{"id":"train_52","question":"Give me a list of all Canadians that reside in the U.S.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 / wdt:P17 wd:Q16 . ?uri wdt:P551 wd:Q30 . }","paraphrases":[],"info":{}}
{"id":"train_66","question":"Show me all U.S. states.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . }","paraphrases":[],"info":{}}
{"id":"train_72","question":"Show me the book that Muhammad Ali wrote.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q571 . ?uri wdt:P50 wd:Q36107 . }","paraphrases":[],"info":{}}
{"id":"train_85","question":"Give me all South American countries.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q6256 . ?uri wdt:P30 wd:Q18 . }","paraphrases":[],"info":{}}
