{"id":"WebQTrn-248","question":"who started pixar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q127552 wdt:P112 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-277","question":"who did hera marry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q38012 wdt:P26 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-376","question":"who speaks farsi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { ?x wdt:P37 wd:Q9168 ; wdt:P31 / wdt:P279 * wd:Q6256 . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-426","question":"who was louis riel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q313691 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-473","question":"who's kobe bryant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q25369 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-605","question":"who was tex beneke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q488352 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-792","question":"who owns skywest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q773662 wdt:P749 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-908","question":"who is james dean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q83359 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-973","question":"who was dan cody?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q5213273 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-1013","question":"who is aidan davis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q4696678 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-1240","question":"where is mallorca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q8828 wdt:P206 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-1384","question":"who was louis xvi?","sparql":"PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX bd: <http://www.bigdata.com/rdf#> PREFIX schema: <http://schema.org/> SELECT DISTINCT ?x WHERE { SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . wd:Q7732 schema:description ?x . } }","paraphrases":[],"info":{}}
{"id":"WebQTrn-1979","question":"who's betty white?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q373895 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-1992","question":"who shot j lennon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q1203 wdt:P157 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-2393","question":"who started google?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q9366 wdt:P112 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-2428","question":"who is john garcia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q918849 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-2674","question":"where is usc from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q1024426 wdt:P131 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-2830","question":"where is madeira?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q26253 wdt:P131 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-2865","question":"where is bosnia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q225 wdt:P30 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-3094","question":"who is aidan quinn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { wd:Q403902 wdt:P106 ?x . }","paraphrases":[],"info":{}}
{"id":"WebQTrn-3125","question":"what city uses gmt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?x WHERE { ?x wdt:P421 wd:Q30192 ; wdt:P31 wd:Q515 . }","paraphrases":[],"info":{}}
