{"id":"train_1","question":"Who killed Caesar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?o1 WHERE { wd:Q1048 wdt:P157 ?o1 . }","paraphrases":[],"info":{}}
{"id":"train_13","question":"Give me all professional skateboarders from Sweden.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?s1 WHERE { ?s1 wdt:P641 wd:Q842284 . ?s1 wdt:P19 ?o1 . ?o1 wdt:P131 * wd:Q34 . }","paraphrases":[],"info":{}}
{"id":"train_19","question":"Give me the homepage of Forbes.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q25161472 wdt:P856 ?uri }","paraphrases":[],"info":{}}
{"id":"train_26","question":"Give me all writers that won the Nobel Prize in literature.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q36180 ; wdt:P166 wd:Q37922 . }","paraphrases":[],"info":{}}
{"id":"train_27","question":"Give me English actors starring in Lovesick.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12125895 wdt:P161 ?uri . ?uri wdt:P19 ?birthplace . ?birthplace wdt:P17 wd:Q145 . }","paraphrases":[],"info":{}}
{"id":"train_34","question":"Give me all Dutch parties.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?s1 WHERE { ?s1 wdt:P17 wd:Q55 . ?s1 wdt:P31 wd:Q7278 . }","paraphrases":[],"info":{}}
{"id":"train_49","question":"Give me all cars that are produced in Germany.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT * WHERE { ?s1 wdt:P31 wd:Q59773381 . ?s1 wdt:P176 ?o1 . ?o1 wdt:P17 wd:Q183 . ?o1 wdt:P31 wd:Q786820 . }","paraphrases":[],"info":{}}
{"id":"train_53","question":"Give me all spacecrafts that flew to Mars.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?s1 where { ?s1 wdt:P31 wd:Q389459 }","paraphrases":[],"info":{}}
{"id":"train_54","question":"Show me all Czech movies.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11424 . { ?uri wdt:P495 wd:Q213 . } UNION { ?uri wdt:P495 wd:Q33946 . } }","paraphrases":[],"info":{}}
{"id":"train_55","question":"Give me all taikonauts.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q11631 . ?uri wdt:P27 wd:Q148 . }","paraphrases":[],"info":{}}
{"id":"train_57","question":"Give me all movies with Tom Cruise.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079 . }","paraphrases":[],"info":{}}
{"id":"train_60","question":"Give me all female German chancellors.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P39 wd:Q4970706 . }","paraphrases":[],"info":{}}
{"id":"train_61","question":"Who owns Aldi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q125054 wdt:P355 ?uri }","paraphrases":[],"info":{}}
{"id":"train_68","question":"Give me a list of all critically endangered birds.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P171 * wd:Q5113 . ?uri wdt:P141 wd:Q219127 . }","paraphrases":[],"info":{}}
{"id":"train_71","question":"Give me all chemical elements.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11344 . }","paraphrases":[],"info":{}}
{"id":"train_98","question":"Give me all libraries established before 1400.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * WHERE { ?uri wdt:P31 / wdt:P279 * wd:Q7075 . ?uri wdt:P571 ?date . FILTER ( YEAR ( ?date ) < 1400 ) }","paraphrases":[],"info":{}}
{"id":"train_99","question":"Give me all Frisian islands that belong to the Netherlands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { { wd:Q76936 wdt:P527 + ?uri . } UNION { wd:Q76936 wdt:P527 * ?islandgroup . ?uri wdt:P361 + ?islandgroup . } ?uri wdt:P17 wd:Q55 . ?uri wdt:P31 wd:Q23442 . }","paraphrases":[],"info":{}}
{"id":"train_106","question":"Who founded Intel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q248 wdt:P112 ?uri . }","paraphrases":[],"info":{}}
{"id":"train_118","question":"List all boardgames by GMT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q131436 . }","paraphrases":[],"info":{}}
{"id":"train_125","question":"Give me all actors starring in movies directed by and starring William Shatner.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?film wdt:P57 wd:Q16297 ; wdt:P161 wd:Q16297 . ?film wdt:P161 ?uri . }","paraphrases":[],"info":{}}
{"id":"train_127","question":"Give me all Danish films.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279 * wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . }","paraphrases":[],"info":{}}
{"id":"train_134","question":"Give me the Apollo 14 astronauts.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri }","paraphrases":[],"info":{}}
{"id":"train_138","question":"Give me a list of all trumpet players that were bandleaders.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q158852 ; wdt:P1303 wd:Q8338 . }","paraphrases":[],"info":{}}
{"id":"train_141","question":"Show me all museums in London.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q33506 . ?uri wdt:P276 wd:Q84 . }","paraphrases":[],"info":{}}
{"id":"train_143","question":"Give me all writers that won the Nobel Prize in literature.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q36180 . ?uri wdt:P166 wd:Q37922 . }","paraphrases":[],"info":{}}
{"id":"train_144","question":"Show me all basketball players that are higher than 2 meters.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 . ?uri wdt:P2048 ?height . FILTER ( ?height > 200 ) }","paraphrases":[],"info":{}}
{"id":"train_150","question":"Give all swimmers that were born in Moscow.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }","paraphrases":[],"info":{}}
{"id":"train_152","question":"Give me all Swiss non-profit organizations.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159 wd:Q39 . } UNION { ?uri wdt:P159 ?city . ?city wdt:P31 wd:Q70208 } }","paraphrases":[],"info":{}}
{"id":"train_156","question":"Show a list of soccer clubs that play in the Bundesliga.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 ; wdt:P118 wd:Q82595 . }","paraphrases":[],"info":{}}
{"id":"train_162","question":"Give me all companies in Munich.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279 * wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P159 wd:Q1726 . }","paraphrases":[],"info":{}}
{"id":"train_163","question":"Give me the capitals of all countries that the Himalayas run through.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . }","paraphrases":[],"info":{}}
{"id":"train_166","question":"Give me all islands that belong to Japan.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . }","paraphrases":[],"info":{}}
{"id":"train_171","question":"Give me all soccer clubs in the Premier League.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 . ?uri wdt:P118 wd:Q9448 . }","paraphrases":[],"info":{}}
{"id":"train_175","question":"Give me all actors who were born in Paris after 1950.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q90 ; wdt:P569 ?birthDate . BIND ( YEAR ( ?birthDate ) as ?birthYear ) . FILTER ( ?birthYear > 1950 ) }","paraphrases":[],"info":{}}
{"id":"train_177","question":"Give me all Australian nonprofit organizations.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159 | wdt:P17 wd:Q408 . } UNION { ?uri wdt:P159 | wdt:P17 ?city . ?city wdt:P159 wd:Q408 } }","paraphrases":[],"info":{}}
{"id":"train_187","question":"Give me all actors who were born in Berlin.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q64 . }","paraphrases":[],"info":{}}
{"id":"train_191","question":"Give me all the TV shows with Neil Patrick Harris.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279 * wd:Q15416 . ?uri wdt:P161 wd:Q485310 . ?uri wdt:P31 ?type . }","paraphrases":[],"info":{}}
{"id":"train_194","question":"Give me all Swedish holidays.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . }","paraphrases":[],"info":{}}
{"id":"train_196","question":"List all the musicals with music by Leonard Bernstein.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }","paraphrases":[],"info":{}}
{"id":"train_197","question":"Give me all companies in the advertising industry.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4830453 ; wdt:P452 wd:Q39809 . }","paraphrases":[],"info":{}}
{"id":"train_200","question":"Give me all Australian metalcore bands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }","paraphrases":[],"info":{}}
{"id":"train_202","question":"Give me all types of eating disorders.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }","paraphrases":[],"info":{}}
{"id":"train_207","question":"Give me all libraries established earlier than 1400.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER ( YEAR ( ?date ) < 1400 ) }","paraphrases":[],"info":{}}
{"id":"train_211","question":"Give me all Methodist politicians.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }","paraphrases":[],"info":{}}
{"id":"train_225","question":"Show me all songs from Bruce Springsteen released between 1980 and 1990.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND ( YEAR ( ?date ) as ?year ) . FILTER ( ?year >= 1980 && ?year <= 1990 ) }","paraphrases":[],"info":{}}
{"id":"train_231","question":"Give me a list of all lakes in Denmark.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23397 ; wdt:P17 wd:Q35 . }","paraphrases":[],"info":{}}
{"id":"train_233","question":"Show me all English Gothic buildings in Kent.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279 * wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }","paraphrases":[],"info":{}}
{"id":"train_243","question":"List all episodes of the first season of the HBO television series The Sopranos!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?episode ) AS ?count ) WHERE { ?episode wdt:P4908 wd:Q5274359 . }","paraphrases":[],"info":{}}
{"id":"train_244","question":"Give me all films produced by Hal Roach.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11424 . ?uri wdt:P162 wd:Q72792 . }","paraphrases":[],"info":{}}
{"id":"train_246","question":"Give me a list of all bandleaders that play trumpet.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P106 wd:Q806349 . ?res wdt:P1303 wd:Q8338 . }","paraphrases":[],"info":{}}
{"id":"train_254","question":"List the seven kings of Rome.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . }","paraphrases":[],"info":{}}
{"id":"train_255","question":"Show me all the breweries in Australia.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . }","paraphrases":[],"info":{}}
{"id":"train_256","question":"Give me all films produced by Steven Spielberg with a budget of at least $80 million.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31 / wdt:P279 * wd:Q11424 ; wdt:P2130 ?cost . FILTER ( ?cost > 80000000 ) }","paraphrases":[],"info":{}}
{"id":"train_259","question":"Give me all breeds of the German Shepherd dog.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 * wd:Q38280 FILTER ( ?uri != wd:Q38280 ) }","paraphrases":[],"info":{}}
{"id":"train_277","question":"Who created Batman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . }","paraphrases":[],"info":{}}
{"id":"train_279","question":"Give me all movies directed by Francis Ford Coppola.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 / wdt:P279 * wd:Q11424 ; wdt:P57 wd:Q56094 . }","paraphrases":[],"info":{}}
{"id":"train_291","question":"Give me all launch pads operated by NASA.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }","paraphrases":[],"info":{}}
{"id":"train_304","question":"List all the musicals with music by Elton John.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 / wdt:P279 * wd:Q58483083 ; wdt:P86 wd:Q2808 . }","paraphrases":[],"info":{}}
{"id":"train_313","question":"Give me the runtime of Toy Story.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }","paraphrases":[],"info":{}}
{"id":"train_320","question":"List the children of Margaret Thatcher.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }","paraphrases":[],"info":{}}
{"id":"train_329","question":"Give me all actors starring in movies directed by William Shatner.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297 ; wdt:P161 ?uri . }","paraphrases":[],"info":{}}
{"id":"train_333","question":"List all games by GMT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 / wdt:P279 * wd:Q11410 ; wdt:P123 wd:Q928726 . }","paraphrases":[],"info":{}}
{"id":"train_338","question":"Give me all members of Prodigy.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }","paraphrases":[],"info":{}}
{"id":"train_352","question":"Give me the birth place of Frank Sinatra.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }","paraphrases":[],"info":{}}
{"id":"train_370","question":"Show me all books in Asimov's Foundation series.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1564644 wdt:P527 ?uri }","paraphrases":[],"info":{}}
{"id":"train_384","question":"Give me the grandchildren of Elvis Presley.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?o2 WHERE { wd:Q303 wdt:P40 ?o1 . ?o1 wdt:P40 ?o2 }","paraphrases":[],"info":{}}
{"id":"train_396","question":"Show me Hemingway's autobiography.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q23434 . ?uri wdt:P136 wd:Q4184 . }","paraphrases":[],"info":{}}
{"id":"train_403","question":"Give me the currency of China.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?o1 WHERE { wd:Q148 wdt:P38 ?o1 . }","paraphrases":[],"info":{}}
{"id":"train_404","question":"Give me all Swedish oceanographers.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?s1 WHERE { ?s1 wdt:P27 wd:Q34 . ?s1 wdt:P106 wd:Q3546255 . }","paraphrases":[],"info":{}}
{"id":"train_410","question":"Give me all actors starring in Last Action Hero.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?o1 WHERE { wd:Q858840 wdt:P161 ?o1 . }","paraphrases":[],"info":{}}
