{"id":"train_1286","question":"what university did bill clinton graduated from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0157m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0157m fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?y fb:education.education.degree fb:m.013zdg . }","paraphrases":[],"info":{}}
{"id":"train_1288","question":"where did president kennedy go to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d3k14 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d3k14 fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_1290","question":"what happened at fukushima daiichi nuclear plant?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02vkzy2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02vkzy2 fb:common.topic.notable_for ?y . ?y fb:common.notable_for.notable_object ?x . }","paraphrases":[],"info":{}}
{"id":"train_1291","question":"who was louis kossuth?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.021xrk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.021xrk fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1292","question":"what country do arabic people come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0xff ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0xff fb:people.ethnicity.includes_groups ?x . }","paraphrases":[],"info":{}}
{"id":"train_1293","question":"when did the red sox win the pennant?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01d5z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01d5z fb:sports.sports_team.championships ?x . }","paraphrases":[],"info":{}}
{"id":"train_1295","question":"what was prince charles last name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0xnc3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0xnc3 fb:base.schemastaging.context_name.official_name ?x . }","paraphrases":[],"info":{}}
{"id":"train_1296","question":"what type of legal system does italy have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rjj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rjj fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1297","question":"what website did mark zuckerberg co founder?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.086dny ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.086dny fb:internet.website_owner.websites_owned ?x . }","paraphrases":[],"info":{}}
{"id":"train_1298","question":"what bass does jared followill use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01w3xqs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01w3xqs fb:music.group_member.instruments_played ?x . ?x fb:music.instrument.family fb:m.01vj9c . }","paraphrases":[],"info":{}}
{"id":"train_1299","question":"who played captain kirk in star trek?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0crtw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0crtw fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_1301","question":"what currency does thailand use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1302","question":"where is canadian county oklahoma?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0my97 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0my97 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1303","question":"what does rob kardashian do for living?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.043n6dp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.043n6dp fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1304","question":"where is oceania on a map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05nrg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05nrg fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1305","question":"what can you do in palm springs ca?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0r3tq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0r3tq fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1307","question":"who is adam sandler?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pz91 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pz91 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1310","question":"where was st elizabeth ann seton born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01sl19 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01sl19 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1311","question":"what does the adriatic sea border?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0p_x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0p_x fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . }","paraphrases":[],"info":{}}
{"id":"train_1313","question":"what colony is john adams from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_js ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_js fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.district_represented ?x . ?x fb:location.location.containedby fb:m.08csr . }","paraphrases":[],"info":{}}
{"id":"train_1314","question":"what countries do germany border?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0345h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0345h fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_1315","question":"what language do the assyrians speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0wmn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0wmn fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1316","question":"who plays mary jane in spiderman 3?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0340hj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0340hj fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.01ppxz . }","paraphrases":[],"info":{}}
{"id":"train_1318","question":"where was abraham lincoln buried?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:people.deceased_person.place_of_burial ?x . }","paraphrases":[],"info":{}}
{"id":"train_1319","question":"who was the grandson of king david's father?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02cvn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02cvn fb:people.person.parents ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_1322","question":"where is devon sawa now?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0y58x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0y58x fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_1323","question":"who did the cleveland browns draft?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01xvb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01xvb fb:sports.professional_sports_team.draft_picks ?y . ?y fb:sports.sports_league_draft_pick.player ?x . }","paraphrases":[],"info":{}}
{"id":"train_1324","question":"who was marilyn monroe's parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04wqr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04wqr fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_1327","question":"where does the spanish language come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06nm1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06nm1 fb:base.rosetta.languoid.parent ?x . }","paraphrases":[],"info":{}}
{"id":"train_1328","question":"where does ryan lochte live now?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bfyrl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bfyrl fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . FILTER ( NOT EXISTS { ?y fb:people.place_lived.end_date ?sk0 } || EXISTS { ?y fb:people.place_lived.end_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.place_lived.start_date ?sk2 } || EXISTS { ?y fb:people.place_lived.start_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_1329","question":"what timezone is tennessee nashville?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05jbn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05jbn fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_1331","question":"what is capital city of ontario?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05kr_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05kr_ fb:location.province.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_1333","question":"who did corey feldman married?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0mdyn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0mdyn fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_1334","question":"who is the voice of lois from family guy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03pcqz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03pcqz fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . ?y fb:tv.regular_tv_appearance.series fb:m.019nnl . }","paraphrases":[],"info":{}}
{"id":"train_1337","question":"what currency do i need in egypt?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02k54 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02k54 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1338","question":"where is ellis park rugby stadium?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04ysfk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04ysfk fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01n7 . }","paraphrases":[],"info":{}}
{"id":"train_1339","question":"what does the letters eu stand for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { ?x fb:common.topic.alias \"EU\" @en . }","paraphrases":[],"info":{}}
{"id":"train_1340","question":"what are the 5 countries in the united kingdom?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07ssc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07ssc fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_1342","question":"who is the state senator of kentucky?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0498y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0498y fb:government.political_district.representatives ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.office_position_or_title fb:m.02_7l8y . }","paraphrases":[],"info":{}}
{"id":"train_1343","question":"where did douglas macarthur die?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c_jc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c_jc fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_1344","question":"what does russian people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bnz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bnz fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1346","question":"who is playing jason morgan on general hospital?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0358x_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0358x_ fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.0b4nb8 . }","paraphrases":[],"info":{}}
{"id":"train_1347","question":"where is hong kong china?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03h64 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03h64 fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_1349","question":"what countries do they speak italian?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02bjrlw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02bjrlw fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_1357","question":"what are bridgit mendler's parents names?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04081f3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04081f3 fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_1358","question":"what tourist attractions are in houston texas?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03l2n ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03l2n fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1361","question":"what kind of paintings did frida kahlo do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015k04 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015k04 fb:visual_art.visual_artist.associated_periods_or_movements ?x . }","paraphrases":[],"info":{}}
{"id":"train_1362","question":"what was francisco vasquez de coronado known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jgb2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jgb2 fb:common.topic.notable_for ?y . ?y fb:common.notable_for.object ?x . }","paraphrases":[],"info":{}}
{"id":"train_1363","question":"what form of government does greece use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035qy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035qy fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1364","question":"where did the columbia river begin?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01n86 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01n86 fb:geography.river.origin ?x . }","paraphrases":[],"info":{}}
{"id":"train_1365","question":"who was the original voice of meg on family guy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035szd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035szd fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.from ?sk0 . } ORDER BY xsd:datetime ( ?sk0 ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_1366","question":"what movies has michael clarke duncan been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02lkcc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02lkcc fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1367","question":"what is jessica ennis sport?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0b7nrg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0b7nrg fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1368","question":"where is tahiti bora bora?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hb6g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hb6g fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1369","question":"what are all of michael jackson albums?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:music.artist.album ?x . }","paraphrases":[],"info":{}}
{"id":"train_1370","question":"where did joe namath live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01p_3k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01p_3k fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_1371","question":"who is my state senator and representative minnesota?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04ykg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04ykg fb:government.political_district.representatives ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.office_position_or_title fb:m.02_7l8y . }","paraphrases":[],"info":{}}
{"id":"train_1372","question":"what films has kristen stewart starred in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07swvb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07swvb fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1373","question":"where do samsung lions play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08bbzt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08bbzt fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_1374","question":"what does annie leibovitz do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015m2c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015m2c fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1377","question":"who is ben roethlisberger parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.033t8w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.033t8w fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_1378","question":"what movies have robert pattinson starred in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.062dn7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.062dn7 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1379","question":"what are the zoroastrian scriptures called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.025sr3l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.025sr3l fb:religion.religion.texts ?x . ?x fb:common.topic.notable_types fb:m.02knxyp . }","paraphrases":[],"info":{}}
{"id":"train_1380","question":"what political party is barack obama from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02mjmr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02mjmr fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_1381","question":"what organization did martin luther king lead?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.051cc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.051cc fb:organization.organization_founder.organizations_founded ?x . }","paraphrases":[],"info":{}}
{"id":"train_1383","question":"what currency should you take to thailand?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1384","question":"what kind of guitar does jemaine clement play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bg539 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bg539 fb:music.group_member.instruments_played ?x . ?x fb:music.instrument.family fb:m.0342h . }","paraphrases":[],"info":{}}
{"id":"train_1385","question":"where was lance armstrong born and in what year?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hfwb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hfwb fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1387","question":"where is george bush from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09b6zr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09b6zr fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1389","question":"what is the zip code for trenton ohio?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ytcc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ytcc fb:location.citytown.postal_codes ?x . }","paraphrases":[],"info":{}}
{"id":"train_1390","question":"what is north dakota state's mascot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01xysf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01xysf fb:education.educational_institution.mascot ?x . }","paraphrases":[],"info":{}}
{"id":"train_1391","question":"what is the work of charles darwin?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01lwx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01lwx fb:book.book_subject.works ?x . }","paraphrases":[],"info":{}}
{"id":"train_1392","question":"what movies have adam sandler been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pz91 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pz91 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1393","question":"what was one of benjamin franklin's inventions?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019fz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019fz fb:law.inventor.inventions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1395","question":"what does duffy sing?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03h3y8v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03h3y8v fb:music.artist.track ?x . }","paraphrases":[],"info":{}}
{"id":"train_1397","question":"what does guyana speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.034m8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.034m8 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1401","question":"what college did harry s. truman attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09bg4l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09bg4l fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_1402","question":"what county is minneapolis mn in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0fpzwf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0fpzwf fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_1403","question":"what religion in thailand?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_1404","question":"who is queen elizabeth 1 father?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02rg_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02rg_ fb:people.person.parents ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_1405","question":"what other languages does switzerland speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mzp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mzp fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1408","question":"who plays paul blart?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03why2r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03why2r fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.0gyp72m . }","paraphrases":[],"info":{}}
{"id":"train_1409","question":"who is kobe bryant wife bio?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01kmd4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01kmd4 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_1410","question":"what kind of government system does canada have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d060g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d060g fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
