{"id":"train_375","question":"what type of language does china speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05w3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05w3 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_376","question":"what countries around the world speak french?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.064_8sq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.064_8sq fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_377","question":"who is esther hicks?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06_0rt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06_0rt fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_378","question":"what does michael vick do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027f42 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027f42 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_379","question":"in which province is johannesburg?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0g284 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0g284 fb:location.location.containedby ?x . ?x fb:base.aareas.schema.administrative_area.administrative_area_type fb:m.0hzjmlj . }","paraphrases":[],"info":{}}
{"id":"train_381","question":"what state did al gore represent?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05fv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05fv fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.district_represented ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_383","question":"what type of art is henri matisse famous for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gct_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gct_ fb:visual_art.visual_artist.associated_periods_or_movements ?x . }","paraphrases":[],"info":{}}
{"id":"train_384","question":"what to do in laughlin nevada?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.020bkmh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.020bkmh fb:location.location.contains ?x . }","paraphrases":[],"info":{}}
{"id":"train_385","question":"who plays princess padme in star wars?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0drf_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0drf_ fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_386","question":"who was louis riel?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04qqn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04qqn fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_387","question":"what are the four nations of the uk?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07ssc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07ssc fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_388","question":"who was judy garland married to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0g10g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0g10g fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_389","question":"where is abraham lincoln hometown?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_390","question":"what disease did helen keller?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03ppx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03ppx fb:medicine.notable_person_with_medical_condition.condition ?x . }","paraphrases":[],"info":{}}
{"id":"train_393","question":"what is the atlanta braves mascot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0x2p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0x2p fb:sports.sports_team.team_mascot ?x . }","paraphrases":[],"info":{}}
{"id":"train_398","question":"what sports do they do in canada?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d060g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d060g fb:sports.sports_team_location.teams ?x . }","paraphrases":[],"info":{}}
{"id":"train_400","question":"who is the arizona cardinals football coach?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ws7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ws7 fb:american_football.football_team.current_head_coach ?x . }","paraphrases":[],"info":{}}
{"id":"train_401","question":"where was the battle of waterloo held?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01dcm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01dcm fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_402","question":"what was marilyn monroe known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04wqr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04wqr fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_403","question":"where did lee corso go to college?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04znbt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04znbt fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_404","question":"who are the colorado eagles?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.068_gr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.068_gr fb:common.topic.notable_for ?y . ?y fb:common.notable_for.notable_object ?x . }","paraphrases":[],"info":{}}
{"id":"train_407","question":"what do they speak in iran?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03shp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03shp fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_409","question":"who did ayrton senna drive for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.012pxw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.012pxw fb:base.formula1.formula_1_driver.team_member ?y . ?y fb:base.formula1.formula_1_team_member.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_410","question":"where is the best place to vacation in the dominican republic?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_412","question":"what position does vernon davis play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0br8m3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0br8m3 fb:american_football.football_player.position_s ?x . }","paraphrases":[],"info":{}}
{"id":"train_414","question":"where is the euro 2012 tournament?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06t1s0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06t1s0 fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_415","question":"what time is right now in texas?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07b_l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07b_l fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_416","question":"what to see and do in malta?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04v3q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04v3q fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_419","question":"what countries does queen elizabeth ii reign?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d1_f ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d1_f fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . }","paraphrases":[],"info":{}}
{"id":"train_422","question":"what are some famous tourist attractions in germany?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0345h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0345h fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_423","question":"who's kobe bryant?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01kmd4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01kmd4 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_424","question":"what type of government system does saudi arabia have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01z215 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01z215 fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_425","question":"what countries did czechoslovakia become?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mk6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mk6 fb:base.datedlocationtest.dated_location_test.broke_up_into ?y . ?y fb:base.datedlocationtest.dated_location_break_up.new_locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_426","question":"what songs did richard marx write?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03t852 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03t852 fb:music.composer.compositions ?x . }","paraphrases":[],"info":{}}
{"id":"train_428","question":"what did ryan dunn died from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04sdsv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04sdsv fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_429","question":"what war was george washington associated with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.034rd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.034rd fb:military.military_commander.military_commands ?y . ?y fb:military.military_command.military_conflict ?x . }","paraphrases":[],"info":{}}
{"id":"train_430","question":"who does kris humphries play for in the nba?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0730b4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0730b4 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_431","question":"where tupac grew up?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07pzc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07pzc fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_432","question":"where did al capone go to jail?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.014gr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.014gr fb:base.prison.prisoner.imprisoned ?y . ?y fb:base.prison.imprisonment.prison ?x . }","paraphrases":[],"info":{}}
{"id":"train_433","question":"what type of music did richard wagner play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c44 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c44 fb:music.artist.genre ?x . }","paraphrases":[],"info":{}}
{"id":"train_435","question":"what team did tim tebow play for in college?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0g7km1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0g7km1 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . ?x fb:american_football.football_team.division fb:m.031fsz . }","paraphrases":[],"info":{}}
{"id":"train_437","question":"what nationality was andy williams?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02lvtb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02lvtb fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_441","question":"where do most of the people live in japan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_3d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_3d fb:location.location.contains ?x . ?x fb:topic_server.population_number ?sk0 . } ORDER BY DESC ( xsd:float ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_442","question":"in what country do they speak basque?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.017k6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.017k6 fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_443","question":"where is belgium at?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0154j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0154j fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_444","question":"what religions are in russia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bnz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bnz fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_446","question":"what did einstein do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jcx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jcx fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_447","question":"in what country is amsterdam?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0k3p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0k3p fb:base.biblioness.bibs_location.country ?x . }","paraphrases":[],"info":{}}
{"id":"train_451","question":"what did martin luther king jr go to college for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.051cc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.051cc fb:people.person.education ?y . ?y fb:education.education.major_field_of_study ?x . }","paraphrases":[],"info":{}}
{"id":"train_452","question":"where did sir ernest shackleton come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gbcz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gbcz fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_453","question":"what made jimi hendrix great?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vsy3q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vsy3q fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_454","question":"who did aaron rodgers play college football 4?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04q06_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04q06_ fb:sports.drafted_athlete.drafted ?y . ?y fb:sports.sports_league_draft_pick.school ?x . }","paraphrases":[],"info":{}}
{"id":"train_455","question":"who plays nathan scott?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09p1z3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09p1z3 fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_457","question":"where is mount whitney?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01jlyt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01jlyt fb:geography.mountain.mountain_range ?x . }","paraphrases":[],"info":{}}
{"id":"train_459","question":"who created the character of romeo?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02qnhw1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02qnhw1 fb:fictional_universe.fictional_character.character_created_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_460","question":"what are some places to visit in new york?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02_286 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02_286 fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_461","question":"where is puntland somalia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01hywq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01hywq fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_462","question":"where did drew stanton play in college?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bmqgn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bmqgn fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . ?x fb:sports.school_sports_team.school fb:m.01j_cy . }","paraphrases":[],"info":{}}
{"id":"train_463","question":"what is kareem abdul jabbar real name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.049sb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.049sb fb:base.schemastaging.context_name.official_name ?x . }","paraphrases":[],"info":{}}
{"id":"train_464","question":"what countries fall in eastern europe?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09b69 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09b69 fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_465","question":"what are taylor swift's albums?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dl567 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dl567 fb:music.artist.album ?x . }","paraphrases":[],"info":{}}
{"id":"train_468","question":"what did king edward vi died from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02s82 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02s82 fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_469","question":"who did johnny bench play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0476l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0476l fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_470","question":"who does the islamic worship?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0flw86 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0flw86 fb:religion.religion.deities ?x . }","paraphrases":[],"info":{}}
{"id":"train_471","question":"where is napoleon buried?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0j5b8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0j5b8 fb:people.deceased_person.place_of_burial ?x . }","paraphrases":[],"info":{}}
{"id":"train_474","question":"where do houston aeros play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.068hn0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.068hn0 fb:sports.sports_team.arena_stadium ?x . ?x fb:architecture.structure.opened ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_475","question":"what to see and do in galway ireland?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0m__z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0m__z fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_477","question":"what are the names of michael jackson children?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:people.person.children ?x . }","paraphrases":[],"info":{}}
{"id":"train_478","question":"what is pennsylvania's state flower called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05tbn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05tbn fb:government.governmental_jurisdiction.official_symbols ?y . ?y fb:location.location_symbol_relationship.symbol ?x . ?y fb:location.location_symbol_relationship.Kind_of_symbol fb:m.04627gn . }","paraphrases":[],"info":{}}
{"id":"train_481","question":"what religions are found in australia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0chghy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0chghy fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_482","question":"what college did drew bledsoe?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03mswq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03mswq fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_483","question":"where is the mtv headquarters?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04rqd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04rqd fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_484","question":"who does michael vick play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027f42 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027f42 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_486","question":"what is anderson silva trained in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0djnt1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0djnt1 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_487","question":"which countries does russia border?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bnz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bnz fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_488","question":"what does pixar produce?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0kk9v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0kk9v fb:film.production_company.films ?x . }","paraphrases":[],"info":{}}
{"id":"train_489","question":"what did emily dickinson die of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01509d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01509d fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_490","question":"who played lois lane in superman 1?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04pzy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04pzy fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.film fb:m.01_mdl . }","paraphrases":[],"info":{}}
{"id":"train_492","question":"what language do fiji people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02wt0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02wt0 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_493","question":"what victoria beckham kids names?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cgfb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cgfb fb:people.person.children ?x . }","paraphrases":[],"info":{}}
{"id":"train_494","question":"where is new york in the map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059rby ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059rby fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_495","question":"what did jimmy valvano die with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04wb5r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04wb5r fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_500","question":"what kind of money do the philippines use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05v8c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05v8c fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
