{"id":"train_0","question":"what is the name of justin bieber brother?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06w2sn5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06w2sn5 fb:people.person.sibling_s ?y . ?y fb:people.sibling_relationship.sibling ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_2","question":"what country is the grand bahama island in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03st9j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03st9j fb:location.location.containedby ?x . ?x fb:base.biblioness.bibs_location.loc_type ?sk0 . FILTER ( str ( ?sk0 ) = \"Country\" ) }","paraphrases":[],"info":{}}
{"id":"train_4","question":"what character did john noble play in lord of the rings?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02fgm7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02fgm7 fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.017gm7 . }","paraphrases":[],"info":{}}
{"id":"train_5","question":"who does joakim noah play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c2yrf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c2yrf fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_6","question":"where are the nfl redskins from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.084l5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.084l5 fb:sports.sports_team.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_7","question":"where did saki live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07484 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07484 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_8","question":"how old is sacha baron cohen?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c9c0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c9c0 fb:people.person.date_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_9","question":"what time zone am i in cleveland ohio?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01sn3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01sn3 fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_10","question":"who did draco malloy end up marrying?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c2m4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c2m4 fb:fictional_universe.fictional_character.married_to ?y . ?y fb:fictional_universe.marriage_of_fictional_characters.spouses ?x . }","paraphrases":[],"info":{}}
{"id":"train_11","question":"which countries border the us?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09c7w0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09c7w0 fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_12","question":"where is rome italy located on a map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c62 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c62 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_13","question":"what is nina dobrev nationality?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027nwk2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027nwk2 fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_14","question":"which kennedy died first?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.0fbrl fb:people.family.members ?x . ?x fb:people.deceased_person.date_of_death ?d . } ORDER BY ?d LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_15","question":"what books did beverly cleary right?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.018rv0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.018rv0 fb:book.author.book_editions_published ?x . }","paraphrases":[],"info":{}}
{"id":"train_17","question":"where to fly into bali?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01bkb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01bkb fb:travel.travel_destination.how_to_get_here ?y . ?y fb:travel.transportation.transport_terminus ?x . ?y fb:travel.transportation.mode_of_transportation fb:m.03qb78c . }","paraphrases":[],"info":{}}
{"id":"train_18","question":"who is the prime minister of ethiopia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019pcs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019pcs fb:government.governmental_jurisdiction.governing_officials ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.060bp . FILTER ( NOT EXISTS { ?y fb:government.government_position_held.from ?sk0 } || EXISTS { ?y fb:government.government_position_held.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:government.government_position_held.to ?sk2 } || EXISTS { ?y fb:government.government_position_held.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_20","question":"what high school did president bill clinton attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0157m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0157m fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hn6 . }","paraphrases":[],"info":{}}
{"id":"train_22","question":"what movies does taylor lautner play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07ldhs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07ldhs fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_24","question":"which wife did king henry behead?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03p77 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03p77 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?x fb:people.deceased_person.cause_of_death fb:m.0jb19 . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_25","question":"who was ishmael's mom?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01ghr4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01ghr4 fb:people.person.parents ?x . ?x fb:people.person.gender fb:m.02zsn . }","paraphrases":[],"info":{}}
{"id":"train_26","question":"what was malcolm x trying to accomplish?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03f2h01 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03f2h01 fb:base.activism.activist.area_of_activism ?x . }","paraphrases":[],"info":{}}
{"id":"train_27","question":"where are the netherlands on a world map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059j2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059j2 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_28","question":"what is the president of brazil?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:government.governmental_jurisdiction.governing_officials ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.060c4 . FILTER ( NOT EXISTS { ?y fb:government.government_position_held.from ?sk0 } || EXISTS { ?y fb:government.government_position_held.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:government.government_position_held.to ?sk2 } || EXISTS { ?y fb:government.government_position_held.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_29","question":"what are the major cities in france?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f8l9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f8l9c fb:location.country.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_30","question":"what city did esther live in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02pn7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02pn7 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_31","question":"what sport do the toronto maple leafs play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0j6tr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0j6tr fb:base.events.event_presenting_organisation.event_feed ?y . ?y fb:base.events.event_feed.type_of_event ?x . }","paraphrases":[],"info":{}}
{"id":"train_33","question":"what is saint nicholas known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f9q7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f9q7 fb:book.book_subject.works ?x . }","paraphrases":[],"info":{}}
{"id":"train_34","question":"what is cher's son's name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vtj38 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vtj38 fb:people.person.children ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_35","question":"what party was andrew jackson?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0rlz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0rlz fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_36","question":"what county is the city of hampton va in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0mnsf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0mnsf fb:location.hud_county_place.place ?x . }","paraphrases":[],"info":{}}
{"id":"train_38","question":"what did william shakespeare do for a living?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.081k8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.081k8 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_39","question":"what county is heathrow airport in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03jn4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03jn4 fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01n7 . }","paraphrases":[],"info":{}}
{"id":"train_40","question":"what movie is josh hutcherson in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08wjf4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08wjf4 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_43","question":"what was the name of frederick douglass book?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02zg0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02zg0 fb:book.author.works_written ?x . ?x fb:common.topic.notable_types fb:m.01xryvm . }","paraphrases":[],"info":{}}
{"id":"train_44","question":"who was queen victoria's parents called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cw10 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cw10 fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_45","question":"what movies did sally field win an oscar for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.01jw4r fb:award.award_winner.awards_won ?y . ?y fb:award.award_honor.honored_for ?x . ?y fb:award.award_honor.award ?awd . ?awd fb:award.award_category.category_of fb:m.0g_w . }","paraphrases":[],"info":{}}
{"id":"train_47","question":"what countries do people speak portuguese?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05zjd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05zjd fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_49","question":"what are the names of walt disney kids?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.081nh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.081nh fb:people.person.children ?x . }","paraphrases":[],"info":{}}
{"id":"train_51","question":"what was tupac name in juice?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07pzc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07pzc fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.08w51z . }","paraphrases":[],"info":{}}
{"id":"train_52","question":"what timezone is australia gmt?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0chghy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0chghy fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_53","question":"who does maggie grace play in taken?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_wpf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_wpf fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.0hhggmy . }","paraphrases":[],"info":{}}
{"id":"train_56","question":"what style of music did louis armstrong play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04n32 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04n32 fb:music.artist.genre ?x . }","paraphrases":[],"info":{}}
{"id":"train_57","question":"what tv show did joey lawrence play on?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01pr9kj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01pr9kj fb:tv.tv_actor.starring_roles ?y . ?y fb:tv.regular_tv_appearance.series ?x . }","paraphrases":[],"info":{}}
{"id":"train_58","question":"what timezone is denver co?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02cl1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02cl1 fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_59","question":"what character did brian austin green play on 90210?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0n2bh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0n2bh fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.character ?x . ?y fb:tv.regular_tv_appearance.actor fb:m.01npcy7 . }","paraphrases":[],"info":{}}
{"id":"train_60","question":"where does jackie french live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c9xl9 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c9xl9 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_62","question":"when did the colorado rockies go to the world series?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.0fjp3 fb:sports.sports_championship.events ?x . { { ?x fb:sports.sports_championship_event.runner_up fb:m.01ync . } UNION { ?x fb:sports.sports_championship_event.champion fb:m.01ync . } } ?x fb:time.event.start_date ?d . }","paraphrases":[],"info":{}}
{"id":"train_63","question":"what college did matt lauer attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.049_zz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.049_zz fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_64","question":"where to go in london england?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04jpl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04jpl fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_65","question":"what school did joan miro attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0g_6k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0g_6k fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_68","question":"where is jack daniels factory?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.021zmy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.021zmy fb:distilled_spirits.distillery.region ?x . }","paraphrases":[],"info":{}}
{"id":"train_69","question":"what language do the speak in pakistan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05sb1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05sb1 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_70","question":"where is santa clara university?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027xx3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027xx3 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_74","question":"what sea does the yangtze river flow into?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01y4t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01y4t fb:geography.river.mouth ?x . }","paraphrases":[],"info":{}}
{"id":"train_75","question":"who miley cyrus engaged to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bdxs5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bdxs5 fb:celebrities.celebrity.sexual_relationships ?y . ?y fb:celebrities.romantic_relationship.celebrity ?x . ?y fb:celebrities.romantic_relationship.relationship_type fb:m.02_99rl . }","paraphrases":[],"info":{}}
{"id":"train_76","question":"what kind of money should i take to jamaica?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_r3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_r3 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_77","question":"who is robert downey jr wife?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.016z2j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.016z2j fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?x fb:people.person.gender fb:m.02zsn . ?y fb:people.marriage.from ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_78","question":"where do the ny rangers play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hmtk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hmtk fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_79","question":"where is jefferson davis buried?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.043q0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.043q0 fb:people.deceased_person.place_of_burial ?x . }","paraphrases":[],"info":{}}
{"id":"train_82","question":"what awards has louis sachar won?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01bq8d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01bq8d fb:award.award_winner.awards_won ?y . ?y fb:award.award_honor.award ?x . }","paraphrases":[],"info":{}}
{"id":"train_86","question":"what planes does the navy have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07wg3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07wg3 fb:aviation.aircraft_owner.aircraft_fleet_composition ?y . ?y fb:aviation.aircraft_ownership_count.aircraft_model ?x . }","paraphrases":[],"info":{}}
{"id":"train_87","question":"where did benjamin franklin died?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019fz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019fz fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_88","question":"what is the local language of israel?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03spz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03spz fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_91","question":"what religion are people in russia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bnz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bnz fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_92","question":"what did shawnee smith play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06t3nj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06t3nj fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_93","question":"what countries did queen victoria reign over?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cw10 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cw10 fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . }","paraphrases":[],"info":{}}
{"id":"train_95","question":"what team does luis suarez play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.026f4lr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.026f4lr fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_96","question":"what are dollars called in spain?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mkj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mkj fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_97","question":"who plays meg in family guy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035szd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035szd fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.series fb:m.019nnl . FILTER ( NOT EXISTS { ?y fb:tv.regular_tv_appearance.from ?sk0 } || EXISTS { ?y fb:tv.regular_tv_appearance.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:tv.regular_tv_appearance.to ?sk2 } || EXISTS { ?y fb:tv.regular_tv_appearance.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_99","question":"what is the world's tallest building in dubai called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { ?x fb:common.topic.notable_types fb:m.01xljq9 ; fb:location.location.containedby fb:m.01f08r ; fb:architecture.structure.height_meters ?y } ORDER BY DESC ( xsd:float ( ?y ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_101","question":"what movie did angelina jolie direct?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f4vbz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f4vbz fb:film.director.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_102","question":"where did martin luther king got shot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.051cc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.051cc fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_106","question":"who has been married to julia roberts?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.046zh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.046zh fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_107","question":"where do baltimore ravens play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01ct6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01ct6 fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_110","question":"what is the dominant language in israel?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03spz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03spz fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_111","question":"what are the main languages of nigeria?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05cgv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05cgv fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_112","question":"what jobs did ben franklin do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019fz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019fz fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_114","question":"who plays lola bunny in the looney tunes show?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0534r8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0534r8 fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.film fb:m.04j2p8f . }","paraphrases":[],"info":{}}
