{"id":"train_1773","question":"who is liz lemon marrying on 30 rock?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02700g4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02700g4 fb:fictional_universe.fictional_character.married_to ?y . ?y fb:fictional_universe.marriage_of_fictional_characters.spouses ?x . }","paraphrases":[],"info":{}}
{"id":"train_1774","question":"where was the battle of appomattox located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.054pn2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.054pn2 fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1775","question":"where did the name rome come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c62 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c62 fb:symbols.namesake.named_after ?x . }","paraphrases":[],"info":{}}
{"id":"train_1776","question":"what time zone is fresno ca?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0mzy7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0mzy7 fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_1778","question":"what was the cause of death for sage stallone?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.091f9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.091f9c fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_1779","question":"where did queen isabella live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jd6m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jd6m fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1780","question":"who played carl fredricksen in up?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02rn00y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02rn00y fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.0b6mg3l . }","paraphrases":[],"info":{}}
{"id":"train_1784","question":"what did samuel de champlain?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09r57 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09r57 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1785","question":"what was william faulkner known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.084w8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.084w8 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1786","question":"what language did the miwok indians speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02l_wv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02l_wv fb:people.ethnicity.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1787","question":"who was audrey hepburn's husbands?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dqcm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dqcm fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_1788","question":"who were queen elizabeth 1 parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02rg_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02rg_ fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_1791","question":"what currency is best to take to dominican republic?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1792","question":"who's betty white?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.025mb_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.025mb_ fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1793","question":"who is lleyton hewitt?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04k1p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04k1p fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1794","question":"what movies did quentin tarantino star in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0693l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0693l fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1795","question":"what language does the new zealand speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ctw_b ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ctw_b fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_1796","question":"what kind of cancer killed larry hagman have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vyv9 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vyv9 fb:people.deceased_person.cause_of_death ?x . ?x fb:people.cause_of_death.parent_cause_of_death fb:m.0qcr0 . }","paraphrases":[],"info":{}}
{"id":"train_1797","question":"what kind of drugs does charlie sheen do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01pllx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01pllx fb:base.popstra.celebrity.substance_abuse ?y . ?y fb:base.popstra.substance_abuse.substance ?x . }","paraphrases":[],"info":{}}
{"id":"train_1798","question":"what county is sacramento located in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07bcn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07bcn fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_1800","question":"what did audrey hepburn died of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dqcm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dqcm fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_1801","question":"what country was the treaty of versailles written?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07d4d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07d4d fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1802","question":"what is st mary mascot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01tntf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01tntf fb:education.educational_institution.mascot ?x . }","paraphrases":[],"info":{}}
{"id":"train_1803","question":"who was irving berlin and what did he do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cyhq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cyhq fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1804","question":"who shot j lennon?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vsl3_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vsl3_ fb:user.alexander.misc.murdered_person.murdered_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_1805","question":"where is the denver broncos stadium located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0289q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0289q fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_1806","question":"where did sir ernest shackleton live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gbcz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gbcz fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_1807","question":"what type of music is scott joplin?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07b69 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07b69 fb:music.artist.genre ?x . }","paraphrases":[],"info":{}}
{"id":"train_1808","question":"where did the welsh language originate from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.083tk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.083tk fb:base.rosetta.languoid.parent ?x . }","paraphrases":[],"info":{}}
{"id":"train_1809","question":"who does leia think her father is?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ddqw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ddqw fb:fictional_universe.fictional_character.parents ?x . ?x fb:fictional_universe.fictional_character.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_1810","question":"what languages do people speak in switzerland?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mzp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mzp fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1812","question":"who is president of france?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f8l9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f8l9c fb:government.governmental_jurisdiction.governing_officials ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.060c4 . FILTER ( NOT EXISTS { ?y fb:government.government_position_held.from ?sk0 } || EXISTS { ?y fb:government.government_position_held.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:government.government_position_held.to ?sk2 } || EXISTS { ?y fb:government.government_position_held.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_1813","question":"who did alf's voice?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01klc1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01klc1 fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.0sgqfm0 . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . }","paraphrases":[],"info":{}}
{"id":"train_1814","question":"what was theodore roosevelt's political party?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07hyk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07hyk fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_1816","question":"where ulysses s grant go to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07t2k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07t2k fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_1817","question":"what magazine did edgar allan poe work for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02lt8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02lt8 fb:book.periodical_editor.periodicals_edited ?y . ?y fb:book.editorial_tenure.periodical ?x . }","paraphrases":[],"info":{}}
{"id":"train_1818","question":"where did chickasaw indians live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0n0y5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0n0y5 fb:people.ethnicity.geographic_distribution ?x . }","paraphrases":[],"info":{}}
{"id":"train_1819","question":"what music did antonio vivaldi compose?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pth ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pth fb:music.artist.genre ?x . }","paraphrases":[],"info":{}}
{"id":"train_1821","question":"what is the timezone in vancouver?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ckhc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ckhc fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_1823","question":"what time is world cup soccer?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.030q7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.030q7 fb:user.gogza.default_domain.recurring_event.recurrance_period ?x . }","paraphrases":[],"info":{}}
{"id":"train_1824","question":"what county is stockton ca located in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pc56 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pc56 fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_1828","question":"who is the member of rajya sabha?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01hs05 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01hs05 fb:government.governmental_body.members ?y . ?y fb:government.government_position_held.office_holder ?x . }","paraphrases":[],"info":{}}
{"id":"train_1829","question":"what form of government does czech republic have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mjq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mjq fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1831","question":"what was eli whitney education?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02ncr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02ncr fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_1832","question":"what movies has renee zellweger been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01c_zw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01c_zw fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1834","question":"where jay z was raised?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vw20h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vw20h fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1835","question":"what currency does the dominican republic?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1836","question":"what is daniel radcliffe name in the woman in black?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.013_vh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.013_vh fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.0dgnnp1 . }","paraphrases":[],"info":{}}
{"id":"train_1839","question":"where was battle of verdun located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dl4g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dl4g fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1841","question":"who plays stewie griffin's voice family guy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019nnl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019nnl fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.02m29p . }","paraphrases":[],"info":{}}
{"id":"train_1843","question":"what language do iraqi people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05q4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05q4 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1845","question":"where did paul rudd go to high school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.032w8h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.032w8h fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hn6 . }","paraphrases":[],"info":{}}
{"id":"train_1846","question":"what was abe lincoln shot with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:user.alexander.misc.murdered_person.murder_method ?x . }","paraphrases":[],"info":{}}
{"id":"train_1847","question":"what did regina hall play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.072z_t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.072z_t fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1848","question":"who plays jacob black in twilight?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03nm_fh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03nm_fh fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.02qd_td . }","paraphrases":[],"info":{}}
{"id":"train_1849","question":"what american penny is worth money?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015tzx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015tzx fb:base.coinsdaily.denomination.money_value ?y . ?y fb:measurement_unit.money_value.amount ?x . }","paraphrases":[],"info":{}}
{"id":"train_1850","question":"what book did jacob riis wrote?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jll4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jll4 fb:book.author.works_written ?x . }","paraphrases":[],"info":{}}
{"id":"train_1851","question":"what airport is close to scottsdale arizona?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0qpqn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0qpqn fb:location.location.nearby_airports ?x . }","paraphrases":[],"info":{}}
{"id":"train_1852","question":"who plays noah bennet?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.026cx1z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.026cx1z fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_1854","question":"where do the chicago cubs play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01yjl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01yjl fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_1855","question":"where did reagan die?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c0j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c0j fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_1856","question":"what is the language used in indonesia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03ryn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03ryn fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1858","question":"what was irving langmuir famous for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03yzb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03yzb fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1860","question":"what was the name of martin luther king jr parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.051cc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.051cc fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_1861","question":"what money does guatemala use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0345_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0345_ fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1865","question":"who plays young john winchester in supernatural?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.025ybxs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.025ybxs fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.series fb:m.06s3sm . ?y fb:tv.regular_tv_appearance.from ?sk0 . } ORDER BY xsd:datetime ( ?sk0 ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_1867","question":"what region is manchester england?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.052bw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.052bw fb:location.capital_of_administrative_division.capital_of ?y . ?y fb:location.administrative_division_capital_relationship.administrative_division ?x . }","paraphrases":[],"info":{}}
{"id":"train_1868","question":"where was the gettysburg war located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01jnm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01jnm fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1869","question":"what do people go to amsterdam for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0k3p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0k3p fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1870","question":"who is the elected governor of california?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01n7q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01n7q fb:government.governmental_jurisdiction.governing_officials ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.0fkvn . FILTER ( NOT EXISTS { ?y fb:government.government_position_held.from ?sk0 } || EXISTS { ?y fb:government.government_position_held.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:government.government_position_held.to ?sk2 } || EXISTS { ?y fb:government.government_position_held.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_1871","question":"what language chile speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01p1v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01p1v fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1873","question":"what currency to take to side turkey?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01znc_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01znc_ fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1874","question":"who founded the new democratic party?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0nfwpdn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0nfwpdn fb:government.political_party.politicians_in_this_party ?y . ?y fb:government.political_party_tenure.politician ?x . }","paraphrases":[],"info":{}}
{"id":"train_1875","question":"what team did john madden play football for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0frmb1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0frmb1 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_1876","question":"what does julian clary do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01_rph ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01_rph fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1877","question":"where does the potomac river flow into?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0g52g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0g52g fb:geography.river.mouth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1878","question":"where is the olympic national park located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015nrn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015nrn fb:base.usnationalparks.us_national_park.state ?x . }","paraphrases":[],"info":{}}
{"id":"train_1880","question":"when does the world cup occur?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.030q7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.030q7 fb:time.recurring_event.current_frequency ?x . }","paraphrases":[],"info":{}}
{"id":"train_1883","question":"where does danish language come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0295r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0295r fb:language.human_language.language_family ?x . }","paraphrases":[],"info":{}}
{"id":"train_1884","question":"what countries are in the baltic region?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01xrc5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01xrc5 fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_1885","question":"what nation did hitler lead?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07_m9_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07_m9_ fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . }","paraphrases":[],"info":{}}
{"id":"train_1887","question":"what continent does the amazon river flow through?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0sd7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0sd7 fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01mh . }","paraphrases":[],"info":{}}
