{"id":"train_1530","question":"what is the rainforest in peru called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.016wzw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.016wzw fb:location.location.partially_contains ?x . ?x fb:common.topic.notable_types fb:m.01nt . }","paraphrases":[],"info":{}}
{"id":"train_1531","question":"where is mount jefferson located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0238w8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0238w8 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1533","question":"what is the state symbols of colorado?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01n4w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01n4w fb:government.governmental_jurisdiction.official_symbols ?y . ?y fb:location.location_symbol_relationship.symbol ?x . }","paraphrases":[],"info":{}}
{"id":"train_1534","question":"where did buzz williams go to college?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02qwxhj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02qwxhj fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_1535","question":"which airport is closest to the city of chicago?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01_d4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01_d4 fb:location.location.nearby_airports ?x . ?x fb:location.location.containedby fb:m.01_d4 . }","paraphrases":[],"info":{}}
{"id":"train_1536","question":"what part of the world is south africa in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hzlz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hzlz fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_1538","question":"what movies did adam sandler play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pz91 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pz91 fb:film.producer.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1539","question":"where is washington d.c. at?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0rh6k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0rh6k fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01nt . }","paraphrases":[],"info":{}}
{"id":"train_1542","question":"who created microsoft windows?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04r_8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04r_8 fb:computer.software.developer ?x . }","paraphrases":[],"info":{}}
{"id":"train_1543","question":"what is john steinbeck best known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04107 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04107 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1545","question":"who nominated anthony kennedy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019s7r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019s7r fb:people.appointee.position ?y . ?y fb:people.appointment.appointed_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_1546","question":"who was the voice of darth vader in episode iii?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0fdv3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0fdv3 fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.0f2y0 . }","paraphrases":[],"info":{}}
{"id":"train_1548","question":"where the french language come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.064_8sq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.064_8sq fb:base.rosetta.languoid.parent ?x . }","paraphrases":[],"info":{}}
{"id":"train_1549","question":"what is the government of chile?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01p1v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01p1v fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1550","question":"what movie does natalie portman play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09l3p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09l3p fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1551","question":"who is the head coach of the new orleans saints?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05g3v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05g3v fb:american_football.football_team.current_head_coach ?x . }","paraphrases":[],"info":{}}
{"id":"train_1552","question":"where does the shannon river flow?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04yg368 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04yg368 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1553","question":"what movies does zac efron star in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06wm0z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06wm0z fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1554","question":"what is the political system of nigeria?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05cgv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05cgv fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1555","question":"where is puerto galera?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01pn1_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01pn1_ fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1556","question":"where is the battle of verdun located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dl4g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dl4g fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1557","question":"what currency does hungary have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gj2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gj2 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1558","question":"what all did michael jackson own?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:architecture.architectural_structure_owner.structures_owned ?y . ?y fb:architecture.ownership.structure ?x . }","paraphrases":[],"info":{}}
{"id":"train_1560","question":"what form of government does canada have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d060g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d060g fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1561","question":"what language does people speak in australia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0chghy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0chghy fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1565","question":"what to do and see in miami florida?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f2v0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f2v0 fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1566","question":"what movies did chris farley do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.012801 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.012801 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_1567","question":"where george washington carver go to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03djm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03djm fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_1569","question":"where was the earthquake in christchurch?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gg9kfr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gg9kfr fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1570","question":"what timezone is reno nv?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06kx2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06kx2 fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_1572","question":"what did cam newton do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02phnp7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02phnp7 fb:american_football.football_player.position_s ?x . }","paraphrases":[],"info":{}}
{"id":"train_1574","question":"what continent does the bahamas belong to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0160w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0160w fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_1577","question":"where did isaac newton go to high school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03s9v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03s9v fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hn6 . }","paraphrases":[],"info":{}}
{"id":"train_1578","question":"what planet did princess leia call home?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ddqw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ddqw fb:fictional_universe.fictional_character.places_lived ?x . }","paraphrases":[],"info":{}}
{"id":"train_1580","question":"where is bob marley from where was he born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bkf4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bkf4 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1581","question":"what year did spudd webb won the dunk contest?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03dgnv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03dgnv fb:sports.sports_award_winner.awards ?y . ?y fb:sports.sports_award.season ?x . ?y fb:sports.sports_award.award fb:m.05p84m . }","paraphrases":[],"info":{}}
{"id":"train_1582","question":"what did randy jackson play in journey?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015cqh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015cqh fb:music.musical_group.member ?y . ?y fb:music.group_membership.role ?x . ?y fb:music.group_membership.member fb:m.02yygk . }","paraphrases":[],"info":{}}
{"id":"train_1584","question":"where does roman abramovich live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01zl71 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01zl71 fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_1585","question":"who is nolan ryan married to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hctb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hctb fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_1586","question":"what did neil say on the moon?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05b6w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05b6w fb:people.person.quotations ?x . }","paraphrases":[],"info":{}}
{"id":"train_1587","question":"who played carlton banks?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bdz91 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bdz91 fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_1590","question":"what hotel should i stay in san francisco?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d6lp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d6lp fb:travel.travel_destination.accommodation ?x . }","paraphrases":[],"info":{}}
{"id":"train_1594","question":"what is fresno state's zip code?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0mzy7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0mzy7 fb:location.citytown.postal_codes ?x . }","paraphrases":[],"info":{}}
{"id":"train_1595","question":"who is angelina jolie husband name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f4vbz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f4vbz fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . FILTER ( NOT EXISTS { ?y fb:people.marriage.from ?sk0 } || EXISTS { ?y fb:people.marriage.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.marriage.to ?sk2 } || EXISTS { ?y fb:people.marriage.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) ?y fb:people.marriage.from ?sk4 . } ORDER BY DESC ( xsd:datetime ( ?sk4 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_1596","question":"what kourtney kardashian baby girls name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.043ttm7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.043ttm7 fb:people.person.children ?x . ?x fb:people.person.gender fb:m.02zsn . }","paraphrases":[],"info":{}}
{"id":"train_1598","question":"what does icelandic sound like?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01gmkg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01gmkg fb:language.human_language.language_family ?x . }","paraphrases":[],"info":{}}
{"id":"train_1599","question":"where does bill richardson live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.020z31 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.020z31 fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_1600","question":"who are the judges on the us supreme court?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07sz1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07sz1 fb:law.court.judges ?y . ?y fb:law.judicial_tenure.judge ?x . FILTER ( NOT EXISTS { ?y fb:law.judicial_tenure.from_date ?sk0 } || EXISTS { ?y fb:law.judicial_tenure.from_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:law.judicial_tenure.to_date ?sk2 } || EXISTS { ?y fb:law.judicial_tenure.to_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_1602","question":"who plays jay adams in lords of dogtown?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05n6sq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05n6sq fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.0gl_8b_ . }","paraphrases":[],"info":{}}
{"id":"train_1603","question":"what system of government is used in the united states of america?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09c7w0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09c7w0 fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_1604","question":"what did the habsburg family control?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03lht ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03lht fb:people.family.country ?x . }","paraphrases":[],"info":{}}
{"id":"train_1605","question":"what is beyonce's daughters name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mpq7s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mpq7s fb:people.person.children ?x . }","paraphrases":[],"info":{}}
{"id":"train_1607","question":"what college did michael jordan play basketball for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.054c1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.054c1 fb:sports.drafted_athlete.drafted ?y . ?y fb:sports.sports_league_draft_pick.school ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_1608","question":"what songs has madonna written?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vs_v8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vs_v8 fb:music.composer.compositions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1609","question":"what countries are located in the netherlands?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059j2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059j2 fb:base.aareas.schema.administrative_area.administrative_children ?x . ?x fb:common.topic.notable_types fb:m.02_3phk . }","paraphrases":[],"info":{}}
{"id":"train_1611","question":"where did pope benedict xvi live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09wpt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09wpt fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_1612","question":"what language brazil use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_1614","question":"where is tommy emmanuel from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.064t69 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.064t69 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1615","question":"with which country does south africa border?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hzlz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hzlz fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_1616","question":"what is there to do around austin texas?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0vzm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0vzm fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_1617","question":"what countries in the world speak german?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04306rv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04306rv fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_1618","question":"who plays effy in skins uk?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0279tyz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0279tyz fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.02q1mwf . }","paraphrases":[],"info":{}}
{"id":"train_1620","question":"what kind of money do the netherlands use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059j2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059j2 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_1621","question":"which college did obama graduated?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02mjmr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02mjmr fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?y fb:education.education.degree fb:m.014mlp . }","paraphrases":[],"info":{}}
{"id":"train_1622","question":"who is henry david thoreau?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bwx3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bwx3 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_1624","question":"who is golfer dustin johnson dating?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04n4sw4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04n4sw4 fb:celebrities.celebrity.sexual_relationships ?y . ?y fb:celebrities.romantic_relationship.celebrity ?x . ?y fb:celebrities.romantic_relationship.relationship_type fb:m.02_99rl . FILTER ( NOT EXISTS { ?y fb:celebrities.romantic_relationship.start_date ?sk0 } || EXISTS { ?y fb:celebrities.romantic_relationship.start_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:celebrities.romantic_relationship.end_date ?sk2 } || EXISTS { ?y fb:celebrities.romantic_relationship.end_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_1625","question":"what are the official languages in spain?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mkj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mkj fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_1628","question":"where does the atlanta braves play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0x2p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0x2p fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_1630","question":"what do people from spain speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mkj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mkj fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_1631","question":"who played danielle rousseau on lost?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0828jw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0828jw fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.character ?x . ?x fb:type.object.name ?sk0 . FILTER ( str ( ?sk0 ) = \"Danielle Rousseau\" ) }","paraphrases":[],"info":{}}
{"id":"train_1632","question":"who did king tut married?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07hcc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07hcc fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_1633","question":"what political party did john bell belong to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035vw8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035vw8 fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_1634","question":"what countries are part of nato?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059dn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059dn fb:organization.membership_organization.members ?y . ?y fb:organization.organization_membership.member ?x . }","paraphrases":[],"info":{}}
{"id":"train_1635","question":"what religion is mary queen of scots?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.055l1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.055l1 fb:people.person.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_1636","question":"who is chris cooley married to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06hh0x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06hh0x fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . FILTER ( NOT EXISTS { ?y fb:people.marriage.from ?sk0 } || EXISTS { ?y fb:people.marriage.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.marriage.to ?sk2 } || EXISTS { ?y fb:people.marriage.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_1637","question":"where is port st johns florida?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0rhs4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0rhs4 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_1640","question":"where is kate spade from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bkdx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bkdx fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_1641","question":"what countries are in the caribbean?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0261m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0261m fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_1643","question":"what party was woodrow wilson from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.083q7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.083q7 fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_1646","question":"what did ben hall do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08sx40 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08sx40 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
