{"id":"train_2126","question":"who did hermione granger marry?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c8kc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c8kc fb:fictional_universe.fictional_character.married_to ?y . ?y fb:fictional_universe.marriage_of_fictional_characters.spouses ?x . }","paraphrases":[],"info":{}}
{"id":"train_2127","question":"what does taiwan people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06f32 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06f32 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2128","question":"what state is george washington university located in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01nnsv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01nnsv fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.state_province_region ?x . }","paraphrases":[],"info":{}}
{"id":"train_2129","question":"what is the state bird and flower of michigan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.04rrx fb:government.governmental_jurisdiction.official_symbols ?y . ?y fb:location.location_symbol_relationship.symbol ?x . ?y fb:location.location_symbol_relationship.Kind_of_symbol ?k . FILTER ( ?k = fb:m.04627hw || ?k = fb:m.04627gn ) }","paraphrases":[],"info":{}}
{"id":"train_2130","question":"where was governor cuomo born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02pjpd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02pjpd fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2132","question":"who are the judges of the supreme court?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07sz1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07sz1 fb:law.court.judges ?y . ?y fb:law.judicial_tenure.judge ?x . FILTER ( NOT EXISTS { ?y fb:law.judicial_tenure.from_date ?sk0 } || EXISTS { ?y fb:law.judicial_tenure.from_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:law.judicial_tenure.to_date ?sk2 } || EXISTS { ?y fb:law.judicial_tenure.to_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2137","question":"who was leonardo da vinci teacher?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04lg6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04lg6 fb:influence.influence_node.influenced_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_2140","question":"what football teams did emmitt smith play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01480y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01480y fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2142","question":"what city is purdue university located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05x_5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05x_5 fb:location.location.street_address ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_2144","question":"what language does people in thailand speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2146","question":"what does beth tweddle compete in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09_xs4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09_xs4 fb:olympics.olympic_athlete.country ?y . ?y fb:olympics.olympic_athlete_affiliation.sport ?x . }","paraphrases":[],"info":{}}
{"id":"train_2147","question":"what airport is closest to downtown toronto?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0h7h6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0h7h6 fb:travel.travel_destination.how_to_get_here ?y . ?y fb:travel.transportation.transport_terminus ?x . ?y fb:travel.transportation.mode_of_transportation fb:m.025t3bg . }","paraphrases":[],"info":{}}
{"id":"train_2149","question":"what to do around krabi thailand?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04q9ng ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04q9ng fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2150","question":"what country is george washington carver from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03djm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03djm fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_2151","question":"who is playing bilbo in the hobbit movie?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0g6z1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0g6z1 fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.film fb:m.0n4ck66 . }","paraphrases":[],"info":{}}
{"id":"train_2153","question":"what kind of currency do they use in thailand?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2154","question":"who is the actor that plays rico in hannah montana?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09yn84 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09yn84 fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.0c029cx . }","paraphrases":[],"info":{}}
{"id":"train_2155","question":"what time zone is birmingham england?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0k33p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0k33p fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2156","question":"what does andy warhol do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0kc6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0kc6 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2157","question":"where is colombia the country?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01ls2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01ls2 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2158","question":"who does jodelle ferland play in eclipse?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09jv8w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09jv8w fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.075wx7_ . }","paraphrases":[],"info":{}}
{"id":"train_2160","question":"where was karl marx buried?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.048cl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.048cl fb:people.deceased_person.place_of_burial ?x . }","paraphrases":[],"info":{}}
{"id":"train_2163","question":"what did dr carter g woodson do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.042w00 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.042w00 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2165","question":"what is ayrton senna?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.012pxw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.012pxw fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2166","question":"where was stephen g. breyer born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.016m0v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.016m0v fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2171","question":"what airport does southwest fly to in denver?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02cl1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02cl1 fb:travel.travel_destination.how_to_get_here ?y . ?y fb:travel.transportation.transport_terminus ?x . ?y fb:travel.transportation.mode_of_transportation fb:m.025t3bg . ?x fb:aviation.airport.hub_for fb:m.0gztl . }","paraphrases":[],"info":{}}
{"id":"train_2172","question":"who started google?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0387r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0387r fb:law.invention.inventor ?x . }","paraphrases":[],"info":{}}
{"id":"train_2173","question":"who started google?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.045c7b ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.045c7b fb:organization.organization.founders ?x . }","paraphrases":[],"info":{}}
{"id":"train_2174","question":"in what timezone is arizona?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0vmt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0vmt fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2179","question":"who portrayed indiana jones in raiders of the lost ark?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f4yh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f4yh fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.03ttl . }","paraphrases":[],"info":{}}
{"id":"train_2180","question":"what money is used in ukraine?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07t21 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07t21 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2181","question":"where is greyton western cape?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09g125 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09g125 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2182","question":"what is the buddhist holy book?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.092bf5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.092bf5 fb:religion.religion.texts ?x . }","paraphrases":[],"info":{}}
{"id":"train_2185","question":"who was phil harris married to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mgdgm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mgdgm fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2187","question":"where did antoine laurent lavoisier die?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0tfw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0tfw fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2192","question":"what sports are played in canada?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d060g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d060g fb:sports.sports_team_location.teams ?x . }","paraphrases":[],"info":{}}
{"id":"train_2194","question":"who does northern ireland belong to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05bcl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05bcl fb:base.aareas.schema.administrative_area.administrative_parent ?x . }","paraphrases":[],"info":{}}
{"id":"train_2199","question":"what party was lincoln affiliated with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_2202","question":"what college did kris humphries play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0730b4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0730b4 fb:sports.drafted_athlete.drafted ?y . ?y fb:sports.sports_league_draft_pick.school ?x . }","paraphrases":[],"info":{}}
{"id":"train_2203","question":"what do mali people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04v09 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04v09 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2205","question":"who is john garcia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_lpf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_lpf fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2206","question":"what type of government does japan currently have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_3d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_3d fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_2207","question":"what do israeli people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03spz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03spz fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2210","question":"what did lbj die of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f7fy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f7fy fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2213","question":"what does george soros believe?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gyk6w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gyk6w fb:people.person.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_2215","question":"who was sam houston answers?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gbjz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gbjz fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2221","question":"where is st louis cardinals stadium?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06x68 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06x68 fb:sports.sports_team.arena_stadium ?x . ?x fb:architecture.structure.opened ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2224","question":"where did pharaoh hatshepsut live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gj3r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gj3r fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2228","question":"what county is plymouth ia in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0sswj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0sswj fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_2230","question":"what school did kurt vonnegut go to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.049gc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.049gc fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_2231","question":"where did henry hudson come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c065 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c065 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2232","question":"which continent is costa rica located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01p8s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01p8s fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_2234","question":"what movies has halle berry starred in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03knl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03knl fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2235","question":"what was the capital of ancient israel?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04fry ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04fry fb:location.country.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_2236","question":"where is sony ericsson based?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01spxd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01spxd fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_2238","question":"what do you speak in singapore?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06t2t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06t2t fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2240","question":"where is reggie bush from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05cb70 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05cb70 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2241","question":"what has sara paxton been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.075ms_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.075ms_ fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2242","question":"what primary school did sir isaac newton go to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03s9v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03s9v fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:education.educational_institution.school_type fb:m.014mjc . }","paraphrases":[],"info":{}}
{"id":"train_2243","question":"what's the egyptian currency?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02k54 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02k54 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2244","question":"what is mexico city time zone?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04sqj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04sqj fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2246","question":"who plays jacob black in the twilight movies?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03nm_fh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03nm_fh fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.02qd_td . }","paraphrases":[],"info":{}}
{"id":"train_2247","question":"who is the head coach of the indianapolis colts?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03wnh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03wnh fb:american_football.football_team.current_head_coach ?x . }","paraphrases":[],"info":{}}
{"id":"train_2249","question":"what is the syracuse university mascot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.078bz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.078bz fb:education.educational_institution.mascot ?x . }","paraphrases":[],"info":{}}
{"id":"train_2250","question":"where does honda play soccer?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gsj06 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gsj06 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2251","question":"what time zone is ontario toronto?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0h7h6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0h7h6 fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2252","question":"what government did japan have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_3d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_3d fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_2253","question":"where does the shannon river end?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0m_dt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0m_dt fb:geography.river.mouth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2256","question":"what university did donald trump graduate from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cqt90 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cqt90 fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?y fb:education.education.degree fb:m.02h4rq6 . }","paraphrases":[],"info":{}}
{"id":"train_2257","question":"what drug did mitch hedberg overdose on?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02vzgl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02vzgl fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2259","question":"what language do you speak in austria?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0h7x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0h7x fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2261","question":"who was rosemary clooney married to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0h8hk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0h8hk fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2262","question":"where did roger moore live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.017lqp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.017lqp fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_2263","question":"who's the oakland raiders head coach?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05l71 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05l71 fb:american_football.football_team.current_head_coach ?x . }","paraphrases":[],"info":{}}
{"id":"train_2264","question":"where is portuguese language spoken?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05zjd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05zjd fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_2267","question":"what political party was hitler the leader of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07_m9_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07_m9_ fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_2276","question":"what are 2 inventions benjamin franklin is credited with creating?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019fz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019fz fb:law.inventor.inventions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2277","question":"where did carmen electra grow up?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01lbp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01lbp fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2279","question":"what famous book did benjamin franklin wrote?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019fz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019fz fb:book.author.works_written ?x . }","paraphrases":[],"info":{}}
{"id":"train_2280","question":"what band does adam levine sing for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.044mfr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.044mfr fb:music.group_member.membership ?y . ?y fb:music.group_membership.group ?x . }","paraphrases":[],"info":{}}
{"id":"train_2282","question":"where did robert hooke get his education?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d6j4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d6j4 fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_2283","question":"what country did truman lead?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09bg4l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09bg4l fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . }","paraphrases":[],"info":{}}
{"id":"train_2284","question":"what is language in argentina?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jgd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jgd fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2288","question":"what time is kansas in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0488g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0488g fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
