{"id":"train_120","question":"what school did cassie bernall go to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0219mf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0219mf fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_123","question":"what did st. matthew do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0565x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0565x fb:book.author.works_written ?x . }","paraphrases":[],"info":{}}
{"id":"train_124","question":"what was nelson mandela's religion?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05g7q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05g7q fb:people.person.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_125","question":"what is henry clay known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ct18 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ct18 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_126","question":"who did axl rose marry?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vv6xv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vv6xv fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_127","question":"what is the money of spain called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mkj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mkj fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_128","question":"who was elected president of the philippines?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05v8c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05v8c fb:government.governmental_jurisdiction.governing_officials ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.060c4 . }","paraphrases":[],"info":{}}
{"id":"train_130","question":"what time zone is oklahoma state?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05mph ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05mph fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_131","question":"who was the apostle paul considered to be?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.060nc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.060nc fb:fictional_universe.person_in_fiction.representations_in_fiction ?x . }","paraphrases":[],"info":{}}
{"id":"train_136","question":"who do derek fisher play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04lvwk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04lvwk fb:base.schemastaging.athlete_extra.salary ?y . ?y fb:base.schemastaging.athlete_salary.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_137","question":"where did the casey anthony case take place?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04gtx2_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04gtx2_ fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_138","question":"where did pres clinton go to college?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0157m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0157m fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_139","question":"what was the name of the original seattle baseball team?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0fq2vj2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0fq2vj2 fb:type.object.name ?x . }","paraphrases":[],"info":{}}
{"id":"train_141","question":"where did the houston oilers football team go?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04nmxtk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04nmxtk fb:sports.defunct_sports_team.later_known_as ?x . }","paraphrases":[],"info":{}}
{"id":"train_143","question":"where does niles crane live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02c81m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02c81m fb:fictional_universe.fictional_character.places_lived ?x . }","paraphrases":[],"info":{}}
{"id":"train_148","question":"which countries are part of the united kingdom?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07ssc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07ssc fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_149","question":"what is the postcode for london?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04jpl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04jpl fb:location.citytown.postal_codes ?x . }","paraphrases":[],"info":{}}
{"id":"train_150","question":"what other books did jules verne wrote?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04093 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04093 fb:book.author.book_editions_published ?x . }","paraphrases":[],"info":{}}
{"id":"train_151","question":"what is the currency name of brazil?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_154","question":"who did jon gosselin cheat with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.046s1z1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.046s1z1 fb:base.popstra.celebrity.infidelity_perpetrator ?y . ?y fb:base.popstra.infidelity.participant ?x . }","paraphrases":[],"info":{}}
{"id":"train_155","question":"where is mitsubishi headquarters?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0czgc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0czgc fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_161","question":"what are eu countries?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0_6t_z8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0_6t_z8 fb:organization.membership_organization.members ?y . ?y fb:organization.organization_membership.member ?x . }","paraphrases":[],"info":{}}
{"id":"train_162","question":"what influenced vincent van gogh work?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07_m2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07_m2 fb:influence.influence_node.influenced_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_163","question":"what time zones are there in the us?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09c7w0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09c7w0 fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_164","question":"what are the 5 biggest cities in the usa?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { { SELECT ?x ( MAX ( ?yr ) AS ?recent_yr ) WHERE { fb:m.09c7w0 fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01m9 . ?x fb:location.statistical_region.population ?y . ?y fb:measurement_unit.dated_integer.number ?p . ?y fb:measurement_unit.dated_integer.year ?yr . } GROUP BY ?x } { SELECT ?x ?p ?yr WHERE { fb:m.09c7w0 fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01m9 . ?x fb:location.statistical_region.population ?y . ?y fb:measurement_unit.dated_integer.number ?p . ?y fb:measurement_unit.dated_integer.year ?yr . } } FILTER ( ?yr = ?recent_yr ) } ORDER BY DESC ( xsd:integer ( ?p ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_165","question":"what language do australian people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0chghy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0chghy fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_166","question":"who did ben stiller play in megamind?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0mdqp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0mdqp fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.05229c_ . }","paraphrases":[],"info":{}}
{"id":"train_168","question":"what countries did queen victoria rule?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cw10 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cw10 fb:government.political_appointer.appointees ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . }","paraphrases":[],"info":{}}
{"id":"train_170","question":"where did jeff dunham go to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ch_0g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ch_0g fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_171","question":"what college did kevjumba?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.047p6rh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.047p6rh fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:education.educational_institution.school_type fb:m.05jxkf . }","paraphrases":[],"info":{}}
{"id":"train_173","question":"what movies did diana ross play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01wrcxr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01wrcxr fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_174","question":"what is the zip code for minneapolis?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0fpzwf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0fpzwf fb:location.citytown.postal_codes ?x . }","paraphrases":[],"info":{}}
{"id":"train_175","question":"what country is the west bank located in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.082pc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.082pc fb:base.biblioness.bibs_location.country ?x . }","paraphrases":[],"info":{}}
{"id":"train_178","question":"who won golden boot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0by030z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0by030z fb:award.award_category.winners ?y . ?y fb:award.award_honor.award_winner ?x . }","paraphrases":[],"info":{}}
{"id":"train_179","question":"where did jane mansfield die?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.024y6w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.024y6w fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_180","question":"where is the thames river located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d2kt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d2kt fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_182","question":"what school did william shakespeare attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.081k8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.081k8 fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_184","question":"what college did peyton manning?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027jv8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027jv8 fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_185","question":"what are the 2 conferences in the nfl?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059yj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059yj fb:organization.organization.child ?y . ?y fb:organization.organization_relationship.child ?x . ?x fb:common.topic.notable_types fb:m.025dnr9 . }","paraphrases":[],"info":{}}
{"id":"train_186","question":"when did jennifer lopez start on in living color?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.043zg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.043zg fb:tv.tv_actor.starring_roles ?y . ?y fb:tv.regular_tv_appearance.from ?x . ?y fb:tv.regular_tv_appearance.seasons fb:m.04dq5zq . }","paraphrases":[],"info":{}}
{"id":"train_187","question":"what character does ellen play in finding nemo?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01gbbz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01gbbz fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.01jrbb . }","paraphrases":[],"info":{}}
{"id":"train_190","question":"what are all the names of harry potter?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03647x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03647x fb:book.book_character.appears_in_book ?x . }","paraphrases":[],"info":{}}
{"id":"train_191","question":"what does nick cannon play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01d1st ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01d1st fb:tv.tv_actor.starring_roles ?y . ?y fb:tv.regular_tv_appearance.series ?x . }","paraphrases":[],"info":{}}
{"id":"train_192","question":"what sort of government does brazil have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_193","question":"where did matthias schleiden go to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dd3q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dd3q fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_194","question":"what county is rihanna from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.06mt91 fb:people.person.place_of_birth ?y . ?y fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_195","question":"what happened to daddy yankee?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01wbl_r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01wbl_r fb:base.disaster2.injured_person.injuries ?y . ?y fb:base.disaster2.injury.type_of_event ?x . }","paraphrases":[],"info":{}}
{"id":"train_196","question":"what country is located in the balkan peninsula?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01jjk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01jjk fb:location.location.contains ?x . ?x fb:base.biblioness.bibs_location.loc_type ?sk0 . FILTER ( str ( ?sk0 ) = \"Country\" ) }","paraphrases":[],"info":{}}
{"id":"train_197","question":"what 6 states border south dakota?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mz5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mz5 fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_198","question":"what are the main languages spoken in spain?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mkj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mkj fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_199","question":"what songs did mozart write?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.082db ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.082db fb:music.composer.compositions ?x . }","paraphrases":[],"info":{}}
{"id":"train_200","question":"what language do they speak in thai?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_201","question":"who is the new senator of montana?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.050l8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.050l8 fb:government.political_district.representatives ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.office_position_or_title fb:m.02_7l8y . ?y fb:government.government_position_held.from ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_202","question":"which airport to fly in rome?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c62 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c62 fb:travel.travel_destination.how_to_get_here ?y . ?y fb:travel.transportation.transport_terminus ?x . ?x fb:common.topic.notable_types fb:m.01xpjyz . }","paraphrases":[],"info":{}}
{"id":"train_203","question":"what language people speak in afghanistan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jdd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jdd fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_205","question":"what language do people speak in brazil wikipedia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_207","question":"what cities should i visit in california?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.01n7q fb:travel.travel_destination.tourist_attractions ?y . ?y fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01m9 . }","paraphrases":[],"info":{}}
{"id":"train_209","question":"what is the name of the pittsburgh steelers head coach?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05tfm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05tfm fb:american_football.football_team.current_head_coach ?x . }","paraphrases":[],"info":{}}
{"id":"train_213","question":"what countries share borders with france?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f8l9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f8l9c fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_214","question":"what did patrick swayze sing?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02h3tp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02h3tp fb:music.artist.track ?x . }","paraphrases":[],"info":{}}
{"id":"train_215","question":"what style of art is salvador dali?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09_xn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09_xn fb:visual_art.visual_artist.art_forms ?x . }","paraphrases":[],"info":{}}
{"id":"train_217","question":"what did george v die of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cmpn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cmpn fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_218","question":"what are the three major rivers in south america?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06n3y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06n3y fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01xs05k . ?x fb:geography.river.discharge ?sk0 . } ORDER BY DESC ( xsd:float ( ?sk0 ) ) LIMIT 3","paraphrases":[],"info":{}}
{"id":"train_220","question":"who started pixar?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0kk9v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0kk9v fb:organization.organization.founders ?x . }","paraphrases":[],"info":{}}
{"id":"train_221","question":"who is tia and tamera mowry parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.054xvs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.054xvs fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_223","question":"what kind of government is china?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05w3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05w3 fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_224","question":"where is the nation of greece located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035qy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035qy fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_226","question":"what three countries does mexico border?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0b90_r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0b90_r fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_228","question":"which countries have english as native language?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02h40lc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02h40lc fb:language.human_language.main_country ?x . }","paraphrases":[],"info":{}}
{"id":"train_229","question":"what position does rafael furcal play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03jtzg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03jtzg fb:baseball.baseball_player.position_s ?x . }","paraphrases":[],"info":{}}
{"id":"train_231","question":"what shows did kellie martin star in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03kcyd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03kcyd fb:tv.tv_actor.starring_roles ?y . ?y fb:tv.regular_tv_appearance.series ?x . }","paraphrases":[],"info":{}}
{"id":"train_232","question":"where did rihanna grow up?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mt91 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mt91 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_233","question":"where is whistler mountain located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02pg6z3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02pg6z3 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_235","question":"what country did james cook come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_j8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_j8 fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_236","question":"who is julia roberts married to 2012?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.046zh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.046zh fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . ?y fb:people.marriage.from ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_237","question":"what sport does rebecca adlington compete in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.047tr42 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.047tr42 fb:olympics.olympic_athlete.country ?y . ?y fb:olympics.olympic_athlete_affiliation.sport ?x . }","paraphrases":[],"info":{}}
{"id":"train_240","question":"who played mason capwell?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04f3bz1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04f3bz1 fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_241","question":"what is james madison most famous for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0424m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0424m fb:common.topic.notable_types ?x . }","paraphrases":[],"info":{}}
{"id":"train_242","question":"where was the battle of antietam creek?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0lkxb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0lkxb fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_244","question":"who are shakespeare's parents names?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.081k8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.081k8 fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_245","question":"where is she from shakira?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01wj18h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01wj18h fb:music.artist.origin ?x . }","paraphrases":[],"info":{}}
{"id":"train_247","question":"who did hera marry?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03g3c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03g3c fb:fictional_universe.fictional_character.married_to ?y . ?y fb:fictional_universe.marriage_of_fictional_characters.spouses ?x . }","paraphrases":[],"info":{}}
