{"id":"train_2289","question":"what time is in san diego california?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.071vr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.071vr fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2294","question":"what drugs does charlie sheen do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01pllx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01pllx fb:base.popstra.celebrity.substance_abuse ?y . ?y fb:base.popstra.substance_abuse.substance ?x . }","paraphrases":[],"info":{}}
{"id":"train_2298","question":"what disease michael jackson?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:medicine.notable_person_with_medical_condition.condition ?x . }","paraphrases":[],"info":{}}
{"id":"train_2302","question":"what is the origin of the turkish language?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02hwyss ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02hwyss fb:language.human_language.language_family ?x . }","paraphrases":[],"info":{}}
{"id":"train_2303","question":"when did tom brady join the patriots?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01xyt7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01xyt7 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.from ?x . ?y fb:sports.sports_team_roster.team fb:m.05g3b . }","paraphrases":[],"info":{}}
{"id":"train_2304","question":"what is isaac newton famous for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03s9v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03s9v fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2305","question":"where did barack obama went to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02mjmr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02mjmr fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_2306","question":"what battles did robert e lee participate in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06f5j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06f5j fb:military.military_commander.military_commands ?y . ?y fb:military.military_command.military_conflict ?x . }","paraphrases":[],"info":{}}
{"id":"train_2311","question":"what team did albert pujols play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035gcb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035gcb fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2314","question":"what are fun things to do in seattle wa?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d9jr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d9jr fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2315","question":"where does the oklahoma city thunder practice?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04cxw5b ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04cxw5b fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_2316","question":"what is the language called in turkey?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01znc_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01znc_ fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2318","question":"who was theodore roosevelt's vice president?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07hyk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07hyk fb:government.us_president.vice_president ?x . }","paraphrases":[],"info":{}}
{"id":"train_2320","question":"where does the roman language come from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04h9h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04h9h fb:language.human_language.language_family ?x . }","paraphrases":[],"info":{}}
{"id":"train_2321","question":"what nationality is jermaine paul?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02rxpxn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02rxpxn fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_2323","question":"who were mary shelley's parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04_by ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04_by fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_2324","question":"what do do in new york?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02_286 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02_286 fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2326","question":"what is the capital city of south carolina?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06yxd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06yxd fb:base.aareas.schema.administrative_area.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_2329","question":"what language do they speak in indonesia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03ryn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03ryn fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2332","question":"what is the actual current local time now in uk?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07ssc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07ssc fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2333","question":"what are some of the awards taylor swift has won?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dl567 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dl567 fb:award.award_winner.awards_won ?y . ?y fb:award.award_honor.award ?x . }","paraphrases":[],"info":{}}
{"id":"train_2337","question":"what is there to do in palm springs?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0r3tq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0r3tq fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2338","question":"where is auburn university at?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01wdj_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01wdj_ fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2340","question":"where was ronald reagan born and raised?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c0j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c0j fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2341","question":"what county is morristown tn in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0xr0t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0xr0t fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_2343","question":"where do the houston rockets play basketball?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jmfb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jmfb fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_2348","question":"what continent do the falkland islands belong to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02wmy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02wmy fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01mh . }","paraphrases":[],"info":{}}
{"id":"train_2349","question":"what language do russian people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bnz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bnz fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2351","question":"which states touch canadian soil?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d060g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d060g fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_2352","question":"what did alvin smith died from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0261tkp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0261tkp fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2353","question":"what are the four harry potter house names?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.0cb3n fb:fictional_universe.fictional_organization.sub_organization_in_fiction ?x . }","paraphrases":[],"info":{}}
{"id":"train_2354","question":"who has tim howard played for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.026s3n ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.026s3n fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2356","question":"where does portuguese originate?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05zjd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05zjd fb:base.rosetta.languoid.parent ?x . }","paraphrases":[],"info":{}}
{"id":"train_2357","question":"what currency in dominican republic should i bring?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2358","question":"who did howie long married?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04jg88 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04jg88 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2359","question":"what region of the world is north america in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059g4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059g4 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2362","question":"what instrument does ringo starr play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vrnsk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vrnsk fb:music.group_member.instruments_played ?x . }","paraphrases":[],"info":{}}
{"id":"train_2363","question":"who are china's trading partners?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05w3 ) { fb:m.0d05w3 fb:location.statistical_region.places_exported_to ?y . ?y fb:location.imports_and_exports.exported_to ?x . } UNION { fb:m.0d05w3 fb:location.statistical_region.places_imported_from ?y . ?y fb:location.imports_and_exports.imported_from ?x . } }","paraphrases":[],"info":{}}
{"id":"train_2364","question":"what character did stan lee create?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.079vf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.079vf fb:fictional_universe.fictional_character_creator.fictional_characters_created ?x . }","paraphrases":[],"info":{}}
{"id":"train_2365","question":"where did rich rodriguez get fired?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.091xv3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.091xv3 fb:american_football.football_coach.coaching_history ?y . ?y fb:american_football.football_historical_coach_position.team ?x . ?y fb:american_football.football_historical_coach_position.to ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2366","question":"who did mario lopez just marry?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02w5q6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02w5q6 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . FILTER ( NOT EXISTS { ?y fb:people.marriage.from ?sk0 } || EXISTS { ?y fb:people.marriage.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.marriage.to ?sk2 } || EXISTS { ?y fb:people.marriage.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2367","question":"what happened to president james garfield?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0b22w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0b22w fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2368","question":"what time zone am i in missouri?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04ych ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04ych fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2370","question":"what channel is anderson cooper talk show on?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03v9lv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03v9lv fb:tv.tv_program.original_network ?y . ?y fb:tv.tv_network_duration.network ?x . FILTER ( NOT EXISTS { ?y fb:tv.tv_network_duration.from ?sk0 } || EXISTS { ?y fb:tv.tv_network_duration.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:tv.tv_network_duration.to ?sk2 } || EXISTS { ?y fb:tv.tv_network_duration.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2371","question":"what drugs were in whitney houston when she died?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.086qd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.086qd fb:people.deceased_person.cause_of_death ?x . ?x fb:people.cause_of_death.parent_cause_of_death fb:m.01tf_6 . }","paraphrases":[],"info":{}}
{"id":"train_2372","question":"who did warren moon play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01b0dl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01b0dl fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2373","question":"what brand of guitar does steve vai play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mxt_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mxt_ fb:music.guitarist.guitars_played ?x . ?x fb:common.topic.notable_types fb:m.05czz29 . }","paraphrases":[],"info":{}}
{"id":"train_2374","question":"what do hungarian people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gj2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gj2 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_2375","question":"what prep school did romney attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0271_s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0271_s fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:education.educational_institution.school_type fb:m.0m4mb . }","paraphrases":[],"info":{}}
{"id":"train_2376","question":"in what town did ned kelly and his family grow up?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.014pyb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.014pyb fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2377","question":"what is bethenny frankel husband name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07_l39 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07_l39 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . }","paraphrases":[],"info":{}}
{"id":"train_2381","question":"when was samuel pepys?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06xxc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06xxc fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_2383","question":"what type of money does jamaica use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_r3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_r3 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2384","question":"what instrument does fela kuti play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01tw0t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01tw0t fb:music.group_member.instruments_played ?x . }","paraphrases":[],"info":{}}
{"id":"train_2386","question":"who was charlemagne's wife?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mhc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mhc fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . ?y fb:people.marriage.to ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2387","question":"where did woodrow wilson go to school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.083q7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.083q7 fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_2389","question":"where can you buy amazon kindle?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03d068f ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03d068f fb:base.gadgets.gadget.brand ?x . }","paraphrases":[],"info":{}}
{"id":"train_2390","question":"who is angelina jolie's husband?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f4vbz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f4vbz fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . FILTER ( NOT EXISTS { ?y fb:people.marriage.from ?sk0 } || EXISTS { ?y fb:people.marriage.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.marriage.to ?sk2 } || EXISTS { ?y fb:people.marriage.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) ?y fb:people.marriage.from ?sk4 . } ORDER BY DESC ( xsd:datetime ( ?sk4 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2391","question":"what kind of money do they use in aruba?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0j11 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0j11 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2392","question":"what sports do people in france play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f8l9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f8l9c fb:sports.sports_team_location.teams ?x . }","paraphrases":[],"info":{}}
{"id":"train_2393","question":"what wars did robert e lee lead?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06f5j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06f5j fb:military.military_commander.military_commands ?y . ?y fb:military.military_command.military_conflict ?x . }","paraphrases":[],"info":{}}
{"id":"train_2394","question":"what language do native american indians speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059_w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059_w fb:people.ethnicity.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2395","question":"where did tennessee williams live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c4y8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c4y8 fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_2397","question":"what language do they in belgium?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0154j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0154j fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2399","question":"who plays walter in fringe?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03cf9ly ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03cf9ly fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.04q8mtg . }","paraphrases":[],"info":{}}
{"id":"train_2400","question":"where is port st lucie florida on the map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0rsb4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0rsb4 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2401","question":"what countries are the mediterranean?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04swx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04swx fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_2403","question":"who juan ponce de leon?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0123f1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0123f1 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2405","question":"what state is toronto in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0h7h6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0h7h6 fb:base.biblioness.bibs_location.state ?x . }","paraphrases":[],"info":{}}
{"id":"train_2407","question":"what is the state motto of massachusetts?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05k7sb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05k7sb fb:government.governmental_jurisdiction.official_symbols ?y . ?y fb:location.location_symbol_relationship.symbol ?x . ?y fb:location.location_symbol_relationship.Kind_of_symbol fb:m.0j749 . }","paraphrases":[],"info":{}}
{"id":"train_2408","question":"what is time zone in new orleans?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f2tj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f2tj fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2410","question":"where did helen keller die?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03ppx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03ppx fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2412","question":"where did johann sebastian bach live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_f0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_f0 fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_2413","question":"what timezone is malaysia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09pmkv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09pmkv fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2414","question":"where is alex smith from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05dfhp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05dfhp fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2415","question":"where was alice walker born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bv70 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bv70 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2416","question":"what do they speak iceland?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rj0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rj0 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2418","question":"what wars have france been involved in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f8l9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f8l9c fb:military.military_combatant.casualties ?y . ?y fb:military.casualties.military_conflict ?x . }","paraphrases":[],"info":{}}
{"id":"train_2419","question":"who plays moira on the l word?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02bf9g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02bf9g fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:g.121_4f1c . }","paraphrases":[],"info":{}}
{"id":"train_2421","question":"what is the major language of jamaica?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_r3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_r3 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_2422","question":"who was the members of blackstreet?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01fm10 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01fm10 fb:music.musical_group.member ?y . ?y fb:music.group_membership.member ?x . }","paraphrases":[],"info":{}}
