{"id":"train_888","question":"what countries did queen elizabeth ii rule?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d1_f ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d1_f fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . }","paraphrases":[],"info":{}}
{"id":"train_889","question":"who played forrest gump as a kid?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bdjd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bdjd fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.0264f7h . ?y fb:film.performance.character_note ?sk0 . FILTER ( str ( ?sk0 ) = \"Young Forrest\" ) }","paraphrases":[],"info":{}}
{"id":"train_891","question":"where was the battle of vicksburg held?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01hf7f ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01hf7f fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_892","question":"what kind of artist is henri matisse?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gct_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gct_ fb:visual_art.visual_artist.art_forms ?x . }","paraphrases":[],"info":{}}
{"id":"train_893","question":"who is the head coach of the tennessee titans?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07l2m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07l2m fb:american_football.football_team.current_head_coach ?x . }","paraphrases":[],"info":{}}
{"id":"train_894","question":"what type of government does fiji have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02wt0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02wt0 fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_895","question":"in what state did the bloody battle of antietam take place?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0lkxb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0lkxb fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_896","question":"who was dan cody?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07m5fb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07m5fb fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_897","question":"what language do people speak in turkey?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01znc_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01znc_ fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_899","question":"what are all the inventions benjamin franklin made?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019fz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019fz fb:law.inventor.inventions ?x . }","paraphrases":[],"info":{}}
{"id":"train_900","question":"what was wrong with joan crawford?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cgbf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cgbf fb:medicine.notable_person_with_medical_condition.condition ?x . }","paraphrases":[],"info":{}}
{"id":"train_901","question":"who does debbie dingle go out with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09rj2g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09rj2g fb:fictional_universe.fictional_character.romantically_involved_with ?y . ?y fb:fictional_universe.romantic_involvement.partner ?x . }","paraphrases":[],"info":{}}
{"id":"train_902","question":"what country was anton van leeuwenhoek from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.0bj_v fb:people.person.place_of_birth ?y . ?y fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_903","question":"who played todd manning on one life to live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01y6dz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01y6dz fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.035141 . }","paraphrases":[],"info":{}}
{"id":"train_904","question":"what does latin america consist of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04pnx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04pnx fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_905","question":"who is the manager of the st louis cardinals?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06x68 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06x68 fb:baseball.baseball_team.current_manager ?x . }","paraphrases":[],"info":{}}
{"id":"train_906","question":"where in oregon was stand by me filmed?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0m2kd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0m2kd fb:film.film.featured_film_locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_907","question":"what did writers of the harlem renaissance write about?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019y_2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019y_2 fb:book.book_subject.works ?x . ?x fb:common.topic.notable_types fb:m.03jz7ls . }","paraphrases":[],"info":{}}
{"id":"train_908","question":"what is the language they speak in jamaica?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_r3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_r3 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_910","question":"where did prophet daniel died?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02cts ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02cts fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_911","question":"what state was theodore roosevelt from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.07hyk fb:people.person.place_of_birth ?y . ?y fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_912","question":"what form of government does brazil have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_915","question":"where do the fla marlins play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02__x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02__x fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_918","question":"who was arthur miller father?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0yfp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0yfp fb:people.person.parents ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_919","question":"what influenced william morris to be an artist?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08304 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08304 fb:influence.influence_node.influenced_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_920","question":"what super bowls have the giants won?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05gg4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05gg4 fb:sports.sports_team.championships ?x . ?x fb:common.topic.notable_types fb:m.01xljv1 . }","paraphrases":[],"info":{}}
{"id":"train_921","question":"where was rod stewart born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0qf11 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0qf11 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_922","question":"which country uses euro as its main currency?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02l6h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02l6h fb:finance.currency.countries_used ?x . ?x fb:base.biblioness.bibs_location.loc_type ?sk0 . FILTER ( str ( ?sk0 ) = \"Country\" ) }","paraphrases":[],"info":{}}
{"id":"train_924","question":"who played eowyn in the lord of the rings movies?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gynx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gynx fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_925","question":"what important office did abraham lincoln hold?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.office_position_or_title ?x . }","paraphrases":[],"info":{}}
{"id":"train_926","question":"which country has adopted the euro as its currency ( 1 point )?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02l6h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02l6h fb:finance.currency.countries_used ?x . ?x fb:base.biblioness.bibs_location.loc_type ?sk0 . FILTER ( str ( ?sk0 ) = \"Country\" ) }","paraphrases":[],"info":{}}
{"id":"train_928","question":"what type of cancer did huell howser die of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02kddt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02kddt fb:people.deceased_person.cause_of_death ?x . ?x fb:medicine.disease.parent_disease fb:m.0qcr0 . }","paraphrases":[],"info":{}}
{"id":"train_929","question":"what timezone is minneapolis in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0fpzwf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0fpzwf fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_930","question":"who is aidan davis?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.080p6xw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.080p6xw fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_931","question":"what was nicolaus copernicus occupation?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vvm4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vvm4 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_932","question":"what did richard arkwright contribute to the industrial revolution?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01tglh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01tglh fb:law.inventor.inventions ?x . }","paraphrases":[],"info":{}}
{"id":"train_933","question":"what kind of currency does greece have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035qy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035qy fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_935","question":"where is the mozambique located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04wlh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04wlh fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_937","question":"where is isthmus of panama located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04zwft ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04zwft fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_938","question":"what to see in washington dc in 2 days?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0rh6k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0rh6k fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_939","question":"where is azerbaijan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jhd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jhd fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_941","question":"what is the money of argentina called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jgd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jgd fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_942","question":"what college did matt schaub play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05txyj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05txyj fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . ?x fb:american_football.football_team.division fb:m.031fsz . }","paraphrases":[],"info":{}}
{"id":"train_943","question":"what did bella abzug do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02dqgj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02dqgj fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_944","question":"what sights to see in madrid?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.056_y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.056_y fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_945","question":"what films has gerard butler starred in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.038rzr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.038rzr fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_946","question":"what films did hans zimmer wrote music for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0150t6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0150t6 fb:film.music_contributor.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_947","question":"where was alice paul born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02lp71 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02lp71 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_948","question":"what did john quincy adams died of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_nq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_nq fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_951","question":"what is the political system in italy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rjj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rjj fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_953","question":"who is raquel welch's daughter?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.012s5j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.012s5j fb:people.person.children ?x . ?x fb:people.person.gender fb:m.02zsn . }","paraphrases":[],"info":{}}
{"id":"train_954","question":"what kind of art did leonardo da vinci produce?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04lg6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04lg6 fb:visual_art.visual_artist.art_forms ?x . }","paraphrases":[],"info":{}}
{"id":"train_955","question":"what does the zambezi river flow into?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0p_70 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0p_70 fb:geography.river.mouth ?x . }","paraphrases":[],"info":{}}
{"id":"train_956","question":"what states does the connecticut river flow through?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01ldvs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01ldvs fb:location.location.partially_containedby ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_957","question":"what money is used in the maldives?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04ty8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04ty8 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_958","question":"where does mike leach coach?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08gnpj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08gnpj fb:american_football.football_coach.current_team_head_coached ?x . }","paraphrases":[],"info":{}}
{"id":"train_959","question":"what is the zip code of new york city?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02_286 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02_286 fb:location.citytown.postal_codes ?x . }","paraphrases":[],"info":{}}
{"id":"train_960","question":"what condition does michael j fox have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hz_1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hz_1 fb:medicine.notable_person_with_medical_condition.condition ?x . }","paraphrases":[],"info":{}}
{"id":"train_961","question":"where did jrr tolkien live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.041h0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.041h0 fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_962","question":"what are the major languages of italy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rjj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rjj fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_963","question":"what to do in panama city beach fl?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0rhg5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0rhg5 fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_964","question":"what is currency in dominican republic?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_965","question":"where is san miguel mexico on map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.056201 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.056201 fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.02_3pws . }","paraphrases":[],"info":{}}
{"id":"train_966","question":"where are the great pyramid of giza located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.036mk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.036mk fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_968","question":"who plays the voice of lois griffin?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03pcqz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03pcqz fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . }","paraphrases":[],"info":{}}
{"id":"train_969","question":"what team does sergio aguero play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.099vgz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.099vgz fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_974","question":"who is susan st james?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rp65 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rp65 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_975","question":"what is chris paul's son name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cymln ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cymln fb:people.person.children ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_976","question":"who does josh hutcherson play in the hunger games?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08wjf4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08wjf4 fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.0gkz15s . }","paraphrases":[],"info":{}}
{"id":"train_979","question":"what is the state flag of colorado called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01n4w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01n4w fb:symbols.flag_referent.flag ?y . ?y fb:symbols.flag_use.flag ?x . }","paraphrases":[],"info":{}}
{"id":"train_980","question":"who plays claire in lost?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0828jw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0828jw fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.06xt2p . }","paraphrases":[],"info":{}}
{"id":"train_981","question":"who are senators from new jersey?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05fjf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05fjf fb:government.political_district.representatives ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.048zv9l . FILTER ( NOT EXISTS { ?y fb:government.government_position_held.from ?sk0 } || EXISTS { ?y fb:government.government_position_held.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:government.government_position_held.to ?sk2 } || EXISTS { ?y fb:government.government_position_held.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_983","question":"what language do denmark?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0k6nt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0k6nt fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_986","question":"who is facebook's founder?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hmyfsv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hmyfsv fb:organization.organization.founders ?x . }","paraphrases":[],"info":{}}
{"id":"train_988","question":"what language do people speak in costa rica?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01p8s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01p8s fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_990","question":"what kind of music does john mayer play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01s21dg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01s21dg fb:music.artist.genre ?x . }","paraphrases":[],"info":{}}
{"id":"train_991","question":"what is lil wayne real name?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.016kjs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.016kjs fb:base.schemastaging.context_name.official_name ?x . }","paraphrases":[],"info":{}}
{"id":"train_992","question":"what is the political system of the us?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09c7w0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09c7w0 fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_993","question":"what religions are practiced in afghanistan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jdd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jdd fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_994","question":"where is the world series 2012 being played?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ds8qct ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ds8qct fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_995","question":"what kind of language do irish speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03bkbh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03bkbh fb:people.ethnicity.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_996","question":"what cancer did audrey hepburn died of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dqcm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dqcm fb:people.deceased_person.cause_of_death ?x . ?x fb:people.cause_of_death.parent_cause_of_death fb:m.0qcr0 . }","paraphrases":[],"info":{}}
