{"id":"train_2650","question":"what movies johnny depp is in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jfx1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jfx1 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2652","question":"what songs does katherine jenkins sing?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01qrf09 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01qrf09 fb:music.artist.track_contributions ?y . ?y fb:music.track_contribution.track ?x . }","paraphrases":[],"info":{}}
{"id":"train_2653","question":"what is ryan seacrest famous for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02b9g4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02b9g4 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2655","question":"how much indiana jones movies are there?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03ttl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03ttl fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.film ?x . ?x fb:film.film.film_series fb:m.0hn_72f . }","paraphrases":[],"info":{}}
{"id":"train_2656","question":"what does george soros own?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gyk6w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gyk6w fb:organization.organization_founder.organizations_founded ?x . }","paraphrases":[],"info":{}}
{"id":"train_2657","question":"what kind of money should i bring to dominican?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2659","question":"what city became the capital of the assyrian empire?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0wmn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0wmn fb:location.country.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_2660","question":"what time zone is maryville tn?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0_swz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0_swz fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2663","question":"where did marco rubio go to college?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0dpr5f ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0dpr5f fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_2664","question":"where was emperor tiberius born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07hz1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07hz1 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2665","question":"who did ronald reagan get shot by?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c0j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c0j fb:user.dfhuynh.default_domain.assassinated_person.assassination ?y . ?y fb:user.dfhuynh.default_domain.assassination.assassin ?x . }","paraphrases":[],"info":{}}
{"id":"train_2668","question":"who did president kennedy marry?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d3k14 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d3k14 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2669","question":"what movies did zoe saldana play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05qg6g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05qg6g fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2673","question":"where was abraham buried?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pwb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pwb fb:people.deceased_person.place_of_burial ?x . }","paraphrases":[],"info":{}}
{"id":"train_2674","question":"what type of cancer did donna summer died from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0136p1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0136p1 fb:people.deceased_person.cause_of_death ?x . ?x fb:people.cause_of_death.parent_cause_of_death fb:m.0qcr0 . }","paraphrases":[],"info":{}}
{"id":"train_2675","question":"where's the hudson river?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cvyp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cvyp fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2676","question":"what did jerry sandusky do to the children?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03h31dh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03h31dh fb:base.crime.convicted_criminal.convictions ?y . ?y fb:base.crime.criminal_conviction.guilty_of ?x . }","paraphrases":[],"info":{}}
{"id":"train_2677","question":"where does the jordan river end?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0cvy5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0cvy5 fb:geography.river.mouth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2678","question":"what is the state flower of pennsylvania?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05tbn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05tbn fb:government.governmental_jurisdiction.official_symbols ?y . ?y fb:location.location_symbol_relationship.symbol ?x . ?y fb:location.location_symbol_relationship.Kind_of_symbol fb:m.04627gn . }","paraphrases":[],"info":{}}
{"id":"train_2679","question":"what school did michael jackson attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_2680","question":"what does kenya moore do for a living?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.08cpnf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.08cpnf fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2681","question":"what country is barack obama from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02mjmr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02mjmr fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_2682","question":"who was wale signed to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.049fb8r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.049fb8r fb:music.artist.label ?x . }","paraphrases":[],"info":{}}
{"id":"train_2683","question":"who did tyson chandler play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05j8c8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05j8c8 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2684","question":"what character did liv tyler play in lord of the rings?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01rh0w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01rh0w fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.017gl1 . }","paraphrases":[],"info":{}}
{"id":"train_2685","question":"who played princess leia in star wars movies?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ddqw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ddqw fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_2688","question":"where was saint joseph from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c08y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c08y fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2689","question":"what job did george w bush have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09b6zr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09b6zr fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2690","question":"what are countries in south asia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06nn1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06nn1 fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_2691","question":"where is the caribbean geographically located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0261m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0261m fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2692","question":"what was howard carter's job?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03jvx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03jvx fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2694","question":"what is the capital city of texas usa?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07b_l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07b_l fb:location.us_state.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_2696","question":"what is the main language spoken in switzerland?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mzp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mzp fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2700","question":"where was the vietnam war located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07_nf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07_nf fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_2702","question":"where is aviano air force base located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05l8fk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05l8fk fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2705","question":"where did giovanni da verrazano live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0k6d2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0k6d2 fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_2706","question":"what was antonio vivaldi known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pth ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pth fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2707","question":"what movies does johnny depp play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jfx1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jfx1 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2711","question":"what country did the zulu live in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gwrmk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gwrmk fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2712","question":"where was president chester arthur born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vb2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vb2 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2713","question":"where to fly in for galapagos islands?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.016zjj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.016zjj fb:location.location.nearby_airports ?x . }","paraphrases":[],"info":{}}
{"id":"train_2714","question":"who has tom brady played for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01xyt7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01xyt7 fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2717","question":"what time is it in lake havasu city arizona?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0qpxs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0qpxs fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2719","question":"where did nick clegg go to prep school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.036547 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.036547 fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:education.educational_institution.school_type fb:m.07g47h . }","paraphrases":[],"info":{}}
{"id":"train_2720","question":"where did laura bush grow up?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04g8d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04g8d fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2721","question":"what currency should i take to mauritius?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04vs9 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04vs9 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2722","question":"which states share borders with virginia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07z1m ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07z1m fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_2723","question":"what is a judge in the supreme court called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07sz1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07sz1 fb:government.governmental_body.offices_positions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2724","question":"what did johannes kepler accomplish?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0403d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0403d fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2725","question":"what college did edgar allan poe go to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02lt8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02lt8 fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_2726","question":"who is ellen albertini dow?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03hzplf ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03hzplf fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2728","question":"what kind of language do china speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05w3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05w3 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_2729","question":"where is the singapore zoo?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0211mz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0211mz fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2730","question":"what town was abe lincoln born in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:people.person.place_of_birth ?x . ?x fb:common.topic.notable_types fb:m.01m9 . }","paraphrases":[],"info":{}}
{"id":"train_2731","question":"what do ethiopia import and export?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019pcs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019pcs fb:location.statistical_region.major_exports ?y . ?y fb:location.imports_exports_by_industry.industry ?x . }","paraphrases":[],"info":{}}
{"id":"train_2733","question":"what challenges did helen keller have to face?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03ppx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03ppx fb:base.qualia.disabled_person.disability ?y . ?y fb:base.qualia.disability.type_of_disability ?x . }","paraphrases":[],"info":{}}
{"id":"train_2734","question":"who is andy williams brother?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02lvtb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02lvtb fb:people.person.sibling_s ?y . ?y fb:people.sibling_relationship.sibling ?x . ?x fb:people.person.gender fb:m.05zppz . }","paraphrases":[],"info":{}}
{"id":"train_2735","question":"where does morrissey live 2010?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01w524f ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01w524f fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . FILTER ( NOT EXISTS { ?y fb:people.place_lived.end_date ?sk0 } || EXISTS { ?y fb:people.place_lived.end_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) >= \"2010-01-01\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.place_lived.start_date ?sk2 } || EXISTS { ?y fb:people.place_lived.start_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) <= \"2010-12-31\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2736","question":"what teams did jim harbaugh play for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04rmtv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04rmtv fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2737","question":"who played atticus finch in the movie?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02pk0sd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02pk0sd fb:film.film_character.portrayed_in_films ?y . ?y fb:film.performance.actor ?x . }","paraphrases":[],"info":{}}
{"id":"train_2738","question":"where did toussaint louverture live?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.011wgw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.011wgw fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2739","question":"what other countries share a border with china?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05w3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05w3 fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_2740","question":"who has the voice of stewie griffin?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02m29p ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02m29p fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . }","paraphrases":[],"info":{}}
{"id":"train_2742","question":"who is the senator of the state of texas?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07b_l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07b_l fb:government.political_district.representatives ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.office_position_or_title fb:m.02_7l8y . }","paraphrases":[],"info":{}}
{"id":"train_2743","question":"who is jensen ackles in a relationship with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.030697 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.030697 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . FILTER ( NOT EXISTS { ?y fb:people.marriage.from ?sk0 } || EXISTS { ?y fb:people.marriage.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.marriage.to ?sk2 } || EXISTS { ?y fb:people.marriage.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2744","question":"who is the voice actor for eric cartman?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0myj0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0myj0 fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . }","paraphrases":[],"info":{}}
{"id":"train_2745","question":"what language do irish people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03bkbh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03bkbh fb:people.ethnicity.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2746","question":"what is the currency used in brazil?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015fr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015fr fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2747","question":"what money is used in mozambique?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04wlh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04wlh fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2748","question":"what illness does michael j fox have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hz_1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hz_1 fb:medicine.notable_person_with_medical_condition.condition ?x . }","paraphrases":[],"info":{}}
{"id":"train_2751","question":"who did jerry rice retire with?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0240vt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0240vt fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . ?y fb:sports.sports_team_roster.to ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2753","question":"what movie queen latifah play in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01wgcvn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01wgcvn fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2810","question":"who is aidan quinn?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.045c66 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.045c66 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2840","question":"what city uses gmt?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03bdv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03bdv fb:time.time_zone.locations_in_this_time_zone ?x . ?x fb:base.biblioness.bibs_location.loc_type ?sk0 . FILTER ( str ( ?sk0 ) = \"City\" ) }","paraphrases":[],"info":{}}
{"id":"train_2858","question":"who owns audi 2011?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0k50 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0k50 fb:organization.organization.parent ?y . ?y fb:organization.organization_relationship.parent ?x . }","paraphrases":[],"info":{}}
{"id":"train_2875","question":"what boudicca do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01fz6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01fz6 fb:common.topic.notable_types ?x . }","paraphrases":[],"info":{}}
{"id":"train_3282","question":"what nestle owns?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01556g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01556g fb:business.business_operation.industry ?x . }","paraphrases":[],"info":{}}
{"id":"train_3304","question":"what is kate spade?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bkdx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06bkdx fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
