{"id":"train_248","question":"what type of guitar does kirk hammett play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0489w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0489w fb:music.group_member.instruments_played ?x . ?x fb:music.instrument.family fb:m.0342h . }","paraphrases":[],"info":{}}
{"id":"train_249","question":"what language they speak in the philippines?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05v8c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05v8c fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_250","question":"where is the kakadu national park located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0psgs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0psgs fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_251","question":"what money does jamaica use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_r3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_r3 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_253","question":"what date did kennedy become president?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d3k14 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d3k14 fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.from ?x . ?y fb:government.government_position_held.basic_title fb:m.060c4 . }","paraphrases":[],"info":{}}
{"id":"train_254","question":"what timezone is colorado in right now?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01n4w ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01n4w fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_255","question":"who owns aston martin 2012?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ywc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ywc fb:organization.organization.leadership ?y . ?y fb:organization.leadership.person ?x . ?y fb:organization.leadership.title ?sk0 . FILTER ( str ( ?sk0 ) = \"Chief Executive Officer\" ) FILTER ( NOT EXISTS { ?y fb:organization.leadership.from ?sk1 } || EXISTS { ?y fb:organization.leadership.from ?sk2 . FILTER ( xsd:datetime ( ?sk2 ) <= \"2012-12-31\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:organization.leadership.to ?sk3 } || EXISTS { ?y fb:organization.leadership.to ?sk4 . FILTER ( xsd:datetime ( ?sk4 ) >= \"2012-01-01\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_256","question":"what disease has jack osbourne got?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02348n ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02348n fb:medicine.notable_person_with_medical_condition.condition ?x . }","paraphrases":[],"info":{}}
{"id":"train_258","question":"what language they speak in taiwan?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06f32 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06f32 fb:location.country.official_language ?x . }","paraphrases":[],"info":{}}
{"id":"train_259","question":"who owns the toronto maple leafs?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0j6tr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0j6tr fb:sports.professional_sports_team.owner_s ?x . }","paraphrases":[],"info":{}}
{"id":"train_260","question":"what county is novato california in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0r1hb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0r1hb fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_262","question":"what are the basic beliefs of sikhism?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06yyp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06yyp fb:religion.religion.beliefs ?x . }","paraphrases":[],"info":{}}
{"id":"train_264","question":"who was liz taylor married too?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bmh4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bmh4 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_265","question":"where was the ancient region of mesopotamia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0524v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0524v fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_268","question":"where is the ottoman empire located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05kyr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05kyr fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_270","question":"who are the green bay packers owned by?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03b3j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03b3j fb:sports.professional_sports_team.owner_s ?x . }","paraphrases":[],"info":{}}
{"id":"train_271","question":"what inspired langston hughes to write poetry?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bv62 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bv62 fb:influence.influence_node.influenced_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_272","question":"what languages are there in switzerland?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06mzp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06mzp fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_276","question":"who is married to garry trudeau?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.037w1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.037w1 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_278","question":"what countries make up continental europe?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02j9z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02j9z fb:base.locations.continents.countries_within ?x . }","paraphrases":[],"info":{}}
{"id":"train_279","question":"what do abrahamic religions have in common?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f_h6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f_h6 fb:religion.religion.practices ?x . }","paraphrases":[],"info":{}}
{"id":"train_280","question":"what did johnny crawford sing?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01qmb2r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01qmb2r fb:music.artist.track ?x . }","paraphrases":[],"info":{}}
{"id":"train_285","question":"where is tom cruise from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07r1h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07r1h fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_286","question":"what movies did madonna appear in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01vs_v8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01vs_v8 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_287","question":"where does leland chapman live now?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05yqrl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05yqrl fb:people.person.places_lived ?y . ?y fb:people.place_lived.location ?x . FILTER ( NOT EXISTS { ?y fb:people.place_lived.end_date ?sk0 } || EXISTS { ?y fb:people.place_lived.end_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:people.place_lived.start_date ?sk2 } || EXISTS { ?y fb:people.place_lived.start_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_288","question":"where was the roman colosseum located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d5qx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d5qx fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_289","question":"what date was abraham lincoln inaugurated?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:base.inaugurations.inauguration_speaker.inauguration ?x . }","paraphrases":[],"info":{}}
{"id":"train_290","question":"what time zone is new york under?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059rby ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059rby fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_292","question":"who voiced meg in the pilot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035szd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035szd fb:tv.tv_character.appeared_in_tv_program ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . ?y fb:tv.regular_tv_appearance.seasons fb:m.027gynh . }","paraphrases":[],"info":{}}
{"id":"train_293","question":"where did bashar al assad study?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01_vwx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01_vwx fb:people.person.education ?y . ?y fb:education.education.institution ?x . }","paraphrases":[],"info":{}}
{"id":"train_294","question":"who plays lois lane in superman returns?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.044g_k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.044g_k fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.04pzy . }","paraphrases":[],"info":{}}
{"id":"train_296","question":"who is the voice of stewie griffin from family guy?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.019nnl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.019nnl fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.02m29p . ?y fb:tv.regular_tv_appearance.special_performance_type fb:m.02nsjvf . FILTER ( NOT EXISTS { ?y fb:tv.regular_tv_appearance.from ?sk0 } || EXISTS { ?y fb:tv.regular_tv_appearance.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:tv.regular_tv_appearance.to ?sk2 } || EXISTS { ?y fb:tv.regular_tv_appearance.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_297","question":"what films did charlie chaplin direct?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01lc5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01lc5 fb:film.director.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_298","question":"who does lea michele dating in real life?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02qw2xb ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02qw2xb fb:celebrities.celebrity.sexual_relationships ?y . ?y fb:celebrities.romantic_relationship.celebrity ?x . ?y fb:celebrities.romantic_relationship.relationship_type fb:m.02_7k44 . FILTER ( NOT EXISTS { ?y fb:celebrities.romantic_relationship.start_date ?sk0 } || EXISTS { ?y fb:celebrities.romantic_relationship.start_date ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:celebrities.romantic_relationship.end_date ?sk2 } || EXISTS { ?y fb:celebrities.romantic_relationship.end_date ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_301","question":"what should you see in london?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04jpl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04jpl fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_303","question":"what subatomic particles did jj thomson discover?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0j68z ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0j68z fb:base.nobelprizes.nobel_prize_winner.nobel_honor ?y . ?y fb:base.nobelprizes.nobel_honor.subject_area ?x . ?x fb:common.topic.notable_types fb:m.08scbsj . }","paraphrases":[],"info":{}}
{"id":"train_304","question":"what films have taylor lautner been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07ldhs ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07ldhs fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_305","question":"who were anakin skywalker's parents?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f2y0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f2y0 fb:fictional_universe.fictional_character.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_308","question":"what exactly did dale earnhardt die from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.026fx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.026fx fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_309","question":"what year did miami heat win the championship?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jm2v ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jm2v fb:sports.sports_team.championships ?x . }","paraphrases":[],"info":{}}
{"id":"train_310","question":"what kind of government did benito mussolini have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0177g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0177g fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_311","question":"who was emperor diocletian?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02d0k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02d0k fb:user.robert.roman_empire.roman_emperor.title ?x . }","paraphrases":[],"info":{}}
{"id":"train_312","question":"who is chelsea kane?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02vydtw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02vydtw fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_313","question":"who is darwin and what is his theory?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01lwx ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01lwx fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_314","question":"what did obama study in school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02mjmr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02mjmr fb:people.person.education ?y . ?y fb:education.education.major_field_of_study ?x . }","paraphrases":[],"info":{}}
{"id":"train_315","question":"where did deion sanders play baseball?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03n69x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03n69x fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . ?x fb:sports.sports_team.sport fb:m.018jz . }","paraphrases":[],"info":{}}
{"id":"train_317","question":"what continent is south africa part of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hzlz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hzlz fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
{"id":"train_319","question":"what did kate winslet get an oscar for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.0dvld fb:award.award_winner.awards_won ?y . ?y fb:award.award_honor.honored_for ?x . ?y fb:award.award_honor.award ?awd . ?awd fb:award.award_category.category_of fb:m.0g_w . }","paraphrases":[],"info":{}}
{"id":"train_320","question":"what company did henry ford work for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gxm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gxm fb:people.person.employment_history ?y . ?y fb:business.employment_tenure.company ?x . }","paraphrases":[],"info":{}}
{"id":"train_321","question":"where indian ocean is located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rz4 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rz4 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_322","question":"who was mary's mother?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04n7gc6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04n7gc6 fb:people.person.parents ?x . ?x fb:people.person.gender fb:m.02zsn . }","paraphrases":[],"info":{}}
{"id":"train_323","question":"where is american express located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01w6dw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01w6dw fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_324","question":"what is the china money called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d05w3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d05w3 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_326","question":"where is the howard university located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0217m9 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0217m9 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_329","question":"what do catholics call their god?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c8wxp ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c8wxp fb:religion.religion.deities ?x . }","paraphrases":[],"info":{}}
{"id":"train_330","question":"what is the capital of alaska state?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hjy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hjy fb:base.aareas.schema.administrative_area.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_333","question":"what college did jeff corwin go to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03xsv3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03xsv3 fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hnl . }","paraphrases":[],"info":{}}
{"id":"train_334","question":"who speaks farsi?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.032f6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.032f6 fb:language.human_language.countries_spoken_in ?x . }","paraphrases":[],"info":{}}
{"id":"train_335","question":"who was neptune discovered by?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0c31h ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0c31h fb:astronomy.astronomical_discovery.discoverer ?x . }","paraphrases":[],"info":{}}
{"id":"train_336","question":"who were the major trade partners of russia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06bnz ) { fb:m.06bnz fb:location.statistical_region.places_exported_to ?y . ?y fb:location.imports_and_exports.exported_to ?x . } UNION { fb:m.06bnz fb:location.statistical_region.places_imported_from ?y . ?y fb:location.imports_and_exports.imported_from ?x . } }","paraphrases":[],"info":{}}
{"id":"train_337","question":"what did corey haim really die of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01kyn0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01kyn0 fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_338","question":"where did pavlova originate?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hp3n ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hp3n fb:food.dish.cuisine ?x . }","paraphrases":[],"info":{}}
{"id":"train_339","question":"where did nathaniel hawthorne die?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05gpy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05gpy fb:people.deceased_person.place_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_344","question":"who influenced wolfgang amadeus mozart?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.082db ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.082db fb:influence.influence_node.influenced_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_346","question":"what language do they speak in iceland wikipedia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03rj0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03rj0 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_350","question":"what is the political system in south africa?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0hzlz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0hzlz fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_351","question":"where did joe montana go to high school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01r6hc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01r6hc fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hn6 . }","paraphrases":[],"info":{}}
{"id":"train_355","question":"what countries speak english primarily?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { ?x fb:location.country.official_language fb:m.02h40lc . ?x fb:common.topic.notable_types fb:m.01mp . }","paraphrases":[],"info":{}}
{"id":"train_356","question":"what states does the missouri river touch?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04ykz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04ykz fb:location.location.partially_containedby ?x . ?x fb:base.biblioness.bibs_location.loc_type ?sk0 . FILTER ( str ( ?sk0 ) = \"State\" ) }","paraphrases":[],"info":{}}
{"id":"train_357","question":"what is in liverpool england?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04lh6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04lh6 fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_358","question":"what state is harvard college located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01mpwj ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01mpwj fb:location.location.containedby ?x . ?x fb:common.topic.notable_types fb:m.0kpys4 . }","paraphrases":[],"info":{}}
{"id":"train_363","question":"what money do japanese use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03_3d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03_3d fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_364","question":"what is the time zone in oklahoma city?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0fvzg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0fvzg fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_365","question":"what killed whitney houston?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.086qd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.086qd fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_366","question":"what kind of government did the mali empire have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04v09 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04v09 fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_367","question":"what is the religion of israel people?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03spz ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03spz fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_369","question":"what airport is closest to sandals grande in st lucia?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06s0l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06s0l fb:location.location.nearby_airports ?x . }","paraphrases":[],"info":{}}
{"id":"train_370","question":"which country is north of the usa?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { fb:m.09c7w0 fb:location.location.adjoin_s ?y . ?y fb:location.adjoining_relationship.adjoins ?x . fb:m.09c7w0 fb:location.location.geolocation ?g . ?g fb:location.geocode.latitude ?l . ?x fb:location.location.geolocation ?gx . ?gx fb:location.geocode.latitude ?xl . Filter ( xsd:float ( ?xl ) > xsd:float ( ?l ) ) . }","paraphrases":[],"info":{}}
{"id":"train_371","question":"where does drew gordon play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gyrdqn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gyrdqn fb:sports.pro_athlete.teams ?y . ?y fb:sports.sports_team_roster.team ?x . ?y fb:sports.sports_team_roster.from ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_373","question":"what language does people in netherlands speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059j2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059j2 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
