{"id":"train_2424","question":"who created the character of sherlock holmes?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06rkl ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06rkl fb:fictional_universe.fictional_character.character_created_by ?x . }","paraphrases":[],"info":{}}
{"id":"train_2425","question":"what does scottish people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06q1r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06q1r fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2426","question":"who all has kim kardashian dated?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0261x8t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0261x8t fb:base.popstra.celebrity.dated ?y . ?y fb:base.popstra.dated.participant ?x . }","paraphrases":[],"info":{}}
{"id":"train_2429","question":"what book did john steinbeck wrote about the people in the dust bowl?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.04107 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.04107 fb:book.author.works_written ?x . ?x fb:common.topic.notable_types fb:m.01xryvm . ?x fb:book.written_work.subjects fb:m.0g89m . }","paraphrases":[],"info":{}}
{"id":"train_2433","question":"what type of government does the nigeria have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05cgv ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05cgv fb:location.country.form_of_government ?x . }","paraphrases":[],"info":{}}
{"id":"train_2434","question":"where is usc from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03tw2s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03tw2s fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2435","question":"where is usc from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.065y4w7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.065y4w7 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2436","question":"where is usc from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.065y4w7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.065y4w7 fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_2437","question":"where is usc from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.065y4w7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.065y4w7 fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.state_province_region ?x . }","paraphrases":[],"info":{}}
{"id":"train_2438","question":"what country was william shakespeare born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.081k8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.081k8 fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2439","question":"where great britain on the world map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.034cm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.034cm fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2442","question":"what is president abraham lincoln known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2443","question":"who does jemaine clement play in despicable me?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bg539 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bg539 fb:film.actor.film ?y . ?y fb:film.performance.character ?x . ?y fb:film.performance.film fb:m.06zkfsy . }","paraphrases":[],"info":{}}
{"id":"train_2446","question":"where do the broncos play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0289q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0289q fb:sports.sports_team.arena_stadium ?x . ?x fb:architecture.structure.opened ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2447","question":"who inspired antonio vivaldi?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0pth ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0pth fb:influence.influence_node.influenced ?x . }","paraphrases":[],"info":{}}
{"id":"train_2448","question":"what type of currency is used in puerto rico?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05r7t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05r7t fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2449","question":"what is jackie kennedy famous for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0h6mq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0h6mq fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.basic_title ?x . }","paraphrases":[],"info":{}}
{"id":"train_2450","question":"what currency is used in france before euro?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0f8l9c ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0f8l9c fb:location.country.currency_formerly_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2451","question":"who started up mcdonalds?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07gyp7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07gyp7 fb:organization.organization.founders ?x . }","paraphrases":[],"info":{}}
{"id":"train_2452","question":"what major landforms are located in egypt?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.02k54 fb:location.location.contains ?y . ?y fb:geography.geographical_feature.category ?x . }","paraphrases":[],"info":{}}
{"id":"train_2453","question":"who played nba finals 2010?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { { fb:m.0bx_x85 fb:sports.sports_championship_event.champion ?x . } UNION { fb:m.0bx_x85 fb:sports.sports_championship_event.runner_up ?x . } }","paraphrases":[],"info":{}}
{"id":"train_2454","question":"what state was ronald reagan governor of?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c0j ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c0j fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.jurisdiction_of_office ?x . ?y fb:government.government_position_held.basic_title fb:m.0fkvn . }","paraphrases":[],"info":{}}
{"id":"train_2455","question":"what is the most practiced religion in the united states?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09c7w0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09c7w0 fb:location.statistical_region.religions ?y . ?y fb:location.religion_percentage.religion ?x . ?y fb:location.religion_percentage.percentage ?sk0 . } ORDER BY DESC ( xsd:float ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2458","question":"who has britney spears married?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.015f7 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.015f7 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2459","question":"what currency is used in hungary?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gj2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gj2 fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2460","question":"what currency do they use in qatar?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0697s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0697s fb:location.country.currency_used ?x . }","paraphrases":[],"info":{}}
{"id":"train_2461","question":"what are fun things to do in denver colorado?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02cl1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02cl1 fb:travel.travel_destination.tourist_attractions ?x . }","paraphrases":[],"info":{}}
{"id":"train_2462","question":"what did thoreau die from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0bwx3 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0bwx3 fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2464","question":"what war was woodrow wilson president for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { { SELECT ?pfrom ?pto WHERE { fb:m.083q7 fb:government.politician.government_positions_held ?y0 . ?y0 fb:government.government_position_held.basic_title fb:m.060c4 ; fb:government.government_position_held.from ?pfrom ; fb:government.government_position_held.to ?pto . } } { SELECT ?from ?to ?x WHERE { ?x fb:common.topic.notable_types fb:m.02h76fz . ?x fb:time.event.start_date ?from . ?x fb:time.event.end_date ?to . ?x fb:military.military_conflict.combatants ?y . ?y fb:military.military_combatant_group.combatants fb:m.09c7w0 . } } FILTER ( ?to <= ?pto && ?from >= ?pfrom ) }","paraphrases":[],"info":{}}
{"id":"train_2465","question":"who is carl edwards racing for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.059s1q ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.059s1q fb:base.nascar.nascar_driver.team ?x . }","paraphrases":[],"info":{}}
{"id":"train_2466","question":"where are the florida marlins from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02__x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02__x fb:sports.sports_team.location ?x . }","paraphrases":[],"info":{}}
{"id":"train_2467","question":"what is the main religion in eastern europe?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { fb:m.09b69 fb:location.location.contains ?y1 . ?y1 fb:common.topic.notable_types fb:m.01mp . ?y1 fb:location.statistical_region.religions ?y2 . ?y2 fb:location.religion_percentage.religion ?x . }","paraphrases":[],"info":{}}
{"id":"train_2468","question":"what language does romanian people speak?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.06c1y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.06c1y fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2470","question":"what date was john adams elected president?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?dt WHERE { ?e fb:government.election.winner fb:m.03_js ; fb:government.election.office fb:m.060d2 ; fb:government.election.election_year ?dt . }","paraphrases":[],"info":{}}
{"id":"train_2472","question":"which party was lincoln?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gzh ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gzh fb:government.politician.party ?y . ?y fb:government.political_party_tenure.party ?x . }","paraphrases":[],"info":{}}
{"id":"train_2473","question":"who are the two current illinois senators?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03v0t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03v0t fb:government.political_district.representatives ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.governmental_body fb:m.07t58 . FILTER ( NOT EXISTS { ?y fb:government.government_position_held.from ?sk0 } || EXISTS { ?y fb:government.government_position_held.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:government.government_position_held.to ?sk2 } || EXISTS { ?y fb:government.government_position_held.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2474","question":"what did robin gibb died from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0137hn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0137hn fb:people.deceased_person.cause_of_death ?x . }","paraphrases":[],"info":{}}
{"id":"train_2475","question":"what were adolf hitler's parents names?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07_m9_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07_m9_ fb:people.person.parents ?x . }","paraphrases":[],"info":{}}
{"id":"train_2476","question":"what did jordyn wieber win gold for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05nzn7y ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05nzn7y fb:olympics.olympic_athlete.medals_won ?y . ?y fb:olympics.olympic_medal_honor.event ?x . ?y fb:olympics.olympic_medal_honor.medal fb:m.02lpp7 . }","paraphrases":[],"info":{}}
{"id":"train_2477","question":"what job does bill rancic have?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02skv6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02skv6 fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2479","question":"what does michael jackson like to eat?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:food.diet_follower.follows_diet ?x . }","paraphrases":[],"info":{}}
{"id":"train_2482","question":"what airport fly into for maui?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jbs5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jbs5 fb:location.location.contains ?x . ?x fb:common.topic.notable_types fb:m.01xpjyz . }","paraphrases":[],"info":{}}
{"id":"train_2483","question":"what has lucy hale played in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0754d6 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0754d6 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2485","question":"who is the falcons kicker?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0wsr ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0wsr fb:sports.sports_team.roster ?y . ?y fb:sports.sports_team_roster.player ?x . ?y fb:sports.sports_team_roster.position fb:m.047g8h . FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.from ?sk0 } || EXISTS { ?y fb:sports.sports_team_roster.from ?sk1 . FILTER ( xsd:datetime ( ?sk1 ) <= \"2015-08-10\" ^^ xsd:dateTime ) } ) FILTER ( NOT EXISTS { ?y fb:sports.sports_team_roster.to ?sk2 } || EXISTS { ?y fb:sports.sports_team_roster.to ?sk3 . FILTER ( xsd:datetime ( ?sk3 ) >= \"2015-08-10\" ^^ xsd:dateTime ) } ) }","paraphrases":[],"info":{}}
{"id":"train_2486","question":"where did charles drew go to high school?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.018t67 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.018t67 fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:common.topic.notable_types fb:m.01y2hn6 . }","paraphrases":[],"info":{}}
{"id":"train_2489","question":"who won governor race in indiana?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03v1s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03v1s fb:government.governmental_jurisdiction.governing_officials ?y . ?y fb:government.government_position_held.office_holder ?x . ?y fb:government.government_position_held.basic_title fb:m.0fkvn . }","paraphrases":[],"info":{}}
{"id":"train_2490","question":"what languages do people speak in egypt?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02k54 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02k54 fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2491","question":"what college did florence griffith joyner attend?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0jkxq ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0jkxq fb:people.person.education ?y . ?y fb:education.education.institution ?x . ?x fb:kg.object_profile.prominent_type fb:education.university . }","paraphrases":[],"info":{}}
{"id":"train_2492","question":"what style of art did henri matisse use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0gct_ ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0gct_ fb:visual_art.visual_artist.associated_periods_or_movements ?x . }","paraphrases":[],"info":{}}
{"id":"train_2493","question":"who plays alan parrish in jumanji?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09w353 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09w353 fb:film.film.starring ?y . ?y fb:film.performance.actor ?x . ?y fb:film.performance.character fb:m.0d3n58 . }","paraphrases":[],"info":{}}
{"id":"train_2494","question":"who was reese witherspoon married too?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0n6f8 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0n6f8 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?x fb:people.person.gender fb:m.05zppz . ?y fb:people.marriage.to ?sk0 . } ORDER BY DESC ( xsd:datetime ( ?sk0 ) ) LIMIT 1","paraphrases":[],"info":{}}
{"id":"train_2496","question":"what is the dominican republic's capital?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.027rn ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.027rn fb:location.country.capital ?x . }","paraphrases":[],"info":{}}
{"id":"train_2497","question":"what is illinois state flower called?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03v0t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03v0t fb:government.governmental_jurisdiction.official_symbols ?y . ?y fb:location.location_symbol_relationship.symbol ?x . ?y fb:location.location_symbol_relationship.Kind_of_symbol fb:m.04627gn . }","paraphrases":[],"info":{}}
{"id":"train_2498","question":"what language do they speak thailand?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07f1x ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07f1x fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2501","question":"what is the san francisco giants mascot?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0713r ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0713r fb:sports.sports_team.team_mascot ?x . }","paraphrases":[],"info":{}}
{"id":"train_2502","question":"where was tupac born?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07pzc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07pzc fb:people.person.place_of_birth ?x . }","paraphrases":[],"info":{}}
{"id":"train_2503","question":"where is the main headquarters of the un?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07t65 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07t65 fb:organization.organization.headquarters ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_2505","question":"what utc time zone is arizona?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0vmt ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0vmt fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2506","question":"who played as barney?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01f4yy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01f4yy fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.0j_84dv . }","paraphrases":[],"info":{}}
{"id":"train_2507","question":"who played elaine's boyfriend on seinfeld?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.01djc5 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.01djc5 fb:fictional_universe.fictional_character.romantically_involved_with ?y . ?y fb:fictional_universe.romantic_involvement.partner ?x . }","paraphrases":[],"info":{}}
{"id":"train_2508","question":"who did juan ponce de leon married?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0123f1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0123f1 fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2510","question":"what times is it in texas?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07b_l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07b_l fb:location.location.time_zones ?x . }","paraphrases":[],"info":{}}
{"id":"train_2511","question":"where did the arizona diamondbacks play?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0x0d ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0x0d fb:sports.sports_team.arena_stadium ?x . }","paraphrases":[],"info":{}}
{"id":"train_2512","question":"what did fred davis do?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02rhm_l ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02rhm_l fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2514","question":"where is the fukushima daiichi located?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02vkzy2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02vkzy2 fb:location.location.street_address ?y . ?y fb:location.mailing_address.citytown ?x . }","paraphrases":[],"info":{}}
{"id":"train_2515","question":"what country was bin laden from?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.05mg9 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.05mg9 fb:people.person.nationality ?x . }","paraphrases":[],"info":{}}
{"id":"train_2516","question":"who plays claudia joy on army wives?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0273sq1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0273sq1 fb:tv.tv_program.regular_cast ?y . ?y fb:tv.regular_tv_appearance.actor ?x . ?y fb:tv.regular_tv_appearance.character fb:m.06zry95 . }","paraphrases":[],"info":{}}
{"id":"train_2517","question":"where did darfur happen?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0d07gg ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0d07gg fb:time.event.locations ?x . }","paraphrases":[],"info":{}}
{"id":"train_2518","question":"what language does greece use?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.035qy ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.035qy fb:location.country.languages_spoken ?x . }","paraphrases":[],"info":{}}
{"id":"train_2522","question":"what movies has taylor momsen been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.067qp2 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.067qp2 fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2523","question":"what was henry ford best known for?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.03gxm ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.03gxm fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2524","question":"what kind of music did michael jackson sing?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.09889g ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.09889g fb:music.artist.genre ?x . }","paraphrases":[],"info":{}}
{"id":"train_2526","question":"what movies has chris colfer been in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07k51gd ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07k51gd fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2528","question":"what did roald dahl write?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0ff2k ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0ff2k fb:book.author.book_editions_published ?x . }","paraphrases":[],"info":{}}
{"id":"train_2532","question":"who was the real erin brockovich?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.02nxk ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.02nxk fb:people.person.profession ?x . }","paraphrases":[],"info":{}}
{"id":"train_2533","question":"what county is troy il in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0sch1 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0sch1 fb:location.hud_county_place.county ?x . }","paraphrases":[],"info":{}}
{"id":"train_2534","question":"what position does mitt romney hold?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0271_s ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0271_s fb:government.politician.government_positions_held ?y . ?y fb:government.government_position_held.office_position_or_title ?x . }","paraphrases":[],"info":{}}
{"id":"train_2535","question":"who is country singer jewel married to?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0152cw ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0152cw fb:people.person.spouse_s ?y . ?y fb:people.marriage.spouse ?x . ?y fb:people.marriage.type_of_union fb:m.04ztj . }","paraphrases":[],"info":{}}
{"id":"train_2536","question":"what movies does tupac act in?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.07pzc ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.07pzc fb:film.actor.film ?y . ?y fb:film.performance.film ?x . }","paraphrases":[],"info":{}}
{"id":"train_2537","question":"where does the appalachian trail run through?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0lyj0 ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0lyj0 fb:location.location.containedby ?x . }","paraphrases":[],"info":{}}
{"id":"train_2538","question":"where is burundi located on a map?","sparql":"PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x WHERE { FILTER ( ?x != fb:m.0169t ) FILTER ( ! isLiteral ( ?x ) || lang ( ?x ) = '' || langMatches ( lang ( ?x ) , 'en' ) ) fb:m.0169t fb:base.locations.countries.continent ?x . }","paraphrases":[],"info":{}}
