{"id":"train_1975","question":"List the name of the soccer clubs whose chairman is Joan Laporta.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:chairman dbr:Joan_Laporta . ?x dbp:name ?uri . ?x rdf:type dbo:SoccerClub }","paraphrases":[],"info":{}}
{"id":"train_2021","question":"Give me the number of home stadiums of teams managed by John Spencer.","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:manager <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x dbo:homeStadium ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2032","question":"List the Swedish newspaper headquarted in Stockholm? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:language dbr:Swedish_language . ?uri dbp:headquarters dbr:Stockholm . ?uri rdf:type dbo:Newspaper }","paraphrases":[],"info":{}}
{"id":"train_2052","question":"Count the number of judges who've come on CTV network shows.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:network dbr:CTV_Television_Network . ?x dbp:judges ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2084","question":"What writers have nationality as Statelessness?  ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:nationality dbr:Statelessness . ?uri rdf:type dbo:Writer }","paraphrases":[],"info":{}}
{"id":"train_2125","question":"List the television shows whose distributors are located at Burbank, California.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbp:locationCity <http://dbpedia.org/resource/Burbank,_California> . ?uri dbp:distributor ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_2221","question":"List the birthplace of the medicians who studied in Harvard.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:institution dbr:Harvard_Medical_School . ?x dbo:birthPlace ?uri . ?x rdf:type dbo:Medician }","paraphrases":[],"info":{}}
{"id":"train_2259","question":"What is the job of the George Arceneaux, Jr. which is also the office of the Blanche Bruce","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/George_Arceneaux,_Jr.> dbo:occupation ?uri . dbr:Blanche_Bruce dbp:office ?uri }","paraphrases":[],"info":{}}
{"id":"train_2294","question":"What has been founded in the state that Denton county, Texas is a part of? ","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:part <http://dbpedia.org/resource/Denton_County,_Texas> . ?uri dbo:foundationPlace ?x . }","paraphrases":[],"info":{}}
{"id":"train_2338","question":"Give me some shows related to the ones created by Russell Davies","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:creator dbr:Russell_T_Davies . ?uri dbo:related ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_2355","question":"List the first drivers of Grand Prixes where Mika Hakkinen was a pole driver.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:poleDriver <http://dbpedia.org/resource/Mika_Häkkinen> . ?x dbo:firstDriver ?uri . ?x rdf:type dbo:GrandPrix }","paraphrases":[],"info":{}}
{"id":"train_2356","question":"How many movies have their music signed up with Sony Music Entertainment.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:recordLabel dbr:Sony_Music_Entertainment . ?uri dbo:musicComposer ?x . ?uri rdf:type dbo:Film }","paraphrases":[],"info":{}}
{"id":"train_2394","question":"List the sports played in private universities.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:type dbr:Private_university . ?x dbo:sport ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2396","question":"Who is the performer of album which has the song \"To Where You Are\"?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:To_Where_You_Are dbo:album ?x . ?x dbo:artist ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2416","question":"List the awards won by the wife of Ingrid von Rosen.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Ingrid_von_Rosen dbp:spouse ?x . ?x dbp:awards ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2423","question":"Count the different genres of games published by Titus Software","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:publisher dbr:Titus_Software . ?x dbo:genre ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2445","question":"Which license of the Microsoft Office Picture Manager is also the  product of the Apple Productivity Experience Group ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Microsoft_Office_Picture_Manager dbo:license ?uri . dbr:Apple_Productivity_Experience_Group dbo:product ?uri }","paraphrases":[],"info":{}}
{"id":"train_2471","question":"Count the awards given to the recepients of the Becket fund for religious liberty.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:award dbr:Becket_Fund_for_Religious_Liberty . ?x dbp:awards ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2483","question":"What is the city  of the 2015 MLS All-Star Game and birthplace of the The Okee Dokee Brothers","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:2015_MLS_All-Star_Game dbp:city ?uri . dbr:The_Okee_Dokee_Brothers dbo:birthPlace ?uri }","paraphrases":[],"info":{}}
{"id":"train_2485","question":"Count all the places where companies located in Ontario operate.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:locationCity dbr:Ontario . ?x dbp:locations ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2508","question":"Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:almaMater dbr:National_and_Kapodistrian_University_of_Athens . ?x dbo:award ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2532","question":"?What are the airline hubs of Cascade Airways","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Cascade_Airways dbp:hubs ?uri }","paraphrases":[],"info":{}}
{"id":"train_2555","question":"List some writers which speak one of the Germanic languages.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:languageFamily dbr:Germanic_languages . ?uri dbp:language ?x . ?uri rdf:type dbo:Writer }","paraphrases":[],"info":{}}
{"id":"train_2578","question":"Count the different alma maters of people employed by the CNN","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:employer dbr:CNN . ?x dbo:almaMater ?uri . }","paraphrases":[],"info":{}}
{"id":"train_2667","question":"What shows used to air on the channel which was earlier known as \"The Comedy Central\"?","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:predecessor <http://dbpedia.org/resource/The_Comedy_Channel_(United_States)> . ?uri dbp:distributor ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_2674","question":"Name a famous relative of barry voight","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:relative dbr:Barry_Voight . }","paraphrases":[],"info":{}}
{"id":"train_2681","question":"List places that are associated to cities in the state of Mecklenburg-Vorpommern.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:federalState dbr:Mecklenburg-Vorpommern . ?uri dbp:cities ?x . }","paraphrases":[],"info":{}}
{"id":"train_2705","question":"List some people who were opponents of someone who was died by hanging? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:deathCause dbr:Hanging . ?x dbo:opponent ?uri . ?x rdf:type dbo:Person }","paraphrases":[],"info":{}}
{"id":"train_2716","question":"List the mascot of the universities which are a part of  National Collegiate Athletic Association.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:athletics dbr:National_Collegiate_Athletic_Association . ?x dbp:mascot ?uri . ?x rdf:type dbo:University }","paraphrases":[],"info":{}}
{"id":"train_2730","question":"Which television show is based in Massachusetts and has opening theme as \"Where Everybody Knows Your Name\"?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:openingTheme dbr:Where_Everybody_Knows_Your_Name . ?uri dbo:location dbr:Massachusetts . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_2920","question":"Name some books by Spanish speaking authors.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbp:language dbr:Spanish_language . ?uri dbp:author ?x . }","paraphrases":[],"info":{}}
{"id":"train_2926","question":"What shows are aired on sister channels of BBC Parliaments","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:sisterNames dbr:BBC_Parliament . ?uri dbo:network ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_2935","question":"To which company is the service \"Nintendo eShop\" associated with?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:services dbr:Nintendo_eShop . ?uri rdf:type dbo:Company }","paraphrases":[],"info":{}}
{"id":"train_2937","question":"List the movies whose music composer is often associated with Jon and Vangelis.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:associatedActs dbr:Jon_and_Vangelis . ?uri dbo:musicComposer ?x . ?uri rdf:type dbo:Film }","paraphrases":[],"info":{}}
{"id":"train_2945","question":"Name some shows similar to the one whose theme song is made by Murray Gold.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:themeMusicComposer dbr:Murray_Gold . ?uri dbo:related ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_2957","question":"Give me the characters who last appeared in Star Wars Episode 3","sparql":"PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:last <http://dbpedia.org/resource/Star_Wars:_Episode_III_–_Revenge_of_the_Sith> }","paraphrases":[],"info":{}}
{"id":"train_2979","question":"Which river goes through cohoes, NY","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> dbo:river ?uri }","paraphrases":[],"info":{}}
{"id":"train_2993","question":"Name some dishes made with flowering plants.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:division dbr:Flowering_plant . ?uri dbo:ingredient ?x . ?uri rdf:type dbo:Food }","paraphrases":[],"info":{}}
{"id":"train_3016","question":"Did Steve Sampson manage a club of Santa Clara university","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { dbr:Steve_Sampson dbo:managerClub dbr:Santa_Clara_University }","paraphrases":[],"info":{}}
{"id":"train_3023","question":"How many sitcoms were produced by the company whose predecessor was the Desilu Productions","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:predecessor dbr:Desilu_Productions . ?uri dbp:company ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_3051","question":"What is the official residence of the Christopher Daz Figuero which is also the  state of the Cruce a Nado Internacional","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Christopher_Díaz_Figueroa> dbp:residence ?uri . dbr:Cruce_a_Nado_Internacional dbo:country ?uri }","paraphrases":[],"info":{}}
{"id":"train_3076","question":"What is the citizenship of the Sarah Kazemy and land of the Cervelle de canut","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Sarah_Kazemy dbo:citizenship ?uri . dbr:Cervelle_de_canut dbo:country ?uri }","paraphrases":[],"info":{}}
{"id":"train_3077","question":"Movie's produced by Michael Deeley has Jordan Cronenweth as director of photography","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:producer dbr:Michael_Deeley . ?uri dbo:cinematography dbr:Jordan_Cronenweth . ?uri rdf:type dbo:Film }","paraphrases":[],"info":{}}
{"id":"train_3085","question":"Give me all martial artists trained by Joe Schilling.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:trainer dbr:Joe_Schilling . ?uri rdf:type dbo:MartialArtist }","paraphrases":[],"info":{}}
{"id":"train_3101","question":"Count the different causes of death of Christians.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:religion dbr:Christianity . ?x dbo:deathCause ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3121","question":"List the academic discipline of the journals whose publisher is SAGE Publications.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:publisher dbr:SAGE_Publications . ?x dbo:academicDiscipline ?uri . ?x rdf:type dbo:AcademicJournal }","paraphrases":[],"info":{}}
{"id":"train_3129","question":"List the alma mater of the person who is wedded to Sissela Bok.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:spouse dbr:Sissela_Bok . ?x dbp:almaMater ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3148","question":"Mazhar Ul Haq High School, Beerwah is affiliated to Islamic Religion","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> dbp:religiousAffiliation dbr:Islam }","paraphrases":[],"info":{}}
{"id":"train_3152","question":"List all the tenants of the stadium where the WWF Summer Slam 2004 took place.","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> dbp:venue ?x . ?x dbo:tenant ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3203","question":"Count  the journals in the field of Philosophy.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbp:discipline dbr:Philosophy . ?uri rdf:type dbo:AcademicJournal }","paraphrases":[],"info":{}}
{"id":"train_3217","question":"Count the different origins of members of the Vitis Vinifera species.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:species dbr:Vitis_vinifera . ?x dbo:origin ?uri . ?uri rdf:type dbo:Place }","paraphrases":[],"info":{}}
{"id":"train_3243","question":"List the movies whose editors are born in London.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:placeOfBirth dbr:London . ?uri dbo:editing ?x . ?uri rdf:type dbo:Film }","paraphrases":[],"info":{}}
{"id":"train_3312","question":"What is the municipality of the Brown's Corners, Toronto and also the  place of birth of the George Karrys","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brown's_Corners,_Toronto> dbo:municipality ?uri . dbr:George_Karrys dbp:placeOfBirth ?uri }","paraphrases":[],"info":{}}
{"id":"train_3360","question":"List the resting place of the people who served in Norwalk Trainband.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:militaryUnit dbr:Norwalk_Trainband . ?x dbp:restingplace ?uri . ?x rdf:type dbo:Person }","paraphrases":[],"info":{}}
{"id":"train_3381","question":"List the birth city of the politicians of Democratic Party.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> . ?x dbo:birthPlace ?uri . ?x rdf:type dbo:Politician }","paraphrases":[],"info":{}}
{"id":"train_3390","question":"What is the place of birth of the Michael Marder which is also the  place of death of the Tigran Petrosian","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Michael_Marder dbp:placeOfBirth ?uri . dbr:Tigran_Petrosian dbo:deathPlace ?uri }","paraphrases":[],"info":{}}
{"id":"train_3391","question":"Who is married to Tony Ramo","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:partner dbr:Tony_Romo . }","paraphrases":[],"info":{}}
{"id":"train_3423","question":"WHich region of the Providence Chapel, Charlwood is also the region of the Joseph Case High School","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Providence_Chapel,_Charlwood> dbp:style ?uri . dbr:Joseph_Case_High_School dbo:region ?uri }","paraphrases":[],"info":{}}
{"id":"train_3425","question":"What basketball league's champion is Golden State Warriors","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:champion dbr:Golden_State_Warriors . ?uri rdf:type dbo:BasketballLeague }","paraphrases":[],"info":{}}
{"id":"train_3426","question":"Name some people working at someplace owned by News Corp.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbp:owners dbr:News_Corp . ?uri dbo:employer ?x . }","paraphrases":[],"info":{}}
{"id":"train_3470","question":"What is the national origin of Dornier Aerodyne and Hirth Acrostar?;","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Dornier_Aerodyne dbp:nationalOrigin ?uri . dbr:Hirth_Acrostar dbo:origin ?uri }","paraphrases":[],"info":{}}
{"id":"train_3472","question":"Count the tenants of the stadiums owned by toronto.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:owner dbr:Toronto . ?x dbp:tenants ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3484","question":"List the series of the books whose author is K. W. Jeter.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:author dbr:K._W._Jeter . ?x dbo:series ?uri . ?x rdf:type dbo:Book }","paraphrases":[],"info":{}}
{"id":"train_3507","question":"Count the number of religions followed by Janta Dal members.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:party dbr:Janata_Dal . ?x dbo:religion ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3559","question":"Who are the people who died in a place architected by Jens Jensen","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:architect <http://dbpedia.org/resource/Jens_Jensen_(landscape_architect)> . ?uri dbo:deathPlace ?x . ?uri rdf:type dbo:Person }","paraphrases":[],"info":{}}
{"id":"train_3564","question":"Who did Bruce Bochy play for? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Bruce_Bochy dbo:team ?uri }","paraphrases":[],"info":{}}
{"id":"train_3630","question":"List the newspapers whose headquarters's time zone is Central European Summer Time.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:timeZone dbr:Central_European_Summer_Time . ?uri dbp:headquarters ?x . ?uri rdf:type dbo:Newspaper }","paraphrases":[],"info":{}}
{"id":"train_3636","question":"what are some journals of academic Philosophy","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:discipline dbr:Philosophy }","paraphrases":[],"info":{}}
{"id":"train_3656","question":"List the leaders of the government agencies whose jurisdiction was German-occupied Europe.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:jurisdiction dbr:German-occupied_Europe . ?x dbo:leader ?uri . ?x rdf:type dbo:GovernmentAgency }","paraphrases":[],"info":{}}
{"id":"train_3657","question":"List the cast member of the movies whose producer is Mark Johnson.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:producer <http://dbpedia.org/resource/Mark_Johnson_(producer)> . ?x dbo:starring ?uri . ?x rdf:type dbo:Film }","paraphrases":[],"info":{}}
{"id":"train_3664","question":"What is the common award won by Charles LeMaire and Eric Roth","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Charles_LeMaire dbp:awards ?uri . dbr:Eric_Roth dbo:award ?uri }","paraphrases":[],"info":{}}
{"id":"train_3673","question":"For which team did both Butch Metzger and Brian Horwitz debuted? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Butch_Metzger dbo:debutTeam ?uri . dbr:Brian_Horwitz dbo:debutTeam ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3689","question":"Which  siler medalist of the Tennis at the 2012 Summer Olympics  Men's singles was also the  flagbearer of the Switzerland at the 2008 Summer Olympics","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tennis_at_the_2012_Summer_Olympics_–_Men's_singles> dbo:silverMedalist ?uri . dbr:Switzerland_at_the_2008_Summer_Olympics dbp:flagbearer ?uri }","paraphrases":[],"info":{}}
{"id":"train_3698","question":"Who coached the marquet golden eagels during 2013","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2013–14_Marquette_Golden_Eagles_men's_basketball_team> dbo:coach ?uri }","paraphrases":[],"info":{}}
{"id":"train_3699","question":"Give me a list of computers whose CPU is in the US.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:locationCity dbr:United_States . ?uri dbo:cpu ?x . ?uri rdf:type dbo:InformationAppliance }","paraphrases":[],"info":{}}
{"id":"train_3712","question":"Whci co founder of Sea gayle Music is also the artist of Brad Paisley Discography /","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Brad_Paisley_discography dbp:artist ?uri . dbr:Sea_Gayle_Music dbp:founder ?uri }","paraphrases":[],"info":{}}
{"id":"train_3733","question":"Count all the shows whose music composers are in Oysterhead.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:associatedMusicalArtist dbr:Oysterhead . ?uri dbp:themeMusicComposer ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_3764","question":"What are some products manufactured by Sony? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:manufacturer dbr:Sony . }","paraphrases":[],"info":{}}
{"id":"train_3807","question":"With which musical artist is the music group which sung Mind Blowin' related to?  ","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)> dbo:musicalArtist ?x . ?x dbo:associatedMusicalArtist ?uri . }","paraphrases":[],"info":{}}
{"id":"train_3826","question":"What newspapers's owners is Schibsted","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:owners dbr:Schibsted . ?uri rdf:type dbo:Newspaper }","paraphrases":[],"info":{}}
{"id":"train_3860","question":"List the television shows whose network's executive officer is Steve Burke.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:keyPerson <http://dbpedia.org/resource/Steve_Burke_(businessman)> . ?uri dbo:network ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_3882","question":"What fictional character's species is American Pekin duck","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:species dbr:American_Pekin_duck }","paraphrases":[],"info":{}}
