{"id":"train_32","question":"Which famous political figure appointed william cushing, and also founded Pittsburgh>","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Pittsburgh dbo:founder ?uri . dbr:William_Cushing dbo:appointer ?uri }","paraphrases":[],"info":{}}
{"id":"train_42","question":"Who is the common manager of Aston Villa 2000-02 season and aldo the manager of Middlesbrough F.C. season 2009-10","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2000–01_Aston_Villa_F.C._season> dbp:name ?uri . <http://dbpedia.org/resource/2009–10_Middlesbrough_F.C._season> dbo:manager ?uri }","paraphrases":[],"info":{}}
{"id":"train_65","question":"Count all those whose youth club was managed by Luis Enrique.","sparql":"PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:manager <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri dbp:youthclubs ?x . }","paraphrases":[],"info":{}}
{"id":"train_166","question":"Is Microsoft office written in C++","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> ASK WHERE { dbr:Microsoft_Office dbp:programmingLanguage <http://dbpedia.org/resource/C++> }","paraphrases":[],"info":{}}
{"id":"train_183","question":"Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:commander <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x dbo:commander ?uri }","paraphrases":[],"info":{}}
{"id":"train_188","question":"Which college of Luke List (golfer) is the alma mater of K. Terry Dornbush","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Luke_List_(golfer)> dbp:college ?uri . dbr:K._Terry_Dornbush dbp:almaMater ?uri }","paraphrases":[],"info":{}}
{"id":"train_216","question":"Which company's division is Audi India? Correct Question","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:divisions dbr:Audi_India }","paraphrases":[],"info":{}}
{"id":"train_239","question":"List the common sports between Fr. Agnel Multipurpose School  and Jamiatu Muslim Mindanao","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Fr._Agnel_Multipurpose_School_and_Junior_College dbo:sport ?uri . dbr:Jamiatu_Muslim_Mindanao dbo:athletics ?uri }","paraphrases":[],"info":{}}
{"id":"train_255","question":"Count all the things licensed as Software as a service.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbo:license dbr:Software_as_a_service . }","paraphrases":[],"info":{}}
{"id":"train_261","question":"Count the drinks originated in England.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbo:origin dbr:England . ?uri rdf:type dbo:Beverage }","paraphrases":[],"info":{}}
{"id":"train_265","question":"Give me some softwares which run on mac os","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:operatingSystem dbr:Mac_OS . ?uri rdf:type dbo:Software }","paraphrases":[],"info":{}}
{"id":"train_286","question":"List the shows whose network is run by BBC.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:owningCompany dbr:BBC . ?uri dbo:network ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_335","question":"Does Walt Disney Studio have a subsidiary called PixarCascadia_","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> dbo:subsidiary dbr:Pixar }","paraphrases":[],"info":{}}
{"id":"train_342","question":"List the awards given to the race horses bred by Willis Sharpe Kilmer.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:breeder dbr:Willis_Sharpe_Kilmer . ?x dbo:honours ?uri . ?x rdf:type dbo:RaceHorse }","paraphrases":[],"info":{}}
{"id":"train_345","question":"List the religions of the commanders of Royal Thai Army.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Royal_Thai_Army dbp:notableCommanders ?x . ?x dbo:religion ?uri . }","paraphrases":[],"info":{}}
{"id":"train_389","question":"Give me a count of everything made by the company which offers electronical manufacturing too.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:service dbr:Electronics_manufacturing_services . ?uri dbo:manufacturer ?x . }","paraphrases":[],"info":{}}
{"id":"train_402","question":"List the origin of the weapons which were used in the American Revolutionary War.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:usedInWar dbr:American_Revolutionary_War . ?x dbp:origin ?uri . ?x rdf:type dbo:Weapon }","paraphrases":[],"info":{}}
{"id":"train_424","question":"Name everyone working for a company owned by Roman Abramovich.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:owningCompany dbr:Roman_Abramovich . ?uri dbo:occupation ?x . }","paraphrases":[],"info":{}}
{"id":"train_452","question":"How many bacterias have taxonomy as Bacillales and domain as Bacteria? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbo:order dbr:Bacillales . ?uri dbp:domain dbr:Bacteria }","paraphrases":[],"info":{}}
{"id":"train_458","question":"List few authors whose education took place in Saint Petersburg?   ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:education dbr:Saint_Petersburg . ?uri rdf:type dbo:Writer }","paraphrases":[],"info":{}}
{"id":"train_472","question":"Name the president served by a lieutenant who succeeded Bob C Riley.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:predecessor dbr:Bob_C._Riley . ?uri dbo:lieutenant ?x . ?uri rdf:type dbo:President }","paraphrases":[],"info":{}}
{"id":"train_494","question":"Whose doctoral student is etienne bieler\\xc9tienne_Bi\\xe9ler","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:doctoralStudent <http://dbpedia.org/resource/Étienne_Biéler> }","paraphrases":[],"info":{}}
{"id":"train_556","question":"Name the ones who debuted in the San Francisco 49ers.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:debutTeam dbr:San_Francisco_49ers . }","paraphrases":[],"info":{}}
{"id":"train_594","question":"Name the part of Liverpool city region >","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Liverpool_City_Region dbo:part ?uri }","paraphrases":[],"info":{}}
{"id":"train_601","question":"Count the different religions followed by Second Lieutenants in military.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:militaryRank dbr:Second_lieutenant . ?x dbo:religion ?uri . }","paraphrases":[],"info":{}}
{"id":"train_605","question":"List the producer of the TV shows whose company is HBO.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:company dbr:HBO . ?x dbo:producer ?uri . ?x rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_631","question":"Whichd officer's final resting place is North Bend, ohio and belongs to Indiana Territory branch ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:restingplace <http://dbpedia.org/resource/North_Bend,_Ohio> . ?uri dbp:branch dbr:Indiana_Territory . }","paraphrases":[],"info":{}}
{"id":"train_639","question":"Is Eddie Bravo the trainer of Alan Jouban","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { dbr:Alan_Jouban dbo:trainer dbr:Eddie_Bravo }","paraphrases":[],"info":{}}
{"id":"train_647","question":"Count the birthplaces of recepients of the National Museum of Racing and Hall of Fame.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:honours dbr:National_Museum_of_Racing_and_Hall_of_Fame . ?x dbo:birthPlace ?uri . ?uri rdf:type dbo:Place }","paraphrases":[],"info":{}}
{"id":"train_667","question":"To which company is Michael Dell a father company? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:owningCompany dbr:Michael_Dell . ?uri rdf:type dbo:Company }","paraphrases":[],"info":{}}
{"id":"train_705","question":"List the people whose are in the board of an organization kickstarted in New York.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:foundation dbr:New_York . ?uri dbo:board ?x . ?uri rdf:type dbo:Person }","paraphrases":[],"info":{}}
{"id":"train_708","question":"name the home stadium of FC Spartak Moscow season 2011-12","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011–12_FC_Spartak_Moscow_season> dbo:homeStadium ?uri }","paraphrases":[],"info":{}}
{"id":"train_712","question":"Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.","sparql":"PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:ground <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri dbp:youthclubs ?x . }","paraphrases":[],"info":{}}
{"id":"train_728","question":"Count the different religions practiced by people who are in the Malaysian and Chinese association.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:party dbr:Malaysian_Chinese_Association . ?x dbo:religion ?uri . }","paraphrases":[],"info":{}}
{"id":"train_729","question":"List all those whose relatives' nationality is United States.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbp:nationality dbr:United_States . ?uri dbo:relative ?x . }","paraphrases":[],"info":{}}
{"id":"train_761","question":"List the books whose authors are in Alcal de Henares.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:birthPlace <http://dbpedia.org/resource/Alcalá_de_Henares> . ?uri dbo:author ?x . ?uri rdf:type dbo:Book }","paraphrases":[],"info":{}}
{"id":"train_804","question":"Count the  origin of the beverages which have been originated in england /","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:origin dbr:England . ?x dbp:origin ?uri }","paraphrases":[],"info":{}}
{"id":"train_840","question":"Count the religions followed by people living in British Columbia.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:residence dbr:British_Columbia . ?x dbp:religion ?uri . }","paraphrases":[],"info":{}}
{"id":"train_847","question":"For everyone who died in paris, count their different fields of work.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:deathPlace dbr:Paris . ?x dbp:fields ?uri . }","paraphrases":[],"info":{}}
{"id":"train_902","question":"Which country's national motto is \"Truth prevails\"?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:nationalMotto dbr:Truth_prevails . ?uri rdf:type dbo:Country }","paraphrases":[],"info":{}}
{"id":"train_948","question":"Name the members of youth clubs which have Camp Nou as their homeground.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbp:ground dbr:Camp_Nou . ?uri dbp:youthclubs ?x . }","paraphrases":[],"info":{}}
{"id":"train_981","question":"Count the number of actors in Lucy Sullivan Is Getting Married.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { dbr:Lucy_Sullivan_Is_Getting_Married dbp:starring ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1001","question":"Estimate the number of sports divisions at the universities under international association of universities.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:affiliation dbr:International_Association_of_Universities . ?x dbo:sport ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1053","question":"Name a few whose live in a place where Indian English is an official language","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?x dbo:officialLanguage dbr:Indian_English . ?uri dbo:residence ?x . }","paraphrases":[],"info":{}}
{"id":"train_1064","question":"Give me a count of everything under the archipelago, where Papeete is the biggest town.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:largestCity dbr:Papeete . ?uri dbp:archipelago ?x . }","paraphrases":[],"info":{}}
{"id":"train_1076","question":"Which university of Alexandre Tichonov is the place of death of Valentin Muratov /","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Alexandre_Tichonov dbp:university ?uri . dbr:Valentin_Muratov dbp:placeOfDeath ?uri }","paraphrases":[],"info":{}}
{"id":"train_1161","question":"Who all have been canonized by Pope Paul VI","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:canonizedBy dbr:Pope_Paul_VI }","paraphrases":[],"info":{}}
{"id":"train_1175","question":"List the base currency of the country whose anthem is Oj, svijetla majska zoro.","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:anthem <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x dbp:currency ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1230","question":"What is the death place of the Elbieta Czartoryska which is also place of birth of the Charles Journet","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elżbieta_Czartoryska_(1905–1989)> dbp:deathPlace ?uri . dbr:Charles_Journet dbo:birthPlace ?uri }","paraphrases":[],"info":{}}
{"id":"train_1258","question":"List the children of the parent of Marvin Bush.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Marvin_Bush dbo:parent ?x . ?x dbp:children ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1296","question":"Give me some series related to the one which had Yasmin Paige in them.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:starring dbr:Yasmin_Paige . ?uri dbo:related ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_1313","question":"List the shows whose company's successor is Amblin Television.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:successor dbr:Amblin_Television . ?uri dbo:company ?x . ?uri rdf:type dbo:TelevisionShow }","paraphrases":[],"info":{}}
{"id":"train_1327","question":"Count the number of people who graduated from universities affiliated with the NCAA.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:athletics dbr:National_Collegiate_Athletic_Association . ?uri dbp:education ?x . ?uri rdf:type dbo:Person }","paraphrases":[],"info":{}}
{"id":"train_1366","question":"How many ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbp:team dbr:Chicago_Bulls . }","paraphrases":[],"info":{}}
{"id":"train_1367","question":"What is the place of birth of the Kira Plastinina and Sergey Ryazansky","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Kira_Plastinina dbp:placeOfBirth ?uri . dbr:Sergey_Ryazansky dbp:placeOfBirth ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1369","question":"What is the products of the BBC Multimedia and series of the The Last Resort (Doctor Who)","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:BBC_Multimedia dbp:products ?uri . <http://dbpedia.org/resource/The_Last_Resort_(Doctor_Who)> dbo:series ?uri }","paraphrases":[],"info":{}}
{"id":"train_1440","question":"What is the almamater of the successor of F. A. Little, Jr.? ","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> dbo:successor ?x . ?x dbo:almaMater ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1441","question":"List everything in which saxophone players have been casted.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:instrument dbr:Saxophone . ?uri dbp:starring ?x . }","paraphrases":[],"info":{}}
{"id":"train_1461","question":"What is the venerated in of the Abraham and religion of the Saima Chowdhury","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Abraham dbp:veneratedIn ?uri . dbr:Saima_Chowdhury dbp:religion ?uri }","paraphrases":[],"info":{}}
{"id":"train_1468","question":"Name the mascot of the military branch of William Harper.","sparql":"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> dbo:militaryBranch ?x . ?x dbp:mascot ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1491","question":"Count the wars in which people awarded with the Croix de guerre fought.","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:awards <http://dbpedia.org/resource/Croix_de_guerre_1939–1945_(France)> . ?x dbp:battles ?uri . ?uri rdf:type dbo:MilitaryConflict }","paraphrases":[],"info":{}}
{"id":"train_1560","question":"What sports team's arena is The Palace of Auburn Hills","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:arena dbr:The_Palace_of_Auburn_Hills . ?uri rdf:type dbo:SportsTeam }","paraphrases":[],"info":{}}
{"id":"train_1597","question":"What is the nationality of the J. T. Krogh which is also the  sovereign state of the Camilla Martin","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:J._T._Krogh dbo:nationality ?uri . dbr:Camilla_Martin dbo:country ?uri }","paraphrases":[],"info":{}}
{"id":"train_1612","question":"Is lion an animal?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { dbr:Lion dbo:kingdom dbr:Animal }","paraphrases":[],"info":{}}
{"id":"train_1618","question":"Count all the scientologists.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbo:religion dbr:Scientology . }","paraphrases":[],"info":{}}
{"id":"train_1652","question":"What is the religion of the person who is in the cast of Master's Sun>?","sparql":"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Master's_Sun> dbo:starring ?x . ?x dbp:religion ?uri . ?x rdf:type dbo:Person }","paraphrases":[],"info":{}}
{"id":"train_1658","question":"List the former partner of the figure skaters whose former choreographer was Igor Shpillband.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:formerChoreographer dbr:Igor_Shpillband . ?x dbo:formerPartner ?uri . ?x rdf:type dbo:FigureSkater }","paraphrases":[],"info":{}}
{"id":"train_1659","question":"Give me a list of all the buildings which are located in districts governed by John Tory.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:leaderName dbr:John_Tory . ?uri dbo:location ?x . ?uri rdf:type dbo:Building }","paraphrases":[],"info":{}}
{"id":"train_1680","question":"Count all the awards which were presented by something located in California.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbo:headquarter dbr:California . ?uri dbo:presenter ?x . ?uri rdf:type dbo:Award }","paraphrases":[],"info":{}}
{"id":"train_1685","question":"Which tenants of the Master Card center is also th draft team of Sam Carrrick ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:MasterCard_Centre dbp:tenants ?uri . dbr:Sam_Carrick dbp:draftTeam ?uri }","paraphrases":[],"info":{}}
{"id":"train_1692","question":"What is a salthill?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Salthill dbo:type ?uri }","paraphrases":[],"info":{}}
{"id":"train_1713","question":"Which state is the birth location of Ann Monroe Gilchrist Strong? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Ann_Monroe_Gilchrist_Strong dbo:birthPlace ?x . ?x dbo:country ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1747","question":"Where can i find teams whose coach has been Rodney Eade.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:coach dbr:Rodney_Eade . ?x dbp:location ?uri . ?x rdf:type dbo:SportsTeam }","paraphrases":[],"info":{}}
{"id":"train_1755","question":"List the awards given to the relatives of Gregorios Bernardakis.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Gregorios_Bernardakis dbo:relative ?x . ?x dbo:award ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1783","question":"Name the college of the Allama Matthews which also has affiliation with  Monroe Carell Jr. Children's Hospital at Vanderbilt","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Allama_Matthews dbo:college ?uri . <http://dbpedia.org/resource/Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt> dbp:affiliation ?uri }","paraphrases":[],"info":{}}
{"id":"train_1800","question":"Among the universities having Gyrfalcon as mascot which have Michelle D. Johnson as superintendent? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:superintendent dbr:Michelle_D._Johnson . ?uri dbp:mascot dbr:Gyrfalcon . ?uri rdf:type dbo:University }","paraphrases":[],"info":{}}
{"id":"train_1804","question":" Count the participants of the NBA.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?uri dbo:league dbr:National_Basketball_Association . }","paraphrases":[],"info":{}}
{"id":"train_1822","question":"List the authors of the musicals whose songwriter is Richard M. Sherman.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbo:musicBy dbr:Richard_M._Sherman . ?x dbo:author ?uri . ?x rdf:type dbo:Musical }","paraphrases":[],"info":{}}
{"id":"train_1825","question":"Give me some organizations working for Environmentalism","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbp:purpose dbr:Environmentalism . ?uri rdf:type dbo:Organisation }","paraphrases":[],"info":{}}
{"id":"train_1842","question":"Count the total religions followed by the ones living in England.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:residence dbr:England . ?x dbp:religion ?uri . }","paraphrases":[],"info":{}}
{"id":"train_1848","question":"Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { dbr:Werner_Heisenberg dbo:doctoralStudent <http://dbpedia.org/resource/Șerban_Țițeica> }","paraphrases":[],"info":{}}
{"id":"train_1858","question":"Does the white river flow into the connecticut river{u'_id': u'97e02dcf44aa43c1b7cc7a7c155b118f',","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> ASK WHERE { dbr:Connecticut_River dbo:rightTributary <http://dbpedia.org/resource/White_River_(Vermont)> }","paraphrases":[],"info":{}}
{"id":"train_1893","question":"What is the common military branch of the Thomas Darden and that of Edwin F. Hunter","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Thomas_Darden dbo:militaryBranch ?uri . dbr:Edwin_F._Hunter dbp:branch ?uri }","paraphrases":[],"info":{}}
{"id":"train_1933","question":"What is the operating system of the LG Optimus Vu and also the developer of the Dart (programming language)","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:LG_Optimus_Vu dbo:operatingSystem ?uri . <http://dbpedia.org/resource/Dart_(programming_language)> dbp:developer ?uri }","paraphrases":[],"info":{}}
{"id":"train_1943","question":"Where did ed podolak go to high school","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { dbr:Ed_Podolak dbo:highschool ?uri }","paraphrases":[],"info":{}}
{"id":"train_1974","question":"List the producers who produced movies starring Michael Jackson.","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x dbp:starring dbr:Michael_Jackson . ?x dbp:producer ?uri . ?x rdf:type dbo:Film }","paraphrases":[],"info":{}}
