{"id":"train_3908","question":"Count all the games whose distributors are located in America","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ( COUNT ( ?uri ) AS ?count ) WHERE { ?x dbp:country dbr:United_States . ?uri dbp:distributor ?x . }","paraphrases":[],"info":{}}
{"id":"train_3915","question":"Who is the spouse of Daniel Gibson? ","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:spouse dbr:Daniel_Gibson . }","paraphrases":[],"info":{}}
{"id":"train_3943","question":"Who wrote Heroman?","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { dbr:Heroman dbp:author ?uri }","paraphrases":[],"info":{}}
{"id":"train_3947","question":"Which draft team od Dale Mitchell is also the tenant of Master Card center /","sparql":"PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dale_Mitchell_(ice_hockey)> dbo:draftTeam ?uri . dbr:MasterCard_Centre dbp:tenants ?uri }","paraphrases":[],"info":{}}
