{"id":"train_215","question":"What are the papers written by Jieting L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/172/5133> }","paraphrases":["Which publications did Jieting L. author?"],"info":{}}
{"id":"train_216","question":"What are the papers written by Johansson, F.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/1342-1> }","paraphrases":["Which papers did the author Fredrik Johansson write?"],"info":{}}
{"id":"train_217","question":"Which publications did Rainer M. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/93/4844> }","paraphrases":["Which papers did the author Rainer Melchert write?"],"info":{}}
{"id":"train_218","question":"What is the webpage of the person Groote, Jan Friso?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/g/JanFrisoGroote> dblp:webpage ?answer }","paraphrases":["What is the webpage of Jan Friso Groote?"],"info":{}}
{"id":"train_219","question":"What is the webpage of the person Frank W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/w/FrankWolter> dblp:webpage ?answer }","paraphrases":["What is the webpage of Frank W.?"],"info":{}}
{"id":"train_220","question":"What is the webpage of the person Azriel Rosenfeld?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/r/AzrielRosenfeld> dblp:webpage ?answer }","paraphrases":["What is the webpage of Azriel Rosenfeld?"],"info":{}}
{"id":"train_221","question":"What is the primary affiliation of Hendrix, Eligius M. T.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/35/6213> dblp:primaryAffiliation ?answer }","paraphrases":["Eligius M. T. Hendrix is primarily affiliated to which institution?"],"info":{}}
{"id":"train_222","question":"What is the Wikidata ID of E. Alba?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/a/EnriqueAlbaTorres> dblp:wikidata ?answer }","paraphrases":["The author Enrique Alba is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_223","question":"What are the papers written by Benyou Liao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/55/8713> }","paraphrases":["What are the papers written by the person Liao, B.?"],"info":{}}
{"id":"train_224","question":"What are the papers written by the person T. Watanabe?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/64/6874> }","paraphrases":["Which papers did the author Takashi Watanabe write?"],"info":{}}
{"id":"train_225","question":"Which papers did the author Juing-Shian C. write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/94/4253> }","paraphrases":["Which publications did Juing-Shian Chiou author?"],"info":{}}
{"id":"train_226","question":"Which papers did the author I-Hua Chih write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/7986> }","paraphrases":["What are the papers written by I-Hua C.?"],"info":{}}
{"id":"train_227","question":"Which publications did Maysa S. De Magalh\\u00E3es author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/67/4730> }","paraphrases":["What are the papers written by Maysa S. De Magalh\\u00E3es?"],"info":{}}
{"id":"train_228","question":"Which publications did Noboru N. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/4270> }","paraphrases":["What are the papers written by Noboru Nakamichi?"],"info":{}}
{"id":"train_229","question":"What are the papers written by M. Buvana?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/159/5785> }","paraphrases":["What are the papers written by the person Buvana, M.?"],"info":{}}
{"id":"train_230","question":"What is the webpage of the person Luis Gonz\\u00E1lez Abril?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/98/4378> dblp:webpage ?answer }","paraphrases":["What is the webpage of Luis Gonz\\u00E1lez Abril?"],"info":{}}
{"id":"train_231","question":"What are the papers written by John T. Nosek?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/1815> }","paraphrases":["Which papers did the author John T. Nosek write?"],"info":{}}
{"id":"train_232","question":"What are the papers written by Ida S. Tognisse?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/291/6531> }","paraphrases":["What are the papers written by the person Ida S\\u00E8m\\u00E9vo Tognisse?"],"info":{}}
{"id":"train_233","question":"What are the papers written by the person JingTao Yao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/y/JingtaoYao> }","paraphrases":["Which publications did JingTao Y. author?"],"info":{}}
{"id":"train_234","question":"Which publications did B. J. Geisler author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/266/5297> }","paraphrases":["Which papers did the author B. J. Geisler write?"],"info":{}}
{"id":"train_235","question":"What is the webpage of Milo, T.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/TovaMilo> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Milo, T.?"],"info":{}}
{"id":"train_236","question":"Which publications did Rory O'Moore author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/47/1756> }","paraphrases":["What are the papers written by Rory O.?"],"info":{}}
{"id":"train_237","question":"Which publications did Matthew S. Nokleby author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/3378> }","paraphrases":["What are the papers written by the person Matthew S. Nokleby?"],"info":{}}
{"id":"train_238","question":"What is the primary affiliation of Carlos D. Kloos?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/k/CarlosDelgadoKloos> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Carlos Delgado Kloos."],"info":{}}
{"id":"train_239","question":"What are the papers written by the person Nael B. Abu-Ghazaleh?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/86/2654> }","paraphrases":["What are the papers written by Nael B. Abu-Ghazaleh?"],"info":{}}
{"id":"train_240","question":"What are the papers written by the person A. V. Thakur?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/1945> }","paraphrases":["What are the papers written by Aditya V. Thakur?"],"info":{}}
{"id":"train_241","question":"What is the webpage of the person Correia, P. Lobato?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/80/1829> dblp:webpage ?answer }","paraphrases":["What is the webpage of Correia, P. Lobato?"],"info":{}}
{"id":"train_242","question":"Which papers did the author Clare C. write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/217/4832> }","paraphrases":["What are the papers written by the person Clare C.?"],"info":{}}
{"id":"train_243","question":"What is the Wikidata ID of Anselmo Lastra?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/83/6799> dblp:wikidata ?answer }","paraphrases":["The author Lastra, Anselmo is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_244","question":"Which papers did the author L. Zhu write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/99/549> }","paraphrases":["What are the papers written by the person L. Zhu?"],"info":{}}
{"id":"train_245","question":"Which publications did Julia Lieb author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/177/9433> }","paraphrases":["Which papers did the author Julia Lieb write?"],"info":{}}
{"id":"train_246","question":"Which papers did the author Francesco Cardinale write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/50/10751> }","paraphrases":["Which publications did Francesco Cardinale author?"],"info":{}}
{"id":"train_247","question":"Which papers did the author B. Chen write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/54/1638> }","paraphrases":["Which publications did B. Chen author?"],"info":{}}
{"id":"train_248","question":"What is the webpage of the person Thangarajah, J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/02/2279> dblp:webpage ?answer }","paraphrases":["What is the webpage of Thangarajah, J.?"],"info":{}}
{"id":"train_249","question":"What are the papers written by the person Sangmi Lee Pallickara?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/1106> }","paraphrases":["What are the papers written by Sangmi Lee Pallickara?"],"info":{}}
{"id":"train_250","question":"Show the Wikidata ID of the person Peter Dayan.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/22/522> dblp:wikidata ?answer }","paraphrases":["The author Peter Dayan is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_251","question":"What is the webpage of the person Markus Holzer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/h/MarkusHolzer1> dblp:webpage ?answer }","paraphrases":["What is the webpage of Holzer, M.?"],"info":{}}
{"id":"train_252","question":"Which publications did Krishnaswamy, Ravishankar author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/74/813> }","paraphrases":["Which papers did the author Ravishankar Krishnaswamy write?"],"info":{}}
{"id":"train_253","question":"What are the papers written by Michel, Fridolin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/94/10252> }","paraphrases":["Which publications did Michel, Fridolin author?"],"info":{}}
{"id":"train_254","question":"Mention the primary affiliation of Danny Ziyi Chen.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/c/DannyZChen> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Chen, D. Ziyi."],"info":{}}
{"id":"train_255","question":"Which publications did M. Hou author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/202/3811> }","paraphrases":["What are the papers written by Mingshan Hou?"],"info":{}}
{"id":"train_256","question":"Which papers did the author Ataollah Ebrahimzadeh write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/45/3605> }","paraphrases":["What are the papers written by the person Ebrahimzadeh, Ataollah?"],"info":{}}
{"id":"train_257","question":"Which papers did the author Reinhard Stoiber write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/59/5988> }","paraphrases":["Which publications did Reinhard Stoiber author?"],"info":{}}
{"id":"train_258","question":"What are the papers written by the person Francesca N.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/276/3533> }","paraphrases":["What are the papers written by Francesca Naretto?"],"info":{}}
{"id":"train_259","question":"Which publications did Shu-Fang Chen author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/122/8004> }","paraphrases":["What are the papers written by Shu-Fang Chen?"],"info":{}}
{"id":"train_260","question":"Which publications did Jack Minker author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/m/JackMinker> }","paraphrases":["What are the papers written by J. Minker?"],"info":{}}
{"id":"train_261","question":"Adrian Dumitrescu is primarily affiliated to which institution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/69/5787> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Dumitrescu, A.."],"info":{}}
{"id":"train_262","question":"What are the papers written by Arnesh Telukdarie?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/233/4505> }","paraphrases":["Which papers did the author Arnesh Telukdarie write?"],"info":{}}
{"id":"train_263","question":"What are the papers written by the person P. Hungler?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/246/5029> }","paraphrases":["What are the papers written by P. Hungler?"],"info":{}}
{"id":"train_264","question":"What are the papers written by the person S. W. Roberts?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/184/7800> }","paraphrases":["What are the papers written by Roberts, S. W.?"],"info":{}}
{"id":"train_265","question":"What are the papers written by the person Frederick R. Adler?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/10996> }","paraphrases":["Which publications did F. R. Adler author?"],"info":{}}
{"id":"train_267","question":"What are the papers written by Chris Bain?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/233/2122> }","paraphrases":["What are the papers written by the person Chris Bain?"],"info":{}}
{"id":"train_268","question":"What are the papers written by Rech, L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/3196> }","paraphrases":["Which papers did the author Rech, L. write?"],"info":{}}
{"id":"train_269","question":"What are the papers written by the person Francisco Javier L\\u00F3pez-Fraguas?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/l/FJLopezFraguas> }","paraphrases":["Which papers did the author F. Javier L\\u00F3pez-Fraguas write?"],"info":{}}
{"id":"train_270","question":"Which publications did Wei Jiang author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/21/3839> }","paraphrases":["What are the papers written by the person Wei J.?"],"info":{}}
{"id":"train_271","question":"What are the papers written by the person Yajie Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/10/821> }","paraphrases":["Which publications did Yajie Wang author?"],"info":{}}
{"id":"train_272","question":"Which publications did Sridhar Iyer author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/45/4930> }","paraphrases":["Which papers did the author Sridhar Iyer write?"],"info":{}}
{"id":"train_274","question":"What is the webpage of Elizabeth D. Mynatt?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/ElizabethDMynatt> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Elizabeth D. Mynatt?"],"info":{}}
{"id":"train_275","question":"Show the Wikidata ID of the person Nguyen, N. Thanh.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/n/NgocThanhNguyen> dblp:wikidata ?answer }","paraphrases":["The author Nguyen, N. Thanh is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_276","question":"Find the primary affiliation of Chen, Xiang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/64/3062-7> dblp:primaryAffiliation ?answer }","paraphrases":["Xiang Chen is primarily affiliated to which institution?"],"info":{}}
{"id":"train_277","question":"Show the Wikidata ID of the person Steve A. Schneider.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/s/SASchneider> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Schneider, Steve A.?"],"info":{}}
{"id":"train_278","question":"What is the webpage of Francisco Herrera?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/04/0> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Francisco Herrera?"],"info":{}}
{"id":"train_279","question":"What are the papers written by Z. Qu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/2938> }","paraphrases":["Which publications did Zhihua Qu author?"],"info":{}}
{"id":"train_281","question":"What are the papers written by Anders Berglund?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/3602> }","paraphrases":["What are the papers written by the person Anders B.?"],"info":{}}
{"id":"train_282","question":"Which papers did the author Xiamu Niu write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/27/6338> }","paraphrases":["Which publications did Xiamu Niu author?"],"info":{}}
{"id":"train_283","question":"Which publications did John Tromp author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/46/86> }","paraphrases":["What are the papers written by the person John Tromp?"],"info":{}}
{"id":"train_284","question":"Which papers did the author Mahdi Shabany write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/88/4324> }","paraphrases":["What are the papers written by the person M. Shabany?"],"info":{}}
{"id":"train_285","question":"What are the papers written by the person Wijn, A. S. de?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/131/7900> }","paraphrases":["What are the papers written by Astrid S. de Wijn?"],"info":{}}
{"id":"train_286","question":"Which publications did Yang Sun Lee author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/54/9241-1> }","paraphrases":["What are the papers written by the person Lee, Y. Sun?"],"info":{}}
{"id":"train_287","question":"Which publications did Fernand Meyer author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/4923> }","paraphrases":["Which papers did the author Fernand Meyer write?"],"info":{}}
{"id":"train_288","question":"What is the Wikidata ID of S. Kambhampati?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/k/SKambhampati> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person S. Kambhampati."],"info":{}}
{"id":"train_289","question":"The author Dario Landa Silva is associated with which Wikidata identifier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/88/4046> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Dario Landa Silva?"],"info":{}}
{"id":"train_290","question":"Which publications did Ranst, Wiebe Van author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/170/4064> }","paraphrases":["What are the papers written by the person Ranst, Wiebe Van?"],"info":{}}
{"id":"train_291","question":"Which publications did Bommannan, G. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/211/6931> }","paraphrases":["Which papers did the author Gautham Bommannan write?"],"info":{}}
{"id":"train_292","question":"What is the webpage of the person Se-Young Yun?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/23/8862> dblp:webpage ?answer }","paraphrases":["What is the webpage of Se-Young Y.?"],"info":{}}
{"id":"train_293","question":"Find the primary affiliation of Liu, Wenyu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/42/4110-1> dblp:primaryAffiliation ?answer }","paraphrases":["Wenyu Liu is primarily affiliated to which institution?"],"info":{}}
{"id":"train_294","question":"What is the primary affiliation of Xiaoliang W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/02/3450-1> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Xiaoliang Wang."],"info":{}}
{"id":"train_295","question":"What is the primary affiliation of Yiqing H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/39/6548-2> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Yiqing Huang."],"info":{}}
{"id":"train_296","question":"What are the papers written by the person Ronald Chung?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/27/5973> }","paraphrases":["Which papers did the author Ronald C. write?"],"info":{}}
{"id":"train_297","question":"What are the papers written by the person F. Meyer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/6778> }","paraphrases":["What are the papers written by Felix Meyer?"],"info":{}}
{"id":"train_298","question":"What are the papers written by Bottoni, P.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/449> }","paraphrases":["What are the papers written by the person Paolo Bottoni?"],"info":{}}
{"id":"train_299","question":"Which papers did the author R. Arora write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/212/4806> }","paraphrases":["Which publications did Rishu Arora author?"],"info":{}}
{"id":"train_300","question":"What is the webpage of the person Fran\\u00E7oise Peyrin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/48/2692> dblp:webpage ?answer }","paraphrases":["What is the webpage of Peyrin, F.?"],"info":{}}
{"id":"train_301","question":"Find the primary affiliation of Myers, Michael D..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/MDMyers> dblp:primaryAffiliation ?answer }","paraphrases":["Michael D. Myers is primarily affiliated to which institution?"],"info":{}}
{"id":"train_302","question":"What is the webpage of Carpendale, Sheelagh?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/c/MSheelaghTCarpendale> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Carpendale, Sheelagh?"],"info":{}}
{"id":"train_303","question":"Find the primary affiliation of Paul Honeine.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/53/7011> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Paul H.."],"info":{}}
{"id":"train_304","question":"Which papers did the author Paul L. Overbeek write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/27/2576> }","paraphrases":["What are the papers written by P. L. Overbeek?"],"info":{}}
{"id":"train_305","question":"Which publications did Hainan Guo author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/183/2090> }","paraphrases":["What are the papers written by Guo, H.?"],"info":{}}
{"id":"train_306","question":"What are the papers written by Tantithamthavorn, C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/140/7129> }","paraphrases":["Which papers did the author Tantithamthavorn, C. write?"],"info":{}}
{"id":"train_307","question":"What is the webpage of Thad S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/s/ThadStarner> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Thad Starner?"],"info":{}}
{"id":"train_308","question":"Find the primary affiliation of Robert F. H. Fischer.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/40/4085> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Fischer, R. F. H.."],"info":{}}
{"id":"train_309","question":"Find the primary affiliation of Z. Jiang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/41/245> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Zhong-Ping Jiang."],"info":{}}
{"id":"train_310","question":"Mention the primary affiliation of Widdows, Dominic.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/87/4113> dblp:primaryAffiliation ?answer }","paraphrases":["Dominic Widdows is primarily affiliated to which institution?"],"info":{}}
{"id":"train_311","question":"What are the papers written by J. S. Lehnert?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/86/2923> }","paraphrases":["Which publications did James S. Lehnert author?"],"info":{}}
{"id":"train_312","question":"What are the papers written by Michael C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/08/4101> }","paraphrases":["What are the papers written by the person Michael C.?"],"info":{}}
{"id":"train_313","question":"Find the primary affiliation of Christoph Treude.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/29/1074> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Christoph T.?"],"info":{}}
{"id":"train_314","question":"Which publications did Mengjiao Wang author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/93/9728-3> }","paraphrases":["What are the papers written by the person Mengjiao Wang?"],"info":{}}
{"id":"train_315","question":"Which papers did the author W. Balke write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/WTBalke> }","paraphrases":["What are the papers written by Wolf-Tilo Balke?"],"info":{}}
{"id":"train_316","question":"Which publications did Pedro R. D'Argenio author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/61/441> }","paraphrases":["Which papers did the author Pedro R. D'Argenio write?"],"info":{}}
{"id":"train_317","question":"What are the papers written by the person Charles Beumier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/92/1598> }","paraphrases":["Which papers did the author Charles Beumier write?"],"info":{}}
{"id":"train_318","question":"Which papers did the author A. H. DeCostanza write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/208/4870> }","paraphrases":["Which publications did A. H. DeCostanza author?"],"info":{}}
{"id":"train_319","question":"What is the webpage of the person Gulliver, T. Aaron?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/g/TAGulliver> dblp:webpage ?answer }","paraphrases":["What is the webpage of T. Aaron Gulliver?"],"info":{}}
{"id":"train_320","question":"What is the Wikidata ID of Hamid R. Tizhoosh?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/70/966> dblp:wikidata ?answer }","paraphrases":["The author Hamid R. Tizhoosh is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_321","question":"What are the papers written by the person Goillau, P. J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/19/1238> }","paraphrases":["Which papers did the author Goillau, P. J. write?"],"info":{}}
