{"id":"train_6178","question":"When was the research paper on Fundus images by University of Calgary, Canada published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ccece/OloumiRE14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Calgary, Canada' . <https://dblp.org/rec/conf/ccece/OloumiRE14> dblp:yearOfPublication ?answer }","paraphrases":["University of Calgary, Canada published a paper on Fundus images in what year?"],"info":{}}
{"id":"train_6179","question":"In COCOON in 2010, what are the titles of the papers on Dilation stars?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cocoon/AugustineEW10> dblp:publishedIn 'COCOON' . <https://dblp.org/rec/conf/cocoon/AugustineEW10> dblp:yearOfPublication '2010' . <https://dblp.org/rec/conf/cocoon/AugustineEW10> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Dilation stars that were published in International Conference on Computing and Combinatorics in 2010?"],"info":{}}
{"id":"train_6180","question":"In Int. J. Autom. Technol. in 2009, who are the authors that published papers about Assist system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijat/RahmanINHS09> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ijat/RahmanINHS09> dblp:publishedIn 'Int. J. Autom. Technol.' . <https://dblp.org/rec/journals/ijat/RahmanINHS09> dblp:yearOfPublication '2009' }","paraphrases":["Who are the authors that published papers about Assist system in Int. J. Autom. Technol. in 2009?"],"info":{}}
{"id":"train_6181","question":"Who are the authors that published papers about Care environments in MIE in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mie/KlausenRL16> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/mie/KlausenRL16> dblp:publishedIn 'MIE' . <https://dblp.org/rec/conf/mie/KlausenRL16> dblp:yearOfPublication '2016' }","paraphrases":["In MIE in 2016, who are the authors that published papers about Care environments?"],"info":{}}
{"id":"train_6182","question":"In 2018 in Int. J. Crit. Infrastructure Prot., what are the titles of the papers on Power systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcip/MohandesHSMK18> dblp:publishedIn 'Int. J. Crit. Infrastructure Prot.' . <https://dblp.org/rec/journals/ijcip/MohandesHSMK18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/ijcip/MohandesHSMK18> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Power systems that were published in Int. J. Crit. Infrastructure Prot. in 2018?"],"info":{}}
{"id":"train_6183","question":"In ACM International Conference on Knowledge Discovery and Data Mining in 2002, what are the titles of the papers on Association rules?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/kdd/EvfimievskiSAG02> dblp:publishedIn 'KDD' . <https://dblp.org/rec/conf/kdd/EvfimievskiSAG02> dblp:yearOfPublication '2002' . <https://dblp.org/rec/conf/kdd/EvfimievskiSAG02> dblp:title ?answer }","paraphrases":["In the year 2002 in KDD, what are the titles of the research papers on Association rules?"],"info":{}}
{"id":"train_6184","question":"In the year 2021 in EUSIPCO, who are the authors that published research papers about Speech synthesis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eusipco/LorinczSG21> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/eusipco/LorinczSG21> dblp:publishedIn 'EUSIPCO' . <https://dblp.org/rec/conf/eusipco/LorinczSG21> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in EUSIPCO, who are the authors that published papers about Speech synthesis?"],"info":{}}
{"id":"train_6185","question":"In HPCN Europe in 1998, who are the authors that published papers about Database architecture?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hpcn/TaniarJ98> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/hpcn/TaniarJ98> dblp:publishedIn 'HPCN Europe' . <https://dblp.org/rec/conf/hpcn/TaniarJ98> dblp:yearOfPublication '1998' }","paraphrases":["Who are the authors that published papers about Database architecture in HPCN Europe in 1998?"],"info":{}}
{"id":"train_6186","question":"The University of Newcastle, Australia published a paper on Vertex magic cover in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mics/SugengR11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'The University of Newcastle, Australia' . <https://dblp.org/rec/journals/mics/SugengR11> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Vertex magic cover by The University of Newcastle published?"],"info":{}}
{"id":"train_6187","question":"In the year 2014 in URAI, who are the authors that published research papers about Optimization design?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/urai/LiuSJS14> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/urai/LiuSJS14> dblp:publishedIn 'URAI' . <https://dblp.org/rec/conf/urai/LiuSJS14> dblp:yearOfPublication '2014' }","paraphrases":["In URAI in 2014, who are the authors that published papers about Optimization design?"],"info":{}}
{"id":"train_6188","question":"Washington University in St. Louis published a paper on Sensor networks in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/rtss/ShaDHLKP13> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Washington University in St. Louis, Department of Computer Science and Engineering, MO, USA' . <https://dblp.org/rec/conf/rtss/ShaDHLKP13> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Sensor networks by Washington University in St. Louis published?"],"info":{}}
{"id":"train_6189","question":"In 2020 in International Symposium on Computational Geometry, who are the authors that published papers about Hull queries?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/compgeom/000120a> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/compgeom/000120a> dblp:publishedIn 'SoCG' . <https://dblp.org/rec/conf/compgeom/000120a> dblp:yearOfPublication '2020' }","paraphrases":["In International Symposium on Computational Geometry in 2020, who are the authors that published papers about Hull queries?"],"info":{}}
{"id":"train_6190","question":"Who are the authors that published papers about Imaging model in Machine Vision Applications in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mva/KamadaOD07> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/mva/KamadaOD07> dblp:publishedIn 'MVA' . <https://dblp.org/rec/conf/mva/KamadaOD07> dblp:yearOfPublication '2007' }","paraphrases":["In 2007 in Machine Vision Applications, who are the authors that published papers about Imaging model?"],"info":{}}
{"id":"train_6191","question":"In 2020 in Frontiers Appl. Math. Stat., who are the authors that published papers about Model approach?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/fams/Syed20> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/fams/Syed20> dblp:publishedIn 'Frontiers Appl. Math. Stat.' . <https://dblp.org/rec/journals/fams/Syed20> dblp:yearOfPublication '2020' }","paraphrases":["In the year 2020 in Frontiers Appl. Math. Stat., who are the authors that published research papers about Model approach?"],"info":{}}
{"id":"train_6192","question":"In the year 1986 in IEEE Trans. Commun., who are the authors that published research papers about Response channels?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcom/WolfU86> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/tcom/WolfU86> dblp:publishedIn 'IEEE Trans. Commun.' . <https://dblp.org/rec/journals/tcom/WolfU86> dblp:yearOfPublication '1986' }","paraphrases":["In IEEE Trans. Commun. in 1986, who are the authors that published papers about Response channels?"],"info":{}}
{"id":"train_6193","question":"In the year 2021 in MIE, what are the titles of the research papers on Knowledge acquisition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mie/HagenKWEKF21> dblp:publishedIn 'MIE' . <https://dblp.org/rec/conf/mie/HagenKWEKF21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/conf/mie/HagenKWEKF21> dblp:title ?answer }","paraphrases":["In 2021 in MIE, what are the titles of the papers on Knowledge acquisition?"],"info":{}}
{"id":"train_6194","question":"When was the paper on Digits function by TU Wien, Vienna, Austria published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jlms/DrmotaMR11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'TU Wien, Vienna, Austria' . <https://dblp.org/rec/journals/jlms/DrmotaMR11> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Digits function by TU Wien, Vienna, Austria published?"],"info":{}}
{"id":"train_6195","question":"What are the titles of the papers on Drone routines that were published in MUM in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mum/HoppeB0K19> dblp:publishedIn 'MUM' . <https://dblp.org/rec/conf/mum/HoppeB0K19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/conf/mum/HoppeB0K19> dblp:title ?answer }","paraphrases":["In 2019 in Mobile and Ubiquitous Multimedia (ACM), what are the titles of the papers on Drone routines?"],"info":{}}
{"id":"train_6196","question":"In Euromicro International Conference on Parallel, Distributed and Network Based Processing in 1993, what are the titles of the papers on Multiprocessor architecture?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pdp/LibsSDBJH93> dblp:publishedIn 'PDP' . <https://dblp.org/rec/conf/pdp/LibsSDBJH93> dblp:yearOfPublication '1993' . <https://dblp.org/rec/conf/pdp/LibsSDBJH93> dblp:title ?answer }","paraphrases":["In the year 1993 in Euromicro International Conference on Parallel, Distributed and Network Based Processing, what are the titles of the research papers on Multiprocessor architecture?"],"info":{}}
{"id":"train_6197","question":"In the year 2020 in IEEE Access, who are the authors that published research papers about Patient relationship?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/LiuYLH20> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/access/LiuYLH20> dblp:publishedIn 'IEEE Access' . <https://dblp.org/rec/journals/access/LiuYLH20> dblp:yearOfPublication '2020' }","paraphrases":["In 2020 in IEEE Access, who are the authors that published papers about Patient relationship?"],"info":{}}
{"id":"train_6198","question":"In 2013 in PPDP, what are the titles of the papers on Type extensions?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ppdp/CaballeroST13> dblp:publishedIn 'PPDP' . <https://dblp.org/rec/conf/ppdp/CaballeroST13> dblp:yearOfPublication '2013' . <https://dblp.org/rec/conf/ppdp/CaballeroST13> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Type extensions that were published in International Conference on Principles and Practice of Declarative Programming in 2013?"],"info":{}}
{"id":"train_6199","question":"In ICCNMC in 2005, who are the authors that published papers about Probability system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccnmc/JeongJMK05> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/iccnmc/JeongJMK05> dblp:publishedIn 'ICCNMC' . <https://dblp.org/rec/conf/iccnmc/JeongJMK05> dblp:yearOfPublication '2005' }","paraphrases":["In the year 2005 in ICCNMC, who are the authors that published research papers about Probability system?"],"info":{}}
{"id":"train_6201","question":"In the year 2021 in Int. J. Comput. Vis., what are the titles of the research papers on Foreground maps?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcv/ChengF21> dblp:publishedIn 'Int. J. Comput. Vis.' . <https://dblp.org/rec/journals/ijcv/ChengF21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/ijcv/ChengF21> dblp:title ?answer }","paraphrases":["In Int. J. Comput. Vis. in 2021, what are the titles of the papers on Foreground maps?"],"info":{}}
{"id":"train_6203","question":"Who are the authors that published papers about Packet drop in SIAM J. Control. Optim. in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/siamco/GuTQ21> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/siamco/GuTQ21> dblp:publishedIn 'SIAM J. Control. Optim.' . <https://dblp.org/rec/journals/siamco/GuTQ21> dblp:yearOfPublication '2021' }","paraphrases":["In SIAM J. Control. Optim. in 2021, who are the authors that published papers about Packet drop?"],"info":{}}
{"id":"train_6204","question":"In ICPR in 2012, who are the authors that published papers about Image representations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icpr/XuGN12> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icpr/XuGN12> dblp:publishedIn 'ICPR' . <https://dblp.org/rec/conf/icpr/XuGN12> dblp:yearOfPublication '2012' }","paraphrases":["In the year 2012 in ICPR, who are the authors that published research papers about Image representations?"],"info":{}}
{"id":"train_6205","question":"In 1993 in Future Gener. Comput. Syst., what are the titles of the papers on Design support tool?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/fgcs/DHeygereMR93> dblp:publishedIn 'Future Gener. Comput. Syst.' . <https://dblp.org/rec/journals/fgcs/DHeygereMR93> dblp:yearOfPublication '1993' . <https://dblp.org/rec/journals/fgcs/DHeygereMR93> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Design support tool that were published in Future Gener. Comput. Syst. in 1993?"],"info":{}}
{"id":"train_6206","question":"When was the paper on N attitudes by University of Massachusetts Amherst published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/its/ArroyoSBW12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Massachusetts Amherst, Center for Knowledge Communication, MA, USA' . <https://dblp.org/rec/conf/its/ArroyoSBW12> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on N attitudes by University of Massachusetts Amherst, Center for Knowledge Communication, MA, USA published?"],"info":{}}
{"id":"train_6207","question":"In the year 2016 in NANOCOM, what are the titles of the research papers on Broadcast system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/nanocom/MavridopoulosNT16> dblp:publishedIn 'NANOCOM' . <https://dblp.org/rec/conf/nanocom/MavridopoulosNT16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/conf/nanocom/MavridopoulosNT16> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Broadcast system that were published in NANOCOM in 2016?"],"info":{}}
{"id":"train_6208","question":"In 2005 in International Joint Conference on Natural Language Processing, who are the authors that published papers about Opinion extraction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcnlp/KobayashiIMTF04> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ijcnlp/KobayashiIMTF04> dblp:publishedIn 'IJCNLP' . <https://dblp.org/rec/conf/ijcnlp/KobayashiIMTF04> dblp:yearOfPublication '2005' }","paraphrases":["Who are the authors that published papers about Opinion extraction in IJCNLP in 2005?"],"info":{}}
{"id":"train_6209","question":"In 2021 in Int. J. Comput. Intell. Syst., what are the titles of the papers on Salesman problem?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcisys/RenWWW21> dblp:publishedIn 'Int. J. Comput. Intell. Syst.' . <https://dblp.org/rec/journals/ijcisys/RenWWW21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/ijcisys/RenWWW21> dblp:title ?answer }","paraphrases":["In the year 2021 in Int. J. Comput. Intell. Syst., what are the titles of the research papers on Salesman problem?"],"info":{}}
{"id":"train_6210","question":"In the year 2018 in Int. J. Appl. Evol. Comput., what are the titles of the research papers on Classification models?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijaec/SahuS18> dblp:publishedIn 'Int. J. Appl. Evol. Comput.' . <https://dblp.org/rec/journals/ijaec/SahuS18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/ijaec/SahuS18> dblp:title ?answer }","paraphrases":["In 2018 in Int. J. Appl. Evol. Comput., what are the titles of the papers on Classification models?"],"info":{}}
{"id":"train_6212","question":"What are the titles of the papers on Shape derivatives that were published in J. Comput. Phys. in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcphy/HeKO07> dblp:publishedIn 'J. Comput. Phys.' . <https://dblp.org/rec/journals/jcphy/HeKO07> dblp:yearOfPublication '2007' . <https://dblp.org/rec/journals/jcphy/HeKO07> dblp:title ?answer }","paraphrases":["In 2007 in J. Comput. Phys., what are the titles of the papers on Shape derivatives?"],"info":{}}
{"id":"train_6213","question":"In IEEE Access in 2020, who are the authors that published papers about Set model?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/LiJZYLZL20> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/access/LiJZYLZL20> dblp:publishedIn 'IEEE Access' . <https://dblp.org/rec/journals/access/LiJZYLZL20> dblp:yearOfPublication '2020' }","paraphrases":["Who are the authors that published papers about Set model in IEEE Access in 2020?"],"info":{}}
{"id":"train_6214","question":"In J. Database Manag. in 2011, who are the authors that published papers about Document database?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jdm/SenguptaV11> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jdm/SenguptaV11> dblp:publishedIn 'J. Database Manag.' . <https://dblp.org/rec/journals/jdm/SenguptaV11> dblp:yearOfPublication '2011' }","paraphrases":["Who are the authors that published papers about Document database in J. Database Manag. in 2011?"],"info":{}}
{"id":"train_6215","question":"Who are the authors that published papers about Barrier source in iSES in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ises/KumarST19> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ises/KumarST19> dblp:publishedIn 'iSES' . <https://dblp.org/rec/conf/ises/KumarST19> dblp:yearOfPublication '2019' }","paraphrases":["In 2019 in iSES, who are the authors that published papers about Barrier source?"],"info":{}}
{"id":"train_6216","question":"In the year 2016 in Mensch & Computer Workshopband, what are the titles of the research papers on Recommender systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mc/HolzingerVZ16> dblp:publishedIn 'Mensch & Computer Workshopband' . <https://dblp.org/rec/conf/mc/HolzingerVZ16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/conf/mc/HolzingerVZ16> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Recommender systems that were published in Mensch & Computer Workshopband in 2016?"],"info":{}}
{"id":"train_6217","question":"What are the titles of the papers on Interference channels that were published in CrownCom in 2010?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/crowncom/MochaourabCJ10> dblp:publishedIn 'CrownCom' . <https://dblp.org/rec/conf/crowncom/MochaourabCJ10> dblp:yearOfPublication '2010' . <https://dblp.org/rec/conf/crowncom/MochaourabCJ10> dblp:title ?answer }","paraphrases":["In CrownCom in 2010, what are the titles of the papers on Interference channels?"],"info":{}}
{"id":"train_6219","question":"Who are the authors that published papers about Grade title in ICLS in 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icls/Bucci96> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icls/Bucci96> dblp:publishedIn 'ICLS' . <https://dblp.org/rec/conf/icls/Bucci96> dblp:yearOfPublication '1996' }","paraphrases":["In the year 1996 in ICLS, who are the authors that published research papers about Grade title?"],"info":{}}
{"id":"train_6220","question":"In Comput. Aided Des. in 1996, what are the titles of the papers on Generating assembly?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cad/BertolottoBFN96> dblp:publishedIn 'Comput. Aided Des.' . <https://dblp.org/rec/journals/cad/BertolottoBFN96> dblp:yearOfPublication '1996' . <https://dblp.org/rec/journals/cad/BertolottoBFN96> dblp:title ?answer }","paraphrases":["In 1996 in Comput. Aided Des., what are the titles of the papers on Generating assembly?"],"info":{}}
{"id":"train_6221","question":"In 2007 in International Conference on the Theory and Application of Cryptology and Information Security, what are the titles of the papers on Byzantine agreement?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/asiacrypt/Beerliova-TrubiniovaHR07> dblp:publishedIn 'ASIACRYPT' . <https://dblp.org/rec/conf/asiacrypt/Beerliova-TrubiniovaHR07> dblp:yearOfPublication '2007' . <https://dblp.org/rec/conf/asiacrypt/Beerliova-TrubiniovaHR07> dblp:title ?answer }","paraphrases":["In the year 2007 in International Conference on the Theory and Application of Cryptology and Information Security, what are the titles of the research papers on Byzantine agreement?"],"info":{}}
{"id":"train_6222","question":"In Autom. in 2017, what are the titles of the papers on Mode control?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/automatica/ShtesselMF17> dblp:publishedIn 'Autom.' . <https://dblp.org/rec/journals/automatica/ShtesselMF17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/journals/automatica/ShtesselMF17> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Mode control that were published in Autom. in 2017?"],"info":{}}
{"id":"train_6223","question":"In the year 2018 in ICETE, what are the titles of the research papers on Platform architecture?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icete/Levina18> dblp:publishedIn 'ICETE (1)' . <https://dblp.org/rec/conf/icete/Levina18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/conf/icete/Levina18> dblp:title ?answer }","paraphrases":["In ICETE in 2018, what are the titles of the papers on Platform architecture?"],"info":{}}
{"id":"train_6224","question":"In Systems and Computers in Japan in 2001, who are the authors that published papers about Game system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/scjapan/SasakiT01> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/scjapan/SasakiT01> dblp:publishedIn 'Systems and Computers in Japan' . <https://dblp.org/rec/journals/scjapan/SasakiT01> dblp:yearOfPublication '2001' }","paraphrases":["Who are the authors that published papers about Game system in Systems and Computers in Japan in 2001?"],"info":{}}
{"id":"train_6225","question":"In COMPSAC (2) in 2009, what are the titles of the papers on Agent protection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/compsac/MunozMHM09> dblp:publishedIn 'COMPSAC (2)' . <https://dblp.org/rec/conf/compsac/MunozMHM09> dblp:yearOfPublication '2009' . <https://dblp.org/rec/conf/compsac/MunozMHM09> dblp:title ?answer }","paraphrases":["In the year 2009 in COMPSAC (2), what are the titles of the research papers on Agent protection?"],"info":{}}
{"id":"train_6226","question":"In the year 2021 in CoRR, what are the titles of the research papers on Modulation recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2105-13746> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2105-13746> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/corr/abs-2105-13746> dblp:title ?answer }","paraphrases":["In CoRR in 2021, what are the titles of the papers on Modulation recognition?"],"info":{}}
{"id":"train_6227","question":"In 2003 in IEEE International Symposium on Personal and Indoor Mobile Radio Conference, what are the titles of the papers on Antennas transmission?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pimrc/YiL03> dblp:publishedIn 'PIMRC' . <https://dblp.org/rec/conf/pimrc/YiL03> dblp:yearOfPublication '2003' . <https://dblp.org/rec/conf/pimrc/YiL03> dblp:title ?answer }","paraphrases":["In the year 2003 in IEEE International Symposium on Personal and Indoor Mobile Radio Conference, what are the titles of the research papers on Antennas transmission?"],"info":{}}
{"id":"train_6228","question":"In Int. J. Mob. Commun. in 2006, what are the titles of the papers on Wlan experiments?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijmc/Tsang06> dblp:publishedIn 'Int. J. Mob. Commun.' . <https://dblp.org/rec/journals/ijmc/Tsang06> dblp:yearOfPublication '2006' . <https://dblp.org/rec/journals/ijmc/Tsang06> dblp:title ?answer }","paraphrases":["In the year 2006 in Int. J. Mob. Commun., what are the titles of the research papers on Wlan experiments?"],"info":{}}
{"id":"train_6229","question":"What are the titles of the papers on Image processing that were published in IEEE International Conference on Image Processing in 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icip/McCabeWC98> dblp:publishedIn 'ICIP (2)' . <https://dblp.org/rec/conf/icip/McCabeWC98> dblp:yearOfPublication '1998' . <https://dblp.org/rec/conf/icip/McCabeWC98> dblp:title ?answer }","paraphrases":["In ICIP (2) in 1998, what are the titles of the papers on Image processing?"],"info":{}}
{"id":"train_6230","question":"In 2021 in Sensors, what are the titles of the papers on Transportation classification?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/FriedrichLH21> dblp:publishedIn 'Sensors' . <https://dblp.org/rec/journals/sensors/FriedrichLH21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/sensors/FriedrichLH21> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Transportation classification that were published in Sensors in 2021?"],"info":{}}
{"id":"train_6231","question":"What are the titles of the papers on Property identification that were published in ICRA in 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icra/DebusDH99> dblp:publishedIn 'ICRA' . <https://dblp.org/rec/conf/icra/DebusDH99> dblp:yearOfPublication '1999' . <https://dblp.org/rec/conf/icra/DebusDH99> dblp:title ?answer }","paraphrases":["In 1999 in ICRA, what are the titles of the papers on Property identification?"],"info":{}}
{"id":"train_6233","question":"In 2020 in ICIP, who are the authors that published papers about Relationship network?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icip/PengCL20> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icip/PengCL20> dblp:publishedIn 'ICIP' . <https://dblp.org/rec/conf/icip/PengCL20> dblp:yearOfPublication '2020' }","paraphrases":["In the year 2020 in IEEE International Conference on Image Processing, who are the authors that published research papers about Relationship network?"],"info":{}}
{"id":"train_6235","question":"In INFOCOM in 2021, what are the titles of the papers on Cloud computing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/infocom/QinLY21> dblp:publishedIn 'INFOCOM' . <https://dblp.org/rec/conf/infocom/QinLY21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/conf/infocom/QinLY21> dblp:title ?answer }","paraphrases":["In the year 2021 in IEEE International Conference on Computer Communications, what are the titles of the research papers on Cloud computing?"],"info":{}}
{"id":"train_6236","question":"In 2002 in ISTAS, who are the authors that published papers about Case study?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/istas/CeaparuS02> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/istas/CeaparuS02> dblp:publishedIn 'ISTAS' . <https://dblp.org/rec/conf/istas/CeaparuS02> dblp:yearOfPublication '2002' }","paraphrases":["In International Symposium on Technology and Society in 2002, who are the authors that published papers about Case study?"],"info":{}}
{"id":"train_6237","question":"In HPDC in 1997, what are the titles of the papers on Scheduling methods?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hpdc/SudoSS97> dblp:publishedIn 'HPDC' . <https://dblp.org/rec/conf/hpdc/SudoSS97> dblp:yearOfPublication '1997' . <https://dblp.org/rec/conf/hpdc/SudoSS97> dblp:title ?answer }","paraphrases":["In the year 1997 in HPDC, what are the titles of the research papers on Scheduling methods?"],"info":{}}
{"id":"train_6238","question":"Who are the authors that published papers about Si heterojunctions in Microelectron. J. in 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mj/FaragAT08> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/mj/FaragAT08> dblp:publishedIn 'Microelectron. J.' . <https://dblp.org/rec/journals/mj/FaragAT08> dblp:yearOfPublication '2008' }","paraphrases":["In Microelectron. J. in 2008, who are the authors that published papers about Si heterojunctions?"],"info":{}}
