{"id":"train_619","question":"Mention the co-authors of A. Gisbrecht.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/80/8426> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/80/8426> ) }","paraphrases":["With which other authors has the author Andrej Gisbrecht written papers?"],"info":{}}
{"id":"train_620","question":"List the papers published by Subramanian, R. in the last 7 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/177/4567> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Which papers did Subramanian, R. publish in the last seven years?"],"info":{}}
{"id":"train_622","question":"Which papers did Ian Miguel publish in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/17/2612> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["List the papers published by Ian Miguel in the last four years."],"info":{}}
{"id":"train_623","question":"List the papers published by Shohana Rahman Deeba in the last 7 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/247/9575> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Which papers did Deeba, Shohana Rahman publish in the last seven years?"],"info":{}}
{"id":"train_624","question":"List the papers published by Abhishek Rawat in the last 9 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/8341> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Which papers did Rawat, A. publish in the last 9 years?"],"info":{}}
{"id":"train_625","question":"Mention the papers published by Panos M. Pardalos with the author from University of Florida, Gainesville.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/04/1137> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'University of Florida, Gainesville' }","paraphrases":["What research papers did Pardalos, P. M. publish with the author affiliated to University of Florida, Gainesville?"],"info":{}}
{"id":"train_626","question":"Who are the co-authors of Yingfei Xiong?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/2673> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/82/2673> ) }","paraphrases":["Mention the co-authors of Yingfei Xiong."],"info":{}}
{"id":"train_628","question":"Mention the venues in which Paulo F. Pires published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/69/1904> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has P. F. Pires published papers?"],"info":{}}
{"id":"train_629","question":"Mention the papers published by Q. Ha with the author from College of Technology, Vietnam National University, Hanoi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/01/1849> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'College of Technology, Vietnam National University, Hanoi' }","paraphrases":["What research papers did Quang-Thuy Ha publish with the author affiliated to College of Technology?"],"info":{}}
{"id":"train_630","question":"In which conferences or journals has Reiner Lenz published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/5717> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Lenz, R. published?"],"info":{}}
{"id":"train_631","question":"In which conferences or journals has Shuqiang Jiang published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/90/3651> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Shuqiang Jiang published?"],"info":{}}
{"id":"train_632","question":"List the papers published by Sofia Jos\\u00E9 Santos in the last three years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/244/9951> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Which papers did Sofia Jos\\u00E9 Santos publish in the last 3 years?"],"info":{}}
{"id":"train_633","question":"List the papers published by Shoichi Tanifuji in the last 8 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/99/10518> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Which papers did Shoichi Tanifuji publish in the last 8 years?"],"info":{}}
{"id":"train_634","question":"Mention the papers published by Michael Beetz with the author from University of Bremen, Germany.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/MichaelBeetz> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'University of Bremen, Germany' }","paraphrases":["Which publications did Michael Beetz write with the author from University of Bremen, Germany?"],"info":{}}
{"id":"train_635","question":"In which conferences or journals has Tri Nguyen published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/29/6538> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Tri N. published."],"info":{}}
{"id":"train_636","question":"What are the papers written by Daniel Etiemble and D. Revelosona together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/76/5706> . ?answer dblp:authoredBy <https://dblp.org/pid/91/10511> }","paraphrases":["Which papers did Daniel Etiemble and Revelosona, D. write together?"],"info":{}}
{"id":"train_637","question":"List the papers published by Gang Liu in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/37/2109> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did G. Liu publish in the last four years?"],"info":{}}
{"id":"train_638","question":"Mention the venues in which Hee Sik Kim published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/5373> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Kim, H. Sik published papers?"],"info":{}}
{"id":"train_639","question":"Mention the co-authors of Masami Hagiya.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/h/MasamiHagiya> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/h/MasamiHagiya> ) }","paraphrases":["Who are the co-authors of Masami Hagiya?"],"info":{}}
{"id":"train_640","question":"In which conferences or journals has Yachao Wang published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/149/0396> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Yachao W. published?"],"info":{}}
{"id":"train_641","question":"In which conferences or journals has V. Latora published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/1297> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which V. Latora published?"],"info":{}}
{"id":"train_642","question":"Mention the papers published by Euiwoong Lee with the author from University of Michigan, USA.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/129/5624> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'University of Michigan, USA' }","paraphrases":["Which publications did Euiwoong Lee write with the author from University of Michigan, USA?"],"info":{}}
{"id":"train_643","question":"Who are the co-authors of Spiros Fotopoulos?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/4176> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/88/4176> ) }","paraphrases":["With which other authors has the author S. Fotopoulos written papers?"],"info":{}}
{"id":"train_644","question":"Mention the co-authors of Azzolin, Rodrigo Zelir.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/143/9499> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/143/9499> ) }","paraphrases":["With which other authors has the author Rodrigo Zelir Azzolin written papers?"],"info":{}}
{"id":"train_645","question":"Find the papers written by Nick Hounsell and Geqi Qi together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/73/10976> . ?answer dblp:authoredBy <https://dblp.org/pid/149/2471> }","paraphrases":["Which papers did Nick Hounsell and Geqi Q. write together?"],"info":{}}
{"id":"train_646","question":"With which other authors has the author Tyler G. written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/306/5233> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/306/5233> ) }","paraphrases":["Who are the co-authors of Tyler Grimes?"],"info":{}}
{"id":"train_648","question":"List the papers published by Michael L. in the last six years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/04/2489> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Which papers did Michael Link publish in the last 6 years?"],"info":{}}
{"id":"train_649","question":"Mention the co-authors of Alexander Bakst.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/13/11515> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/13/11515> ) }","paraphrases":["With which other authors has the author Alexander Bakst written papers?"],"info":{}}
{"id":"train_650","question":"Find the papers written by Huang, Xiaoqiu and Ankit Agrawal together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/6202-1> . ?answer dblp:authoredBy <https://dblp.org/pid/55/5176> }","paraphrases":["Which papers did Huang, Xiaoqiu and Ankit A. write together?"],"info":{}}
{"id":"train_651","question":"List the papers published by A. Farouk in the last six years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/176/5087> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Which papers did Ahmed Farouk publish in the last 6 years?"],"info":{}}
{"id":"train_652","question":"Mention the co-authors of Zhengying Chen.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/151/8840> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/151/8840> ) }","paraphrases":["With which other authors has the author Z. Chen written papers?"],"info":{}}
{"id":"train_654","question":"List the papers published by Fallahi, B. in the last 3 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/164/8296> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Which papers did Fallahi, B. publish in the last 3 years?"],"info":{}}
{"id":"train_655","question":"What are the papers written by Cuadros-Vargas, Ernesto and Omar U. Fl\\u00F3rez-Choque together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/20/6400> . ?answer dblp:authoredBy <https://dblp.org/pid/22/6324> }","paraphrases":["Which papers did Ernesto Cuadros-Vargas and Omar U. Fl\\u00F3rez-Choque write together?"],"info":{}}
{"id":"train_656","question":"Who are the co-authors of J. Liang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/3243-2> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/95/3243-2> ) }","paraphrases":["Mention the co-authors of Jing Liang."],"info":{}}
{"id":"train_657","question":"List the papers published by Stefania M. in the last two years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/126/7823> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Which papers did Stefania Monica publish in the last two years?"],"info":{}}
{"id":"train_658","question":"List the papers published by Matthew J. Mandich in the last 3 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/257/2456> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Which papers did Matthew J. Mandich publish in the last three years?"],"info":{}}
{"id":"train_660","question":"Mention the co-authors of Walke, B..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/w/BernhardWalke> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/w/BernhardWalke> ) }","paraphrases":["Who are the co-authors of Walke, B.?"],"info":{}}
{"id":"train_662","question":"What are the papers written by Agata Ciabattoni and Aguzzoli, Stefano together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/44/6796> . ?answer dblp:authoredBy <https://dblp.org/pid/17/5121> }","paraphrases":["Which papers did Agata Ciabattoni and Stefano Aguzzoli write together?"],"info":{}}
{"id":"train_664","question":"What are the venues in which Rafael Dueire Lins published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/44/4611> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Rafael Dueire Lins published papers?"],"info":{}}
{"id":"train_666","question":"Which papers did Peng Zhang and Li-Yun Dong write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/21/1048-14> . ?answer dblp:authoredBy <https://dblp.org/pid/11/3891> }","paraphrases":["Find the papers written by Peng Zhang and Li-Yun Dong together."],"info":{}}
{"id":"train_669","question":"Mention the venues in which Alexander S. Kozlov published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/181/2717> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Alexander S. Kozlov published papers?"],"info":{}}
{"id":"train_670","question":"Which papers did P. Kissmann and J\\u00F6rg Hoffmann write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/6191> . ?answer dblp:authoredBy <https://dblp.org/pid/26/836> }","paraphrases":["What are the papers written by Peter Kissmann and J. Hoffmann together?"],"info":{}}
{"id":"train_672","question":"List the papers published by James W. Mickens in the last two years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/90/1843> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Which papers did James W. Mickens publish in the last two years?"],"info":{}}
{"id":"train_674","question":"What are the venues in which G. R. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/92/3439> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which G. R. published."],"info":{}}
{"id":"train_676","question":"Which papers did Md. K. Sarker publish in the last 6 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/186/2804> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["List the papers published by Md. K. Sarker in the last six years."],"info":{}}
{"id":"train_678","question":"Find the papers written by Hufford, Kevin D. and Zeleny, M. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/32/5595> . ?answer dblp:authoredBy <https://dblp.org/pid/73/409> }","paraphrases":["Which papers did Kevin D. Hufford and Zeleny, M. write together?"],"info":{}}
{"id":"train_680","question":"Mention the co-authors of Helmut Heppe.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/253/0921> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/253/0921> ) }","paraphrases":["Who are the co-authors of Helmut Heppe?"],"info":{}}
{"id":"train_681","question":"In which conferences or journals has M. Gerhold published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/221/9436> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which M. Gerhold published."],"info":{}}
{"id":"train_682","question":"In which conferences or journals has Ben Allison published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/18/6438> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Ben Allison published."],"info":{}}
{"id":"train_683","question":"Mention the venues in which Alabbas, M. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/10489> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Maytham Alabbas published papers?"],"info":{}}
{"id":"train_685","question":"Mention the co-authors of Yu-Wei Chang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/09/2929> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/09/2929> ) }","paraphrases":["With which other authors has the author Chang, Yu-Wei written papers?"],"info":{}}
{"id":"train_686","question":"Mention the co-authors of Vladimir B..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/83/460> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/83/460> ) }","paraphrases":["With which other authors has the author Vladimir B. written papers?"],"info":{}}
{"id":"train_687","question":"Find the papers written by Kenneth O. Stanley and Risto M. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/s/KennethOStanley> . ?answer dblp:authoredBy <https://dblp.org/pid/m/RistoMiikkulainen> }","paraphrases":["Which papers did Kenneth O. Stanley and Risto M. write together?"],"info":{}}
{"id":"train_688","question":"Find the papers written by Ryo Hayakawa and Nakai-Kasai, Ayano together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/146/1419> . ?answer dblp:authoredBy <https://dblp.org/pid/214/2262> }","paraphrases":["Which papers did Ryo H. and Nakai-Kasai, Ayano write together?"],"info":{}}
{"id":"train_690","question":"Who are the co-authors of Mtakati, Sibulele?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/270/7141> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/270/7141> ) }","paraphrases":["With which other authors has the author Sibulele Mtakati written papers?"],"info":{}}
{"id":"train_691","question":"With which other authors has the author Javier Iglesias written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/89/254> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/89/254> ) }","paraphrases":["Who are the co-authors of Javier Iglesias?"],"info":{}}
{"id":"train_692","question":"List the papers published by Donald Metzler in the last seven years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/2272> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Which papers did Donald M. publish in the last seven years?"],"info":{}}
{"id":"train_694","question":"List the papers published by Ralf K\\u00FCsters in the last 9 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/k/RKusters> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Which papers did Ralf K\\u00FCsters publish in the last 9 years?"],"info":{}}
{"id":"train_695","question":"Find the papers written by Chi-Tsai Yeh and Chun-Hao Wang together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/78/8784> . ?answer dblp:authoredBy <https://dblp.org/pid/60/7011> }","paraphrases":["What are the papers written by Chi-Tsai Y. and Chun-Hao Wang together?"],"info":{}}
{"id":"train_696","question":"Mention the venues in which Zhao, L. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/47/5689> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Lingxiao Zhao published papers?"],"info":{}}
{"id":"train_697","question":"Find the papers written by Lin, Qizhong and Yiyuan Hao together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/99/1639> . ?answer dblp:authoredBy <https://dblp.org/pid/231/7093> }","paraphrases":["Which papers did Qizhong Lin and Hao, Y. write together?"],"info":{}}
{"id":"train_698","question":"Mention the co-authors of Brunskill, E..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/27/1277> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/27/1277> ) }","paraphrases":["With which other authors has the author Emma Brunskill written papers?"],"info":{}}
{"id":"train_699","question":"What research papers did Laurent, Thomas publish with the author affiliated to Loyola Marymount University?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/47/8889-1> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Loyola Marymount University, Department of Mathematics, Los Angeles, CA, USA' }","paraphrases":["Which publications did Thomas Laurent write with the author from Loyola Marymount University?"],"info":{}}
{"id":"train_700","question":"Which papers did author W. Kwasowiec publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/59/2677> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did W. Kwasowiec author and in which year?"],"info":{}}
{"id":"train_701","question":"List the titles of the papers that Hosam M. Mahmoud published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/m/HosamMMahmoud> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Hosam M. Mahmoud publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_703","question":"Name the co-authors of Dingxuan Li in the last three years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/300/8467> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/300/8467> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Li, Dingxuan in the last three years and where are they affiliated?"],"info":{}}
{"id":"train_704","question":"Mention the papers published by B. Anda and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/91/2927> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did B. Anda author and in which year?"],"info":{}}
{"id":"train_709","question":"Mention the other authors with whom Nasr, K. M. has co-authored papers in the last six years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/206> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/19/206> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Karim M. Nasr in the last 6 years and where are they affiliated?"],"info":{}}
{"id":"train_710","question":"Name the co-authors of Patrik Haslum in the last six years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/39/6592> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/39/6592> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of P. Haslum in the last 6 years and where are they affiliated?"],"info":{}}
{"id":"train_711","question":"Name the co-authors of Amir Akbari in the last four years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/07/8862> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/07/8862> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Amir A. in the last four years and where are they affiliated?"],"info":{}}
{"id":"train_713","question":"Who are the co-authors of Hao Chao in the last nine years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/25/10648> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/25/10648> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of H. Chao in the last 9 years and where are they affiliated?"],"info":{}}
{"id":"train_714","question":"Who are the co-authors of Saha, I. in the last six years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/6031> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/88/6031> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Saha, I. in the last 6 years and where are they affiliated?"],"info":{}}
{"id":"train_715","question":"Which papers did author Gerard J. M. Janssen publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/49/4927> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Gerard J. M. Janssen and in which year."],"info":{}}
{"id":"train_718","question":"List the venues in which Paul Parsons published papers in the last two years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/10043> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Paul Parsons published in the last two years and in which venues."],"info":{}}
{"id":"train_719","question":"List the venues in which Toru M. published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/129/1046> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Toru Mano publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_720","question":"Mention the other authors with whom S. Franceschetti has co-authored papers in the last six years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/28/9151> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/28/9151> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Silvana Franceschetti in the last 6 years and where are they affiliated?"],"info":{}}
