{"id":"train_6893","question":"Between 'Map graphs having witnesses of large girth' and 'Reinforcement learning based on local state feature learning and policy adjustment', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1812-04102> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/isci/LinL03> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/corr/abs-1812-04102> , <https://dblp.org/rec/journals/isci/LinL03> ) AS ?answer ) }","paraphrases":["Between 'Map graphs having witnesses of large girth' and 'Reinforcement learning based on local state feature learning and policy adjustment', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6896","question":"Which one was published first, 'Adaptive Object-Models and Metamodeling Techniques' or 'Prospect Theory and Information Security Investment Decisions'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ecoopw/RevaultY01> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/amcis/YoungBC12> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/ecoopw/RevaultY01> , <https://dblp.org/rec/conf/amcis/YoungBC12> ) AS ?answer ) }","paraphrases":["Between 'Adaptive Object-Models and Metamodeling Techniques' and 'Prospect Theory and Information Security Investment Decisions', which paper was published earlier?"],"info":{}}
{"id":"train_6897","question":"Mention the author who has published the most papers among the authors of 'Towards GAN Benchmarks Which Require Generalization'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2001-03653> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Towards GAN Benchmarks Which Require Generalization'?"],"info":{}}
{"id":"train_6898","question":"Which one has more number of authors, 'Achieving dynamicity in security policies enforcement using aspects' or 'Anomaly detection and localization by diffusion wavelet-based analysis on traffic matrix'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijisec/AyedICC18> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/comsis/SunTM15> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/ijisec/AyedICC18> , <https://dblp.org/rec/journals/comsis/SunTM15> ) AS ?answer ) }","paraphrases":["Between 'Achieving dynamicity in security policies enforcement using aspects' and 'Anomaly detection and localization by diffusion wavelet-based analysis on traffic matrix', which paper has more authors?"],"info":{}}
{"id":"train_6899","question":"Mention the year in which the first papers of the authors of 'Performance improvements on MEFX-LMS based noise cancellation system in vehicle cabin' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/iscas/AkihoTHK00> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Performance improvements on MEFX-LMS based noise cancellation system in vehicle cabin' published?"],"info":{}}
{"id":"train_6900","question":"Between 'KEEL Data-Mining Software Tool: Data Set Repository, Integration of Algorithms and Experimental Analysis Framework' and 'PelletSpatial: A Hybrid RCC-8 and RDF/OWL Reasoning and Query Engine', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mvl/Alcala-FdezFLDG11> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/semweb/StockerS08> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/mvl/Alcala-FdezFLDG11> , <https://dblp.org/rec/conf/semweb/StockerS08> ) AS ?answer ) }","paraphrases":["Which one was published first, 'KEEL Data-Mining Software Tool: Data Set Repository, Integration of Algorithms and Experimental Analysis Framework' or 'PelletSpatial: A Hybrid RCC-8 and RDF/OWL Reasoning and Query Engine'?"],"info":{}}
{"id":"train_6902","question":"Which one was published first, 'DFS: A Simple to Write Yet Difficult to Execute Benchmark' or 'A study about control for rolling objects and beam system'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iiswc/MurphyBMHGL06> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/alr/TakahashiSSY16> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/iiswc/MurphyBMHGL06> , <https://dblp.org/rec/journals/alr/TakahashiSSY16> ) AS ?answer ) }","paraphrases":["Between 'DFS: A Simple to Write Yet Difficult to Execute Benchmark' and 'A study about control for rolling objects and beam system', which paper was published earlier?"],"info":{}}
{"id":"train_6904","question":"Which one has more number of authors, 'Constraint Satisfaction: The Approximability of Minimization Problems' or 'Efficient Randomized Pattern-Matching Algorithms'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/coco/KhannaST97> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ibmrd/KarpR87> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/coco/KhannaST97> , <https://dblp.org/rec/journals/ibmrd/KarpR87> ) AS ?answer ) }","paraphrases":["Between 'Constraint Satisfaction: The Approximability of Minimization Problems' and 'Efficient Randomized Pattern-Matching Algorithms', which paper has more authors?"],"info":{}}
{"id":"train_6905","question":"Which one was published first, 'Pair-programming helps female computer science students' or 'Dynamic NoC-based architecture for MPSoC security implementation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jeric/WernerHM04> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/sbcci/SepulvedaGPCS11> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/jeric/WernerHM04> , <https://dblp.org/rec/conf/sbcci/SepulvedaGPCS11> ) AS ?answer ) }","paraphrases":["Between 'Pair-programming helps female computer science students' and 'Dynamic NoC-based architecture for MPSoC security implementation', which paper was published earlier?"],"info":{}}
{"id":"train_6906","question":"Between 'Optimising quality of information in data collection for mobile sensor networks' and 'High Order Anchoring and Reinitialization of Level Set Function for Simulating Interface Motion', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iwqos/BijarboonehFNP13> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/jscic/RamanujS19> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/iwqos/BijarboonehFNP13> , <https://dblp.org/rec/journals/jscic/RamanujS19> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Optimising quality of information in data collection for mobile sensor networks' or 'High Order Anchoring and Reinitialization of Level Set Function for Simulating Interface Motion'?"],"info":{}}
{"id":"train_6907","question":"Between 'Nondeterministic Discretization of Weights Improves Accuracy of Neural Networks' and 'New methods of human-robot interaction in medical practice', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ecml/Wojnarski07> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/cmpb/Garcia-AracilZCN14> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/ecml/Wojnarski07> , <https://dblp.org/rec/journals/cmpb/Garcia-AracilZCN14> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Nondeterministic Discretization of Weights Improves Accuracy of Neural Networks' or 'New methods of human-robot interaction in medical practice'?"],"info":{}}
{"id":"train_6908","question":"Mention the year in which the first papers of the authors of 'Big Data Analytics: Schizophrenia Prediction on Apache Spark' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/aces/SaputraA20> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Big Data Analytics: Schizophrenia Prediction on Apache Spark' published?"],"info":{}}
{"id":"train_6910","question":"Mention the year in which the first papers of the authors of 'Chaotic Arithmetic Coding for Secure Video Multicast' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/corr/Pande13> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Chaotic Arithmetic Coding for Secure Video Multicast' published?"],"info":{}}
{"id":"train_6911","question":"Between 'Tag detection algorithm for improving the instability problem of an augmented reality' and 'Agree to disagree: security requirements are different, but mechanisms for security adaptation are not', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ismar/LeeKKH06> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/icse/TunB18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/ismar/LeeKKH06> , <https://dblp.org/rec/conf/icse/TunB18> ) AS ?answer ) }","paraphrases":["Between 'Tag detection algorithm for improving the instability problem of an augmented reality' and 'Agree to disagree: security requirements are different, but mechanisms for security adaptation are not', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6912","question":"Between 'Experiential learning: Lean team at Virginia Tech' and 'Intelligence obtained by applying data mining to a database of French theses on the subject of Brazil', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ieem/BuehlmannE14> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ires/TarapanoffQJA01> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/ieem/BuehlmannE14> , <https://dblp.org/rec/journals/ires/TarapanoffQJA01> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Experiential learning: Lean team at Virginia Tech' or 'Intelligence obtained by applying data mining to a database of French theses on the subject of Brazil'?"],"info":{}}
{"id":"train_6913","question":"Mention the author who has published the most papers among the authors of 'Perceptual characterization of motion evoked by sounds for synthesis control purposes'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tap/MererAYK13> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Perceptual characterization of motion evoked by sounds for synthesis control purposes'?"],"info":{}}
{"id":"train_6914","question":"Between 'Entity set expansion in knowledge graph: a heterogeneous information network perspective' and 'A Differential Input/Output Linear MOS Transconductor', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/fcsc/ShiDCHWL21> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ieicet/TongpoonMOT11> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/fcsc/ShiDCHWL21> , <https://dblp.org/rec/journals/ieicet/TongpoonMOT11> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Entity set expansion in knowledge graph: a heterogeneous information network perspective' or 'A Differential Input/Output Linear MOS Transconductor'?"],"info":{}}
{"id":"train_6915","question":"Between 'Extending the conceptual graph approach for data conceptual modelling' and 'The effects of interpulse interval on stochastic properties of electrical stimulation: models and measurements', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dke/MoulinC92> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/tbe/MatsuokaRAM01> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/dke/MoulinC92> , <https://dblp.org/rec/journals/tbe/MatsuokaRAM01> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Extending the conceptual graph approach for data conceptual modelling' or 'The effects of interpulse interval on stochastic properties of electrical stimulation: models and measurements'?"],"info":{}}
{"id":"train_6916","question":"Name the primary affiliation of most of the authors of 'Weighted Joint Collaborative Representation Based On Median-Mean Line and Angular Separation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tgrs/ImaniG17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'Weighted Joint Collaborative Representation Based On Median-Mean Line and Angular Separation' affiliated?"],"info":{}}
{"id":"train_6919","question":"Between 'Generalized Fitting Subgroup of a Group of Finite Morley Rank' and 'Harmonized Landsat/Sentinel-2 Products for Land Monitoring', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jsyml/Nesin91b> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/igarss/MasekJRSCD18> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/jsyml/Nesin91b> , <https://dblp.org/rec/conf/igarss/MasekJRSCD18> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Generalized Fitting Subgroup of a Group of Finite Morley Rank' or 'Harmonized Landsat/Sentinel-2 Products for Land Monitoring'?"],"info":{}}
{"id":"train_6920","question":"Mention the year in which the first papers of the authors of 'On the Gonality of Cartesian Products of Graphs' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/combinatorics/AidunM20> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'On the Gonality of Cartesian Products of Graphs' published?"],"info":{}}
{"id":"train_6922","question":"Between 'RTL Conversion Method From Pipelined Synchronous RTL Models Into Asynchronous Ones' and 'Some Formal Properties of Stratified Feature Grammars', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/SembaS22> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/amai/JohnsonM93> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/access/SembaS22> , <https://dblp.org/rec/journals/amai/JohnsonM93> ) AS ?answer ) }","paraphrases":["Which one was published first, 'RTL Conversion Method From Pipelined Synchronous RTL Models Into Asynchronous Ones' or 'Some Formal Properties of Stratified Feature Grammars'?"],"info":{}}
{"id":"train_6923","question":"To which institution are the majority of the authors of 'Precoding Aided Generalized Spatial Modulation with K Transmit Antenna Groups' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icc/CaoO19> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'Precoding Aided Generalized Spatial Modulation with K Transmit Antenna Groups'?"],"info":{}}
{"id":"train_6926","question":"Between 'Designing 6DOF haptic transfer functions for effective exploration of 3D diffusion tensor fields' and 'WDM interconnect targeted Si-wire optical demultiplexers for large manufacturing tolerance, low voltage tunability and polarization diversified operability', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/haptics/OgawaFST09> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/ofc/JeongSTSTM16> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/haptics/OgawaFST09> , <https://dblp.org/rec/conf/ofc/JeongSTSTM16> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Designing 6DOF haptic transfer functions for effective exploration of 3D diffusion tensor fields' or 'WDM interconnect targeted Si-wire optical demultiplexers for large manufacturing tolerance, low voltage tunability and polarization diversified operability'?"],"info":{}}
{"id":"train_6928","question":"Which one was published first, 'Neural Network Doc2vec in Automated Sentiment Analysis for Short Informal Texts' or 'Developing Student Oral Presentation Skills with the Help of Mobile Devices'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/specom/MaslovaP17> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ijmbl/GweeT15> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/specom/MaslovaP17> , <https://dblp.org/rec/journals/ijmbl/GweeT15> ) AS ?answer ) }","paraphrases":["Between 'Neural Network Doc2vec in Automated Sentiment Analysis for Short Informal Texts' and 'Developing Student Oral Presentation Skills with the Help of Mobile Devices', which paper was published earlier?"],"info":{}}
{"id":"train_6930","question":"Name the primary affiliation of most of the authors of 'Near optimal multiple alignment within a band in polynomial time'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jcss/MaWL07> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the primary affiliation of most of the authors of 'Near optimal multiple alignment within a band in polynomial time'."],"info":{}}
{"id":"train_6933","question":"Mention the year in which the first papers of the authors of 'Language Representations Starting from Fully Initial Languages' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/actaC/PaunV91> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["In which year were the first papers of the authors of 'Language Representations Starting from Fully Initial Languages' published?"],"info":{}}
{"id":"train_6934","question":"What is the primary affiliation of most of the authors of the paper 'Learning Discriminative and Generalizable Representations by Spatial-Channel Partition for Person Re-Identification'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/wacv/ChenLB20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'Learning Discriminative and Generalizable Representations by Spatial-Channel Partition for Person Re-Identification' affiliated?"],"info":{}}
{"id":"train_6936","question":"Between 'On-Line Selection Of Distinguishing Elements For Focused Information Retrieval' and 'Structure learning of sparse directed acyclic graphs incorporating the scale-free property', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icmcs/ChenZCDFZ01> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/cstat/GuoZWL19> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/icmcs/ChenZCDFZ01> , <https://dblp.org/rec/journals/cstat/GuoZWL19> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'On-Line Selection Of Distinguishing Elements For Focused Information Retrieval' or 'Structure learning of sparse directed acyclic graphs incorporating the scale-free property'?"],"info":{}}
{"id":"train_6939","question":"Mention the author who has published the most papers among the authors of 'Extensible, Extendable, Expandable, Extractable: The 4E Design Approach for Reconfigurable Displays'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijhci/VanderdoncktV21> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Extensible, Extendable, Expandable, Extractable: The 4E Design Approach for Reconfigurable Displays'?"],"info":{}}
{"id":"train_6941","question":"Which one has more number of authors, 'On perceptual advantages of active robot vision' or 'Adaptive Immune System TH1/TH2 Differentiation Mechanism Inspired Perimeter Patrol Control Strategy'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jfr/CannataG99> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/tcst/YangBZH11> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/jfr/CannataG99> , <https://dblp.org/rec/journals/tcst/YangBZH11> ) AS ?answer ) }","paraphrases":["Between 'On perceptual advantages of active robot vision' and 'Adaptive Immune System TH1/TH2 Differentiation Mechanism Inspired Perimeter Patrol Control Strategy', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6947","question":"Between '3D Space Path Planning of Complex Environmental Underwater Vehicle' and 'Using fMRI to decode true thoughts independent of intention to conceal', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cso/LiuD09> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/neuroimage/YangHGDNB14> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/cso/LiuD09> , <https://dblp.org/rec/journals/neuroimage/YangHGDNB14> ) AS ?answer ) }","paraphrases":["Which one was published first, '3D Space Path Planning of Complex Environmental Underwater Vehicle' or 'Using fMRI to decode true thoughts independent of intention to conceal'?"],"info":{}}
{"id":"train_6948","question":"Which one was published first, 'Impact of Spatial Frequency Based Constraints on Adversarial Robustness' or 'The Weakest Failure Detector for Eventual Consistency'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcnn/BernhardMMBCSR21> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/DuboisGKPS15> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/ijcnn/BernhardMMBCSR21> , <https://dblp.org/rec/journals/corr/DuboisGKPS15> ) AS ?answer ) }","paraphrases":["Between 'Impact of Spatial Frequency Based Constraints on Adversarial Robustness' and 'The Weakest Failure Detector for Eventual Consistency', which paper was published earlier?"],"info":{}}
{"id":"train_6949","question":"Mention the author who has published the most papers among the authors of 'ELPKG: A High-Accuracy Link Prediction Approach for Knowledge Graph Completion'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/symmetry/MaQHWZHSWZR19> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'ELPKG: A High-Accuracy Link Prediction Approach for Knowledge Graph Completion'?"],"info":{}}
{"id":"train_6952","question":"Between 'Manifold Constrained Variational Mixtures' and 'Enhanced Precision Time Synchronization for Wireless Sensor Networks', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icann/ArchambeauV05> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/sensors/ChoKB11> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/icann/ArchambeauV05> , <https://dblp.org/rec/journals/sensors/ChoKB11> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Manifold Constrained Variational Mixtures' or 'Enhanced Precision Time Synchronization for Wireless Sensor Networks'?"],"info":{}}
{"id":"train_6953","question":"Mention the author who has published the most papers among the authors of 'Biometric Authentication'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/computer/Weaver06> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Biometric Authentication'?"],"info":{}}
{"id":"train_6955","question":"Between 'Towel: Real World Mobility on the Web' and 'Paired compressed cover trees guarantee a near linear parametrized complexity for all k-nearest neighbors search in an arbitrary metric space', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cadui/HarperSG99> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/abs-2201-06553> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/cadui/HarperSG99> , <https://dblp.org/rec/journals/corr/abs-2201-06553> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Towel: Real World Mobility on the Web' or 'Paired compressed cover trees guarantee a near linear parametrized complexity for all k-nearest neighbors search in an arbitrary metric space'?"],"info":{}}
{"id":"train_6956","question":"Who has published the most papers among the authors of 'Preface'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/anor/Guignard-SpielbergS05> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the author who has published the most papers among the authors of 'Preface'."],"info":{}}
{"id":"train_6957","question":"Mention the author who has published the most papers among the authors of 'Research on Team Orienteering Problem with Dynamic Travel Times'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jsw/Li12a> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Research on Team Orienteering Problem with Dynamic Travel Times'?"],"info":{}}
{"id":"train_6958","question":"Between 'Cross-modal Collaborative Manifold Propagation for Image Recommendation' and 'Online Manifold Regularization: A New Learning Setting and Empirical Study', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mir/JianJYWH19> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/pkdd/GoldbergLZ08> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/mir/JianJYWH19> , <https://dblp.org/rec/conf/pkdd/GoldbergLZ08> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Cross-modal Collaborative Manifold Propagation for Image Recommendation' or 'Online Manifold Regularization: A New Learning Setting and Empirical Study'?"],"info":{}}
{"id":"train_6959","question":"Mention the primary affiliation of most of the authors of 'Mobile Energy Internet'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-1802-01570> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Mobile Energy Internet' from?"],"info":{}}
{"id":"train_6961","question":"Between 'Approximate QR-based algorithms for recursive nonlinear least squares estimation' and 'Centralization vs decentralization of application software', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscas/ChanZL05> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/cacm/SchuffL01> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/iscas/ChanZL05> , <https://dblp.org/rec/journals/cacm/SchuffL01> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Approximate QR-based algorithms for recursive nonlinear least squares estimation' or 'Centralization vs decentralization of application software'?"],"info":{}}
