{"id":"train_521","question":"Mention the venues in which Hal A. Kierstead published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/k/HAKierstead> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Hal A. Kierstead published?"],"info":{}}
{"id":"train_522","question":"Mention the venues in which S. Basu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/5861> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which S. Basu published?"],"info":{}}
{"id":"train_523","question":"What are the papers written by Dmitry Efrosinin and Weisi Guo together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/06/5784> . ?answer dblp:authoredBy <https://dblp.org/pid/72/8514> }","paraphrases":["Find the papers written by Dmitry E. and Weisi Guo together."],"info":{}}
{"id":"train_524","question":"What are the papers written by Marco Liserre and F. Scarpetta together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/49/19> . ?answer dblp:authoredBy <https://dblp.org/pid/255/4696> }","paraphrases":["Find the papers written by Marco Liserre and F. Scarpetta together."],"info":{}}
{"id":"train_525","question":"With which other authors has the author Debasish Pradhan written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/42/9443> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/42/9443> ) }","paraphrases":["Who are the co-authors of Debasish Pradhan?"],"info":{}}
{"id":"train_526","question":"Which papers did Christina M. Payne publish in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/132/3356> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["List the papers published by Christina M. Payne in the last two years."],"info":{}}
{"id":"train_527","question":"Which papers did Jinglin Shi publish in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/84/1530> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["List the papers published by Jinglin S. in the last 6 years."],"info":{}}
{"id":"train_528","question":"Mention the co-authors of Rupei X..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/138/7303> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/138/7303> ) }","paraphrases":["With which other authors has the author Rupei Xu written papers?"],"info":{}}
{"id":"train_529","question":"List the papers published by Patrick C. in the last 9 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/131/5969> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Which papers did Patrick C. publish in the last nine years?"],"info":{}}
{"id":"train_530","question":"List the papers published by Bjarne Stig Andersen in the last four years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/55/2433> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Bjarne Stig Andersen publish in the last 4 years?"],"info":{}}
{"id":"train_531","question":"List the papers published by Zhonghua Huang in the last 3 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/77/2539> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Which papers did Zhonghua H. publish in the last 3 years?"],"info":{}}
{"id":"train_532","question":"Mention the co-authors of Liu, C..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/52/5716-2> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/52/5716-2> ) }","paraphrases":["With which other authors has the author Liu, C. written papers?"],"info":{}}
{"id":"train_533","question":"Mention the venues in which Tobias Kowatsch published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/6574> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Kowatsch, Tobias published?"],"info":{}}
{"id":"train_534","question":"Which papers did Ingo Muegge publish in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/33/4534> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["List the papers published by Ingo Muegge in the last three years."],"info":{}}
{"id":"train_535","question":"Mention the venues in which Gl\\u00F3wka, T. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/139/0156> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Gl\\u00F3wka, T. published?"],"info":{}}
{"id":"train_536","question":"In which conferences or journals has Alex Shymka published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/193/4924> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Alex Shymka published."],"info":{}}
{"id":"train_537","question":"Who are the co-authors of Jinhua Du?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/61/2112> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/61/2112> ) }","paraphrases":["Mention the co-authors of Jinhua Du."],"info":{}}
{"id":"train_538","question":"Which papers did Olga Veksler publish in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/v/OlgaVeksler> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["List the papers published by Olga Veksler in the last 4 years."],"info":{}}
{"id":"train_539","question":"What are the papers written by Rissland, Edwina L. and Jensen, D. D. together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/r/EdwinaLRissland> . ?answer dblp:authoredBy <https://dblp.org/pid/38/828> }","paraphrases":["Which papers did Edwina L. Rissland and Jensen, D. D. write together?"],"info":{}}
{"id":"train_540","question":"What research papers did Henk Wymeersch publish with the author affiliated to Chalmers University of Technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/1188> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Chalmers University of Technology, Gothenburg, Sweden' }","paraphrases":["Which publications did H. Wymeersch write with the author from Chalmers University of Technology, Gothenburg, Sweden?"],"info":{}}
{"id":"train_541","question":"What are the venues in which T. Chen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/52/6812> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which T. Chen published."],"info":{}}
{"id":"train_542","question":"Mention the co-authors of Aljoscha Smolic.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/s/AljoschaSmolic> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/s/AljoschaSmolic> ) }","paraphrases":["With which other authors has the author Aljoscha Smolic written papers?"],"info":{}}
{"id":"train_543","question":"List the papers published by Sheng-Tzong Cheng in the last 5 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/80/4313> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["Which papers did Sheng-Tzong C. publish in the last five years?"],"info":{}}
{"id":"train_544","question":"In which conferences or journals has Mark S. Avnet published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/130/7463> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Mark S. Avnet published."],"info":{}}
{"id":"train_545","question":"Mention the co-authors of Dubois, Eric.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/d/EricDubois1> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/d/EricDubois1> ) }","paraphrases":["With which other authors has the author Eric Dubois written papers?"],"info":{}}
{"id":"train_546","question":"Which papers did A. Allison publish in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/71/4553> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["List the papers published by A. Allison in the last six years."],"info":{}}
{"id":"train_547","question":"Which papers did Christian D. Schunn publish in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/35/2189> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["List the papers published by Schunn, Christian D. in the last two years."],"info":{}}
{"id":"train_548","question":"What are the venues in which M. R. M. Jenkin published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/j/MichaelRMJenkin> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Michael R. M. Jenkin published papers?"],"info":{}}
{"id":"train_550","question":"In which conferences or journals has Dong, H. published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/83/4823> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Dong, H. published?"],"info":{}}
{"id":"train_551","question":"Mention the venues in which Hui Song published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/51/1785> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has H. Song published papers?"],"info":{}}
{"id":"train_552","question":"What are the papers written by Pierre Castellano and Sridha S. together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/7156> . ?answer dblp:authoredBy <https://dblp.org/pid/80/166> }","paraphrases":["Which papers did Pierre Castellano and Sridha S. write together?"],"info":{}}
{"id":"train_553","question":"List the papers published by Zhao, Wen-Xiao in the last four years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/77/8083> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Wen-Xiao Zhao publish in the last 4 years?"],"info":{}}
{"id":"train_554","question":"Which papers did Jiang, James J. and P. H. Cheney write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/49/4743> . ?answer dblp:authoredBy <https://dblp.org/pid/49/6352> }","paraphrases":["What are the papers written by Jiang, James J. and Paul H. Cheney together?"],"info":{}}
{"id":"train_555","question":"What are the venues in which Fred Cohen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/92/4026> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Fred Cohen published papers?"],"info":{}}
{"id":"train_557","question":"Mention the venues in which Martin Stiemerling published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/45/1079> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Martin Stiemerling published?"],"info":{}}
{"id":"train_559","question":"List the papers published by F. Feldbusch in the last four years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/61/5265> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did F. Feldbusch publish in the last four years?"],"info":{}}
{"id":"train_560","question":"What are the papers written by Zhihua Hao and Xiaojiang Ma together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/46/5604> . ?answer dblp:authoredBy <https://dblp.org/pid/47/4871> }","paraphrases":["Find the papers written by Hao, Zhihua and Xiaojiang Ma together."],"info":{}}
{"id":"train_561","question":"List the papers published by Bruno Sinopoli in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/53/2290> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Sinopoli, Bruno publish in the last four years?"],"info":{}}
{"id":"train_562","question":"List the papers published by Yilmaz, Fatma Gizem Karaoglan in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/159/4023> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Fatma Gizem Karaoglan Yilmaz publish in the last 4 years?"],"info":{}}
{"id":"train_564","question":"In which conferences or journals has Peyman Milanfar published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/48/6882> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Peyman Milanfar published?"],"info":{}}
{"id":"train_565","question":"What are the venues in which Yung, Moti published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/y/MotiYung> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Moti Yung published papers?"],"info":{}}
{"id":"train_566","question":"With which other authors has the author Chang, J. written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/159/2889> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/159/2889> ) }","paraphrases":["Who are the co-authors of Chang, J.?"],"info":{}}
{"id":"train_567","question":"Mention the venues in which Kazuhiro Fukui published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/01/1485> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Kazuhiro Fukui published?"],"info":{}}
{"id":"train_568","question":"Who are the co-authors of Aashish Sharma?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/70/5324> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/70/5324> ) }","paraphrases":["With which other authors has the author Aashish Sharma written papers?"],"info":{}}
{"id":"train_569","question":"Mention the co-authors of David S..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/132/7069> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/132/7069> ) }","paraphrases":["With which other authors has the author David S. written papers?"],"info":{}}
{"id":"train_570","question":"What are the papers written by Hechmi Toumi and Mohamed Hafri together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/118/4223> . ?answer dblp:authoredBy <https://dblp.org/pid/191/2534> }","paraphrases":["Find the papers written by Toumi, Hechmi and Mohamed Hafri together."],"info":{}}
{"id":"train_572","question":"Mention the venues in which Jae Heon Yun published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/99/4859> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Jae Heon Yun published papers?"],"info":{}}
{"id":"train_573","question":"List the papers published by Lepekhina, A. S. in the last three years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/262/4350> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Which papers did Lepekhina, A. S. publish in the last 3 years?"],"info":{}}
{"id":"train_574","question":"What are the venues in which J. Platos published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/2617> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which J. Platos published."],"info":{}}
{"id":"train_576","question":"Who are the co-authors of Yasuyo Kita?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/66/5556> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/66/5556> ) }","paraphrases":["Mention the co-authors of Y. Kita."],"info":{}}
{"id":"train_577","question":"Which papers did Pavel N. Vorobkalov publish in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/235/7536> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["List the papers published by Pavel N. Vorobkalov in the last 3 years."],"info":{}}
{"id":"train_578","question":"List the papers published by Yong Ma in the last 8 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/33/3013> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Which papers did Ma, Yong publish in the last 8 years?"],"info":{}}
{"id":"train_580","question":"With which other authors has the author N. Subramanya written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/319/7131> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/319/7131> ) }","paraphrases":["Who are the co-authors of N. Subramanya?"],"info":{}}
{"id":"train_581","question":"Find the papers written by Barbier, Franck and Nodenot, Thierry together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/13/4588> . ?answer dblp:authoredBy <https://dblp.org/pid/30/1554> }","paraphrases":["Which papers did Franck Barbier and Nodenot, Thierry write together?"],"info":{}}
{"id":"train_582","question":"Mention the venues in which Dague, Philippe published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/35/3908> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Dague, Philippe published papers?"],"info":{}}
{"id":"train_584","question":"Mention the co-authors of Hideki Tode.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/3255> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/30/3255> ) }","paraphrases":["Who are the co-authors of Hideki Tode?"],"info":{}}
{"id":"train_586","question":"In which conferences or journals has Hongwei Qu published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/116/1174> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Hongwei Qu published."],"info":{}}
{"id":"train_589","question":"List the papers published by D. Ramesh in the last 2 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/258/0340> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Which papers did Divya Ramesh publish in the last two years?"],"info":{}}
{"id":"train_590","question":"Which papers did Jiun-In Guo publish in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/33/3059> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["List the papers published by Jiun-In Guo in the last 3 years."],"info":{}}
{"id":"train_591","question":"In which conferences or journals has Wenhua Li published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/41/337> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Wenhua Li published."],"info":{}}
{"id":"train_592","question":"With which other authors has the author S. A. Meijer written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/31/6596> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/31/6596> ) }","paraphrases":["Who are the co-authors of Sebastiaan A. Meijer?"],"info":{}}
{"id":"train_593","question":"What are the papers written by Cutello, V. and Giuseppe Nicosia together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/233> . ?answer dblp:authoredBy <https://dblp.org/pid/28/6928> }","paraphrases":["Which papers did Vincenzo Cutello and Giuseppe Nicosia write together?"],"info":{}}
{"id":"train_594","question":"What are the papers written by Eugenio Faldella and Stefano Caselli together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/5181> . ?answer dblp:authoredBy <https://dblp.org/pid/40/5874> }","paraphrases":["Which papers did Eugenio Faldella and Stefano Caselli write together?"],"info":{}}
{"id":"train_595","question":"Mention the co-authors of Rajmohan Rajaraman.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/r/RRajaraman> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/r/RRajaraman> ) }","paraphrases":["With which other authors has the author Rajaraman, Rajmohan written papers?"],"info":{}}
{"id":"train_596","question":"With which other authors has the author Satzger, B. written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/27/1529> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/27/1529> ) }","paraphrases":["Who are the co-authors of Benjamin Satzger?"],"info":{}}
{"id":"train_597","question":"List the papers published by Kallookaran, Michael in the last 8 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/189/0388> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Which papers did Kallookaran, Michael publish in the last 8 years?"],"info":{}}
{"id":"train_598","question":"What are the venues in which Reza Rafiee published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/35/10429> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Reza Rafiee published."],"info":{}}
{"id":"train_599","question":"What are the venues in which Chen, Pao-Yang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/74/1230> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Chen, Pao-Yang published papers?"],"info":{}}
{"id":"train_601","question":"Who are the co-authors of T. K. Lien?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/86/6352> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/86/6352> ) }","paraphrases":["Mention the co-authors of T. K. Lien."],"info":{}}
{"id":"train_602","question":"Which papers did Vaithilingam Jeyakumar publish in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/v/VaithilingamJeyakumar> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["List the papers published by Jeyakumar, Vaithilingam in the last two years."],"info":{}}
{"id":"train_603","question":"With which other authors has the author Reeta Chhatani written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/175/8191> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/175/8191> ) }","paraphrases":["Who are the co-authors of Reeta C.?"],"info":{}}
{"id":"train_604","question":"What are the papers written by Chen, Ziqian and Gentiane Venture together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/168/3805> . ?answer dblp:authoredBy <https://dblp.org/pid/56/7043> }","paraphrases":["Which papers did Chen, Ziqian and Gentiane Venture write together?"],"info":{}}
{"id":"train_605","question":"In which conferences or journals has Elly A. Konijn published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/3388> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Elly A. Konijn published."],"info":{}}
{"id":"train_607","question":"Which papers did Joan Bresnan publish in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/05/5609> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["List the papers published by Joan B. in the last 9 years."],"info":{}}
{"id":"train_608","question":"What are the papers written by Michael Borkowski and Stefan Schulte together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/188/1821> . ?answer dblp:authoredBy <https://dblp.org/pid/s/StefanSchulte2> }","paraphrases":["Which papers did Borkowski, Michael and S. Schulte write together?"],"info":{}}
{"id":"train_609","question":"Mention the papers published by Jie L. with the author from Xian Jiaotong University.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/88/6731-2> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Xian Jiaotong University, School of Electronic and Information Engineering, China' }","paraphrases":["What research papers did Jie Lin publish with the author affiliated to Xian Jiaotong University, School of Electronic and Information Engineering, China?"],"info":{}}
{"id":"train_610","question":"List the papers published by Dabbene, Fabrizio in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/28/897> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Dabbene, Fabrizio publish in the last 4 years?"],"info":{}}
{"id":"train_611","question":"Which papers did Jia-Chin Lin and Keshav Singh write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/27/1183> . ?answer dblp:authoredBy <https://dblp.org/pid/132/7939> }","paraphrases":["What are the papers written by Jia-Chin Lin and Keshav S. together?"],"info":{}}
{"id":"train_612","question":"Find the papers written by Bernardo Nugroho Yahya and Feri Setiawan together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/92/7976> . ?answer dblp:authoredBy <https://dblp.org/pid/221/3966> }","paraphrases":["Which papers did Bernardo Nugroho Yahya and Setiawan, F. write together?"],"info":{}}
{"id":"train_613","question":"With which other authors has the author Jakub P. written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/7810> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/88/7810> ) }","paraphrases":["Who are the co-authors of Jakub P.?"],"info":{}}
{"id":"train_615","question":"List the papers published by Chin-Wan Chung in the last 5 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/c/ChinWanChung> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["Which papers did Chin-Wan Chung publish in the last five years?"],"info":{}}
{"id":"train_617","question":"Mention the co-authors of Devanshu A..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/140/2713> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/140/2713> ) }","paraphrases":["Who are the co-authors of Devanshu A.?"],"info":{}}
