{"id":"train_5647","question":"Name the authors of 'Ruminating Word Representations with Random Noised Masker' and 'Electronic power transformer to secure the power supply of a mission critical microgrid'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-1911-03459> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-1911-03459> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Ruminating Word Representations with Random Noised Masker' and 'Electronic power transformer to secure the power supply of a mission critical microgrid'?"],"info":{}}
{"id":"train_5649","question":"Name the authors of 'The RERS Grey-Box Challenge 2012: Analysis of Event-Condition-Action Systems' and 'Surfing the Net for Software Engineering Notes'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/isola/HowarIMSB12> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/isola/HowarIMSB12> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'The RERS Grey-Box Challenge 2012: Analysis of Event-Condition-Action Systems' and 'Surfing the Net for Software Engineering Notes'?"],"info":{}}
{"id":"train_5655","question":"Mention the years in which 'A knowledge-driven probabilistic framework for the prediction of protein-protein interaction networks' and 'Snitches, Trolls, and Social Norms: Unpacking Perceptions of Social Media Use for Crime Prevention' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/cbm/BrowneWZA10> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/cscw/IsraniES17> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'A knowledge-driven probabilistic framework for the prediction of protein-protein interaction networks' and 'Snitches, Trolls, and Social Norms: Unpacking Perceptions of Social Media Use for Crime Prevention' published?"],"info":{}}
{"id":"train_5662","question":"Name the authors of 'Revising the IS Model Curriculum: Rethinking the Approach and the Process' and 'The design of dual radio ZigBee homecare gateway for remote patient monitoring'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/cais/TopiVKNSVW07> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/cais/TopiVKNSVW07> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Revising the IS Model Curriculum: Rethinking the Approach and the Process' and the publication 'The design of dual radio ZigBee homecare gateway for remote patient monitoring'?"],"info":{}}
{"id":"train_5663","question":"List the venues in which 'Correction to: Semantic annotation of summarized sensor data stream for effective query processing' and 'An iterative kernel based method for fourth order nonlinear equation with nonlinear boundary condition' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tjs/PachaMS20a> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/cnsns/AzarnavidPA18> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'Correction to: Semantic annotation of summarized sensor data stream for effective query processing' and 'An iterative kernel based method for fourth order nonlinear equation with nonlinear boundary condition' were published."],"info":{}}
{"id":"train_5666","question":"Mention the venues in which 'Fast Convolution Operations on Many-Core Architectures' and 'Trigonometric Interpolation Kernel to Construct Deformable Shapes for User-Interactive Applications' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/hpcc/LiZXS15> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/spl/SchmitterDU15> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Fast Convolution Operations on Many-Core Architectures' and 'Trigonometric Interpolation Kernel to Construct Deformable Shapes for User-Interactive Applications' were published."],"info":{}}
{"id":"train_5668","question":"Name the authors of 'Performance Analysis of a Cognitive Radio Network With a Buffered Relay' and 'NaNet: a Low-Latency, Real-Time, Multi-Standard Network Interface Card with GPUDirect Features'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tvt/TranZPS15> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/tvt/TranZPS15> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Performance Analysis of a Cognitive Radio Network With a Buffered Relay' and 'NaNet: a Low-Latency, Real-Time, Multi-Standard Network Interface Card with GPUDirect Features'?"],"info":{}}
{"id":"train_5672","question":"Mention the venues in which 'Interpolatory ternary subdivision surfaces' and 'C2POWER Approach for Power Saving in Multi-standard Wireless Devices' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/cagd/LiM06> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/mobimedia/RadwanRGS10> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Interpolatory ternary subdivision surfaces' and 'C2POWER Approach for Power Saving in Multi-standard Wireless Devices' published?"],"info":{}}
{"id":"train_5674","question":"List the venues in which 'Performance-Oriented Knowledge Management Approach: The KP3 Methodology' and 'Advanced control solutions to increase efficiency of a furnace combustion process' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/hicss/AhnC02> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/eucc/ZanoliBAB13> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Performance-Oriented Knowledge Management Approach: The KP3 Methodology' and 'Advanced control solutions to increase efficiency of a furnace combustion process' published?"],"info":{}}
{"id":"train_5680","question":"Mention the venues in which 'Sensitivity analysis of the Eisenberg-Noe model of contagion' and 'Performance of Querying Temporal Attributes in Object-Relational Databases' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/orl/LiuS10> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/time/KleinerL02> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Sensitivity analysis of the Eisenberg-Noe model of contagion' and 'Performance of Querying Temporal Attributes in Object-Relational Databases' published?"],"info":{}}
{"id":"train_5682","question":"Mention the years in which 'An integrated framework for posture recognition' and 'Comparing and Combining Approximate Computing Frameworks' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ijaip/MadanSH18> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-2102-08771> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'An integrated framework for posture recognition' and 'Comparing and Combining Approximate Computing Frameworks' published?"],"info":{}}
{"id":"train_5687","question":"Mention the years in which 'Application of Agile Development Methodology and User-Centered Design for the Interdisciplinary Project Zuku' and 'A 2\\u00D71 LINC Transceiver for Enhanced Power Transmission in Wireless Systems' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/hci/VilcapomaP18> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/jece/ElaalG07> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Application of Agile Development Methodology and User-Centered Design for the Interdisciplinary Project Zuku' and 'A 2\\u00D71 LINC Transceiver for Enhanced Power Transmission in Wireless Systems' published?"],"info":{}}
{"id":"train_5692","question":"Name the authors of 'Randomness-efficient low degree tests and short PCPs via epsilon-biased sets' and 'High-Performance IIR QMF Banks for Speech Subband Coding'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/stoc/Ben-SassonSVW03> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/stoc/Ben-SassonSVW03> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Randomness-efficient low degree tests and short PCPs via epsilon-biased sets' and 'High-Performance IIR QMF Banks for Speech Subband Coding'?"],"info":{}}
{"id":"train_5698","question":"Who are the authors of the paper 'Automatization of the mexican fruit fly activity recognition process using 3D and gray-level features' and the publication 'A safe authentication system for distance education'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/acst/Hernandez-RodriguezRCL06> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/acst/Hernandez-RodriguezRCL06> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Automatization of the mexican fruit fly activity recognition process using 3D and gray-level features' and 'A safe authentication system for distance education'?"],"info":{}}
{"id":"train_5701","question":"Mention the years in which 'Topological properties of hierarchical cubic networks' and 'Remote Recording of Emotional and Activity Data: A Methodological Study' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jsa/ChiangC96> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-2104-05843> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Topological properties of hierarchical cubic networks' and 'Remote Recording of Emotional and Activity Data: A Methodological Study' published?"],"info":{}}
{"id":"train_5702","question":"Mention the venues in which 'Addressing the IT skills crisis: gender and the IT profession (panel)' and 'Identifying and Addressing Design and Policy Challenges in Online Content Moderation' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icis/LeeNTV00> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/chi/Jiang20> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Addressing the IT skills crisis: gender and the IT profession (panel)' and 'Identifying and Addressing Design and Policy Challenges in Online Content Moderation' published?"],"info":{}}
{"id":"train_5703","question":"List the venues in which 'High-resolution Ultrasonic Echo Detection with Two-stage Recurrent Neural Network' and 'The Floodlight Problem' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icit/PanXZMLS20> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/cccg/BoseGLOSU93> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'High-resolution Ultrasonic Echo Detection with Two-stage Recurrent Neural Network' and 'The Floodlight Problem' were published."],"info":{}}
{"id":"train_5704","question":"List the venues in which 'European national news' and 'Faux-Riccati synthesis of nonlinear observer-based compensators for discrete-time nonlinear systems' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/clsr/Turner11e> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/cdc/PrachTB14> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'European national news' and 'Faux-Riccati synthesis of nonlinear observer-based compensators for discrete-time nonlinear systems' were published."],"info":{}}
{"id":"train_5705","question":"Mention the years in which 'Entwicklung und Anwendung von Expertensystemen auf Personal Computern' and 'Olympic and Paralympic Games Project Structure and Governance: The Case of Olympic and Paralympic Games' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/robotersysteme/MertensS87> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/ijitpm/LimaPSCD22> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Entwicklung und Anwendung von Expertensystemen auf Personal Computern' and 'Olympic and Paralympic Games Project Structure and Governance: The Case of Olympic and Paralympic Games' published?"],"info":{}}
{"id":"train_5708","question":"Mention the venues in which 'Analysis of high resolution NMR spectra using a minicomputer' and 'Fault-tolerant sorting in SIMD hypercubes' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/candc/Schrey80> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/ipps/MishraCBL95> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Analysis of high resolution NMR spectra using a minicomputer' and 'Fault-tolerant sorting in SIMD hypercubes' published?"],"info":{}}
{"id":"train_5709","question":"List the venues in which 'Subword-based Deep Averaging Networks for Author Profiling in Social Media' and 'Stable subspace tracking algorithm based on signed URV decomposition' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/clef/Franco-Salvador17> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/icassp/ZhouV11> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Subword-based Deep Averaging Networks for Author Profiling in Social Media' and 'Stable subspace tracking algorithm based on signed URV decomposition' published?"],"info":{}}
{"id":"train_5711","question":"Who are the authors of the paper 'Feedback Stabilization of Switched Linear Systems With Unknown Disturbances Under Data-Rate Constraints' and the publication 'Model-driven standardization of public authority data interchange'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tac/YangL18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/tac/YangL18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Feedback Stabilization of Switched Linear Systems With Unknown Disturbances Under Data-Rate Constraints' and 'Model-driven standardization of public authority data interchange'?"],"info":{}}
{"id":"train_5712","question":"Mention the years in which 'A Probabilistic Answer Type Model' and 'UN-SCAN-IT Version 50 for Windows' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/eacl/PinchakL06> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/jcisd/Edwards02a> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'A Probabilistic Answer Type Model' and 'UN-SCAN-IT Version 50 for Windows' published?"],"info":{}}
{"id":"train_5714","question":"List the venues in which 'Behavior of the partial correlation coefficients of a least squares lattice filter in the presence of a nonstationary chirp input' and 'Further investigation on time-domain maximum likelihood estimation of chirp signal parameters' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tsp/SoniZK95> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/iet-spr/DengYFLZ13> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Behavior of the partial correlation coefficients of a least squares lattice filter in the presence of a nonstationary chirp input' and 'Further investigation on time-domain maximum likelihood estimation of chirp signal parameters' published?"],"info":{}}
{"id":"train_5715","question":"Mention the venues in which 'ETSIT-UPM experiences in hands-on nanosatellite activities' and 'Simulation from the Tail of the Univariate and Multivariate Normal Distribution' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/educon/Martinez12> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/books/sp/19/BotevL19> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'ETSIT-UPM experiences in hands-on nanosatellite activities' and 'Simulation from the Tail of the Univariate and Multivariate Normal Distribution' were published."],"info":{}}
{"id":"train_5717","question":"Name the authors of 'PASTA: Ultra-Large Multiple Sequence Alignment' and 'The expansion of immaculate functions in the ribbon basis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/recomb/MirarabNW14> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/recomb/MirarabNW14> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'PASTA: Ultra-Large Multiple Sequence Alignment' and the publication 'The expansion of immaculate functions in the ribbon basis'?"],"info":{}}
{"id":"train_5719","question":"Mention the venues in which 'A Business Process Based Method for Capability Modelling' and 'Wavelet-Based MPNLMS Adaptive Algorithm for Network Echo Cancellation' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/bir/KocS15> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/ejasmp/DengD07> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'A Business Process Based Method for Capability Modelling' and 'Wavelet-Based MPNLMS Adaptive Algorithm for Network Echo Cancellation' published?"],"info":{}}
{"id":"train_5722","question":"Mention the venues in which 'Minimising risks in IT outsourcing: Choosing target services' and 'DenseZDD: A Compact and Fast Index for Families of Sets' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/pacis/RouseC03> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/algorithms/DenzumiKTAMS18> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Minimising risks in IT outsourcing: Choosing target services' and 'DenseZDD: A Compact and Fast Index for Families of Sets' published?"],"info":{}}
{"id":"train_5723","question":"Mention the venues in which 'Biometrics on smart cards: An approach to keyboard behavioral signature' and 'Mobility Analysis of Two Exechon-Liked Parallel Mechanisms' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/fgcs/Alexandre97> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/icira/ChaiCML13> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Biometrics on smart cards: An approach to keyboard behavioral signature' and 'Mobility Analysis of Two Exechon-Liked Parallel Mechanisms' published?"],"info":{}}
{"id":"train_5724","question":"Name the authors of 'New constructing method of Lyapunov-Krasovskii functionals for stability of time-varying delay systems' and 'The New Normal? Motivators for and Hindrances to Telework'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iecon/ZhenmanYM17> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/iecon/ZhenmanYM17> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'New constructing method of Lyapunov-Krasovskii functionals for stability of time-varying delay systems' and the publication 'The New Normal? Motivators for and Hindrances to Telework'?"],"info":{}}
{"id":"train_5725","question":"Mention the venues in which 'An online cost sensitive decision-making method in crowdsourcing systems' and 'Symbol timing recovery in digital subscribers loops in the presence of residual echo and crosstalk' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/sigmod/GaoLOWC13> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/tcom/Panayirci93> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'An online cost sensitive decision-making method in crowdsourcing systems' and 'Symbol timing recovery in digital subscribers loops in the presence of residual echo and crosstalk' were published."],"info":{}}
{"id":"train_5727","question":"List the venues in which 'Ontology-based Management of Pervasive Systems' and 'A Study on Indoor Positioning System Based on Attitude Estimation by Sensors and Distance Estimation by SOKUIKI Sensor' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/series/faia/DimakisSP07> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/gcce/SasakiF18> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Ontology-based Management of Pervasive Systems' and 'A Study on Indoor Positioning System Based on Attitude Estimation by Sensors and Distance Estimation by SOKUIKI Sensor' published?"],"info":{}}
{"id":"train_5732","question":"Who are the authors of the paper 'A User-Centered Approach to Affective Interaction' and the publication 'Contention resolution in a non-synchronized multiple access channel'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/acii/SundstromSH05> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/acii/SundstromSH05> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'A User-Centered Approach to Affective Interaction' and 'Contention resolution in a non-synchronized multiple access channel'?"],"info":{}}
{"id":"train_5734","question":"Name the authors of 'Discovering Problem-Solving Knowledge in Business Emails - Traceability in Software Design Using Computer Mediated Communication' and 'Dual Sourcing and Joint Replenishment of Hospital Supplies'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/ic3k/FrancoisMA14> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/ic3k/FrancoisMA14> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Discovering Problem-Solving Knowledge in Business Emails - Traceability in Software Design Using Computer Mediated Communication' and 'Dual Sourcing and Joint Replenishment of Hospital Supplies'?"],"info":{}}
{"id":"train_5740","question":"Who are the authors of the paper 'Three Body Problem Applied to the Helium Atom System: The Independent Electron Approximation (IEA)' and the publication 'Prototyping of Digital Ink E-Mail System Based on a Common Ink Format'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/isum/Ramirez-Velasquez19a> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/isum/Ramirez-Velasquez19a> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Three Body Problem Applied to the Helium Atom System: The Independent Electron Approximation (IEA)' and 'Prototyping of Digital Ink E-Mail System Based on a Common Ink Format'?"],"info":{}}
{"id":"train_5741","question":"Mention the venues in which 'Guest Editorial' and 'New results about the H-measure of a set' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/iet-spr/ZaidiMISG16> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/ifip7-2/Barbulescu02> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Guest Editorial' and 'New results about the H-measure of a set' published?"],"info":{}}
{"id":"train_5743","question":"Mention the years in which 'Adaptive hybrid digital-analog video transmission in wireless mobile networks' and 'Using Compression Energy Efficiently in Mobile Environment' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icccn/ZhaoL14> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/greencom/SillastoWM10> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Adaptive hybrid digital-analog video transmission in wireless mobile networks' and 'Using Compression Energy Efficiently in Mobile Environment' published?"],"info":{}}
{"id":"train_5745","question":"Who are the authors of the paper 'Development of a joystick-controlled optically-induced dielectrophoresis platform for real-time micromanipulation' and the publication 'Decoupling Change from Design'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/robio/SamLLWXL13> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/robio/SamLLWXL13> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Development of a joystick-controlled optically-induced dielectrophoresis platform for real-time micromanipulation' and 'Decoupling Change from Design'?"],"info":{}}
{"id":"train_5746","question":"Who are the authors of the paper 'Tests of fit for the three-parameter lognormal distribution' and the publication 'Reproducibility in Computing Research: An Empirical Study'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/csda/Chen06> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/csda/Chen06> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Tests of fit for the three-parameter lognormal distribution' and 'Reproducibility in Computing Research: An Empirical Study'?"],"info":{}}
{"id":"train_5748","question":"Mention the years in which 'A Spin-Glass Model for Semi-Supervised Community Detection' and 'Color Image Watermarking Algorithm Using BPN Neural Networks' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/aaai/EatonM12> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/iconip/PiaoCH06> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'A Spin-Glass Model for Semi-Supervised Community Detection' and 'Color Image Watermarking Algorithm Using BPN Neural Networks' published?"],"info":{}}
{"id":"train_5749","question":"Who are the authors of 'Visualization of volcanic ash clouds' and 'Universal WWW Access for Heterogeneous Client Devices'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/cga/RothG95> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/cga/RothG95> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Visualization of volcanic ash clouds' and the publication 'Universal WWW Access for Heterogeneous Client Devices'?"],"info":{}}
{"id":"train_5751","question":"List the venues in which 'An OpenCL implementation of a forward sampling algorithm for CP-logic' and 'Reduction in The Metabolic Cost of Human Walking Gaits Using Quasi-Passive Upper Body Exoskeleton' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ijar/RanstV15> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/ismr/EbrahimiMJ19> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'An OpenCL implementation of a forward sampling algorithm for CP-logic' and 'Reduction in The Metabolic Cost of Human Walking Gaits Using Quasi-Passive Upper Body Exoskeleton' published?"],"info":{}}
{"id":"train_5752","question":"Mention the venues in which 'Robust multiple kernel subspace clustering with block diagonal representation and low-rank consensus kernel' and 'BEEINFO: Interest-Based Forwarding Using Artificial Bee Colony for Socially Aware Networking' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/kbs/ZhangXSLGG21> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/tvt/XiaLLAYM15> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Robust multiple kernel subspace clustering with block diagonal representation and low-rank consensus kernel' and 'BEEINFO: Interest-Based Forwarding Using Artificial Bee Colony for Socially Aware Networking' published?"],"info":{}}
{"id":"train_5753","question":"Mention the venues in which 'Subjective voice quality evaluation of artificial bandwidth extension: comparing different audio bandwidths and speech codecs' and 'Digits Speech Recognition Based on Geometrical Learning' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/interspeech/PulakkaRMTA14> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/adma/CaoPWH05> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Subjective voice quality evaluation of artificial bandwidth extension: comparing different audio bandwidths and speech codecs' and 'Digits Speech Recognition Based on Geometrical Learning' published?"],"info":{}}
{"id":"train_5754","question":"List the venues in which 'Configurable Text Stamp Identification Tool with Application of Fuzzy Logic' and 'Word RNN as a Baseline for Sentence Completion' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/das/HeD04> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/cist/ParkCP18> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Configurable Text Stamp Identification Tool with Application of Fuzzy Logic' and 'Word RNN as a Baseline for Sentence Completion' published?"],"info":{}}
{"id":"train_5755","question":"Name the authors of 'Threshold-based clustering with merging and regularization in application to network intrusion detection' and 'The accuracy of sea surface temperature fields from the advanced along track scanning radiometer'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/csda/Nikulin06> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/csda/Nikulin06> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Threshold-based clustering with merging and regularization in application to network intrusion detection' and 'The accuracy of sea surface temperature fields from the advanced along track scanning radiometer'?"],"info":{}}
