{"id":"train_5253","question":"Have the authors of the paper 'Optimizing Spaced $k$-mer Neighbors for Efficient Filtration in Protein Similarity Search' not not published a publication in IEEE ACM Trans. Comput. Biol. Bioinform.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcbb/LiMZ14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tcbb/LiMZ14> ) . ?y dblp:publishedIn 'IEEE ACM Trans. Comput. Biol. Bioinform.' }","paraphrases":["Haven't the authors of the publication 'Optimizing Spaced $k$-mer Neighbors for Efficient Filtration in Protein Similarity Search' not published a publication in IEEE ACM Trans. Comput. Biol. Bioinform.?"],"info":{}}
{"id":"train_5254","question":"Was the publication 'Productivity Improvement Through Multi-Objective Simulation Optimization - A Case Study' not not published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/AldurgamAAS19> dblp:yearOfPublication '2019' }","paraphrases":["Was the paper 'Productivity Improvement Through Multi-Objective Simulation Optimization - A Case Study' not not published in the year 2019?"],"info":{}}
{"id":"train_5256","question":"Was the paper 'MorphoCluster: Efficient Annotation of Plankton Images by Clustering' not not published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/SchroderKK20> dblp:yearOfPublication '2020' }","paraphrases":["Was 'MorphoCluster: Efficient Annotation of Plankton Images by Clustering' not not published in 2020?"],"info":{}}
{"id":"train_5257","question":"Was the paper 'A Study on Robot Task Planning Problems in Multiagent Enviroments' not not published in the year 1995?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icra/KawakamiK95> dblp:yearOfPublication '1995' }","paraphrases":["Was the publication 'A Study on Robot Task Planning Problems in Multiagent Enviroments' not not published in 1995?"],"info":{}}
{"id":"train_5259","question":"Have the authors of the paper 'Topology aware functional similarity of protein interaction networks based on gene ontology' not not published a publication in EMBC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/0004CXBW11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/embc/0004CXBW11> ) . ?y dblp:publishedIn 'EMBC' }","paraphrases":["Haven't the authors of the publication 'Topology aware functional similarity of protein interaction networks based on gene ontology' not published a publication in EMBC?"],"info":{}}
{"id":"train_5261","question":"Was 'How to communicate uncertainty in severe weather forecasts?\\u2028' not not published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cogsci/FleischhutHH17> dblp:yearOfPublication '2017' }","paraphrases":["Was the paper 'How to communicate uncertainty in severe weather forecasts?\\u2028' not not published in the year 2017?"],"info":{}}
{"id":"train_5262","question":"Was 'A 15-ns Switching Time, 9-Bit Current-Mode DAC for High Speed Laser Diode Drivers' not not published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscas/LupoBPCRNB20> dblp:yearOfPublication '2020' }","paraphrases":["Was the paper 'A 15-ns Switching Time, 9-Bit Current-Mode DAC for High Speed Laser Diode Drivers' not not published in the year 2020?"],"info":{}}
{"id":"train_5263","question":"Haven't the authors of the publication 'Channel Tracking using Pruning for MIMO-OFDM Systems over Gauss-Markov Channels' not published a publication in ICASSP (3)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/NevatY07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icassp/NevatY07> ) . ?y dblp:publishedIn 'ICASSP (3)' }","paraphrases":["Did the authors of the publication 'Channel Tracking using Pruning for MIMO-OFDM Systems over Gauss-Markov Channels' not not publish a paper in ICASSP (3)?"],"info":{}}
{"id":"train_5264","question":"Was the publication 'User Association and Resource Allocation in Full-Duplex Relay Aided NOMA Systems' not not published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iotj/WangALF19> dblp:yearOfPublication '2019' }","paraphrases":["Was the paper 'User Association and Resource Allocation in Full-Duplex Relay Aided NOMA Systems' not not published in the year 2019?"],"info":{}}
{"id":"train_5266","question":"Was the publication 'Indoor Localization with Aircraft Signals' not not published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sensys/EichelbergerLTW17> dblp:yearOfPublication '2017' }","paraphrases":["Was 'Indoor Localization with Aircraft Signals' not not published in 2017?"],"info":{}}
{"id":"train_5269","question":"Have the authors of the paper 'Maintaining Object Ordering in a Shared P2P Storage Environment' not not published a publication in IEEE Security in Storage Workshop?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sisw/CaronniRS05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sisw/CaronniRS05> ) . ?y dblp:publishedIn 'IEEE Security in Storage Workshop' }","paraphrases":["Did the authors of 'Maintaining Object Ordering in a Shared P2P Storage Environment' not not publish a paper in IEEE Security in Storage Workshop?"],"info":{}}
{"id":"train_5270","question":"Was 'CLF networks with dynamic attention phase' not not published in 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icnn/HernadiJ96> dblp:yearOfPublication '1996' }","paraphrases":["Was the paper 'CLF networks with dynamic attention phase' not not published in the year 1996?"],"info":{}}
{"id":"train_5271","question":"Was the paper 'A Meta-Programming Technique for Debugging Answer-Set Programs' not not published in the year 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaai/GebserPST08> dblp:yearOfPublication '2008' }","paraphrases":["Was the publication 'A Meta-Programming Technique for Debugging Answer-Set Programs' not not published in 2008?"],"info":{}}
{"id":"train_5274","question":"Did the authors of 'A novel notion in rough set theory: Invariant subspace' not not publish a paper in Fuzzy Sets Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fss/GaoM22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/fss/GaoM22> ) . ?y dblp:publishedIn 'Fuzzy Sets Syst.' }","paraphrases":["Have the authors of the paper 'A novel notion in rough set theory: Invariant subspace' not not published a publication in Fuzzy Sets Syst.?"],"info":{}}
{"id":"train_5275","question":"Was the publication 'On the efficiency of connection charges under renewable integration in distribution systems' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ita/Munoz-AlvarezT16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'On the efficiency of connection charges under renewable integration in distribution systems' not not published in the year 2016?"],"info":{}}
{"id":"train_5276","question":"Was the publication 'Performance of cepstrum-based deconvolution for DOA estimation in the presence of room reverberation' not not published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gcce/NagaseOF14> dblp:yearOfPublication '2014' }","paraphrases":["Was the paper 'Performance of cepstrum-based deconvolution for DOA estimation in the presence of room reverberation' not not published in the year 2014?"],"info":{}}
{"id":"train_5277","question":"Haven't the authors of the publication 'P-CSREC: A New Approach for Personalized Cloud Service Recommendation' not published a publication in IEEE Access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/ZhangLLHW0P18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/access/ZhangLLHW0P18> ) . ?y dblp:publishedIn 'IEEE Access' }","paraphrases":["Did the authors of the publication 'P-CSREC: A New Approach for Personalized Cloud Service Recommendation' not not publish a paper in IEEE Access?"],"info":{}}
{"id":"train_5279","question":"Was 'Variable step-size matching pursuit based on oblique projection for compressed sensing' not not published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iet-ipr/LiYGZF20> dblp:yearOfPublication '2020' }","paraphrases":["Was the paper 'Variable step-size matching pursuit based on oblique projection for compressed sensing' not not published in the year 2020?"],"info":{}}
{"id":"train_5280","question":"Was the publication 'Undergraduate Students' Preferences for Friendsourcing on Facebook Vs Group Messaging Applications' not not published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/KhojastehF17> dblp:yearOfPublication '2017' }","paraphrases":["Was the paper 'Undergraduate Students' Preferences for Friendsourcing on Facebook Vs Group Messaging Applications' not not published in the year 2017?"],"info":{}}
{"id":"train_5281","question":"Was the publication 'Crowdsourcing, Mixed Elastic Systems and Human-Enhanced Computing-A Survey' not not published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsc/JarrettBS18> dblp:yearOfPublication '2018' }","paraphrases":["Was the paper 'Crowdsourcing, Mixed Elastic Systems and Human-Enhanced Computing-A Survey' not not published in the year 2018?"],"info":{}}
{"id":"train_5283","question":"Haven't the authors of the publication 'On Electromagnetic Scattering from a Penetrable Corner' not published a publication in SIAM J. Math. Anal.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamma/LiuX17a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/siamma/LiuX17a> ) . ?y dblp:publishedIn 'SIAM J. Math. Anal.' }","paraphrases":["Did the authors of 'On Electromagnetic Scattering from a Penetrable Corner' not not publish a paper in SIAM J. Math. Anal.?"],"info":{}}
{"id":"train_5284","question":"Was 'An All-Integer Algorithm for Drawing Anti-aliased Straight Lines' not not published in 1994?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cgf/Yong-Kui94> dblp:yearOfPublication '1994' }","paraphrases":["Was the paper 'An All-Integer Algorithm for Drawing Anti-aliased Straight Lines' not not published in the year 1994?"],"info":{}}
{"id":"train_5285","question":"Was the paper 'Uncertainty measures for evidential reasoning II: A new measure of total uncertainty' not not published in the year 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijar/PalBH93> dblp:yearOfPublication '1993' }","paraphrases":["Was the publication 'Uncertainty measures for evidential reasoning II: A new measure of total uncertainty' not not published in 1993?"],"info":{}}
{"id":"train_5286","question":"Haven't the authors of the publication 'Modeling Crosscutting Services with UML Sequence Diagrams' not published a publication in MoDELS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/uml/DeublerMRK05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/uml/DeublerMRK05> ) . ?y dblp:publishedIn 'MoDELS' }","paraphrases":["Did the authors of the publication 'Modeling Crosscutting Services with UML Sequence Diagrams' not not publish a paper in MoDELS?"],"info":{}}
{"id":"train_5287","question":"Was the publication 'Online discriminative object tracking with local sparse representation' not not published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wacv/WangCXY12> dblp:yearOfPublication '2012' }","paraphrases":["Was the paper 'Online discriminative object tracking with local sparse representation' not not published in the year 2012?"],"info":{}}
{"id":"train_5289","question":"Haven't the authors of the publication 'Generating Text with Deep Reinforcement Learning' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/Guo15b> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/Guo15b> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Did the authors of the publication 'Generating Text with Deep Reinforcement Learning' not not publish a paper in CoRR?"],"info":{}}
{"id":"train_5290","question":"Was 'A probabilistic Hough transform' not not published in 1991?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pr/KiryatiEB91> dblp:yearOfPublication '1991' }","paraphrases":["Was the paper 'A probabilistic Hough transform' not not published in the year 1991?"],"info":{}}
{"id":"train_5291","question":"Was the paper 'Per Garment Capture and Synthesis for Real-time Virtual Try-on' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/uist/ChongSUI21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Per Garment Capture and Synthesis for Real-time Virtual Try-on' not not published in 2021?"],"info":{}}
{"id":"train_5293","question":"Haven't the authors of the publication 'Keywords Extracting as Text ChanceDiscovery' not published a publication in FSKD?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fskd/ZhangC07a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/fskd/ZhangC07a> ) . ?y dblp:publishedIn 'FSKD (2)' }","paraphrases":["Did the authors of 'Keywords Extracting as Text ChanceDiscovery' not not publish a paper in FSKD (2)?"],"info":{}}
{"id":"train_5294","question":"Have the authors of the paper 'Fast rates for prediction with limited expert advice' not not published a publication in NeurIPS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nips/SaadB21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/nips/SaadB21> ) . ?y dblp:publishedIn 'NeurIPS' }","paraphrases":["Did the authors of 'Fast rates for prediction with limited expert advice' not not publish a paper in NeurIPS?"],"info":{}}
{"id":"train_5295","question":"Was 'Family practice clerkship encounters documented with structured phrases on paper and hand-held computer logs' not not published in 2000?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amia/MarshallS00> dblp:yearOfPublication '2000' }","paraphrases":["Was the paper 'Family practice clerkship encounters documented with structured phrases on paper and hand-held computer logs' not not published in the year 2000?"],"info":{}}
{"id":"train_5299","question":"Was the publication 'Residual-Quantization Based Code Design for Compressing Noisy Sources With Arbitrary Decoder Side Information' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcom/WeiLLSP16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'Residual-Quantization Based Code Design for Compressing Noisy Sources With Arbitrary Decoder Side Information' not not published in the year 2016?"],"info":{}}
{"id":"train_5300","question":"Haven't the authors of the publication 'Intrapreneurship: a comparative structural equation modeling study' not published a publication in Ind. Manag. Data Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/imds/Antoncic07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/imds/Antoncic07> ) . ?y dblp:publishedIn 'Ind. Manag. Data Syst.' }","paraphrases":["Have the authors of the paper 'Intrapreneurship: a comparative structural equation modeling study' not not published a publication in Ind. Manag. Data Syst.?"],"info":{}}
{"id":"train_5301","question":"Was 'Architectural Solutions for Mobile RFID Services for the Internet of Things' not not published in 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/services/MichaelD08> dblp:yearOfPublication '2008' }","paraphrases":["Was the paper 'Architectural Solutions for Mobile RFID Services for the Internet of Things' not not published in the year 2008?"],"info":{}}
{"id":"train_5302","question":"Did the authors of 'Experimental Study on Low Power Wide Area Networks (LPWAN) for Mobile Internet of Things' not not publish a paper in VTC Spring?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vtc/PatelW17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/vtc/PatelW17> ) . ?y dblp:publishedIn 'VTC Spring' }","paraphrases":["Haven't the authors of the publication 'Experimental Study on Low Power Wide Area Networks (LPWAN) for Mobile Internet of Things' not published a publication in VTC Spring?"],"info":{}}
{"id":"train_5303","question":"Have the authors of the paper 'A 06-V pseudo-differential OTA with switched-opamp technique for low power applications' not not published a publication in Microelectron. J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mj/WangLZ19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/mj/WangLZ19> ) . ?y dblp:publishedIn 'Microelectron. J.' }","paraphrases":["Haven't the authors of the publication 'A 06-V pseudo-differential OTA with switched-opamp technique for low power applications' not published a publication in Microelectron. J.?"],"info":{}}
{"id":"train_5304","question":"Was the publication 'Dynamic Secure Routing Game in Distributed Cognitive Radio Networks' not not published in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/ZhuSB11> dblp:yearOfPublication '2011' }","paraphrases":["Was the paper 'Dynamic Secure Routing Game in Distributed Cognitive Radio Networks' not not published in the year 2011?"],"info":{}}
{"id":"train_5305","question":"Have the authors of the paper 'Stability Analysis of Swarm with Gaussian Attractant/Repellent Profiles' not not published a publication in JCAI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/jcai/LiuYZ09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/jcai/LiuYZ09> ) . ?y dblp:publishedIn 'JCAI' }","paraphrases":["Haven't the authors of the publication 'Stability Analysis of Swarm with Gaussian Attractant/Repellent Profiles' not published a publication in JCAI?"],"info":{}}
{"id":"train_5306","question":"Have the authors of the paper 'Peak Temperature Minimization via Task Allocation and Splitting for Heterogeneous MPSoC Real-Time Systems' not not published a publication in J. Signal Process. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/vlsisp/ZhouYCW16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/vlsisp/ZhouYCW16> ) . ?y dblp:publishedIn 'J. Signal Process. Syst.' }","paraphrases":["Did the authors of the publication 'Peak Temperature Minimization via Task Allocation and Splitting for Heterogeneous MPSoC Real-Time Systems' not not publish a paper in J. Signal Process. Syst.?"],"info":{}}
{"id":"train_5307","question":"Have the authors of the paper 'Benchmarking two types of restricted transitive closure algorithms' not not published a publication in COMPSAC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/compsac/ToptsisYN90> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/compsac/ToptsisYN90> ) . ?y dblp:publishedIn 'COMPSAC' }","paraphrases":["Did the authors of 'Benchmarking two types of restricted transitive closure algorithms' not not publish a paper in International Computer Software and Applications Conference?"],"info":{}}
{"id":"train_5308","question":"Was the publication 'Dynamic media selection between WiFi and LTE in telemedicine scenarios' not not published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icacci/BhatMR17> dblp:yearOfPublication '2017' }","paraphrases":["Was the paper 'Dynamic media selection between WiFi and LTE in telemedicine scenarios' not not published in the year 2017?"],"info":{}}
{"id":"train_5310","question":"Did the authors of the publication 'Towards Accessible Mental Healthcare through Augmented Reality and Self-Assessment Tools' not not publish a paper in Int. J. Online Biomed. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijoe/LushBEB20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijoe/LushBEB20> ) . ?y dblp:publishedIn 'Int. J. Online Biomed. Eng.' }","paraphrases":["Haven't the authors of the publication 'Towards Accessible Mental Healthcare through Augmented Reality and Self-Assessment Tools' not published a publication in Int. J. Online Biomed. Eng.?"],"info":{}}
{"id":"train_5311","question":"Did the authors of 'Adaptive Decoupling Control Using Radial Basis Function Neural Network for Permanent Magnet Synchronous Motor Considering Uncertain and Time-Varying Parameters' not not publish a paper in IEEE Access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/JieZZXG20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/access/JieZZXG20> ) . ?y dblp:publishedIn 'IEEE Access' }","paraphrases":["Haven't the authors of the publication 'Adaptive Decoupling Control Using Radial Basis Function Neural Network for Permanent Magnet Synchronous Motor Considering Uncertain and Time-Varying Parameters' not published a publication in IEEE Access?"],"info":{}}
{"id":"train_5312","question":"Was the paper 'Privacy Preserving Occupancy Detection Using NB IoT Sensors' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccece/ChandVMA21> dblp:yearOfPublication '2021' }","paraphrases":["Was 'Privacy Preserving Occupancy Detection Using NB IoT Sensors' not not published in 2021?"],"info":{}}
{"id":"train_5314","question":"Have the authors of the paper 'P2P Queries Routing Using Distributed Knowledge' not not published a publication in DEIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/deis/IsmailBI11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/deis/IsmailBI11> ) . ?y dblp:publishedIn 'DEIS' }","paraphrases":["Did the authors of the publication 'P2P Queries Routing Using Distributed Knowledge' not not publish a paper in DEIS?"],"info":{}}
{"id":"train_5315","question":"Was 'SNARE: sensor node attached reputation evaluator' not not published in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/conext/MaaroufN06> dblp:yearOfPublication '2006' }","paraphrases":["Was the paper 'SNARE: sensor node attached reputation evaluator' not not published in the year 2006?"],"info":{}}
{"id":"train_5317","question":"Haven't the authors of the publication 'Importance of Community Influence and Meter Message on Brand Value Co-creation: a Study In Social Commerce Research - in - Progress' not published a publication in CONF-IRM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/conf-irm/MaGLHC18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/conf-irm/MaGLHC18> ) . ?y dblp:publishedIn 'CONF-IRM' }","paraphrases":["Did the authors of the publication 'Importance of Community Influence and Meter Message on Brand Value Co-creation: a Study In Social Commerce Research - in - Progress' not not publish a paper in CONF-IRM?"],"info":{}}
{"id":"train_5318","question":"Haven't the authors of the publication 'A participatory approach to design spatial scenarios of cropping systems and assess their effects on phoma stem canker management at a regional scale' not published a publication in Environ. Model. Softw.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/envsoft/HossardJPPS13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/envsoft/HossardJPPS13> ) . ?y dblp:publishedIn 'Environ. Model. Softw.' }","paraphrases":["Did the authors of 'A participatory approach to design spatial scenarios of cropping systems and assess their effects on phoma stem canker management at a regional scale' not not publish a paper in Environ. Model. Softw.?"],"info":{}}
{"id":"train_5319","question":"Was the paper 'On matrix-product structure of repeated-root constacyclic codes over finite fields' not not published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dm/CaoCDFM20> dblp:yearOfPublication '2020' }","paraphrases":["Was 'On matrix-product structure of repeated-root constacyclic codes over finite fields' not not published in 2020?"],"info":{}}
{"id":"train_5320","question":"Haven't the authors of the publication 'Sparse Ellipsometry: Portable Acquisition of Polarimetric SVBRDF and Shape with Unstructured Flash Photography' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2207-04236> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2207-04236> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Did the authors of 'Sparse Ellipsometry: Portable Acquisition of Polarimetric SVBRDF and Shape with Unstructured Flash Photography' not not publish a paper in CoRR?"],"info":{}}
{"id":"train_5322","question":"Was 'Correlations and Random Information in Cellular Automata' not not published in 1987?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/compsys/Lindgren87> dblp:yearOfPublication '1987' }","paraphrases":["Was the paper 'Correlations and Random Information in Cellular Automata' not not published in the year 1987?"],"info":{}}
{"id":"train_5323","question":"Haven't the authors of the publication 'An architectural proposal for future wireless emergency response networks with broadband services' not published a publication in Bell Labs Tech. J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bell/HintonKH05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/bell/HintonKH05> ) . ?y dblp:publishedIn 'Bell Labs Tech. J.' }","paraphrases":["Did the authors of 'An architectural proposal for future wireless emergency response networks with broadband services' not not publish a paper in Bell Labs Tech. J.?"],"info":{}}
{"id":"train_5325","question":"Was the paper 'Gentleman: a light-weight web-based projectional editor generator' not not published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/models/LafontantS20> dblp:yearOfPublication '2020' }","paraphrases":["Was the publication 'Gentleman: a light-weight web-based projectional editor generator' not not published in 2020?"],"info":{}}
{"id":"train_5326","question":"Have the authors of the paper 'Estimating network path loss episode frequency by passive measurement' not not published a publication in BMEI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bmei/WuGM12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/bmei/WuGM12> ) . ?y dblp:publishedIn 'BMEI' }","paraphrases":["Haven't the authors of the publication 'Estimating network path loss episode frequency by passive measurement' not published a publication in BMEI?"],"info":{}}
{"id":"train_5328","question":"Was the paper 'Designing a search interface for a Spanish learner spoken corpus: the end-user's evaluation' not not published in the year 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/lrec/Llanos12> dblp:yearOfPublication '2012' }","paraphrases":["Was 'Designing a search interface for a Spanish learner spoken corpus: the end-user's evaluation' not not published in 2012?"],"info":{}}
{"id":"train_5329","question":"Did the authors of 'Early Stored Program Computing in England' not not publish a paper in Jerusalem Conference on Information Technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/jcit/Huskey78a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/jcit/Huskey78a> ) . ?y dblp:publishedIn 'Jerusalem Conference on Information Technology' }","paraphrases":["Have the authors of the paper 'Early Stored Program Computing in England' not not published a publication in Jerusalem Conference on Information Technology?"],"info":{}}
{"id":"train_5330","question":"Was 'Estimation of perceived image blur using edge features' not not published in 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/imst/KayargaddeM96> dblp:yearOfPublication '1996' }","paraphrases":["Was the paper 'Estimation of perceived image blur using edge features' not not published in the year 1996?"],"info":{}}
{"id":"train_5331","question":"Was 'Communication and Gamification in the Web-Based Foreign Language Educational System: Web-Based Foreign Language Educational System' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijwltt/OsipovVNP16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'Communication and Gamification in the Web-Based Foreign Language Educational System: Web-Based Foreign Language Educational System' not not published in the year 2016?"],"info":{}}
{"id":"train_5332","question":"Did the authors of 'Fall Detection Systems - A Solution based on Low Cost Sensors' not not publish a paper in ICSOFT (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icsoft/LagunaTFM10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icsoft/LagunaTFM10> ) . ?y dblp:publishedIn 'ICSOFT (1)' }","paraphrases":["Did the authors of the publication 'Fall Detection Systems - A Solution based on Low Cost Sensors' not not publish a paper in International Conference on Software and Data Technologies?"],"info":{}}
