{"id":"train_2538","question":"Which paper on Information systems was published by Atkinson in MUSIC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/69/6932> . ?answer dblp:publishedIn 'MUSIC' }","paraphrases":["Mention the publication on Information systems that was published by Atkinson in MUSIC."],"info":{}}
{"id":"train_2539","question":"Mention the publication on Wideband mobile stations that was published by Dmitry in VTC Spring.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/06/1520> . ?answer dblp:publishedIn 'VTC Spring' }","paraphrases":["Which paper on Wideband mobile stations was published by Dmitry in VTC Spring?"],"info":{}}
{"id":"train_2540","question":"Name the venue in which Shibayama published the paper about Pedestrian trajectory.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ieicet/KimSK12> dblp:authoredBy <https://dblp.org/pid/40/10733> . <https://dblp.org/rec/journals/ieicet/KimSK12> dblp:publishedIn ?answer }","paraphrases":["In which venue did Shibayama publish the paper about Pedestrian trajectory?"],"info":{}}
{"id":"train_2541","question":"Which author named Hsieh published the paper on Quantum circuits?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2203-09376> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Quantum circuits and has the name Min-Hsiu?"],"info":{}}
{"id":"train_2542","question":"In which venue did Rahman publish the paper about Machine translation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/comso/LaskarPB20> dblp:authoredBy <https://dblp.org/pid/247/6547> . <https://dblp.org/rec/conf/comso/LaskarPB20> dblp:publishedIn ?answer }","paraphrases":["Rahman published the paper on Machine translation in which venue?"],"info":{}}
{"id":"train_2543","question":"Name the author who published the paper on Suitability analysis and has the name Shen.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/urban/ShenDD21> dblp:authoredBy ?answer }","paraphrases":["Which author named Shuoge published the paper on Suitability analysis?"],"info":{}}
{"id":"train_2544","question":"Mention the publication on Pain management that was published by Wu in BMC Medical Informatics Decis. Mak..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/127/5982> . ?answer dblp:publishedIn 'BMC Medical Informatics Decis. Mak.' }","paraphrases":["Which paper on Pain management was published by Wu in BMC Medical Informatics Decis. Mak.?"],"info":{}}
{"id":"train_2545","question":"Name the venue in which Scotti published the paper about Mineral precipitation.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2207-06299> dblp:authoredBy <https://dblp.org/pid/13/9837> . <https://dblp.org/rec/journals/corr/abs-2207-06299> dblp:publishedIn ?answer }","paraphrases":["Scotti published the paper on Mineral precipitation in which venue?"],"info":{}}
{"id":"train_2546","question":"Mention the publication on Category detector that was published by Kumar in ICCV Workshops.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/116/4747> . ?answer dblp:publishedIn 'ICCV Workshops' }","paraphrases":["Which paper on Category detector was published by Kumar in ICCV Workshops?"],"info":{}}
{"id":"train_2547","question":"Name the author who published the paper on Clos networks and has the name Li.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccd/FranaszekGL95> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Clos networks and has the name Chung-Sheng?"],"info":{}}
{"id":"train_2548","question":"In which venue did Semeraro publish the paper about Data cloud?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/recsys/MustoNLGS16> dblp:authoredBy <https://dblp.org/pid/41/446> . <https://dblp.org/rec/conf/recsys/MustoNLGS16> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Semeraro published the paper about Data cloud."],"info":{}}
{"id":"train_2549","question":"Which author named Segall published the paper on Radio networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcom/SidiS83> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Radio networks and has the name Segall."],"info":{}}
{"id":"train_2550","question":"Name the venue in which A. published the paper about Gamma frequency.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cp/DawoodDAMJ22> dblp:authoredBy <https://dblp.org/pid/320/2260> . <https://dblp.org/rec/journals/cp/DawoodDAMJ22> dblp:publishedIn ?answer }","paraphrases":["In which venue did A. publish the paper about Gamma frequency?"],"info":{}}
{"id":"train_2551","question":"Name the venue in which Kodali published the paper about Location management.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wcnc/KodaliVJ05> dblp:authoredBy <https://dblp.org/pid/53/2375> . <https://dblp.org/rec/conf/wcnc/KodaliVJ05> dblp:publishedIn ?answer }","paraphrases":["In which venue did Kodali publish the paper about Location management?"],"info":{}}
{"id":"train_2553","question":"Which author published the paper on Granularity control and has the name Wah?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijait/HsuCW07> dblp:authoredBy ?answer }","paraphrases":["Which author named Wah published the paper on Granularity control?"],"info":{}}
{"id":"train_2554","question":"In which venue did Li publish the paper about Design classroom?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ahfe/Li21b> dblp:authoredBy <https://dblp.org/pid/18/6855> . <https://dblp.org/rec/conf/ahfe/Li21b> dblp:publishedIn ?answer }","paraphrases":["Li published the paper on Design classroom in which venue?"],"info":{}}
{"id":"train_2556","question":"Name the author who published the paper on Control systems and has the name Xi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2002-07987> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Control systems and has the name Xi?"],"info":{}}
{"id":"train_2557","question":"Which research paper on Multipoint measurement techniques was published by Tinarelli in IEEE Trans. Instrum. Meas.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/8972> . ?answer dblp:publishedIn 'IEEE Trans. Instrum. Meas.' }","paraphrases":["Which paper on Multipoint measurement techniques was published by Roberto in IEEE Trans. Instrum. Meas.?"],"info":{}}
{"id":"train_2559","question":"Mention the publication on -resolution that was published by Garcia in EUSIPCO.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/207/9833> . ?answer dblp:publishedIn 'EUSIPCO' }","paraphrases":["Which paper on -resolution was published by Hans in EUSIPCO?"],"info":{}}
{"id":"train_2560","question":"Name the author who published the paper on Path planning and has the name Yang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jaciii/YangMYL04> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Path planning and has the name Simon?"],"info":{}}
{"id":"train_2562","question":"Name the venue in which Opolka published the paper about Theta functions.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aaecc/Opolka85> dblp:authoredBy <https://dblp.org/pid/57/3928> . <https://dblp.org/rec/conf/aaecc/Opolka85> dblp:publishedIn ?answer }","paraphrases":["In which venue did Opolka publish the paper about Theta functions?"],"info":{}}
{"id":"train_2564","question":"Yuze published the paper on Lwir fpas in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/asicon/NiuLKZYLZC21> dblp:authoredBy <https://dblp.org/pid/184/4234> . <https://dblp.org/rec/conf/asicon/NiuLKZYLZC21> dblp:publishedIn ?answer }","paraphrases":["In which venue did Yuze publish the paper about Lwir fpas?"],"info":{}}
{"id":"train_2565","question":"In which venue did Kimura publish the paper about Lookback options?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/siamam/Kimura11> dblp:authoredBy <https://dblp.org/pid/16/2910> . <https://dblp.org/rec/journals/siamam/Kimura11> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Kimura published the paper about Lookback options."],"info":{}}
{"id":"train_2566","question":"In which venue did Ali publish the paper about Annotation schema?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/lrec/JabbariSZC20> dblp:authoredBy <https://dblp.org/pid/174/8881> . <https://dblp.org/rec/conf/lrec/JabbariSZC20> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Ali published the paper about Annotation schema."],"info":{}}
{"id":"train_2567","question":"Name the venue in which Wang published the paper about Vorticity formulation.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/nm/WangL02> dblp:authoredBy <https://dblp.org/pid/54/2062> . <https://dblp.org/rec/journals/nm/WangL02> dblp:publishedIn ?answer }","paraphrases":["In which venue did Cheng publish the paper about Vorticity formulation?"],"info":{}}
{"id":"train_2568","question":"Yeuon published the paper on Training program in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cbsn/SohnHPCLLJ16> dblp:authoredBy <https://dblp.org/pid/191/1797> . <https://dblp.org/rec/journals/cbsn/SohnHPCLLJ16> dblp:publishedIn ?answer }","paraphrases":["In which venue did Lee publish the paper about Training program?"],"info":{}}
{"id":"train_2569","question":"Natale published the paper on Bit messages in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/BoczkowskiKN16> dblp:authoredBy <https://dblp.org/pid/126/5223> . <https://dblp.org/rec/journals/corr/BoczkowskiKN16> dblp:publishedIn ?answer }","paraphrases":["In which venue did Emanuele publish the paper about Bit messages?"],"info":{}}
{"id":"train_2570","question":"Apostolos published the paper on Energy harvester in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wisnet/ViriliGMCAMR16> dblp:authoredBy <https://dblp.org/pid/48/8001> . <https://dblp.org/rec/conf/wisnet/ViriliGMCAMR16> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Apostolos published the paper about Energy harvester."],"info":{}}
{"id":"train_2571","question":"In which venue did Doh publish the paper about Power mac?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscc/ParkKDJ11> dblp:authoredBy <https://dblp.org/pid/28/4189> . <https://dblp.org/rec/conf/iscc/ParkKDJ11> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Doh published the paper about Power mac."],"info":{}}
{"id":"train_2572","question":"Name the author who published the paper on Retrieval approach and has the name Petkova.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/clef/BallesterosP05> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Retrieval approach and has the name Petkova?"],"info":{}}
{"id":"train_2573","question":"Name the author who published the paper on Granularity control and has the name Marroqu\\u00EDn.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ivc/RiveraM03> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Granularity control and has the name Jos\\u00E9?"],"info":{}}
{"id":"train_2575","question":"Name the author who published the paper on Sensor networks and has the name Yu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iwcmc/WangYLZ14> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Sensor networks and has the name Richard?"],"info":{}}
{"id":"train_2577","question":"Which paper on Service deployment was published by Cruz in ICTON?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/174/3707> . ?answer dblp:publishedIn 'ICTON' }","paraphrases":["Which research paper on Service deployment was published by Cruz in ICTON?"],"info":{}}
{"id":"train_2578","question":"Mention the publication on R&d policy that was published by Li in Int. J. Technol. Manag..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/7888> . ?answer dblp:publishedIn 'Int. J. Technol. Manag.' }","paraphrases":["Which paper on R&d policy was published by Jiatao in Int. J. Technol. Manag.?"],"info":{}}
{"id":"train_2579","question":"Which author named Vanrompay published the paper on Behaviour advice?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jaihc/BatoolVNJW19> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Behaviour advice and has the name Vanrompay."],"info":{}}
{"id":"train_2580","question":"Name the venue in which Atsushi published the paper about Resolution conversion.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iciap/ToriiWMI03> dblp:authoredBy <https://dblp.org/pid/53/1011> . <https://dblp.org/rec/conf/iciap/ToriiWMI03> dblp:publishedIn ?answer }","paraphrases":["In which venue did Imiya publish the paper about Resolution conversion?"],"info":{}}
{"id":"train_2581","question":"Name the venue in which Sala published the paper about Web applications.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aina/Sala05> dblp:authoredBy <https://dblp.org/pid/90/4167> . <https://dblp.org/rec/conf/aina/Sala05> dblp:publishedIn ?answer }","paraphrases":["Nicoletta published the paper on Web applications in which venue?"],"info":{}}
{"id":"train_2582","question":"Eli published the paper on Computer chess programs in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1711-08337> dblp:authoredBy <https://dblp.org/pid/d/OmidDavidTabibi> . <https://dblp.org/rec/journals/corr/abs-1711-08337> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which (Omid) published the paper about Computer chess programs."],"info":{}}
{"id":"train_2583","question":"In which venue did Chen-Fu publish the paper about Injection computation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/3pgcic/Andriamanalimanana18a> dblp:authoredBy <https://dblp.org/pid/02/10096> . <https://dblp.org/rec/conf/3pgcic/Andriamanalimanana18a> dblp:publishedIn ?answer }","paraphrases":["Chiang published the paper on Injection computation in which venue?"],"info":{}}
{"id":"train_2588","question":"Name the venue in which D. published the paper about Clock synchronization.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/srds/CouvetFN91> dblp:authoredBy <https://dblp.org/pid/11/1795> . <https://dblp.org/rec/conf/srds/CouvetFN91> dblp:publishedIn ?answer }","paraphrases":["In which venue did Couvet publish the paper about Clock synchronization?"],"info":{}}
{"id":"train_2589","question":"Tadhg published the paper on Robot model in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/internet/OMearaP01> dblp:authoredBy <https://dblp.org/pid/76/81> . <https://dblp.org/rec/journals/internet/OMearaP01> dblp:publishedIn ?answer }","paraphrases":["In which venue did Tadhg publish the paper about Robot model?"],"info":{}}
{"id":"train_2590","question":"In which venue did Hailin publish the paper about Relay selection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/icl/LiLCYZ19> dblp:authoredBy <https://dblp.org/pid/04/1131-1> . <https://dblp.org/rec/journals/icl/LiLCYZ19> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Zhang published the paper about Relay selection."],"info":{}}
{"id":"train_2591","question":"Susan published the paper on Parameter selection in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijssci/HolkerS21> dblp:authoredBy <https://dblp.org/pid/134/9243> . <https://dblp.org/rec/journals/ijssci/HolkerS21> dblp:publishedIn ?answer }","paraphrases":["In which venue did Seba publish the paper about Parameter selection?"],"info":{}}
{"id":"train_2592","question":"Name the venue in which Grad published the paper about Semidefinite optimization.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/or/Grad14> dblp:authoredBy <https://dblp.org/pid/24/8224> . <https://dblp.org/rec/conf/or/Grad14> dblp:publishedIn ?answer }","paraphrases":["Grad published the paper on Semidefinite optimization in which venue?"],"info":{}}
{"id":"train_2594","question":"Name the author who published the paper on Range video and has the name Alper.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vcip/KozD12> dblp:authoredBy ?answer }","paraphrases":["Which author named Alper published the paper on Range video?"],"info":{}}
{"id":"train_2595","question":"Maria published the paper on Sustainability profiling in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/re/AlhartiSH18> dblp:authoredBy <https://dblp.org/pid/65/3176> . <https://dblp.org/rec/conf/re/AlhartiSH18> dblp:publishedIn ?answer }","paraphrases":["In which venue did Spichkova publish the paper about Sustainability profiling?"],"info":{}}
{"id":"train_2596","question":"Which research paper on Testability measurements was published by Traon in IEEE METRICS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/5206> . ?answer dblp:publishedIn 'IEEE METRICS' }","paraphrases":["Which paper on Testability measurements was published by Yves in IEEE METRICS?"],"info":{}}
{"id":"train_2597","question":"Mention the publication on Demanding qos that was published by Tapisha in WCNC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/194/3244> . ?answer dblp:publishedIn 'WCNC' }","paraphrases":["Which paper on Demanding qos was published by Soni in WCNC?"],"info":{}}
{"id":"train_2598","question":"Name the venue in which Milos published the paper about Factory tours.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ectel/KaibelAK06> dblp:authoredBy <https://dblp.org/pid/27/379> . <https://dblp.org/rec/conf/ectel/KaibelAK06> dblp:publishedIn ?answer }","paraphrases":["Kravcik published the paper on Factory tours in which venue?"],"info":{}}
{"id":"train_2599","question":"Which paper on Fringe patterns was published by Liu in IScIDE (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/169/4585> . ?answer dblp:publishedIn 'IScIDE (1)' }","paraphrases":["Mention the publication on Fringe patterns that was published by Liu in IScIDE (1)."],"info":{}}
{"id":"train_2600","question":"Which author named Chunjie published the paper on Pattern generation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tase/WuLLCG18> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Pattern generation and has the name Chunjie."],"info":{}}
{"id":"train_2601","question":"Which paper on Learning environments was published by Kramarski in iLRN?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/63/3391> . ?answer dblp:publishedIn 'iLRN' }","paraphrases":["Which research paper on Learning environments was published by Kramarski in International Conference of the Immersive Learning Research Network?"],"info":{}}
{"id":"train_2602","question":"Which author named Gunamani published the paper on Squeeze film?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/socpros/AdesharaPDP18> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Squeeze film and has the name Gunamani?"],"info":{}}
{"id":"train_2603","question":"Name the venue in which Alexander published the paper about Business intelligence.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jais/KretzerM18> dblp:authoredBy <https://dblp.org/pid/34/590> . <https://dblp.org/rec/journals/jais/KretzerM18> dblp:publishedIn ?answer }","paraphrases":["Alexander published the paper on Business intelligence in which venue?"],"info":{}}
{"id":"train_2605","question":"Mention the publication on Compound property that was published by N. in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/311/3624> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which paper on Compound property was published by N. in CoRR?"],"info":{}}
{"id":"train_2606","question":"Mention the publication on Video captions that was published by H. in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/g/MarkusHGross> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which paper on Video captions was published by Markus in CoRR?"],"info":{}}
{"id":"train_2607","question":"Name the venue in which Ali published the paper about Detection mechanism.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aina/KhanH17> dblp:authoredBy <https://dblp.org/pid/90/7860> . <https://dblp.org/rec/conf/aina/KhanH17> dblp:publishedIn ?answer }","paraphrases":["In which venue did Khan publish the paper about Detection mechanism?"],"info":{}}
{"id":"train_2609","question":"Which research paper on Code decoders was published by Neu in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/205/3153> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Mention the publication on Code decoders that was published by Neu in CoRR."],"info":{}}
{"id":"train_2610","question":"Which author named Hong published the paper on Classification tree?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icnc/Hong16> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Classification tree and has the name Hong."],"info":{}}
{"id":"train_2611","question":"Which author published the paper on Subgradient method and has the name Huiping?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isie/LiuL019> dblp:authoredBy ?answer }","paraphrases":["Which author named Huiping published the paper on Subgradient method?"],"info":{}}
{"id":"train_2613","question":"In which venue did Hausheer publish the paper about Scion endhosts?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/noms/GartnerWKH22a> dblp:authoredBy <https://dblp.org/pid/76/3287> . <https://dblp.org/rec/conf/noms/GartnerWKH22a> dblp:publishedIn ?answer }","paraphrases":["Hausheer published the paper on Scion endhosts in which venue?"],"info":{}}
{"id":"train_2614","question":"Mohona published the paper on Time complexity in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icisc/BogdanovCGS14> dblp:authoredBy <https://dblp.org/pid/136/4335> . <https://dblp.org/rec/conf/icisc/BogdanovCGS14> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Ghosh published the paper about Time complexity."],"info":{}}
{"id":"train_2615","question":"Which author published the paper on Co-creation and has the name Julia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icis/HeKG14> dblp:authoredBy ?answer }","paraphrases":["Which author named Kotlarsky published the paper on Co-creation?"],"info":{}}
{"id":"train_2616","question":"Mention the publication on Noise suppression that was published by Kamarujjaman in Multim. Tools Appl..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/190/3754> . ?answer dblp:publishedIn 'Multim. Tools Appl.' }","paraphrases":["Which paper on Noise suppression was published by Kamarujjaman in Multim. Tools Appl.?"],"info":{}}
{"id":"train_2617","question":"In which venue did Himanshu publish the paper about Subunit ask1?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/candc/TripathiK18> dblp:authoredBy <https://dblp.org/pid/214/2915> . <https://dblp.org/rec/journals/candc/TripathiK18> dblp:publishedIn ?answer }","paraphrases":["Tripathi published the paper on Subunit ask1 in which venue?"],"info":{}}
{"id":"train_2618","question":"In which venue did Feinler publish the paper about Level domain?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/annals/Feinler11> dblp:authoredBy <https://dblp.org/pid/56/3520> . <https://dblp.org/rec/journals/annals/Feinler11> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which J. published the paper about Level domain."],"info":{}}
{"id":"train_2619","question":"Name the author who published the paper on Anticancer drugs and has the name Onida.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/symmetry/MolteniOCC21> dblp:authoredBy ?answer }","paraphrases":["Which author named Giovanni published the paper on Anticancer drugs?"],"info":{}}
{"id":"train_2620","question":"Mention the publication on Parameter tuning that was published by Carlos in IEEE Access.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/153/4625> . ?answer dblp:publishedIn 'IEEE Access' }","paraphrases":["Which paper on Parameter tuning was published by Carlos in IEEE Access?"],"info":{}}
{"id":"train_2622","question":"Name the author who published the paper on Farm monitoring and has the name Jong-Sik.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sucoms/JuPLCCYS10> dblp:authoredBy ?answer }","paraphrases":["Which author named Cho published the paper on Farm monitoring?"],"info":{}}
{"id":"train_2623","question":"Name the author who published the paper on Cycle methods and has the name E..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/moc/DuanGTZ07> dblp:authoredBy ?answer }","paraphrases":["Which author named E. published the paper on Cycle methods?"],"info":{}}
{"id":"train_2625","question":"Mention the publication on Teresa cerratto that was published by Moradi in Digit. Scholarsh. Humanit..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/293/4360> . ?answer dblp:publishedIn 'Digit. Scholarsh. Humanit.' }","paraphrases":["Which research paper on Teresa cerratto was published by Hamzeh in Digit. Scholarsh. Humanit.?"],"info":{}}
{"id":"train_2626","question":"Which author published the paper on Infrastructure communications and has the name Mohammad?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vtc/RussoLOR18> dblp:authoredBy ?answer }","paraphrases":["Which author named Rmayti published the paper on Infrastructure communications?"],"info":{}}
{"id":"train_2627","question":"Name the author who published the paper on Activity modeling and has the name Luming.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aaai/ZhangLLYZ018> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Activity modeling and has the name Luming?"],"info":{}}
{"id":"train_2628","question":"Which author named Li published the paper on Discriminant analysis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pami/YeL04> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Discriminant analysis and has the name Qi?"],"info":{}}
{"id":"train_2629","question":"Which research paper on Ocean modeling was published by Dana in ICCS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/90/892> . ?answer dblp:publishedIn 'ICCS' }","paraphrases":["Mention the publication on Ocean modeling that was published by A. in International Conference on Conceptual Structures."],"info":{}}
