{"id":"train_1710","question":"Did Lining Xing not publish the paper 'A multiobjective satellite data transmission scheduling technology based on NSGA-II'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icaci/ZhangCLX18> dblp:authoredBy <https://dblp.org/pid/96/6822> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icaci/ZhangCLX18> dblp:authoredBy <https://dblp.org/pid/96/6822> } }","paraphrases":["Was the paper 'A multiobjective satellite data transmission scheduling technology based on NSGA-II' not published by Lining Xing?"],"info":{}}
{"id":"train_1711","question":"Was the paper 'Post-processing and visualization of large-scale DEM simulation data with the open-source VELaSSCo platform' not co-authored by Kevin J. Hanley and Stefanos-Aldo Papanicolopulos?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/simulation/MorrisseyTHPOGR20> dblp:authoredBy <https://dblp.org/pid/205/2169> . <https://dblp.org/rec/journals/simulation/MorrisseyTHPOGR20> dblp:authoredBy <https://dblp.org/pid/161/4763> FILTER NOT EXISTS { <https://dblp.org/rec/journals/simulation/MorrisseyTHPOGR20> dblp:authoredBy <https://dblp.org/pid/205/2169> . <https://dblp.org/rec/journals/simulation/MorrisseyTHPOGR20> dblp:authoredBy <https://dblp.org/pid/161/4763> } }","paraphrases":["Have Kevin J. Hanley and Stefanos-Aldo Papanicolopulos not co-authored the paper 'Post-processing and visualization of large-scale DEM simulation data with the open-source VELaSSCo platform'?"],"info":{}}
{"id":"train_1712","question":"Wasn't the paper 'How can knowledge-based systems solve large-scale problems?: model-based decomposition and problem solving' not published by the person named Ohsuga, Setsuo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/kbs/Ohsuga93> dblp:authoredBy <https://dblp.org/pid/25/4174> FILTER NOT EXISTS { <https://dblp.org/rec/journals/kbs/Ohsuga93> dblp:authoredBy <https://dblp.org/pid/25/4174> } }","paraphrases":["Was the paper 'How can knowledge-based systems solve large-scale problems?: model-based decomposition and problem solving' not published by the person Setsuo Ohsuga?"],"info":{}}
{"id":"train_1713","question":"Did Michelle L. Wachs and Ahmad Haidar not co-author the paper 'An involution for signed Eulerian numbers'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dm/Wachs92> dblp:authoredBy <https://dblp.org/pid/06/4633> . <https://dblp.org/rec/journals/dm/Wachs92> dblp:authoredBy <https://dblp.org/pid/89/8> FILTER NOT EXISTS { <https://dblp.org/rec/journals/dm/Wachs92> dblp:authoredBy <https://dblp.org/pid/06/4633> . <https://dblp.org/rec/journals/dm/Wachs92> dblp:authoredBy <https://dblp.org/pid/89/8> } }","paraphrases":["Have Michelle L. Wachs and Ahmad Haidar not co-authored the paper 'An involution for signed Eulerian numbers'?"],"info":{}}
{"id":"train_1714","question":"Wasn't the paper 'The Automorphism Group of a Circle Geometry' published by the author Bruck, R. H. in J. Comb. Theory, Ser. A?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jct/Bruck82> dblp:authoredBy <https://dblp.org/pid/70/3988> . <https://dblp.org/rec/journals/jct/Bruck82> dblp:publishedIn 'J. Comb. Theory, Ser. A' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jct/Bruck82> dblp:authoredBy <https://dblp.org/pid/70/3988> . <https://dblp.org/rec/journals/jct/Bruck82> dblp:publishedIn 'J. Comb. Theory, Ser. A' } }","paraphrases":["Was the paper 'The Automorphism Group of a Circle Geometry' not published by R. H. Bruck in J. Comb. Theory, Ser. A?"],"info":{}}
{"id":"train_1715","question":"Did Gladshtein, M. A. and Maciej Eder not co-author the paper 'The signal propagation delay reduction of the combinational adder of decimal digits encoded by the Johnson-Mobius code'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/accs/Gladshtein10> dblp:authoredBy <https://dblp.org/pid/19/8889> . <https://dblp.org/rec/journals/accs/Gladshtein10> dblp:authoredBy <https://dblp.org/pid/19/3226> FILTER NOT EXISTS { <https://dblp.org/rec/journals/accs/Gladshtein10> dblp:authoredBy <https://dblp.org/pid/19/8889> . <https://dblp.org/rec/journals/accs/Gladshtein10> dblp:authoredBy <https://dblp.org/pid/19/3226> } }","paraphrases":["Was the paper 'The signal propagation delay reduction of the combinational adder of decimal digits encoded by the Johnson-Mobius code' not co-authored by M. A. Gladshtein and M. Eder?"],"info":{}}
{"id":"train_1716","question":"Did Haibin Yan not publish the paper 'Discriminative Multimetric Learning for Kinship Verification' in IEEE Trans. Inf. Forensics Secur.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tifs/YanLDZ14> dblp:authoredBy <https://dblp.org/pid/27/9964> . <https://dblp.org/rec/journals/tifs/YanLDZ14> dblp:publishedIn 'IEEE Trans. Inf. Forensics Secur.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tifs/YanLDZ14> dblp:authoredBy <https://dblp.org/pid/27/9964> . <https://dblp.org/rec/journals/tifs/YanLDZ14> dblp:publishedIn 'IEEE Trans. Inf. Forensics Secur.' } }","paraphrases":["Wasn't the paper 'Discriminative Multimetric Learning for Kinship Verification' published by the author H. Yan in IEEE Trans. Inf. Forensics Secur.?"],"info":{}}
{"id":"train_1717","question":"Was the paper 'Artificial intelligence applications in supply chain: A descriptive bibliometric analysis and future research directions' not published by Youssra Riahi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eswa/RiahiSGB21> dblp:authoredBy <https://dblp.org/pid/291/2295> FILTER NOT EXISTS { <https://dblp.org/rec/journals/eswa/RiahiSGB21> dblp:authoredBy <https://dblp.org/pid/291/2295> } }","paraphrases":["Wasn't the paper 'Artificial intelligence applications in supply chain: A descriptive bibliometric analysis and future research directions' not published by the person named Youssra Riahi?"],"info":{}}
{"id":"train_1718","question":"Did Michal B. and Jia, Xibin not co-author the paper 'Interception of User's Interests on the Web'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ah/Barla06> dblp:authoredBy <https://dblp.org/pid/76/84> . <https://dblp.org/rec/conf/ah/Barla06> dblp:authoredBy <https://dblp.org/pid/141/0898> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ah/Barla06> dblp:authoredBy <https://dblp.org/pid/76/84> . <https://dblp.org/rec/conf/ah/Barla06> dblp:authoredBy <https://dblp.org/pid/141/0898> } }","paraphrases":["Was the paper 'Interception of User's Interests on the Web' not co-authored by Michal Barla and Jia, Xibin?"],"info":{}}
{"id":"train_1719","question":"Has Jonathan Wareham not published the paper 'Still guilty of technological determinism? Reengineering in the insurance sector'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecis/WarehamN98> dblp:authoredBy <https://dblp.org/pid/60/5989> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ecis/WarehamN98> dblp:authoredBy <https://dblp.org/pid/60/5989> } }","paraphrases":["Was the paper 'Still guilty of technological determinism? Reengineering in the insurance sector' not published by Wareham, Jonathan?"],"info":{}}
{"id":"train_1720","question":"Was the paper 'An Experimental Study of TSN-NonTSN Coexistence' not published by Hariram S. Satheesh in CCWC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccwc/ChoukseySA21> dblp:authoredBy <https://dblp.org/pid/288/3331> . <https://dblp.org/rec/conf/ccwc/ChoukseySA21> dblp:publishedIn 'CCWC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ccwc/ChoukseySA21> dblp:authoredBy <https://dblp.org/pid/288/3331> . <https://dblp.org/rec/conf/ccwc/ChoukseySA21> dblp:publishedIn 'CCWC' } }","paraphrases":["Wasn't the paper 'An Experimental Study of TSN-NonTSN Coexistence' published by the author Hariram Selvamurugan Satheesh in CCWC?"],"info":{}}
{"id":"train_1721","question":"Didn't Y. Frankel publish the paper 'Distributed Public Key Cryptosystems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pkc/FrankelY98> dblp:authoredBy <https://dblp.org/pid/65/6455> FILTER NOT EXISTS { <https://dblp.org/rec/conf/pkc/FrankelY98> dblp:authoredBy <https://dblp.org/pid/65/6455> } }","paraphrases":["Wasn't the paper 'Distributed Public Key Cryptosystems' not published by the author Yair Frankel?"],"info":{}}
{"id":"train_1722","question":"Has the paper 'Storrer, A, Geyken, A, Siebert, A and Wrzner, KM (eds) 2008 Text Resources and Lexical Knowledge Mouton de Gruyter: Berlin/New York 260p' not been published by Mu\\u00F1oz, Isabel Dur\\u00E1n in Proces. del Leng. Natural?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pdln/Munoz09> dblp:authoredBy <https://dblp.org/pid/127/5361> . <https://dblp.org/rec/journals/pdln/Munoz09> dblp:publishedIn 'Proces. del Leng. Natural' FILTER NOT EXISTS { <https://dblp.org/rec/journals/pdln/Munoz09> dblp:authoredBy <https://dblp.org/pid/127/5361> . <https://dblp.org/rec/journals/pdln/Munoz09> dblp:publishedIn 'Proces. del Leng. Natural' } }","paraphrases":["Did Mu\\u00F1oz, Isabel Dur\\u00E1n not publish the paper 'Storrer, A, Geyken, A, Siebert, A and Wrzner, KM (eds) 2008 Text Resources and Lexical Knowledge Mouton de Gruyter: Berlin/New York 260p' in Proces. del Leng. Natural?"],"info":{}}
{"id":"train_1723","question":"Was the paper 'Radical Knowledge Management: Using Lessons Learned From Artists to Create Sustainable Workplaces' not co-authored by Stephanie Barnes and Shuimei Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/frai/Barnes21> dblp:authoredBy <https://dblp.org/pid/298/5596> . <https://dblp.org/rec/journals/frai/Barnes21> dblp:authoredBy <https://dblp.org/pid/217/8326> FILTER NOT EXISTS { <https://dblp.org/rec/journals/frai/Barnes21> dblp:authoredBy <https://dblp.org/pid/298/5596> . <https://dblp.org/rec/journals/frai/Barnes21> dblp:authoredBy <https://dblp.org/pid/217/8326> } }","paraphrases":["Did Stephanie Barnes and Shuimei Zhang not co-author the paper 'Radical Knowledge Management: Using Lessons Learned From Artists to Create Sustainable Workplaces'?"],"info":{}}
{"id":"train_1725","question":"Didn't Berry, Donald A. publish the paper 'Discrete Search with Directional Information'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ior/BerryM86> dblp:authoredBy <https://dblp.org/pid/178/6325> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ior/BerryM86> dblp:authoredBy <https://dblp.org/pid/178/6325> } }","paraphrases":["Did Berry, Donald A. not publish the paper 'Discrete Search with Directional Information'?"],"info":{}}
{"id":"train_1726","question":"Was the paper 'Robot network integration in automated factories' not published by Messina, G. in International Conference on Computational Creativity?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccc/MessinaT88> dblp:authoredBy <https://dblp.org/pid/47/5884> . <https://dblp.org/rec/conf/iccc/MessinaT88> dblp:publishedIn 'ICCC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccc/MessinaT88> dblp:authoredBy <https://dblp.org/pid/47/5884> . <https://dblp.org/rec/conf/iccc/MessinaT88> dblp:publishedIn 'ICCC' } }","paraphrases":["Wasn't the paper 'Robot network integration in automated factories' published by the author Gaetano Messina in ICCC?"],"info":{}}
{"id":"train_1727","question":"Was the paper 'Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments' not published by the person Adams, P.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/AdamsMEWG17> dblp:authoredBy <https://dblp.org/pid/03/298> FILTER NOT EXISTS { <https://dblp.org/rec/conf/chi/AdamsMEWG17> dblp:authoredBy <https://dblp.org/pid/03/298> } }","paraphrases":["Did Adams, P. not publish the paper 'Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments'?"],"info":{}}
{"id":"train_1728","question":"Was the paper 'Distributed IDS using Reconfigurable Hardware' not co-authored by Parimal Patel and Ashok Kumar Tummala?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ipps/TummalaP07> dblp:authoredBy <https://dblp.org/pid/35/5197> . <https://dblp.org/rec/conf/ipps/TummalaP07> dblp:authoredBy <https://dblp.org/pid/33/4537> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ipps/TummalaP07> dblp:authoredBy <https://dblp.org/pid/35/5197> . <https://dblp.org/rec/conf/ipps/TummalaP07> dblp:authoredBy <https://dblp.org/pid/33/4537> } }","paraphrases":["Have Parimal Patel and Ashok Kumar Tummala not co-authored the paper 'Distributed IDS using Reconfigurable Hardware'?"],"info":{}}
{"id":"train_1730","question":"Was the paper 'Modeling dynamic systems with high-level Petri nets with object-orientation' not co-authored by M. Brezovan and Stanescu, Liana?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/inista/BrezovanS16> dblp:authoredBy <https://dblp.org/pid/18/539> . <https://dblp.org/rec/conf/inista/BrezovanS16> dblp:authoredBy <https://dblp.org/pid/19/3866> FILTER NOT EXISTS { <https://dblp.org/rec/conf/inista/BrezovanS16> dblp:authoredBy <https://dblp.org/pid/18/539> . <https://dblp.org/rec/conf/inista/BrezovanS16> dblp:authoredBy <https://dblp.org/pid/19/3866> } }","paraphrases":["Have Marius Brezovan and Stanescu, Liana not co-authored the paper 'Modeling dynamic systems with high-level Petri nets with object-orientation'?"],"info":{}}
{"id":"train_1732","question":"Did Fuyong Xing not publish the paper 'Digitized tissue microarray classification using sparse reconstruction' in Medical Imaging: Image Processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/miip/XingLQFY12> dblp:authoredBy <https://dblp.org/pid/03/10932> . <https://dblp.org/rec/conf/miip/XingLQFY12> dblp:publishedIn 'Medical Imaging: Image Processing' FILTER NOT EXISTS { <https://dblp.org/rec/conf/miip/XingLQFY12> dblp:authoredBy <https://dblp.org/pid/03/10932> . <https://dblp.org/rec/conf/miip/XingLQFY12> dblp:publishedIn 'Medical Imaging: Image Processing' } }","paraphrases":["Has the paper 'Digitized tissue microarray classification using sparse reconstruction' not been published by F. Xing in Medical Imaging: Image Processing?"],"info":{}}
{"id":"train_1733","question":"Was the paper 'A Fast Color Quantization Using a Matrix of Local Pallets' not published by the person Mohamed-Chaker L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aipr/LarabiRF00> dblp:authoredBy <https://dblp.org/pid/31/5962> FILTER NOT EXISTS { <https://dblp.org/rec/conf/aipr/LarabiRF00> dblp:authoredBy <https://dblp.org/pid/31/5962> } }","paraphrases":["Wasn't the paper 'A Fast Color Quantization Using a Matrix of Local Pallets' not published by the person named Mohamed-Chaker L.?"],"info":{}}
{"id":"train_1734","question":"Has Harrison, P. not published the paper 'Using Bracketed Parses to evaluate a Grammar Checking Application'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acl/WojcikHB93> dblp:authoredBy <https://dblp.org/pid/69/4949> FILTER NOT EXISTS { <https://dblp.org/rec/conf/acl/WojcikHB93> dblp:authoredBy <https://dblp.org/pid/69/4949> } }","paraphrases":["Wasn't the paper 'Using Bracketed Parses to evaluate a Grammar Checking Application' not published by the person named Harrison, P.?"],"info":{}}
{"id":"train_1735","question":"Was the paper 'Keeper: A Synchronous Online Conversation Environment Informed by In-Person Facilitation Practices' not published by Margaret A. Hughes in International Conference on Human Factors in Computing Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/HughesR21> dblp:authoredBy <https://dblp.org/pid/252/4365> . <https://dblp.org/rec/conf/chi/HughesR21> dblp:publishedIn 'CHI' FILTER NOT EXISTS { <https://dblp.org/rec/conf/chi/HughesR21> dblp:authoredBy <https://dblp.org/pid/252/4365> . <https://dblp.org/rec/conf/chi/HughesR21> dblp:publishedIn 'CHI' } }","paraphrases":["Has the paper 'Keeper: A Synchronous Online Conversation Environment Informed by In-Person Facilitation Practices' not been published by Hughes, Margaret A. in CHI?"],"info":{}}
{"id":"train_1736","question":"Did Mark Roantree and Zohra Bellahsene not co-author the paper 'Optimizing XML data with view fragments'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/adc/LiuRB10> dblp:authoredBy <https://dblp.org/pid/93/6472> . <https://dblp.org/rec/conf/adc/LiuRB10> dblp:authoredBy <https://dblp.org/pid/b/ZohraBellahsene> FILTER NOT EXISTS { <https://dblp.org/rec/conf/adc/LiuRB10> dblp:authoredBy <https://dblp.org/pid/93/6472> . <https://dblp.org/rec/conf/adc/LiuRB10> dblp:authoredBy <https://dblp.org/pid/b/ZohraBellahsene> } }","paraphrases":["Was the paper 'Optimizing XML data with view fragments' not co-authored by Roantree, Mark and Z. Bellahsene?"],"info":{}}
{"id":"train_1738","question":"Has the paper 'Multi-agent comprehensive evaluation on inland port production efficiency based on arrtibute theory' not been published by Siqin Y. in GrC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/grc/Xue-yanSG13> dblp:authoredBy <https://dblp.org/pid/38/5732> . <https://dblp.org/rec/conf/grc/Xue-yanSG13> dblp:publishedIn 'GrC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/grc/Xue-yanSG13> dblp:authoredBy <https://dblp.org/pid/38/5732> . <https://dblp.org/rec/conf/grc/Xue-yanSG13> dblp:publishedIn 'GrC' } }","paraphrases":["Wasn't the paper 'Multi-agent comprehensive evaluation on inland port production efficiency based on arrtibute theory' published by the author Siqin Y. in GrC?"],"info":{}}
{"id":"train_1739","question":"Was the paper 'Mortality play' not published by Phillip G. Armour in Commun. ACM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacm/Armour07a> dblp:authoredBy <https://dblp.org/pid/27/763> . <https://dblp.org/rec/journals/cacm/Armour07a> dblp:publishedIn 'Commun. ACM' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cacm/Armour07a> dblp:authoredBy <https://dblp.org/pid/27/763> . <https://dblp.org/rec/journals/cacm/Armour07a> dblp:publishedIn 'Commun. ACM' } }","paraphrases":["Wasn't the paper 'Mortality play' published by the author P. G. Armour in Commun. ACM?"],"info":{}}
{"id":"train_1740","question":"Wasn't the paper 'Introduction to Special Issue ECCS'10 in Theory in Biosciences' published by the author Atay, F. M. in Theory Biosci.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tib/KirkilionisA12> dblp:authoredBy <https://dblp.org/pid/69/2006> . <https://dblp.org/rec/journals/tib/KirkilionisA12> dblp:publishedIn 'Theory Biosci.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tib/KirkilionisA12> dblp:authoredBy <https://dblp.org/pid/69/2006> . <https://dblp.org/rec/journals/tib/KirkilionisA12> dblp:publishedIn 'Theory Biosci.' } }","paraphrases":["Has the paper 'Introduction to Special Issue ECCS'10 in Theory in Biosciences' not been published by Atay, F. M. in Theory Biosci.?"],"info":{}}
{"id":"train_1741","question":"Didn't Guozhu L. publish the paper 'SDF-RVD: Restricted Voronoi Diagram on Signed Distance Field'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cad/HouZWXCLTW22> dblp:authoredBy <https://dblp.org/pid/18/3046> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cad/HouZWXCLTW22> dblp:authoredBy <https://dblp.org/pid/18/3046> } }","paraphrases":["Wasn't the paper 'SDF-RVD: Restricted Voronoi Diagram on Signed Distance Field' not published by the author Guozhu L.?"],"info":{}}
{"id":"train_1742","question":"Was the paper 'Reinventing Academic Publishing Online Part I: Rigor, Relevance and Practice' not published by Robert S. Friedman in First Monday?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/firstmonday/WhitworthF09> dblp:authoredBy <https://dblp.org/pid/29/6742> . <https://dblp.org/rec/journals/firstmonday/WhitworthF09> dblp:publishedIn 'First Monday' FILTER NOT EXISTS { <https://dblp.org/rec/journals/firstmonday/WhitworthF09> dblp:authoredBy <https://dblp.org/pid/29/6742> . <https://dblp.org/rec/journals/firstmonday/WhitworthF09> dblp:publishedIn 'First Monday' } }","paraphrases":["Has the paper 'Reinventing Academic Publishing Online Part I: Rigor, Relevance and Practice' not been published by Robert S. Friedman in First Monday?"],"info":{}}
{"id":"train_1743","question":"Did Sharon Manel De Silva not publish the paper 'Enhancing cataloguing skills with CAI tools: using CoPAS to improve novice cataloguer's bibliographic description for published conference proceedings' in J. Libr. Inf. Sci.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jolis/SilvaZ01> dblp:authoredBy <https://dblp.org/pid/175/3106> . <https://dblp.org/rec/journals/jolis/SilvaZ01> dblp:publishedIn 'J. Libr. Inf. Sci.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jolis/SilvaZ01> dblp:authoredBy <https://dblp.org/pid/175/3106> . <https://dblp.org/rec/journals/jolis/SilvaZ01> dblp:publishedIn 'J. Libr. Inf. Sci.' } }","paraphrases":["Has the paper 'Enhancing cataloguing skills with CAI tools: using CoPAS to improve novice cataloguer's bibliographic description for published conference proceedings' not been published by Sharon Manel De Silva in J. Libr. Inf. Sci.?"],"info":{}}
{"id":"train_1745","question":"Was the paper 'The Optimality of Unbalancing Both Workloads and Machine Group Sizes in Closed Queueing Networks of Multiserver Queues' not published by the person James J. Solberg?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ior/SteckeS85> dblp:authoredBy <https://dblp.org/pid/80/731> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ior/SteckeS85> dblp:authoredBy <https://dblp.org/pid/80/731> } }","paraphrases":["Wasn't the paper 'The Optimality of Unbalancing Both Workloads and Machine Group Sizes in Closed Queueing Networks of Multiserver Queues' not published by the author J. J. Solberg?"],"info":{}}
{"id":"train_1746","question":"Was the paper 'SoC CMOS UWB Pulse Radar Sensor for Contactless Respiratory Rate Monitoring' not co-authored by Fabio Zito and Alessandro Tognetti?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tbcas/ZitoPMZTLR11> dblp:authoredBy <https://dblp.org/pid/82/6953> . <https://dblp.org/rec/journals/tbcas/ZitoPMZTLR11> dblp:authoredBy <https://dblp.org/pid/24/3225> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tbcas/ZitoPMZTLR11> dblp:authoredBy <https://dblp.org/pid/82/6953> . <https://dblp.org/rec/journals/tbcas/ZitoPMZTLR11> dblp:authoredBy <https://dblp.org/pid/24/3225> } }","paraphrases":["Did Fabio Zito and A. Tognetti not co-author the paper 'SoC CMOS UWB Pulse Radar Sensor for Contactless Respiratory Rate Monitoring'?"],"info":{}}
{"id":"train_1748","question":"Wasn't the paper 'Augmentation not Duplication: Considerations for the Design of Digitally-Augmented Comic Books' not published by the person named Jens Grubert?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/KljunPAWCDKGCC19> dblp:authoredBy <https://dblp.org/pid/22/1550> FILTER NOT EXISTS { <https://dblp.org/rec/conf/chi/KljunPAWCDKGCC19> dblp:authoredBy <https://dblp.org/pid/22/1550> } }","paraphrases":["Was the paper 'Augmentation not Duplication: Considerations for the Design of Digitally-Augmented Comic Books' not published by Jens G.?"],"info":{}}
{"id":"train_1749","question":"Wasn't the paper 'An Algorithm for Generating Invisible Data Poisoning Using Adversarial Noise That Breaks Image Classification Deep Learning' not published by the author Chan-Hon-Tong, A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/make/Chan-Hon-Tong19> dblp:authoredBy <https://dblp.org/pid/132/2136> FILTER NOT EXISTS { <https://dblp.org/rec/journals/make/Chan-Hon-Tong19> dblp:authoredBy <https://dblp.org/pid/132/2136> } }","paraphrases":["Has Chan-Hon-Tong, A. not published the paper 'An Algorithm for Generating Invisible Data Poisoning Using Adversarial Noise That Breaks Image Classification Deep Learning'?"],"info":{}}
{"id":"train_1750","question":"Didn't Warren, James R. and Piekarski, W. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/00/256> . ?x dblp:authoredBy <https://dblp.org/pid/15/2169> }","paraphrases":["Was a paper not not co-authored by James R. Warren and Piekarski, W.?"],"info":{}}
{"id":"train_1751","question":"Was a paper not not co-authored by Marc Van Droogenbroeck and Anthony Cioppa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/83/4730> . ?x dblp:authoredBy <https://dblp.org/pid/222/2684> }","paraphrases":["Didn't Marc Van Droogenbroeck and A. Cioppa not co-author a paper?"],"info":{}}
{"id":"train_1752","question":"Wasn't the paper 'Modeling Syntactic Complexity with P Systems: A Preview' not not published by the person named Benedek Nagy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/uc/EnguixN14> dblp:authoredBy <https://dblp.org/pid/06/6134> }","paraphrases":["Didn't Benedek Nagy not publish the paper 'Modeling Syntactic Complexity with P Systems: A Preview'?"],"info":{}}
{"id":"train_1753","question":"Was a paper not not co-authored by Bengio, Samy and J. Mari\\u00E9thoz?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/b/SamyBengio> . ?x dblp:authoredBy <https://dblp.org/pid/26/2004> }","paraphrases":["Didn't Bengio, Samy and Johnny Mari\\u00E9thoz not co-author a paper?"],"info":{}}
{"id":"train_1756","question":"Has M. V. Sokolova not not published the paper 'Evaluation of environmental impact upon human health with DeciMaS framework'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eswa/SokolovaF12> dblp:authoredBy <https://dblp.org/pid/82/2712> }","paraphrases":["Was the paper 'Evaluation of environmental impact upon human health with DeciMaS framework' not not published by the person M. V. Sokolova?"],"info":{}}
{"id":"train_1757","question":"Was a paper not not co-authored by Kiyoharu Aizawa and Naoto Inoue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/71/5426> . ?x dblp:authoredBy <https://dblp.org/pid/51/9469> }","paraphrases":["Didn't Aizawa, Kiyoharu and Inoue, N. not co-author a paper?"],"info":{}}
{"id":"train_1758","question":"Didn't Oguzhan Kara and Atalay, A. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/80/7653> . ?x dblp:authoredBy <https://dblp.org/pid/99/7655> }","paraphrases":["Was a paper not not co-authored by O. Kara and Adem Atalay?"],"info":{}}
{"id":"train_1759","question":"Wasn't the paper 'Power Management and Data Rate Maximization in Wireless Energy Harvesting Sensors' not not published by the author Chandra R. Murthy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijwin/Murthy09> dblp:authoredBy <https://dblp.org/pid/96/4430> }","paraphrases":["Didn't Murthy, Chandra R. not publish the paper 'Power Management and Data Rate Maximization in Wireless Energy Harvesting Sensors'?"],"info":{}}
{"id":"train_1760","question":"Was a paper not not co-authored by Peter Jung and Andreas Waadt?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/63/6119-2> . ?x dblp:authoredBy <https://dblp.org/pid/49/4369> }","paraphrases":["Didn't P. Jung and Andreas W. not co-author a paper?"],"info":{}}
{"id":"train_1762","question":"Didn't Partha Pratim Das and Biswanath N. Chatterji not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/43/4145> . ?x dblp:authoredBy <https://dblp.org/pid/c/BiswanathNChatterji> }","paraphrases":["Was a paper not not co-authored by Partha Pratim Das and Biswanath N. Chatterji?"],"info":{}}
{"id":"train_1763","question":"Doesn't S. Ove Hansson not work at Royal Institute of Technology, Stockholm, Sweden?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/h/SvenOveHansson> dblp:primaryAffiliation 'Royal Institute of Technology, Stockholm, Sweden' }","paraphrases":["Isn't Sven Ove Hansson not affiliated with Royal Institute of Technology?"],"info":{}}
{"id":"train_1764","question":"Didn't Kautz, H. A. and Jesse Wang not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/k/HenryAKautz> . ?x dblp:authoredBy <https://dblp.org/pid/175/6379> }","paraphrases":["Was a paper not not co-authored by Kautz, H. A. and Jesse Wang?"],"info":{}}
{"id":"train_1765","question":"Has Hinduja, S. not not published the paper 'Recognition of rough machining features in 2D components'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cad/XuH98> dblp:authoredBy <https://dblp.org/pid/07/745> }","paraphrases":["Didn't Srichand Hinduja not publish the paper 'Recognition of rough machining features in 2D components'?"],"info":{}}
{"id":"train_1766","question":"Isn't Yang, Wen not affiliated with Wuhan University?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/42/3814-1> dblp:primaryAffiliation 'Wuhan University, School of Electronic Information / Collaborative Innovation Center of Geospatial Technology, China' }","paraphrases":["Doesn't Yang, Wen not work at Wuhan University?"],"info":{}}
{"id":"train_1767","question":"Didn't Lee, H. and S. Abdulhadi not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/77/41> . ?x dblp:authoredBy <https://dblp.org/pid/42/10472> }","paraphrases":["Was a paper not not co-authored by Hyunsung Lee and Salah Abdulhadi?"],"info":{}}
{"id":"train_1768","question":"Was a paper not not co-authored by Martin D. and V. Nov\\u00E1k?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/20/7616> . ?x dblp:authoredBy <https://dblp.org/pid/97/2490> }","paraphrases":["Didn't Martin Dyba and Vil\\u00E9m Nov\\u00E1k not co-author a paper?"],"info":{}}
{"id":"train_1770","question":"Was a paper not not co-authored by Vasilios Stefanis and A. Komninos?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/88/2098> . ?x dblp:authoredBy <https://dblp.org/pid/61/5974> }","paraphrases":["Didn't Vasilios S. and A. Komninos not co-author a paper?"],"info":{}}
{"id":"train_1771","question":"Wasn't the paper 'From Design to Test: A High-Speed PRBS' not not published by the person named Kehan Zhu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tvlsi/ZhuS18> dblp:authoredBy <https://dblp.org/pid/00/8568> }","paraphrases":["Was the paper 'From Design to Test: A High-Speed PRBS' not not published by the person Kehan Zhu?"],"info":{}}
