{"id":"train_6769","question":"Which one was published first, 'A Goal-oriented Mixed-granularity Component Selection Method for Huge Component Repositories' or 'Automatic Tuning of the Parallelism Degree in Hardware Transactional Memory'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/seke/XiPLH08> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/europar/RughettiRQC14> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/seke/XiPLH08> , <https://dblp.org/rec/conf/europar/RughettiRQC14> ) AS ?answer ) }","paraphrases":["Between 'A Goal-oriented Mixed-granularity Component Selection Method for Huge Component Repositories' and 'Automatic Tuning of the Parallelism Degree in Hardware Transactional Memory', which paper was published earlier?"],"info":{}}
{"id":"train_6770","question":"Between 'Nonparametric Part Transfer for Fine-Grained Recognition' and 'Enhancing Cybersecurity Capability in Local Governments through Competency-Based Education', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cvpr/GoringRFD14> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/hicss/Pike21> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/cvpr/GoringRFD14> , <https://dblp.org/rec/conf/hicss/Pike21> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Nonparametric Part Transfer for Fine-Grained Recognition' or 'Enhancing Cybersecurity Capability in Local Governments through Competency-Based Education'?"],"info":{}}
{"id":"train_6771","question":"Between 'Learning Artificial Intelligence: Insights into How Youth Encounter and Build Understanding of AI Concepts' and 'Development of an Instrument to Assess Individual IT Culture', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aaai/GreenwaldLW21> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/amcis/Walsh09> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/aaai/GreenwaldLW21> , <https://dblp.org/rec/conf/amcis/Walsh09> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Learning Artificial Intelligence: Insights into How Youth Encounter and Build Understanding of AI Concepts' or 'Development of an Instrument to Assess Individual IT Culture'?"],"info":{}}
{"id":"train_6774","question":"Which one has more number of authors, 'An accelerated gradient-based iterative algorithm for solving extended Sylvester-conjugate matrix equations' or 'New Trends in Education in Conditions of Emerging Global Information Infrastructure'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tinstmc/BayoumiR18> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/ifip3/Demchenko98> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tinstmc/BayoumiR18> , <https://dblp.org/rec/conf/ifip3/Demchenko98> ) AS ?answer ) }","paraphrases":["Between 'An accelerated gradient-based iterative algorithm for solving extended Sylvester-conjugate matrix equations' and 'New Trends in Education in Conditions of Emerging Global Information Infrastructure', which paper has more authors?"],"info":{}}
{"id":"train_6775","question":"What is the primary affiliation of most of the authors of the paper 'Trustworthy Clouds Underpinning the Future Internet'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/fia/GlottHSS11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Trustworthy Clouds Underpinning the Future Internet' from?"],"info":{}}
{"id":"train_6777","question":"Mention the author who has published the most papers among the authors of 'State-space averaging of switched-inductor-cell for PWM dc-dc converters considering conduction losses in both operational modes'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iscas/DavoudiJ06> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'State-space averaging of switched-inductor-cell for PWM dc-dc converters considering conduction losses in both operational modes'?"],"info":{}}
{"id":"train_6778","question":"Which one has more number of authors, 'Taking Initial Steps towards Enterprise Architecture in Local Government' or 'Robotics for social safety'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/egov/AskH11> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ar/HamadaF01> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/egov/AskH11> , <https://dblp.org/rec/journals/ar/HamadaF01> ) AS ?answer ) }","paraphrases":["Between 'Taking Initial Steps towards Enterprise Architecture in Local Government' and 'Robotics for social safety', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6779","question":"Between 'Legal Assignments and fast EADAM with consent via classical theory of stable matchings' and 'An Iterative Reinforcement Approach for Fine-Grained Opinion Mining', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1809-08506> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/naacl/DuT09> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/corr/abs-1809-08506> , <https://dblp.org/rec/conf/naacl/DuT09> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Legal Assignments and fast EADAM with consent via classical theory of stable matchings' or 'An Iterative Reinforcement Approach for Fine-Grained Opinion Mining'?"],"info":{}}
{"id":"train_6780","question":"Between 'Fully nonlinear oscillator noise analysis: an oscillator with no asymptotic phase' and 'Return Time Statistics and Anti-Phase Regularization in Coupled Chaotic Maps Modeling bursting oscillations', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcta/Demir07> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ijbc/AllioC10> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/ijcta/Demir07> , <https://dblp.org/rec/journals/ijbc/AllioC10> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Fully nonlinear oscillator noise analysis: an oscillator with no asymptotic phase' or 'Return Time Statistics and Anti-Phase Regularization in Coupled Chaotic Maps Modeling bursting oscillations'?"],"info":{}}
{"id":"train_6782","question":"Which one has more number of authors, 'Himawari-8/AHI Aerosol Optical Depth Detection Based on Machine Learning Algorithm' or 'Bioelectronics: Biosensors'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/remotesensing/ChenFLLTWC22> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/iasam/AddyGR11> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/remotesensing/ChenFLLTWC22> , <https://dblp.org/rec/conf/iasam/AddyGR11> ) AS ?answer ) }","paraphrases":["Between 'Himawari-8/AHI Aerosol Optical Depth Detection Based on Machine Learning Algorithm' and 'Bioelectronics: Biosensors', which paper has more authors?"],"info":{}}
{"id":"train_6784","question":"To which institution are the majority of the authors of 'Learning analytics to identify exploratory dialogue within synchronous text chat' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/lak/FergusonS11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Learning analytics to identify exploratory dialogue within synchronous text chat' from?"],"info":{}}
{"id":"train_6786","question":"Between 'From Self-Similar Structures to Self-Similar Groups' and 'Domain Generalization Using a Mixture of Multiple Latent Domains', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijac/KelleherSW12> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/aaai/MatsuuraH20> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/ijac/KelleherSW12> , <https://dblp.org/rec/conf/aaai/MatsuuraH20> ) AS ?answer ) }","paraphrases":["Which one was published first, 'From Self-Similar Structures to Self-Similar Groups' or 'Domain Generalization Using a Mixture of Multiple Latent Domains'?"],"info":{}}
{"id":"train_6787","question":"Between 'A new n-level high voltage inversion system' and 'The challenges of virtual prototyping and qualification for future microelectronics', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tie/SuhH97> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/mr/Zhang03> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tie/SuhH97> , <https://dblp.org/rec/journals/mr/Zhang03> ) AS ?answer ) }","paraphrases":["Between 'A new n-level high voltage inversion system' and 'The challenges of virtual prototyping and qualification for future microelectronics', which paper has more authors?"],"info":{}}
{"id":"train_6789","question":"Between 'A Multi-dimensional Weighting Method for Historical Records in Cloud Service Evaluation' and 'Efficient storage and retrieval of medical records using fusion-based multimodal biometrics', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/bdcloud/QiNXWY14> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ijcaet/LalithamaniA18> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/bdcloud/QiNXWY14> , <https://dblp.org/rec/journals/ijcaet/LalithamaniA18> ) AS ?answer ) }","paraphrases":["Which one was published first, 'A Multi-dimensional Weighting Method for Historical Records in Cloud Service Evaluation' or 'Efficient storage and retrieval of medical records using fusion-based multimodal biometrics'?"],"info":{}}
{"id":"train_6792","question":"Which one has more number of authors, 'Context Aware Road-user Importance Estimation (iCARE)' or 'Employees' Break-offs and Location Selection: The Birth of Industrial Clusters'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1909-05152> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/tem/LeeLM12> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/corr/abs-1909-05152> , <https://dblp.org/rec/journals/tem/LeeLM12> ) AS ?answer ) }","paraphrases":["Between 'Context Aware Road-user Importance Estimation (iCARE)' and 'Employees' Break-offs and Location Selection: The Birth of Industrial Clusters', which paper has more authors?"],"info":{}}
{"id":"train_6794","question":"Between 'Leader as an Effective Strategy Implementer in Public Higher Education Institutions' and 'Adaptive Spatial Filtering for an FH/SSMA Packet Radio Network with Packet Combining', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ahfe/MnichW19> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ijwin/Kim01> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/ahfe/MnichW19> , <https://dblp.org/rec/journals/ijwin/Kim01> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Leader as an Effective Strategy Implementer in Public Higher Education Institutions' or 'Adaptive Spatial Filtering for an FH/SSMA Packet Radio Network with Packet Combining'?"],"info":{}}
{"id":"train_6795","question":"Between 'Metaheuristics for Strain Optimization Using Transcriptional Information Enriched Metabolic Models' and 'On the Block Triangular Form of Symmetric Matrices', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/evoW/VilacaMRR10> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/siamrev/DuffU10> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/evoW/VilacaMRR10> , <https://dblp.org/rec/journals/siamrev/DuffU10> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Metaheuristics for Strain Optimization Using Transcriptional Information Enriched Metabolic Models' or 'On the Block Triangular Form of Symmetric Matrices'?"],"info":{}}
{"id":"train_6796","question":"Mention the author who has published the most papers among the authors of 'Efficiently Answering Top-k Typicality Queries on Large Databases'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/vldb/HuaPFLL07> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Efficiently Answering Top-k Typicality Queries on Large Databases'?"],"info":{}}
{"id":"train_6798","question":"Which one has more number of authors, 'Mining maximal subnetworks from interaction network with node attributes' or '\\Parallel Training Considered Harmful?\\: Comparing series-parallel and parallel feedforward network training'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/bibm/GoparajuQS15> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ijon/RibeiroA18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/bibm/GoparajuQS15> , <https://dblp.org/rec/journals/ijon/RibeiroA18> ) AS ?answer ) }","paraphrases":["Between 'Mining maximal subnetworks from interaction network with node attributes' and '\\Parallel Training Considered Harmful?\\: Comparing series-parallel and parallel feedforward network training', which paper has more authors?"],"info":{}}
{"id":"train_6799","question":"Between 'Didaktische Aspekte der Dialogformen bei Auskunftlehrsystemen' and 'Third-generation wireless services for homeland security', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/rgu/MartinH74> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/bell/BalachandranBDK04> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/rgu/MartinH74> , <https://dblp.org/rec/journals/bell/BalachandranBDK04> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Didaktische Aspekte der Dialogformen bei Auskunftlehrsystemen' or 'Third-generation wireless services for homeland security'?"],"info":{}}
{"id":"train_6800","question":"Mention the year in which the first papers of the authors of 'Orienting Matroids Representable Over Both GF(3) and GF(5)' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/ejc/Lee99> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Orienting Matroids Representable Over Both GF(3) and GF(5)' published?"],"info":{}}
{"id":"train_6802","question":"Between 'Feature Integration with Adaptive Importance Maps for Visual Tracking' and 'Human and Animal Motion Tracking Using Inertial Sensors', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcai/LiYY18> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/sensors/Marin20> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/ijcai/LiYY18> , <https://dblp.org/rec/journals/sensors/Marin20> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Feature Integration with Adaptive Importance Maps for Visual Tracking' or 'Human and Animal Motion Tracking Using Inertial Sensors'?"],"info":{}}
{"id":"train_6803","question":"Mention the year in which the first papers of the authors of 'Quantitative Analysis of Soil Total Nitrogen Using Hyperspectral Imaging Technology with Extreme Learning Machine' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/sensors/LiJL19> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Quantitative Analysis of Soil Total Nitrogen Using Hyperspectral Imaging Technology with Extreme Learning Machine' published?"],"info":{}}
{"id":"train_6804","question":"Which one was published first, 'Reconfigurable Intelligent Surfaces: Potentials, Applications, and Challenges for 6G Wireless Networks' or 'Reducing lead time for modeling in CAD simulation softwares'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/wc/BasharatHPMDG21> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/wsc/ThomasKR05> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/wc/BasharatHPMDG21> , <https://dblp.org/rec/conf/wsc/ThomasKR05> ) AS ?answer ) }","paraphrases":["Between 'Reconfigurable Intelligent Surfaces: Potentials, Applications, and Challenges for 6G Wireless Networks' and 'Reducing lead time for modeling in CAD simulation softwares', which paper was published earlier?"],"info":{}}
{"id":"train_6805","question":"Name the primary affiliation of most of the authors of 'Textual Analysis of Stock Market Prediction Using Financial News Articles'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/amcis/SchumakerC06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Textual Analysis of Stock Market Prediction Using Financial News Articles' from?"],"info":{}}
{"id":"train_6806","question":"Mention the year in which the first papers of the authors of 'WHUSUM: Wuhan University at the Update Summarization Task of TAC 2009' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/tac/HuJ09> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["In which year were the first papers of the authors of 'WHUSUM: Wuhan University at the Update Summarization Task of TAC 2009' published?"],"info":{}}
{"id":"train_6807","question":"Between 'Networking across boundaries: enabling wireless communication through the water-air interface' and 'SD-WISE: A Software-Defined WIreless SEnsor network', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigcomm/TonoliniA18> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/cn/AnadiotisGMMP19> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/sigcomm/TonoliniA18> , <https://dblp.org/rec/journals/cn/AnadiotisGMMP19> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Networking across boundaries: enabling wireless communication through the water-air interface' or 'SD-WISE: A Software-Defined WIreless SEnsor network'?"],"info":{}}
{"id":"train_6808","question":"To which institution are the majority of the authors of '3D image generation with laser radar based on APD arrays' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/igarss/ZhouLJLLSY15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of '3D image generation with laser radar based on APD arrays' from?"],"info":{}}
{"id":"train_6809","question":"Between 'Boosted KZ and LLL Algorithms' and 'Optogenetic fMRI and electrophysiological identification of region-specific connectivity between the cerebellar cortex and forebrain', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/LyuL17> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/neuroimage/ChoeSHOM18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/corr/LyuL17> , <https://dblp.org/rec/journals/neuroimage/ChoeSHOM18> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Boosted KZ and LLL Algorithms' or 'Optogenetic fMRI and electrophysiological identification of region-specific connectivity between the cerebellar cortex and forebrain'?"],"info":{}}
{"id":"train_6811","question":"Between 'A Novel Medical Image Signcryption Scheme Using TLTS and Henon Chaotic Map' and 'Hierarchical simultaneous localization and mapping', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/AliA20> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/iros/LisienMSKRC03> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/access/AliA20> , <https://dblp.org/rec/conf/iros/LisienMSKRC03> ) AS ?answer ) }","paraphrases":["Which one was published first, 'A Novel Medical Image Signcryption Scheme Using TLTS and Henon Chaotic Map' or 'Hierarchical simultaneous localization and mapping'?"],"info":{}}
{"id":"train_6812","question":"Between 'Simple derivation and closed-form frequency-domain design of wideband length-8 interpolation kernel' and 'Statistical Analysis of Reliability Data (M J Crowder, A C Kimber, R L Smith, and T J Sweeting)', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigpro/Deng17> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/siamrev/Singpurwalla93> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/sigpro/Deng17> , <https://dblp.org/rec/journals/siamrev/Singpurwalla93> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Simple derivation and closed-form frequency-domain design of wideband length-8 interpolation kernel' or 'Statistical Analysis of Reliability Data (M J Crowder, A C Kimber, R L Smith, and T J Sweeting)'?"],"info":{}}
{"id":"train_6813","question":"Mention the year in which the first papers of the authors of 'Assisted Magnetic Resonance Imaging Diagnosis for Alzheimer's Disease Based on Kernel Principal Component Analysis and Supervised Classification Schemes' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/jips/WangZYS21> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Assisted Magnetic Resonance Imaging Diagnosis for Alzheimer's Disease Based on Kernel Principal Component Analysis and Supervised Classification Schemes' published?"],"info":{}}
{"id":"train_6814","question":"Who has published the most papers among the authors of 'Problem 11094'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tamm/Bataille04> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the author who has published the most papers among the authors of 'Problem 11094'."],"info":{}}
{"id":"train_6815","question":"Mention the primary affiliation of most of the authors of 'Automatic Lane Detection in Chromatography Images'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iciar/MoreiraSMC12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'Automatic Lane Detection in Chromatography Images'?"],"info":{}}
{"id":"train_6816","question":"Between 'Performance improvement in detection and estimation of MC-CDMA systems over MIMO channels' and 'Towards the model-driven engineering of security requirements for embedded systems', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cee/KumaratharanD10> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/re/RoudierIA13> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/cee/KumaratharanD10> , <https://dblp.org/rec/conf/re/RoudierIA13> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Performance improvement in detection and estimation of MC-CDMA systems over MIMO channels' or 'Towards the model-driven engineering of security requirements for embedded systems'?"],"info":{}}
{"id":"train_6818","question":"Which one has more number of authors, 'Multijoint Control Strategies Transfer Between Tasks' or '\\u041C\\u043E\\u0434\\u0435\\u043B\\u044C \\u0441\\u0435\\u043C\\u0430\\u043D\\u0442\\u0438\\u0447\\u0435\\u0441\\u043A\\u043E\\u0433\\u043E \\u0443\\u043F\\u0440\\u0430\\u0432\\u043B\\u0435\\u043D\\u0438\\u044F \\u043B\\u0438\\u0447\\u043D\\u043E\\u0439 \\u0438\\u043D\\u0444\\u043E\\u0440\\u043C\\u0430\\u0446\\u0438\\u0435\\u0439 (Model of Semantic Personal Information Management System)'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bc/McNitt-GrayRF06> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/rcdl/BezdushnyBS14> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/bc/McNitt-GrayRF06> , <https://dblp.org/rec/conf/rcdl/BezdushnyBS14> ) AS ?answer ) }","paraphrases":["Between 'Multijoint Control Strategies Transfer Between Tasks' and '\\u041C\\u043E\\u0434\\u0435\\u043B\\u044C \\u0441\\u0435\\u043C\\u0430\\u043D\\u0442\\u0438\\u0447\\u0435\\u0441\\u043A\\u043E\\u0433\\u043E \\u0443\\u043F\\u0440\\u0430\\u0432\\u043B\\u0435\\u043D\\u0438\\u044F \\u043B\\u0438\\u0447\\u043D\\u043E\\u0439 \\u0438\\u043D\\u0444\\u043E\\u0440\\u043C\\u0430\\u0446\\u0438\\u0435\\u0439 (Model of Semantic Personal Information Management System)', which paper has more authors?"],"info":{}}
{"id":"train_6821","question":"Between 'A gyrification analysis approach based on Laplace Beltrami eigenfunction level sets' and 'The Software Design of Car Low-Speed Intelligent Braking System', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/neuroimage/ShishegarPGEJJ21> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/cscloud/BaoHLJ15> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/neuroimage/ShishegarPGEJJ21> , <https://dblp.org/rec/conf/cscloud/BaoHLJ15> ) AS ?answer ) }","paraphrases":["Between 'A gyrification analysis approach based on Laplace Beltrami eigenfunction level sets' and 'The Software Design of Car Low-Speed Intelligent Braking System', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6822","question":"Between 'Improvement of driver to gate coupling circuits for SiC MOSFETS' and 'Service', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isie/BalcellsMLL14> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ki/Timpf08b> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/isie/BalcellsMLL14> , <https://dblp.org/rec/journals/ki/Timpf08b> ) AS ?answer ) }","paraphrases":["Between 'Improvement of driver to gate coupling circuits for SiC MOSFETS' and 'Service', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6823","question":"Mention the author who has published the most papers among the authors of 'Black holes, quantum mechanics, and the limits of polynomial-time computability'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/crossroads/Jordan16> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Black holes, quantum mechanics, and the limits of polynomial-time computability'?"],"info":{}}
{"id":"train_6824","question":"Between 'Experimental Test of an Interacting Multiple Model Filtering Algorithm for Actuator Fault Detection and Diagnosis of an Unmanned Quadrotor Helicopter' and 'Development of A Novel Vacuum-Suction Gripper Capable of Changing Gripping Position', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icira/AmoozgarCZ12> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/robio/ChenCLZGZ18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/icira/AmoozgarCZ12> , <https://dblp.org/rec/conf/robio/ChenCLZGZ18> ) AS ?answer ) }","paraphrases":["Between 'Experimental Test of an Interacting Multiple Model Filtering Algorithm for Actuator Fault Detection and Diagnosis of an Unmanned Quadrotor Helicopter' and 'Development of A Novel Vacuum-Suction Gripper Capable of Changing Gripping Position', which paper has more number of co-authors?"],"info":{}}
