{"id":"train_1409","question":"Did Bashir, Murwan not publish the paper 'Convex Combination of LMF and ZA-LMF for Variable Sparse System Identification' in ACSSC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acssc/IqbalBZA19> dblp:authoredBy <https://dblp.org/pid/176/8132> . <https://dblp.org/rec/conf/acssc/IqbalBZA19> dblp:publishedIn 'ACSSC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/acssc/IqbalBZA19> dblp:authoredBy <https://dblp.org/pid/176/8132> . <https://dblp.org/rec/conf/acssc/IqbalBZA19> dblp:publishedIn 'ACSSC' } }","paraphrases":["Was the paper 'Convex Combination of LMF and ZA-LMF for Variable Sparse System Identification' not published by Bashir, Murwan in Asilomar Conference on Signals, Systems and Computing?"],"info":{}}
{"id":"train_1410","question":"Did Wenke W. and Lintao Zheng not co-author the paper 'Feature-Based Streamline Selection Method for 2D Flow Fields'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cadgraphics/ZhengWL15> dblp:authoredBy <https://dblp.org/pid/11/11007> . <https://dblp.org/rec/conf/cadgraphics/ZhengWL15> dblp:authoredBy <https://dblp.org/pid/178/5013> FILTER NOT EXISTS { <https://dblp.org/rec/conf/cadgraphics/ZhengWL15> dblp:authoredBy <https://dblp.org/pid/11/11007> . <https://dblp.org/rec/conf/cadgraphics/ZhengWL15> dblp:authoredBy <https://dblp.org/pid/178/5013> } }","paraphrases":["Was the paper 'Feature-Based Streamline Selection Method for 2D Flow Fields' not co-authored by Wenke W. and Lintao Zheng?"],"info":{}}
{"id":"train_1411","question":"Was the paper 'On Coxeter Spectral Study of Edge-bipartite Graphs in Relation with Dynkin Diagrams' not published by the person M. Felisiak?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/colognetwente/FelisiakS12> dblp:authoredBy <https://dblp.org/pid/05/11104> FILTER NOT EXISTS { <https://dblp.org/rec/conf/colognetwente/FelisiakS12> dblp:authoredBy <https://dblp.org/pid/05/11104> } }","paraphrases":["Has M. Felisiak not published the paper 'On Coxeter Spectral Study of Edge-bipartite Graphs in Relation with Dynkin Diagrams'?"],"info":{}}
{"id":"train_1412","question":"Did Dale N. Richardson not publish the paper 'Properties of Sequence Conservation in Upstream Regulatory and Protein Coding Sequences among Paralogs in Arabidopsis thaliana'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/recomb/RichardsonW09> dblp:authoredBy <https://dblp.org/pid/16/7420> FILTER NOT EXISTS { <https://dblp.org/rec/conf/recomb/RichardsonW09> dblp:authoredBy <https://dblp.org/pid/16/7420> } }","paraphrases":["Wasn't the paper 'Properties of Sequence Conservation in Upstream Regulatory and Protein Coding Sequences among Paralogs in Arabidopsis thaliana' not published by the author Dale N. Richardson?"],"info":{}}
{"id":"train_1413","question":"Was the paper 'Multi-Agent Systems in Quantum Security for Modern Wireless Networks' not co-authored by Dharmendra Sharma and Xu Huang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kes/HuangS09> dblp:authoredBy <https://dblp.org/pid/18/3371-1> . <https://dblp.org/rec/conf/kes/HuangS09> dblp:authoredBy <https://dblp.org/pid/00/2922-1> FILTER NOT EXISTS { <https://dblp.org/rec/conf/kes/HuangS09> dblp:authoredBy <https://dblp.org/pid/18/3371-1> . <https://dblp.org/rec/conf/kes/HuangS09> dblp:authoredBy <https://dblp.org/pid/00/2922-1> } }","paraphrases":["Did Dharmendra Sharma and Xu Huang not co-author the paper 'Multi-Agent Systems in Quantum Security for Modern Wireless Networks'?"],"info":{}}
{"id":"train_1415","question":"Did Samuel J. M. Cartaxo and F. Andre Narciso Fernandes not co-author the paper 'Educational software for heat exchanger equipment'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/caee/CartaxoF10> dblp:authoredBy <https://dblp.org/pid/201/0558> . <https://dblp.org/rec/journals/caee/CartaxoF10> dblp:authoredBy <https://dblp.org/pid/201/0584> FILTER NOT EXISTS { <https://dblp.org/rec/journals/caee/CartaxoF10> dblp:authoredBy <https://dblp.org/pid/201/0558> . <https://dblp.org/rec/journals/caee/CartaxoF10> dblp:authoredBy <https://dblp.org/pid/201/0584> } }","paraphrases":["Was the paper 'Educational software for heat exchanger equipment' not co-authored by Samuel J. M. Cartaxo and Fabiano Andre Narciso Fernandes?"],"info":{}}
{"id":"train_1416","question":"Has the paper 'Stochastic functions using sequential logic' not been published by Naman Saraf in ICCD?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccd/SarafBLR13> dblp:authoredBy <https://dblp.org/pid/139/2474> . <https://dblp.org/rec/conf/iccd/SarafBLR13> dblp:publishedIn 'ICCD' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccd/SarafBLR13> dblp:authoredBy <https://dblp.org/pid/139/2474> . <https://dblp.org/rec/conf/iccd/SarafBLR13> dblp:publishedIn 'ICCD' } }","paraphrases":["Was the paper 'Stochastic functions using sequential logic' not published by Naman Saraf in ICCD?"],"info":{}}
{"id":"train_1417","question":"Was the paper 'Approximating the Void: Learning Stochastic Channel Models from Observation with Variational Generative Adversarial Networks' not published by T. J. O'Shea?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1805-06350> dblp:authoredBy <https://dblp.org/pid/176/5279> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1805-06350> dblp:authoredBy <https://dblp.org/pid/176/5279> } }","paraphrases":["Did Timothy J. O'Shea not publish the paper 'Approximating the Void: Learning Stochastic Channel Models from Observation with Variational Generative Adversarial Networks'?"],"info":{}}
{"id":"train_1418","question":"Was the paper 'Modelling of Pseudonymity under Probabilistic Linkability Attacks' not co-authored by Neubauer, Martin and Jun Zhong?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cse/Neubauer09> dblp:authoredBy <https://dblp.org/pid/75/2857> . <https://dblp.org/rec/conf/cse/Neubauer09> dblp:authoredBy <https://dblp.org/pid/79/9455> FILTER NOT EXISTS { <https://dblp.org/rec/conf/cse/Neubauer09> dblp:authoredBy <https://dblp.org/pid/75/2857> . <https://dblp.org/rec/conf/cse/Neubauer09> dblp:authoredBy <https://dblp.org/pid/79/9455> } }","paraphrases":["Did Neubauer, Martin and Jun Zhong not co-author the paper 'Modelling of Pseudonymity under Probabilistic Linkability Attacks'?"],"info":{}}
{"id":"train_1419","question":"Wasn't the paper 'Deep Learning for Bibliographic Catalogue Assisting System' not published by the person named Apilak Suntornacane?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iait/Maneewongvatana21> dblp:authoredBy <https://dblp.org/pid/297/9723> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iait/Maneewongvatana21> dblp:authoredBy <https://dblp.org/pid/297/9723> } }","paraphrases":["Was the paper 'Deep Learning for Bibliographic Catalogue Assisting System' not published by A. Suntornacane?"],"info":{}}
{"id":"train_1421","question":"Did Kambhampati, S. and Minh Binh Do not co-author the paper 'Planning with Partial Preference Models'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcai/NguyenDKS09> dblp:authoredBy <https://dblp.org/pid/k/SKambhampati> . <https://dblp.org/rec/conf/ijcai/NguyenDKS09> dblp:authoredBy <https://dblp.org/pid/45/3725> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ijcai/NguyenDKS09> dblp:authoredBy <https://dblp.org/pid/k/SKambhampati> . <https://dblp.org/rec/conf/ijcai/NguyenDKS09> dblp:authoredBy <https://dblp.org/pid/45/3725> } }","paraphrases":["Have Kambhampati, S. and Minh Binh Do not co-authored the paper 'Planning with Partial Preference Models'?"],"info":{}}
{"id":"train_1422","question":"Wasn't the paper 'GVTS: Global Virtual Time Fair Scheduling to Support Strict Fairness on Many Cores' published by the author Jaehyuk Huh in IEEE Trans. Parallel Distributed Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tpds/KimCH19> dblp:authoredBy <https://dblp.org/pid/83/5240> . <https://dblp.org/rec/journals/tpds/KimCH19> dblp:publishedIn 'IEEE Trans. Parallel Distributed Syst.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tpds/KimCH19> dblp:authoredBy <https://dblp.org/pid/83/5240> . <https://dblp.org/rec/journals/tpds/KimCH19> dblp:publishedIn 'IEEE Trans. Parallel Distributed Syst.' } }","paraphrases":["Was the paper 'GVTS: Global Virtual Time Fair Scheduling to Support Strict Fairness on Many Cores' not published by Jaehyuk Huh in IEEE Trans. Parallel Distributed Syst.?"],"info":{}}
{"id":"train_1423","question":"Did Kamga, R. Thierry Dzati and Sim\\u00E9on Fotso not co-author the paper 'Metrics of Symmetric Difference on Fuzzy Sets Based on R-implicators of the Usual Families of t-norms'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eusflat/FotsoKF17> dblp:authoredBy <https://dblp.org/pid/213/6010> . <https://dblp.org/rec/conf/eusflat/FotsoKF17> dblp:authoredBy <https://dblp.org/pid/32/3946> FILTER NOT EXISTS { <https://dblp.org/rec/conf/eusflat/FotsoKF17> dblp:authoredBy <https://dblp.org/pid/213/6010> . <https://dblp.org/rec/conf/eusflat/FotsoKF17> dblp:authoredBy <https://dblp.org/pid/32/3946> } }","paraphrases":["Was the paper 'Metrics of Symmetric Difference on Fuzzy Sets Based on R-implicators of the Usual Families of t-norms' not co-authored by Kamga, R. Thierry Dzati and S. Fotso?"],"info":{}}
{"id":"train_1424","question":"Was the paper 'A Measure of Fault Tolerance for Distributed Networks' not published by Constantine Stivaros?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icci/Stivaros92> dblp:authoredBy <https://dblp.org/pid/99/5432> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icci/Stivaros92> dblp:authoredBy <https://dblp.org/pid/99/5432> } }","paraphrases":["Wasn't the paper 'A Measure of Fault Tolerance for Distributed Networks' not published by the person named Stivaros, Constantine?"],"info":{}}
{"id":"train_1425","question":"Was the paper 'Fine-grained robust prosody transfer for single-speaker neural text-to-speech' not published by Srikanth Ronanki in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1907-02479> dblp:authoredBy <https://dblp.org/pid/180/2841> . <https://dblp.org/rec/journals/corr/abs-1907-02479> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1907-02479> dblp:authoredBy <https://dblp.org/pid/180/2841> . <https://dblp.org/rec/journals/corr/abs-1907-02479> dblp:publishedIn 'CoRR' } }","paraphrases":["Has the paper 'Fine-grained robust prosody transfer for single-speaker neural text-to-speech' not been published by Srikanth R. in CoRR?"],"info":{}}
{"id":"train_1426","question":"Have Tuo, L. and Ying Xia not co-authored the paper 'An incremental community mining method in dynamic social networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccis/XiaT14> dblp:authoredBy <https://dblp.org/pid/181/6483> . <https://dblp.org/rec/conf/ccis/XiaT14> dblp:authoredBy <https://dblp.org/pid/69/3540> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ccis/XiaT14> dblp:authoredBy <https://dblp.org/pid/181/6483> . <https://dblp.org/rec/conf/ccis/XiaT14> dblp:authoredBy <https://dblp.org/pid/69/3540> } }","paraphrases":["Was the paper 'An incremental community mining method in dynamic social networks' not co-authored by Linglin Tuo and Xia, Ying?"],"info":{}}
{"id":"train_1427","question":"Did Massimo F. and Khan, J. Ahmed not co-author the paper 'Pragmatism and European Philosophy: William James and the French-Italian Connection'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/daglib/p/Ferrari14> dblp:authoredBy <https://dblp.org/pid/177/0662> . <https://dblp.org/rec/books/daglib/p/Ferrari14> dblp:authoredBy <https://dblp.org/pid/124/1951> FILTER NOT EXISTS { <https://dblp.org/rec/books/daglib/p/Ferrari14> dblp:authoredBy <https://dblp.org/pid/177/0662> . <https://dblp.org/rec/books/daglib/p/Ferrari14> dblp:authoredBy <https://dblp.org/pid/124/1951> } }","paraphrases":["Was the paper 'Pragmatism and European Philosophy: William James and the French-Italian Connection' not co-authored by Massimo Ferrari and Junaid Ahmed Khan?"],"info":{}}
{"id":"train_1430","question":"Wasn't the paper 'An In-Class Competition Introducing Inventory Management Concepts' not published by the person named Edward A. Silver?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ited/RobbJS10> dblp:authoredBy <https://dblp.org/pid/71/5195> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ited/RobbJS10> dblp:authoredBy <https://dblp.org/pid/71/5195> } }","paraphrases":["Has Edward A. Silver not published the paper 'An In-Class Competition Introducing Inventory Management Concepts'?"],"info":{}}
{"id":"train_1431","question":"Wasn't the paper 'HEEC: a hybrid unequal energy efficient clustering for wireless sensor networks' not published by the author Amir-Massoud Bidgoli?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/winet/BozorgiB19> dblp:authoredBy <https://dblp.org/pid/94/7490> FILTER NOT EXISTS { <https://dblp.org/rec/journals/winet/BozorgiB19> dblp:authoredBy <https://dblp.org/pid/94/7490> } }","paraphrases":["Did Amir-Massoud Bidgoli not publish the paper 'HEEC: a hybrid unequal energy efficient clustering for wireless sensor networks'?"],"info":{}}
{"id":"train_1433","question":"Was the paper 'A charging scenario for parallel buck-boost battery power modules with full power utilization and charge equalization' not published by the person Chang, C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icit2/WuCM15> dblp:authoredBy <https://dblp.org/pid/245/1922> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icit2/WuCM15> dblp:authoredBy <https://dblp.org/pid/245/1922> } }","paraphrases":["Wasn't the paper 'A charging scenario for parallel buck-boost battery power modules with full power utilization and charge equalization' not published by the person named Chang, C.?"],"info":{}}
{"id":"train_1434","question":"Wasn't the paper 'A simulation-based optimization heuristic using self-organization for complex assembly lines' published by the author Daniel Bohn in WSC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wsc/AngelidisBR12> dblp:authoredBy <https://dblp.org/pid/124/6206> . <https://dblp.org/rec/conf/wsc/AngelidisBR12> dblp:publishedIn 'WSC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/wsc/AngelidisBR12> dblp:authoredBy <https://dblp.org/pid/124/6206> . <https://dblp.org/rec/conf/wsc/AngelidisBR12> dblp:publishedIn 'WSC' } }","paraphrases":["Did Daniel Bohn not publish the paper 'A simulation-based optimization heuristic using self-organization for complex assembly lines' in Winter Simulation Conference?"],"info":{}}
{"id":"train_1435","question":"Was the paper 'A performance enhanced dual-switch Network-on-Chip architecture' not published by Watanabe, Takahiro in ASP-DAC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aspdac/ZengW15> dblp:authoredBy <https://dblp.org/pid/27/4073> . <https://dblp.org/rec/conf/aspdac/ZengW15> dblp:publishedIn 'ASP-DAC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/aspdac/ZengW15> dblp:authoredBy <https://dblp.org/pid/27/4073> . <https://dblp.org/rec/conf/aspdac/ZengW15> dblp:publishedIn 'ASP-DAC' } }","paraphrases":["Wasn't the paper 'A performance enhanced dual-switch Network-on-Chip architecture' published by the author Takahiro Watanabe in ASP-DAC?"],"info":{}}
{"id":"train_1436","question":"Was the paper 'Identify Visual Human Signature in community via wearable camera' not published by Winston H. Hsu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/TsaoCHH15> dblp:authoredBy <https://dblp.org/pid/16/5668> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icassp/TsaoCHH15> dblp:authoredBy <https://dblp.org/pid/16/5668> } }","paraphrases":["Didn't Winston H. Hsu publish the paper 'Identify Visual Human Signature in community via wearable camera'?"],"info":{}}
{"id":"train_1437","question":"Was the paper 'Impatience in mobile networks and its application to data pricing' not published by Salah-Eddine Elayoubi in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/ElayoubiFGRS14> dblp:authoredBy <https://dblp.org/pid/12/2684> . <https://dblp.org/rec/journals/corr/ElayoubiFGRS14> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/ElayoubiFGRS14> dblp:authoredBy <https://dblp.org/pid/12/2684> . <https://dblp.org/rec/journals/corr/ElayoubiFGRS14> dblp:publishedIn 'CoRR' } }","paraphrases":["Has the paper 'Impatience in mobile networks and its application to data pricing' not been published by S. Elayoubi in CoRR?"],"info":{}}
{"id":"train_1438","question":"Was the paper 'An Ontology Based Model for Experts Search and Ranking' not published by Trong Hai Duong?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aciids/UddinDOJ11> dblp:authoredBy <https://dblp.org/pid/49/1164> FILTER NOT EXISTS { <https://dblp.org/rec/conf/aciids/UddinDOJ11> dblp:authoredBy <https://dblp.org/pid/49/1164> } }","paraphrases":["Wasn't the paper 'An Ontology Based Model for Experts Search and Ranking' not published by the person named Trong Hai Duong?"],"info":{}}
{"id":"train_1439","question":"Wasn't the paper 'Evaluation of ISR technologies for counter insurgency warfare' published by the author Israel, Steven A. in AIPR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aipr/Israel10> dblp:authoredBy <https://dblp.org/pid/16/549> . <https://dblp.org/rec/conf/aipr/Israel10> dblp:publishedIn 'AIPR' FILTER NOT EXISTS { <https://dblp.org/rec/conf/aipr/Israel10> dblp:authoredBy <https://dblp.org/pid/16/549> . <https://dblp.org/rec/conf/aipr/Israel10> dblp:publishedIn 'AIPR' } }","paraphrases":["Did Israel, Steven A. not publish the paper 'Evaluation of ISR technologies for counter insurgency warfare' in AIPR?"],"info":{}}
{"id":"train_1441","question":"Wasn't the paper 'Bayesian Validation of Computer Models' not published by the person named Shuchun Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/technometrics/WangCT09> dblp:authoredBy <https://dblp.org/pid/89/6150> FILTER NOT EXISTS { <https://dblp.org/rec/journals/technometrics/WangCT09> dblp:authoredBy <https://dblp.org/pid/89/6150> } }","paraphrases":["Was the paper 'Bayesian Validation of Computer Models' not published by the person Shuchun Wang?"],"info":{}}
{"id":"train_1442","question":"Wasn't the paper 'On the Emulation of Software Faults by Software Fault Injection' not published by the person named Madeira, Henrique?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dsn/MadeiraCV00> dblp:authoredBy <https://dblp.org/pid/33/2879> FILTER NOT EXISTS { <https://dblp.org/rec/conf/dsn/MadeiraCV00> dblp:authoredBy <https://dblp.org/pid/33/2879> } }","paraphrases":["Was the paper 'On the Emulation of Software Faults by Software Fault Injection' not published by Henrique Madeira?"],"info":{}}
{"id":"train_1445","question":"Did Dominique Barthel not publish the paper 'Energy-efficient physical layer packet authenticator for machine-to-machine networks' in Trans. Emerg. Telecommun. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ett/BartoliHLKB13> dblp:authoredBy <https://dblp.org/pid/26/1072> . <https://dblp.org/rec/journals/ett/BartoliHLKB13> dblp:publishedIn 'Trans. Emerg. Telecommun. Technol.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ett/BartoliHLKB13> dblp:authoredBy <https://dblp.org/pid/26/1072> . <https://dblp.org/rec/journals/ett/BartoliHLKB13> dblp:publishedIn 'Trans. Emerg. Telecommun. Technol.' } }","paraphrases":["Has the paper 'Energy-efficient physical layer packet authenticator for machine-to-machine networks' not been published by Barthel, D. in Trans. Emerg. Telecommun. Technol.?"],"info":{}}
{"id":"train_1446","question":"Wasn't the paper 'Determination of stem position and height of reconstructed maize plants using a time-of-flight camera' not published by the author V\\u00E1zquez-Arellano, M.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cea/Vazquez-Arellano18a> dblp:authoredBy <https://dblp.org/pid/177/1017> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cea/Vazquez-Arellano18a> dblp:authoredBy <https://dblp.org/pid/177/1017> } }","paraphrases":["Has Manuel V\\u00E1zquez-Arellano not published the paper 'Determination of stem position and height of reconstructed maize plants using a time-of-flight camera'?"],"info":{}}
{"id":"train_1447","question":"Did Ariyur, Kartik B. not publish the paper 'Control of formation flight via extremum seeking' in Applied Computing Conference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcc/BinettiAKB02> dblp:authoredBy <https://dblp.org/pid/89/6048> . <https://dblp.org/rec/conf/amcc/BinettiAKB02> dblp:publishedIn 'ACC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/amcc/BinettiAKB02> dblp:authoredBy <https://dblp.org/pid/89/6048> . <https://dblp.org/rec/conf/amcc/BinettiAKB02> dblp:publishedIn 'ACC' } }","paraphrases":["Wasn't the paper 'Control of formation flight via extremum seeking' published by the author Kartik B. Ariyur in ACC?"],"info":{}}
{"id":"train_1448","question":"Was the paper 'Kolmogorov-Smirnov Test for Spectrum Sensing: From the Statistical Test to Energy Detection' not co-authored by Roman Mars\\u00E1lek and Karel P.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sips/MarsalekP12> dblp:authoredBy <https://dblp.org/pid/44/8283> . <https://dblp.org/rec/conf/sips/MarsalekP12> dblp:authoredBy <https://dblp.org/pid/06/8934> FILTER NOT EXISTS { <https://dblp.org/rec/conf/sips/MarsalekP12> dblp:authoredBy <https://dblp.org/pid/44/8283> . <https://dblp.org/rec/conf/sips/MarsalekP12> dblp:authoredBy <https://dblp.org/pid/06/8934> } }","paraphrases":["Have R. Mars\\u00E1lek and Karel P. not co-authored the paper 'Kolmogorov-Smirnov Test for Spectrum Sensing: From the Statistical Test to Energy Detection'?"],"info":{}}
{"id":"train_1450","question":"Have Kenneth A. De Jong and William M. Spears not co-authored the paper 'Dining with GAs: Operator Lunch Theorems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/foga/SpearsJ98> dblp:authoredBy <https://dblp.org/pid/37/3997> . <https://dblp.org/rec/conf/foga/SpearsJ98> dblp:authoredBy <https://dblp.org/pid/s/WilliamMSpears> FILTER NOT EXISTS { <https://dblp.org/rec/conf/foga/SpearsJ98> dblp:authoredBy <https://dblp.org/pid/37/3997> . <https://dblp.org/rec/conf/foga/SpearsJ98> dblp:authoredBy <https://dblp.org/pid/s/WilliamMSpears> } }","paraphrases":["Did Kenneth A. De Jong and Spears, W. M. not co-author the paper 'Dining with GAs: Operator Lunch Theorems'?"],"info":{}}
{"id":"train_1451","question":"Did Witold Kinsner and J. D. Terrazas Gonzalez not co-author the paper 'Zero-crossing analysis of L\\u00E9vy walks for real-time feature extraction'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eit/GonzalezK16> dblp:authoredBy <https://dblp.org/pid/36/6143> . <https://dblp.org/rec/conf/eit/GonzalezK16> dblp:authoredBy <https://dblp.org/pid/16/10084> FILTER NOT EXISTS { <https://dblp.org/rec/conf/eit/GonzalezK16> dblp:authoredBy <https://dblp.org/pid/36/6143> . <https://dblp.org/rec/conf/eit/GonzalezK16> dblp:authoredBy <https://dblp.org/pid/16/10084> } }","paraphrases":["Was the paper 'Zero-crossing analysis of L\\u00E9vy walks for real-time feature extraction' not co-authored by W. Kinsner and Jesus D. Terrazas Gonzalez?"],"info":{}}
{"id":"train_1452","question":"Have Xu, Yin and Yuan Tao not co-authored the paper 'Spatial Distribution Pattern of High-End Hotels Based on Multi-Source Data - A Case Study of Central Beijing City'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/geoinformatics/XuT18> dblp:authoredBy <https://dblp.org/pid/63/3463> . <https://dblp.org/rec/conf/geoinformatics/XuT18> dblp:authoredBy <https://dblp.org/pid/14/8167> FILTER NOT EXISTS { <https://dblp.org/rec/conf/geoinformatics/XuT18> dblp:authoredBy <https://dblp.org/pid/63/3463> . <https://dblp.org/rec/conf/geoinformatics/XuT18> dblp:authoredBy <https://dblp.org/pid/14/8167> } }","paraphrases":["Was the paper 'Spatial Distribution Pattern of High-End Hotels Based on Multi-Source Data - A Case Study of Central Beijing City' not co-authored by Xu, Yin and Yuan Tao?"],"info":{}}
{"id":"train_1454","question":"Wasn't the paper 'Channel Sensitivity of LIFO-Backpressure: Quirks and Improvements' not published by the person named Ari Trachtenberg?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcns/SiSHLT16> dblp:authoredBy <https://dblp.org/pid/t/AriTrachtenberg> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tcns/SiSHLT16> dblp:authoredBy <https://dblp.org/pid/t/AriTrachtenberg> } }","paraphrases":["Didn't Ari Trachtenberg publish the paper 'Channel Sensitivity of LIFO-Backpressure: Quirks and Improvements'?"],"info":{}}
{"id":"train_1455","question":"Wasn't the paper 'Primal - Dual Methods for Vertex and Facet Enumeration' published by the author David Bremner in Discret. Comput. Geom.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dcg/BremnerFM98> dblp:authoredBy <https://dblp.org/pid/b/DavidBremner> . <https://dblp.org/rec/journals/dcg/BremnerFM98> dblp:publishedIn 'Discret. Comput. Geom.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/dcg/BremnerFM98> dblp:authoredBy <https://dblp.org/pid/b/DavidBremner> . <https://dblp.org/rec/journals/dcg/BremnerFM98> dblp:publishedIn 'Discret. Comput. Geom.' } }","paraphrases":["Was the paper 'Primal - Dual Methods for Vertex and Facet Enumeration' not published by Bremner, D. in Discret. Comput. Geom.?"],"info":{}}
{"id":"train_1456","question":"Was the paper 'Development of a distributed evolutionary computing package' not published by Ji Cai in IEEE Congress on Evolutionary Computation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cec/TanPLC03> dblp:authoredBy <https://dblp.org/pid/05/3610> . <https://dblp.org/rec/conf/cec/TanPLC03> dblp:publishedIn 'IEEE Congress on Evolutionary Computation' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cec/TanPLC03> dblp:authoredBy <https://dblp.org/pid/05/3610> . <https://dblp.org/rec/conf/cec/TanPLC03> dblp:publishedIn 'IEEE Congress on Evolutionary Computation' } }","paraphrases":["Wasn't the paper 'Development of a distributed evolutionary computing package' published by the author Ji Cai in IEEE Congress on Evolutionary Computation?"],"info":{}}
{"id":"train_1457","question":"Was the paper 'On the Application of Blockchains to Spectrum Management' not co-authored by Sicker, D. C. and Martin B. H. Weiss?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tccn/WeissWSB19> dblp:authoredBy <https://dblp.org/pid/64/948> . <https://dblp.org/rec/journals/tccn/WeissWSB19> dblp:authoredBy <https://dblp.org/pid/05/2160> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tccn/WeissWSB19> dblp:authoredBy <https://dblp.org/pid/64/948> . <https://dblp.org/rec/journals/tccn/WeissWSB19> dblp:authoredBy <https://dblp.org/pid/05/2160> } }","paraphrases":["Did Douglas C. Sicker and Martin B. H. Weiss not co-author the paper 'On the Application of Blockchains to Spectrum Management'?"],"info":{}}
{"id":"train_1458","question":"Did T. Kabeyasawa not publish the paper 'Enhancing integrated earthquake simulation with high performance computing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/aes/SobhaninejadHK11> dblp:authoredBy <https://dblp.org/pid/56/9748> FILTER NOT EXISTS { <https://dblp.org/rec/journals/aes/SobhaninejadHK11> dblp:authoredBy <https://dblp.org/pid/56/9748> } }","paraphrases":["Wasn't the paper 'Enhancing integrated earthquake simulation with high performance computing' not published by the person named T. Kabeyasawa?"],"info":{}}
{"id":"train_1460","question":"Have N. Enami and Yuko Ozasa not co-authored the paper 'Color saliency for object identification'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fcv/OzasaEA15> dblp:authoredBy <https://dblp.org/pid/57/7906> . <https://dblp.org/rec/conf/fcv/OzasaEA15> dblp:authoredBy <https://dblp.org/pid/61/9372> FILTER NOT EXISTS { <https://dblp.org/rec/conf/fcv/OzasaEA15> dblp:authoredBy <https://dblp.org/pid/57/7906> . <https://dblp.org/rec/conf/fcv/OzasaEA15> dblp:authoredBy <https://dblp.org/pid/61/9372> } }","paraphrases":["Was the paper 'Color saliency for object identification' not co-authored by N. Enami and Yuko O.?"],"info":{}}
{"id":"train_1461","question":"Did Hiroaki Katsurai and Keiji Kishine not co-author the paper 'A Multi-Rate Burst-Mode CDR Using a GVCO With Symmetric Loops for Instantaneous Phase Locking in 65-nm CMOS'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcas/KishineIINTKO15> dblp:authoredBy <https://dblp.org/pid/51/8624> . <https://dblp.org/rec/journals/tcas/KishineIINTKO15> dblp:authoredBy <https://dblp.org/pid/45/6482> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tcas/KishineIINTKO15> dblp:authoredBy <https://dblp.org/pid/51/8624> . <https://dblp.org/rec/journals/tcas/KishineIINTKO15> dblp:authoredBy <https://dblp.org/pid/45/6482> } }","paraphrases":["Was the paper 'A Multi-Rate Burst-Mode CDR Using a GVCO With Symmetric Loops for Instantaneous Phase Locking in 65-nm CMOS' not co-authored by Hiroaki K. and K. Kishine?"],"info":{}}
{"id":"train_1462","question":"Was the paper 'Spatial congruity effects reveal metaphors, not markedness' not published by Dolscheid, S. in Annual Meeting of the Cognitive Science Society?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cogsci/DolscheidGC13> dblp:authoredBy <https://dblp.org/pid/168/1771> . <https://dblp.org/rec/conf/cogsci/DolscheidGC13> dblp:publishedIn 'CogSci' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cogsci/DolscheidGC13> dblp:authoredBy <https://dblp.org/pid/168/1771> . <https://dblp.org/rec/conf/cogsci/DolscheidGC13> dblp:publishedIn 'CogSci' } }","paraphrases":["Wasn't the paper 'Spatial congruity effects reveal metaphors, not markedness' published by the author Sarah Dolscheid in Annual Meeting of the Cognitive Science Society?"],"info":{}}
