{"id":"train_2012","question":"Didn't Patel-Schneider, Peter F. not publish the paper 'System Description: DLP'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cade/Patel-Schneider00> dblp:authoredBy <https://dblp.org/pid/78/850> }","paraphrases":["Has Patel-Schneider, Peter F. not not published the paper 'System Description: DLP'?"],"info":{}}
{"id":"train_2013","question":"Didn't Abend, O. not publish the paper 'PreQuEL: Quality Estimation of Machine Translation Outputs in Advance'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2205-09178> dblp:authoredBy <https://dblp.org/pid/30/8159> }","paraphrases":["Wasn't the paper 'PreQuEL: Quality Estimation of Machine Translation Outputs in Advance' not not published by the person named Omri Abend?"],"info":{}}
{"id":"train_2014","question":"Was the paper 'Social Community Extraction for Disease Propagation Control Leveraging Mobile Phones' not not published by the person Yanzhi Ren?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ahswn/Ren0CC15> dblp:authoredBy <https://dblp.org/pid/34/8334> }","paraphrases":["Wasn't the paper 'Social Community Extraction for Disease Propagation Control Leveraging Mobile Phones' not not published by the author Yanzhi Ren?"],"info":{}}
{"id":"train_2015","question":"Was a paper not not co-authored by Kamal Al-Haddad and Bruno Francois?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/05/1965> . ?x dblp:authoredBy <https://dblp.org/pid/85/8036> }","paraphrases":["Didn't Al-Haddad, Kamal and B. Francois not co-author a paper?"],"info":{}}
{"id":"train_2016","question":"Didn't Yongming Li and Y. Wang not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/39/2889> . ?x dblp:authoredBy <https://dblp.org/pid/42/7569> }","paraphrases":["Was a paper not not co-authored by Yongming L. and Yongbing Wang?"],"info":{}}
{"id":"train_2017","question":"Didn't Lipitakis, Alexandra and Evanthia Faliagka not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/77/3581> . ?x dblp:authoredBy <https://dblp.org/pid/49/3381> }","paraphrases":["Was a paper not not co-authored by Alexandra Lipitakis and E. Faliagka?"],"info":{}}
{"id":"train_2018","question":"Was the paper 'Maximum independent sets in subclasses of P5-free graphs' not not published by the person Vadim V. Lozin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ipl/LozinM09> dblp:authoredBy <https://dblp.org/pid/43/5092> }","paraphrases":["Has Vadim V. Lozin not not published the paper 'Maximum independent sets in subclasses of P5-free graphs'?"],"info":{}}
{"id":"train_2020","question":"Was a paper not not co-authored by Akhil Garg and Prashant Dubey?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/15/4429> . ?x dblp:authoredBy <https://dblp.org/pid/93/2439> }","paraphrases":["Didn't A. Garg and Prashant Dubey not co-author a paper?"],"info":{}}
{"id":"train_2023","question":"Has Pierre Soille not not published the paper 'Hierarchical Segmentation of Complex Structures'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icpr/AkcayAS10> dblp:authoredBy <https://dblp.org/pid/12/6404> }","paraphrases":["Didn't P. Soille not publish the paper 'Hierarchical Segmentation of Complex Structures'?"],"info":{}}
{"id":"train_2024","question":"Wasn't the paper 'The Nonexistence of Some Optimal Ternary Codes of Dimension Five' not not published by the author I. N. Landjev?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dcc/Landjev98> dblp:authoredBy <https://dblp.org/pid/97/4129> }","paraphrases":["Was the paper 'The Nonexistence of Some Optimal Ternary Codes of Dimension Five' not not published by the person Ivan N. Landjev?"],"info":{}}
{"id":"train_2025","question":"Was the paper 'A novel method for wave phenomena investigation' not not published by the person Favorskaya, A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kes/Favorskaya19> dblp:authoredBy <https://dblp.org/pid/191/9281> }","paraphrases":["Didn't Alena Favorskaya not publish the paper 'A novel method for wave phenomena investigation'?"],"info":{}}
{"id":"train_2026","question":"Was a paper not not co-authored by Thomas Christaller and Alois C. Knoll?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/c/TChristaller> . ?x dblp:authoredBy <https://dblp.org/pid/k/AloisKnoll> }","paraphrases":["Didn't Thomas Christaller and Knoll, Alois C. not co-author a paper?"],"info":{}}
{"id":"train_2027","question":"Doesn't E. Biham not work at Technion - Israel Institute of Technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/b/EliBiham> dblp:primaryAffiliation 'Technion - Israel Institute of Technology, Haifa, Israel' }","paraphrases":["Isn't E. Biham not affiliated with Technion - Israel Institute of Technology?"],"info":{}}
{"id":"train_2028","question":"Was the paper 'CBGA-ES: A Cluster-Based Genetic Algorithm with Elitist Selection for Supporting Multi-Objective Test Optimization' not not published by the person Shuai W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icst/PradhanWAYL17> dblp:authoredBy <https://dblp.org/pid/42/1503-1> }","paraphrases":["Wasn't the paper 'CBGA-ES: A Cluster-Based Genetic Algorithm with Elitist Selection for Supporting Multi-Objective Test Optimization' not not published by the person named Shuai Wang?"],"info":{}}
{"id":"train_2029","question":"Didn't William D. Vizzotto and Rudimar Spannemberg not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/173/7584> . ?x dblp:authoredBy <https://dblp.org/pid/189/5180> }","paraphrases":["Was a paper not not co-authored by William D. Vizzotto and Spannemberg, R.?"],"info":{}}
{"id":"train_2030","question":"Was a paper not not co-authored by Yukoh Kida and Shigen S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/237/8581> . ?x dblp:authoredBy <https://dblp.org/pid/237/8728> }","paraphrases":["Didn't Yukoh Kida and Shigen S. not co-author a paper?"],"info":{}}
{"id":"train_2031","question":"Wasn't the paper 'Constrained unidimensional scaling with application to genomics' not not published by the author Pak Chung Sham?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/csda/AoNS07> dblp:authoredBy <https://dblp.org/pid/25/4413> }","paraphrases":["Wasn't the paper 'Constrained unidimensional scaling with application to genomics' not not published by the person named Pak Chung Sham?"],"info":{}}
{"id":"train_2032","question":"Didn't Tom Chen and MuDer Jeng not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/135/3985> . ?x dblp:authoredBy <https://dblp.org/pid/08/1094> }","paraphrases":["Was a paper not not co-authored by Chen, Tom and MuDer Jeng?"],"info":{}}
{"id":"train_2033","question":"Was the paper 'Teaching Programming in Secondary Education Through Embodied Computing Platforms: Robotics and Wearables' not not published by the person Achilles Kameas?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jeric/MerkourisCK17> dblp:authoredBy <https://dblp.org/pid/52/6015> }","paraphrases":["Didn't Achilles Kameas not publish the paper 'Teaching Programming in Secondary Education Through Embodied Computing Platforms: Robotics and Wearables'?"],"info":{}}
{"id":"train_2034","question":"Has Ricardo da Silva Torres not not published the paper 'Unsupervised Distance Learning for Plant Species Identification'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/staeors/AlmeidaPAMT16> dblp:authoredBy <https://dblp.org/pid/s/RicardodaSilvaTorres> }","paraphrases":["Was the paper 'Unsupervised Distance Learning for Plant Species Identification' not not published by the person Ricardo da Silva Torres?"],"info":{}}
{"id":"train_2035","question":"Isn't Benjamin D. not affiliated with \\u00C9cole Polytechnique de Paris, Computer Science Laboratory (LIX), France?","sparql":"ASK { <https://dblp.org/pid/d/BenjaminDoerr> <https://dblp.org/rdf/schema#primaryAffiliation> '\\u00C9cole Polytechnique de Paris, Computer Science Laboratory (LIX), France' }","paraphrases":["Doesn't Benjamin D. not work at \\u00C9cole Polytechnique de Paris?"],"info":{}}
{"id":"train_2036","question":"Was a paper not not co-authored by Watcharapupong, Akkradach and Thanunchai Threepak?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/142/5346> . ?x dblp:authoredBy <https://dblp.org/pid/142/5376> }","paraphrases":["Didn't Akkradach Watcharapupong and Threepak, T. not co-author a paper?"],"info":{}}
{"id":"train_2037","question":"Was the paper 'Resource allocation in wireless networks based on joint packet/call levels QoS constraints' not not published by the person Michael C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/CheungM00> dblp:authoredBy <https://dblp.org/pid/77/2570> }","paraphrases":["Has Michael Cheung not not published the paper 'Resource allocation in wireless networks based on joint packet/call levels QoS constraints'?"],"info":{}}
{"id":"train_2038","question":"Wasn't the paper 'Schedulability Analysis for Real Time On-Chip Communication with Wormhole Switching' not not published by the author Z. Shi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijertcs/ShiBI10> dblp:authoredBy <https://dblp.org/pid/50/3642> }","paraphrases":["Wasn't the paper 'Schedulability Analysis for Real Time On-Chip Communication with Wormhole Switching' not not published by the person named Z. Shi?"],"info":{}}
{"id":"train_2039","question":"Didn't Xuejia Lai and Jialin Huang not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/05/4632> . ?x dblp:authoredBy <https://dblp.org/pid/90/10481> }","paraphrases":["Was a paper not not co-authored by Lai, Xuejia and Jialin Huang?"],"info":{}}
{"id":"train_2040","question":"Was a paper not not co-authored by Zhi Quan and W. J. Kaiser?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/47/5185> . ?x dblp:authoredBy <https://dblp.org/pid/99/4794> }","paraphrases":["Didn't Zhi Q. and W. J. Kaiser not co-author a paper?"],"info":{}}
{"id":"train_2041","question":"Wasn't the paper 'Analytical macromodeling for high-level power estimation' not not published by the author Papaefthymiou, Marios C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccad/BernacchiaP99> dblp:authoredBy <https://dblp.org/pid/73/197> }","paraphrases":["Has Marios C. Papaefthymiou not not published the paper 'Analytical macromodeling for high-level power estimation'?"],"info":{}}
{"id":"train_2042","question":"Was the paper 'The effect of computer science on the learning of computational physics' not not published by the person Mordechai Ben-Ari?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iticse/TaubBA14> dblp:authoredBy <https://dblp.org/pid/b/MBenAri> }","paraphrases":["Didn't Mordechai Ben-Ari not publish the paper 'The effect of computer science on the learning of computational physics'?"],"info":{}}
{"id":"train_2043","question":"Was a paper not not co-authored by DiNucci, David C. and Robert G. Babb II?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/02/1090> . ?x dblp:authoredBy <https://dblp.org/pid/35/2680> }","paraphrases":["Didn't David C. DiNucci and Robert G. Babb II not co-author a paper?"],"info":{}}
{"id":"train_2044","question":"Isn't John Wickerson not affiliated with Imperial College London?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/21/7915> dblp:primaryAffiliation 'Imperial College London, Department of Electrical and Electronic Engineering, UK' }","paraphrases":["Doesn't J. Wickerson not work at Imperial College London, Department of Electrical and Electronic Engineering, UK?"],"info":{}}
{"id":"train_2045","question":"Was a paper not not co-authored by \\u00D8degaard, Fredrik and Sudipendra N. Roy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/143/1678> . ?x dblp:authoredBy <https://dblp.org/pid/141/2323> }","paraphrases":["Didn't Fredrik \\u00D8degaard and Sudipendra Nath Roy not co-author a paper?"],"info":{}}
{"id":"train_2046","question":"Was a paper not not co-authored by Pierre Hansen and Aouchiche, Mustapha?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/h/PierreHansen> . ?x dblp:authoredBy <https://dblp.org/pid/64/5936> }","paraphrases":["Didn't Pierre H. and Mustapha Aouchiche not co-author a paper?"],"info":{}}
{"id":"train_2048","question":"Was a paper not not co-authored by August-Wilhelm Scheer and Behdenna, Salima?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/s/AugustWilhelmScheer> . ?x dblp:authoredBy <https://dblp.org/pid/217/5666> }","paraphrases":["Didn't Scheer, August-Wilhelm and Behdenna, Salima not co-author a paper?"],"info":{}}
{"id":"train_2049","question":"Was a paper not not co-authored by Robert J. Sheehan and Luke Moors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/22/4336> . ?x dblp:authoredBy <https://dblp.org/pid/201/9132> }","paraphrases":["Didn't Robert J. Sheehan and Luke Moors not co-author a paper?"],"info":{}}
{"id":"train_2050","question":"Has Sebastian Thrun not not published the paper 'Learning Metric-Topological Maps for Indoor Mobile Robot Navigation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ai/Thrun98> dblp:authoredBy <https://dblp.org/pid/t/SebastianThrun> }","paraphrases":["Wasn't the paper 'Learning Metric-Topological Maps for Indoor Mobile Robot Navigation' not not published by the author Sebastian T.?"],"info":{}}
{"id":"train_2051","question":"Has Tian Chen not not published the paper 'Integrated Iterated Local Search for the Permutation Flowshop Problem with Tardiness Minimization'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/smc/ChenL13> dblp:authoredBy <https://dblp.org/pid/66/5721> }","paraphrases":["Wasn't the paper 'Integrated Iterated Local Search for the Permutation Flowshop Problem with Tardiness Minimization' not not published by the author Tian Chen?"],"info":{}}
{"id":"train_2052","question":"Was a paper not not co-authored by Anders Ledberg and Rita A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/87/8535> . ?x dblp:authoredBy <https://dblp.org/pid/71/8535> }","paraphrases":["Didn't Anders L. and Rita A. not co-author a paper?"],"info":{}}
{"id":"train_2053","question":"Isn't E. Bardsley not affiliated with University of Waikato, Faculty of Science and Engineering, New Zealand?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/197/1248> dblp:primaryAffiliation 'University of Waikato, Faculty of Science and Engineering, New Zealand' }","paraphrases":["Doesn't E. Bardsley not work at University of Waikato, Faculty of Science and Engineering, New Zealand?"],"info":{}}
{"id":"train_2054","question":"Didn't Carlos Velasco and Juan-Carlos Escanciano not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/08/2083> . ?x dblp:authoredBy <https://dblp.org/pid/96/7213> }","paraphrases":["Was a paper not not co-authored by Carlos V. and Juan-Carlos Escanciano?"],"info":{}}
{"id":"train_2055","question":"Didn't Clemens A. Otto and Lou, Y. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/226/3571> . ?x dblp:authoredBy <https://dblp.org/pid/199/5547> }","paraphrases":["Was a paper not not co-authored by Clemens A. Otto and Lou, Y.?"],"info":{}}
{"id":"train_2056","question":"Didn't J. Li and Lei Yu not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/18/6870-1> . ?x dblp:authoredBy <https://dblp.org/pid/01/2775-2> }","paraphrases":["Was a paper not not co-authored by J. Li and Lei Yu?"],"info":{}}
{"id":"train_2058","question":"Didn't Jordan B. Pollack and Ofer Melnik not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/89/43> . ?x dblp:authoredBy <https://dblp.org/pid/93/3470> }","paraphrases":["Was a paper not not co-authored by Jordan B. Pollack and Ofer Melnik?"],"info":{}}
{"id":"train_2059","question":"Didn't Park, Ye-Seul not publish the paper 'Convergence Modeling of Heterogeneous Medical Information for Acute Myocardial Infarction'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/csa2/LeePKL15> dblp:authoredBy <https://dblp.org/pid/192/3779> }","paraphrases":["Was the paper 'Convergence Modeling of Heterogeneous Medical Information for Acute Myocardial Infarction' not not published by the person Park, Ye-Seul?"],"info":{}}
{"id":"train_2060","question":"Wasn't the paper 'Semi-supervised Active Salient Object Detection' not not published by the person named B. Liu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pr/LvLZDLZ22> dblp:authoredBy <https://dblp.org/pid/41/1201> }","paraphrases":["Has Bowen Liu not not published the paper 'Semi-supervised Active Salient Object Detection'?"],"info":{}}
{"id":"train_2061","question":"Was a paper not not co-authored by Huiru Cheng and Yuejun Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/160/3770> . ?x dblp:authoredBy <https://dblp.org/pid/10/2095> }","paraphrases":["Didn't H. Cheng and Yuejun L. not co-author a paper?"],"info":{}}
{"id":"train_2062","question":"Didn't Sampath Rangarajan and Narayan Prasad not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/67/43> . ?x dblp:authoredBy <https://dblp.org/pid/49/5591> }","paraphrases":["Was a paper not not co-authored by Rangarajan, Sampath and Narayan Prasad?"],"info":{}}
{"id":"train_2063","question":"Didn't Leah Epstein not publish the paper 'Lower bounds for online bin covering-type problems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/scheduling/BaloghEL19> dblp:authoredBy <https://dblp.org/pid/e/LeahEpstein> }","paraphrases":["Wasn't the paper 'Lower bounds for online bin covering-type problems' not not published by the author Epstein, Leah?"],"info":{}}
{"id":"train_2064","question":"Wasn't the paper 'Transfer Learning for Gender and Age Prediction' not not published by the person named Jia-Ching Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icce-tw/NgaNTW20> dblp:authoredBy <https://dblp.org/pid/41/2001> }","paraphrases":["Didn't Wang, Jia-Ching not publish the paper 'Transfer Learning for Gender and Age Prediction'?"],"info":{}}
{"id":"train_2066","question":"Doesn't A. Koschmider not work at Kiel University, Germany?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/k/AgnesKoschmider> dblp:primaryAffiliation 'Kiel University, Germany' }","paraphrases":["Isn't Agnes Koschmider not affiliated with Kiel University, Germany?"],"info":{}}
{"id":"train_2067","question":"Didn't Hao, Gaoming not publish the paper 'Precision Work-piece Detection and Measurement Combining Top-down and Bottom-up Saliency'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijautcomp/SunWLHQ18> dblp:authoredBy <https://dblp.org/pid/237/8968> }","paraphrases":["Was the paper 'Precision Work-piece Detection and Measurement Combining Top-down and Bottom-up Saliency' not not published by the person Gaoming Hao?"],"info":{}}
{"id":"train_2068","question":"Wasn't the paper 'Sound Pryer: Adding Value to Traffic Encounters with Streaming Audio' not not published by the person named \\u00D6stergren, M.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwec/Ostergren04> dblp:authoredBy <https://dblp.org/pid/21/3248> }","paraphrases":["Wasn't the paper 'Sound Pryer: Adding Value to Traffic Encounters with Streaming Audio' not not published by the author \\u00D6stergren, M.?"],"info":{}}
{"id":"train_2069","question":"Didn't Michael Hofer not publish the paper 'A fully automated trabecular bone structural analysis tool based on T2*-weighted magnetic resonance imaging'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cmig/KraigerMOERHSS12> dblp:authoredBy <https://dblp.org/pid/99/2991> }","paraphrases":["Was the paper 'A fully automated trabecular bone structural analysis tool based on T2*-weighted magnetic resonance imaging' not not published by the person Michael Hofer?"],"info":{}}
{"id":"train_2070","question":"Didn't Yanling Chang not publish the paper 'Value of information for a leader-follower partially observed Markov game'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/anor/ChangEW15a> dblp:authoredBy <https://dblp.org/pid/144/7740> }","paraphrases":["Wasn't the paper 'Value of information for a leader-follower partially observed Markov game' not not published by the person named Yanling Chang?"],"info":{}}
{"id":"train_2071","question":"Didn't Marius Pesavento and Parvazi, P. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/74/8014> . ?x dblp:authoredBy <https://dblp.org/pid/26/8760> }","paraphrases":["Was a paper not not co-authored by Pesavento, M. and Pouyan Parvazi?"],"info":{}}
{"id":"train_2072","question":"Doesn't Ferreira, C. not work at University of Aveiro?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/61/2411-1> dblp:primaryAffiliation 'University of Aveiro, Department of Economics, Management and Industrial Engineering / Institute of Electronics and Informatics Engineering, Portugal' }","paraphrases":["Isn't Carlos Ferreira not affiliated with University of Aveiro?"],"info":{}}
{"id":"train_2073","question":"Didn't Jan K. and Aqib Javed not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/60/455> . ?x dblp:authoredBy <https://dblp.org/pid/156/9389> }","paraphrases":["Was a paper not not co-authored by Jan K. and Aqib Javed?"],"info":{}}
{"id":"train_2075","question":"Didn't Ahmed Abdullah Alqarni not publish the paper 'Deep Learning Algorithms for Detection and Classification of Gastrointestinal Diseases'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/complexity/Al-AdhailehSAAA21> dblp:authoredBy <https://dblp.org/pid/271/1992> }","paraphrases":["Wasn't the paper 'Deep Learning Algorithms for Detection and Classification of Gastrointestinal Diseases' not not published by the author Ahmed Abdullah Alqarni?"],"info":{}}
{"id":"train_2076","question":"Was a paper not not co-authored by Human Esmaeili and P. Charles Woods?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/164/6751> . ?x dblp:authoredBy <https://dblp.org/pid/76/2114> }","paraphrases":["Didn't Human Esmaeili and Peter Charles Woods not co-author a paper?"],"info":{}}
{"id":"train_2077","question":"Didn't W. Liang and Chun-Shien Lu not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/158/4750> . ?x dblp:authoredBy <https://dblp.org/pid/40/4382> }","paraphrases":["Was a paper not not co-authored by W. Liang and Chun-Shien Lu?"],"info":{}}
{"id":"train_2078","question":"Wasn't the paper 'The Effects of Virtual Learning Environment on High School Students' English Learning Performance and Attitude' not not published by the person named Tai-Liang Wu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icitl/PengLW19> dblp:authoredBy <https://dblp.org/pid/253/8690> }","paraphrases":["Has Wu, Tai-Liang not not published the paper 'The Effects of Virtual Learning Environment on High School Students' English Learning Performance and Attitude'?"],"info":{}}
{"id":"train_2079","question":"Was the paper 'Predicting crop yields under climate change conditions from monthly GCM weather projection' not not published by the person Pachepsky, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/envsoft/ReddyP00> dblp:authoredBy <https://dblp.org/pid/62/961> }","paraphrases":["Wasn't the paper 'Predicting crop yields under climate change conditions from monthly GCM weather projection' not not published by the author Yakov Pachepsky?"],"info":{}}
{"id":"train_2080","question":"Was a paper not not co-authored by Ingo S. and Jens S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/11/1807> . ?x dblp:authoredBy <https://dblp.org/pid/71/1103> }","paraphrases":["Didn't Ingo S. and Jens Sch\\u00F6nherr not co-author a paper?"],"info":{}}
{"id":"train_2081","question":"Was a paper not not co-authored by Dillon H. and R. Daly?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/233/0724> . ?x dblp:authoredBy <https://dblp.org/pid/149/0146> }","paraphrases":["Didn't Dillon H. and Ross Daly not co-author a paper?"],"info":{}}
{"id":"train_2082","question":"Was a paper not not co-authored by Raitio, T. and Paavo Alku?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/19/8809> . ?x dblp:authoredBy <https://dblp.org/pid/99/2726> }","paraphrases":["Didn't Raitio, T. and Paavo A. not co-author a paper?"],"info":{}}
{"id":"train_2083","question":"Was the paper 'Leakage-Based Hybrid Transceiver Design for Millimeter Wave Multi-User Interference Channel' not not published by the person P. Ubaidulla?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/JagyasiU17> dblp:authoredBy <https://dblp.org/pid/89/5028> }","paraphrases":["Wasn't the paper 'Leakage-Based Hybrid Transceiver Design for Millimeter Wave Multi-User Interference Channel' not not published by the author P. Ubaidulla?"],"info":{}}
{"id":"train_2084","question":"Was a paper not not co-authored by Najdawi, M. K. and W. P. Wagner?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/69/3925> . ?x dblp:authoredBy <https://dblp.org/pid/66/1742> }","paraphrases":["Didn't Mohammad K. Najdawi and W. P. Wagner not co-author a paper?"],"info":{}}
{"id":"train_2085","question":"Was a paper not not co-authored by Victor Hazlewood and Barbara H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/04/4418> . ?x dblp:authoredBy <https://dblp.org/pid/139/4902> }","paraphrases":["Didn't V. Hazlewood and Barbara H. not co-author a paper?"],"info":{}}
{"id":"train_2086","question":"Wasn't the paper 'Zero-shot Learning with Semantic Output Codes' not not published by the author Palatucci, Mark?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nips/PalatucciPHM09> dblp:authoredBy <https://dblp.org/pid/37/2638> }","paraphrases":["Didn't Mark Palatucci not publish the paper 'Zero-shot Learning with Semantic Output Codes'?"],"info":{}}
{"id":"train_2087","question":"Wasn't the paper 'Experimentally Validated Extended Kalman Filter Approach for Geomagnetically Induced Current Measurement' not not published by the person named M. Shafie-khah?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tie/BehdaniTAPSC22> dblp:authoredBy <https://dblp.org/pid/143/8893> }","paraphrases":["Wasn't the paper 'Experimentally Validated Extended Kalman Filter Approach for Geomagnetically Induced Current Measurement' not not published by the author M. Shafie-khah?"],"info":{}}
{"id":"train_2088","question":"Didn't Itkin, B. and Wolf, L. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/213/8464> . ?x dblp:authoredBy <https://dblp.org/pid/83/4103> }","paraphrases":["Was a paper not not co-authored by Barak Itkin and Wolf, L.?"],"info":{}}
{"id":"train_2089","question":"Doesn't Ricardo Baeza-Yates not work at NTENT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/b/RABaezaYates> dblp:primaryAffiliation 'NTENT' }","paraphrases":["Isn't Ricardo Baeza-Yates not affiliated with NTENT?"],"info":{}}
{"id":"train_2090","question":"Didn't Bangwen D. and W. Wu not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/224/2149> . ?x dblp:authoredBy <https://dblp.org/pid/55/8398> }","paraphrases":["Was a paper not not co-authored by Bangwen Deng and W. Wu?"],"info":{}}
{"id":"train_2091","question":"Was a paper not not co-authored by Wynne Hsu and Parthasarathy, S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/h/WynneHsu> . ?x dblp:authoredBy <https://dblp.org/pid/p/SParathasarathy> }","paraphrases":["Didn't Wynne Hsu and Parthasarathy, S. not co-author a paper?"],"info":{}}
{"id":"train_2092","question":"Doesn't Marc Moonen not work at Catholic University of Leuven?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/41/6762> dblp:primaryAffiliation 'Catholic University of Leuven, Belgium' }","paraphrases":["Isn't Marc M. not affiliated with Catholic University of Leuven, Belgium?"],"info":{}}
{"id":"train_2093","question":"Isn't Li, G. Ye not affiliated with Georgia Institute of Technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/89/5914> dblp:primaryAffiliation 'Georgia Institute of Technology, Atlanta, GA, USA' }","paraphrases":["Doesn't Geoffrey Ye Li not work at Georgia Institute of Technology, Atlanta, GA, USA?"],"info":{}}
{"id":"train_2094","question":"Was a paper not not co-authored by Kai H\\u00F6ffner and Paul I. Barton?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/157/1741> . ?x dblp:authoredBy <https://dblp.org/pid/81/3426> }","paraphrases":["Didn't H\\u00F6ffner, Kai and Paul I. Barton not co-author a paper?"],"info":{}}
