{"id":"train_5856","question":"List the venues in which 'Parameterized complexity of the MINCCA problem on graphs of bounded decomposability' and 'Using Metaprogramming to Add Persistence to CLOS' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tcs/GozupekOPSS17> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/iccl/LeeZ94> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'Parameterized complexity of the MINCCA problem on graphs of bounded decomposability' and 'Using Metaprogramming to Add Persistence to CLOS' were published."],"info":{}}
{"id":"train_5857","question":"List the venues in which 'Providing Hard Real-Time Guarantees in Context-Aware Applications: Challenges and Requirements' and 'ULMFiT replication' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/nca/BoulkenafedHMBC05> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/lrec/AbdellatifE20> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'Providing Hard Real-Time Guarantees in Context-Aware Applications: Challenges and Requirements' and 'ULMFiT replication' were published."],"info":{}}
{"id":"train_5858","question":"Who are the authors of the paper 'A neighborhood condition for fractional ID-[a, b]-factor-critical graphs' and the publication 'View Synthesis from Unregistered 2-D Images'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/dmgt/SunYZ16> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/dmgt/SunYZ16> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'A neighborhood condition for fractional ID-[a, b]-factor-critical graphs' and 'View Synthesis from Unregistered 2-D Images'?"],"info":{}}
{"id":"train_5862","question":"Mention the years in which 'Logic Programming: Further Developments' and 'Ein Virtueller Dokumentenserver f\\u00FCr Digitale Bibliotheken' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/slp/Gallaire85> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/btw/Zeitz01> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Logic Programming: Further Developments' and 'Ein Virtueller Dokumentenserver f\\u00FCr Digitale Bibliotheken' published?"],"info":{}}
{"id":"train_5863","question":"Mention the venues in which 'Lossy Compression with Near-uniform Encoder Outputs' and 'Multi-timescale Fairness for Heterogeneous Broadband Traffic in Access-Aggregation Networks' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/VellambiKB16> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/epew/NadasVHMT21> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Lossy Compression with Near-uniform Encoder Outputs' and 'Multi-timescale Fairness for Heterogeneous Broadband Traffic in Access-Aggregation Networks' published?"],"info":{}}
{"id":"train_5864","question":"List the venues in which 'Generation and compaction of mixed broadside and skewed-load n-detection test sets for transition faults' and 'Cryptanalysis of 'MAKE'' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/dft/Pomeranz12> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/iacr/BrownKL21> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Generation and compaction of mixed broadside and skewed-load n-detection test sets for transition faults' and 'Cryptanalysis of 'MAKE'' published?"],"info":{}}
{"id":"train_5865","question":"Mention the years in which 'A Conflict Detection Method Based on Constraint Satisfaction in Collaborative Design' and 'Myosis' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jcse/YangWZZ15> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/siggraph/Thompson14> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'A Conflict Detection Method Based on Constraint Satisfaction in Collaborative Design' and 'Myosis' published?"],"info":{}}
{"id":"train_5868","question":"List the venues in which 'Metering equipment running error estimation model based on genetic optimized LM algorithm' and 'A Constraint-Based Framework for Test Case Generation in Method-Level Black-Box Unit Testing' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jcmse/ChenHLDK22> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/jise/ChangL16> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Metering equipment running error estimation model based on genetic optimized LM algorithm' and 'A Constraint-Based Framework for Test Case Generation in Method-Level Black-Box Unit Testing' published?"],"info":{}}
{"id":"train_5869","question":"Name the authors of 'A New Approach for Designing Stable Nonlinear bounded-Lipschitz Observers' and 'PM2PLS: An Integration of Proxy Mobile IPv6 and MPLS'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/med/PapageorgiouA20> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/med/PapageorgiouA20> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'A New Approach for Designing Stable Nonlinear bounded-Lipschitz Observers' and 'PM2PLS: An Integration of Proxy Mobile IPv6 and MPLS'?"],"info":{}}
{"id":"train_5871","question":"Who are the authors of the paper 'Accelerated training of conditional random fields with stochastic gradient methods' and the publication 'Why Can't We Implement This SDM?'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icml/VishwanathanSSM06> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/icml/VishwanathanSSM06> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Accelerated training of conditional random fields with stochastic gradient methods' and 'Why Can't We Implement This SDM?'?"],"info":{}}
{"id":"train_5873","question":"Name the authors of 'Minimal Sufficient Conditions for Structural Observability/Controllability of Composite Networks via Kronecker Product' and 'On-Line Predictive Load Shedding for Network Monitoring'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-1912-03470> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-1912-03470> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Minimal Sufficient Conditions for Structural Observability/Controllability of Composite Networks via Kronecker Product' and 'On-Line Predictive Load Shedding for Network Monitoring'?"],"info":{}}
{"id":"train_5877","question":"Mention the venues in which 'Encouraging Self-Explanation Through Case-Based Tutoring: A Case Study' and 'Platforms and viability of mobile GIS in real-time hydrological models: A review and proposed model' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iccbr/RedmondP97> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/jsit/AlsabhanL11> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Encouraging Self-Explanation Through Case-Based Tutoring: A Case Study' and 'Platforms and viability of mobile GIS in real-time hydrological models: A review and proposed model' published?"],"info":{}}
{"id":"train_5878","question":"Mention the years in which 'Model development of a Bayesian Belief Network for managing inundation events for wetland fish' and 'On the Role of Avatars in Argumentation' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/envsoft/VilizziPBGKKMN13> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/ht/BlountMW15a> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Model development of a Bayesian Belief Network for managing inundation events for wetland fish' and 'On the Role of Avatars in Argumentation' published?"],"info":{}}
{"id":"train_5881","question":"Mention the venues in which 'Multiuser Scheduling and Pairing With Interference Mitigation for LTE Uplink Cellular Networks' and 'Diffusion Models for Peer-to-Peer (P2P) Media Distribution: On the Impact of Decentralized, Constrained Supply' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tvt/FanLLL15> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/isr/HosanagarHT10> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Multiuser Scheduling and Pairing With Interference Mitigation for LTE Uplink Cellular Networks' and 'Diffusion Models for Peer-to-Peer (P2P) Media Distribution: On the Impact of Decentralized, Constrained Supply' published?"],"info":{}}
{"id":"train_5882","question":"Mention the venues in which 'A novel and fast MPC based control strategy for switched linear systems including soft switching cost' and 'Helping Poor Readers: A Case Study of a Computer Assisted Instruction Reading Tutorial' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/cdc/GauLZ17> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/amcis/Crews03> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'A novel and fast MPC based control strategy for switched linear systems including soft switching cost' and 'Helping Poor Readers: A Case Study of a Computer Assisted Instruction Reading Tutorial' published?"],"info":{}}
{"id":"train_5884","question":"Who are the authors of 'Content Dependent Data Hiding on GSM Full Rate Encoded Speech' and 'Query Building in a Distributed Semantic Indexing System'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icsap/ShahbaziSRSM10> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/icsap/ShahbaziSRSM10> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Content Dependent Data Hiding on GSM Full Rate Encoded Speech' and the publication 'Query Building in a Distributed Semantic Indexing System'?"],"info":{}}
{"id":"train_5886","question":"Who are the authors of 'Modified gradient dynamic approach to the tensor complementarity problem' and 'Multi-modal dimensionality reduction using effective distance'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/oms/WangCQW20> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/oms/WangCQW20> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Modified gradient dynamic approach to the tensor complementarity problem' and the publication 'Multi-modal dimensionality reduction using effective distance'?"],"info":{}}
{"id":"train_5888","question":"List the venues in which 'Orbital Energy-Based Reaction Analysis of SN2 Reactions' and 'An Efficient Signcryption Scheme from q-Diffie-Hellman Problems' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/computation/TsunedaMHS16> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/iacr/Kar12a> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Orbital Energy-Based Reaction Analysis of SN2 Reactions' and 'An Efficient Signcryption Scheme from q-Diffie-Hellman Problems' published?"],"info":{}}
{"id":"train_5890","question":"List the venues in which 'Deterministic microcode machine generation' and 'Image inpainting via a control-theoretical model of human vision' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/desec/MzahMA17> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/icca/BoscainGP18> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Deterministic microcode machine generation' and 'Image inpainting via a control-theoretical model of human vision' published?"],"info":{}}
{"id":"train_5891","question":"Mention the venues in which 'Mithril: Stake-based Threshold Multisignatures' and 'Eight Problems for the Mirror Neuron Theory of Action Understanding in Monkeys and Humans' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/iacr/ChaidosK21> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/jocn/Hickok09> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Mithril: Stake-based Threshold Multisignatures' and 'Eight Problems for the Mirror Neuron Theory of Action Understanding in Monkeys and Humans' published?"],"info":{}}
{"id":"train_5892","question":"Name the authors of 'Parallel Contextual Array Insertion Deletion Grammar' and 'Chaos and Logistic Map Based Key Generation Technique for AES-Driven IoT Security'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iwcia/ThomasINT18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/iwcia/ThomasINT18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Parallel Contextual Array Insertion Deletion Grammar' and the publication 'Chaos and Logistic Map Based Key Generation Technique for AES-Driven IoT Security'?"],"info":{}}
{"id":"train_5893","question":"Who are the authors of 'IMOVE: A Motion Tracking and Projection Framework for Social Interaction Applications' and 'A combined GDM-ELLAM-MMOC scheme for advection dominated PDEs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ijcgt/KegeleersBLSB19> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/ijcgt/KegeleersBLSB19> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'IMOVE: A Motion Tracking and Projection Framework for Social Interaction Applications' and the publication 'A combined GDM-ELLAM-MMOC scheme for advection dominated PDEs'?"],"info":{}}
{"id":"train_5894","question":"List the venues in which 'MAGDA: a software environment for Mobile AGent based Distributed Applications' and 'Inertial Sensor Data To Image Encoding For Human Action Recognition' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/pdp/AversaMMV03> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-2105-13533> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'MAGDA: a software environment for Mobile AGent based Distributed Applications' and 'Inertial Sensor Data To Image Encoding For Human Action Recognition' were published."],"info":{}}
{"id":"train_5896","question":"Mention the years in which 'Enforcing System-Wide Properties' and 'A review of kernels on covariance matrices for BCI applications' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/aswec/EichbergMSBH04> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/mlsp/Yger13> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Enforcing System-Wide Properties' and 'A review of kernels on covariance matrices for BCI applications' published?"],"info":{}}
{"id":"train_5899","question":"List the venues in which 'A Complete Revolution in Software Engineering Based on Complexity Science' and 'Codetrail: Connecting source code and web resources' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/serp/XiongX09> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/vl/GoldmanM08> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'A Complete Revolution in Software Engineering Based on Complexity Science' and 'Codetrail: Connecting source code and web resources' published?"],"info":{}}
{"id":"train_5900","question":"Who are the authors of the paper 'Eradicating World Poverty Requires More than Facebook Likes: The Academic Commitment to Educate Socially Responsible Leaders' and the publication 'Perception of Two-Stroke Apparent Motion and Real Motion'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ijcee/Tavanti12> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/ijcee/Tavanti12> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Eradicating World Poverty Requires More than Facebook Likes: The Academic Commitment to Educate Socially Responsible Leaders' and 'Perception of Two-Stroke Apparent Motion and Real Motion'?"],"info":{}}
{"id":"train_5901","question":"List the venues in which 'Search-based Test-CASe Generation by Monitoring Responsibility Safety Rules' and 'User Analytics with UbeOne: Insights into Web Printing' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/itsc/HekmatnejadHF20> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/pvldb/KoutrikaLL13> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Search-based Test-CASe Generation by Monitoring Responsibility Safety Rules' and 'User Analytics with UbeOne: Insights into Web Printing' published?"],"info":{}}
{"id":"train_5902","question":"Mention the years in which 'Kernel Partial Least Squares Regression in Reproducing Kernel Hilbert Space' and 'Urban spatial-temporal activity structures: a New Approach to Inferring the Intra-urban Functional Regions via Social Media Check-In Data' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jmlr/RosipalT01> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/corr/ZhiLWDGL14> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Kernel Partial Least Squares Regression in Reproducing Kernel Hilbert Space' and 'Urban spatial-temporal activity structures: a New Approach to Inferring the Intra-urban Functional Regions via Social Media Check-In Data' published?"],"info":{}}
{"id":"train_5904","question":"Name the authors of 'Polarization reconfigurable antennas for HF MIMO communications' and 'More-than-human participation: design for sustainable smart city futures'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/siu/AydinB16> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/siu/AydinB16> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Polarization reconfigurable antennas for HF MIMO communications' and 'More-than-human participation: design for sustainable smart city futures'?"],"info":{}}
{"id":"train_5907","question":"Mention the years in which 'Layered Downlink Precoding for C-RAN Systems with Full Dimensional MIMO' and 'A Clustering Protocol with Mode Selection for Wireless Sensor Network' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/KangSKS15> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/jips/KusdaryonoL11> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Layered Downlink Precoding for C-RAN Systems with Full Dimensional MIMO' and 'A Clustering Protocol with Mode Selection for Wireless Sensor Network' published?"],"info":{}}
{"id":"train_5908","question":"Name the authors of 'Editor's Notice' and 'Azimuth-rotated vector quantization for BTF compression'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/pami/Tanimoto89b> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/pami/Tanimoto89b> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Editor's Notice' and the publication 'Azimuth-rotated vector quantization for BTF compression'?"],"info":{}}
{"id":"train_5912","question":"Name the authors of 'Data mining and machine learning in textile industry' and 'Skewness-Based Partitioning in SpatialHadoop'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/widm/YildirimBA18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/widm/YildirimBA18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Data mining and machine learning in textile industry' and the publication 'Skewness-Based Partitioning in SpatialHadoop'?"],"info":{}}
{"id":"train_5913","question":"Mention the years in which 'Roughness Change Analysis of Sea Surface From Visible Images by Fractals' and 'Revolutionizing the way people work with medical technology' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/access/PanZJWYZ20> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/ifachms/FreudenthalSG10> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Roughness Change Analysis of Sea Surface From Visible Images by Fractals' and 'Revolutionizing the way people work with medical technology' published?"],"info":{}}
{"id":"train_5914","question":"Who are the authors of the paper 'Scattertext: a Browser-Based Tool for Visualizing how Corpora Differ' and the publication 'Gene Extraction Based on Sparse Singular Value Decomposition'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/Kessler17> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/Kessler17> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Scattertext: a Browser-Based Tool for Visualizing how Corpora Differ' and 'Gene Extraction Based on Sparse Singular Value Decomposition'?"],"info":{}}
{"id":"train_5919","question":"Who are the authors of 'Enhanced Topic-based Vector Space Model for semantics-aware spam filtering' and 'Communication and Round Efficient Information Checking Protocol'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/eswa/SantosLSB12> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/eswa/SantosLSB12> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Enhanced Topic-based Vector Space Model for semantics-aware spam filtering' and the publication 'Communication and Round Efficient Information Checking Protocol'?"],"info":{}}
{"id":"train_5921","question":"Mention the venues in which 'Nudge for Note Taking Assist System: A Learning Strategy Feedback System Among Learners Through Their Tablet' and 'On the Expressive Power of User-Defined Effects: Effect Handlers, Monadic Reflection, Delimited Control' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/hci/KondoYMIW21> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/corr/ForsterKLP16> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Nudge for Note Taking Assist System: A Learning Strategy Feedback System Among Learners Through Their Tablet' and 'On the Expressive Power of User-Defined Effects: Effect Handlers, Monadic Reflection, Delimited Control' were published."],"info":{}}
{"id":"train_5922","question":"Name the authors of 'Temporal View Self-Maintenance' and 'Towards the Importance of the Type of Deep Neural Network and Employment of Pre-trained Word Vectors for Toxicity Detection: An Experimental Study'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/edbt/YangW00> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/edbt/YangW00> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Temporal View Self-Maintenance' and 'Towards the Importance of the Type of Deep Neural Network and Employment of Pre-trained Word Vectors for Toxicity Detection: An Experimental Study'?"],"info":{}}
{"id":"train_5927","question":"Mention the years in which 'QoSNC: A novel approach to QoS-based network coding for fixed networks' and 'Using Augmented Reality for Radiological Incident Training' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jcn/SalavatiKCA10> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/ercim/MaraggiBM19> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'QoSNC: A novel approach to QoS-based network coding for fixed networks' and 'Using Augmented Reality for Radiological Incident Training' published?"],"info":{}}
{"id":"train_5930","question":"Mention the years in which 'Self-Similarity for Data Mining and Predictive Modeling - A Case Study for Network Data' and 'Detecting Offensive Content on Twitter During Proud Boys Riots' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/pakdd/AdibiSN02> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/icmla/FahimG21> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Self-Similarity for Data Mining and Predictive Modeling - A Case Study for Network Data' and 'Detecting Offensive Content on Twitter During Proud Boys Riots' published?"],"info":{}}
{"id":"train_5931","question":"Mention the venues in which 'Usability Study of CARTIER-IA: A Platform for Medical Data and Imaging Management' and 'Adaptive TDTL using frequency and phase processing techniques' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/hci/Vazquez-Ingelmo21> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/isspa/Al-AliAAAP10> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Usability Study of CARTIER-IA: A Platform for Medical Data and Imaging Management' and 'Adaptive TDTL using frequency and phase processing techniques' were published."],"info":{}}
{"id":"train_5932","question":"Name the authors of 'Conditional Lower Bound for RNA Folding Problem' and 'CSCL@Work for Practitioners'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/Chang15c> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/Chang15c> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Conditional Lower Bound for RNA Folding Problem' and 'CSCL@Work for Practitioners'?"],"info":{}}
{"id":"train_5933","question":"Mention the venues in which 'On the applicability of multireference second-order perturbation theory to study weak magnetic coupling in molecular complexes' and 'Capacity Achieving Code Constructions for Two Classes of (d,k) Constraints' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jcc/QueraltTGCCA08> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/corr/cs-IT-0411006> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'On the applicability of multireference second-order perturbation theory to study weak magnetic coupling in molecular complexes' and 'Capacity Achieving Code Constructions for Two Classes of (d,k) Constraints' published?"],"info":{}}
{"id":"train_5934","question":"Name the authors of 'Will the real SE metaphors please stand up!: (or, I never metaphor I didn't like!)' and 'An Approach to Teaching Computer Arithmetic'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/sigsoft/Nelson85> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/sigsoft/Nelson85> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Will the real SE metaphors please stand up!: (or, I never metaphor I didn't like!)' and the publication 'An Approach to Teaching Computer Arithmetic'?"],"info":{}}
{"id":"train_5941","question":"Name the authors of 'A 52mW self-configured wearable body sensor network controller and a 12\\u00B5W 549% efficiency wirelessly powered sensor for continuous health monitoring system' and 'Degradation Tendency Prediction for Pumped Storage Unit Based on Integrated Degradation Index Construction and Hybrid CNN-LSTM Model'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/isscc/YooYLKKKY09> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/isscc/YooYLKKKY09> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'A 52mW self-configured wearable body sensor network controller and a 12\\u00B5W 549% efficiency wirelessly powered sensor for continuous health monitoring system' and 'Degradation Tendency Prediction for Pumped Storage Unit Based on Integrated Degradation Index Construction and Hybrid CNN-LSTM Model'?"],"info":{}}
{"id":"train_5944","question":"List the venues in which 'Location Dependent Fixation Analysis with Sight Vectors Locomotion as a Challenge in Mobile Eye Tracking' and 'Cross-domain sentiment classification with word embeddings and canonical correlation analysis' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/giscience/Muller-FeldmethSBHKSK14> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/soict/BachHP16> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'Location Dependent Fixation Analysis with Sight Vectors Locomotion as a Challenge in Mobile Eye Tracking' and 'Cross-domain sentiment classification with word embeddings and canonical correlation analysis' were published."],"info":{}}
{"id":"train_5945","question":"Mention the venues in which 'PhishOut: Effective Phishing Detection Using Selected Features' and 'GA-Based Nonlinear Pseudo-Derivative Feedback Control of a High-Speed, Supertall Building Elevator' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-2004-09789> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/ccta/MangeraPP19> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'PhishOut: Effective Phishing Detection Using Selected Features' and 'GA-Based Nonlinear Pseudo-Derivative Feedback Control of a High-Speed, Supertall Building Elevator' published?"],"info":{}}
