{"id":"train_4925","question":"Have the authors of the paper 'Performance Evaluation of Open Source Seismic Data Processing Packages' not published a publication in ICA3PP (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ica3pp/AzizGH11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ica3pp/AzizGH11> ) . ?y dblp:publishedIn 'ICA3PP (1)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ica3pp/AzizGH11> dblp:publishedIn 'ICA3PP (1)' } }","paraphrases":["Did the authors of 'Performance Evaluation of Open Source Seismic Data Processing Packages' not publish a paper in International Conference on Algorithms and Architectures for Parallel Processing?"],"info":{}}
{"id":"train_4926","question":"Did the authors of 'A new modelling method for design information based polychromatic sets theory' not publish a paper in ROBIO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/robio/ZhaoLC06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/robio/ZhaoLC06> ) . ?y dblp:publishedIn 'ROBIO' FILTER NOT EXISTS { <https://dblp.org/rec/conf/robio/ZhaoLC06> dblp:publishedIn 'ROBIO' } }","paraphrases":["Haven't the authors of the publication 'A new modelling method for design information based polychromatic sets theory' published a publication in ROBIO?"],"info":{}}
{"id":"train_4927","question":"Wasn't the paper 'Mahalanobis Distance Based Approach for Anomaly Detection of Analog Filters Using Frequency Features and Parzen Window Density Estimation' published in the year 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/et/HuXZLG16> dblp:yearOfPublication '2016' FILTER NOT EXISTS { <https://dblp.org/rec/journals/et/HuXZLG16> dblp:yearOfPublication '2016' } }","paraphrases":["Wasn't the publication 'Mahalanobis Distance Based Approach for Anomaly Detection of Analog Filters Using Frequency Features and Parzen Window Density Estimation' published in 2016?"],"info":{}}
{"id":"train_4928","question":"Haven't the authors of the publication 'Comparison of Voltage Control by Inverters for Improving the PV Penetration in Low Voltage Networks' published the paper 'Descriptor realizations of autoregressive representations'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/LuoS20> dblp:authoredBy ?x . <https://dblp.org/rec/journals/imamci/Karampetakis04> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/imamci/Karampetakis04> != <https://dblp.org/rec/journals/access/LuoS20> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/access/LuoS20> dblp:authoredBy ?x . <https://dblp.org/rec/journals/imamci/Karampetakis04> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/imamci/Karampetakis04> != <https://dblp.org/rec/journals/access/LuoS20> ) } }","paraphrases":["Did the authors of the publication 'Comparison of Voltage Control by Inverters for Improving the PV Penetration in Low Voltage Networks' not publish 'Descriptor realizations of autoregressive representations'?"],"info":{}}
{"id":"train_4929","question":"Haven't the authors of the publication 'The Studio: Reflections and Issues Arising' published the paper 'Binary vectors partially determined by linear equation systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cobuild/RobinsonP99> dblp:authoredBy ?x . <https://dblp.org/rec/journals/dm/AharoniHK97> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/dm/AharoniHK97> != <https://dblp.org/rec/conf/cobuild/RobinsonP99> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/cobuild/RobinsonP99> dblp:authoredBy ?x . <https://dblp.org/rec/journals/dm/AharoniHK97> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/dm/AharoniHK97> != <https://dblp.org/rec/conf/cobuild/RobinsonP99> ) } }","paraphrases":["Did the authors of the publication 'The Studio: Reflections and Issues Arising' not publish 'Binary vectors partially determined by linear equation systems'?"],"info":{}}
{"id":"train_4930","question":"Have the authors of the paper 'Computer simulation study of the relationship between the profile of excitatory postsynaptic potential and stimulus-correlated motoneuron firing' not published a publication in Biol. Cybern.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bc/PiotrkiewiczKJ09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/bc/PiotrkiewiczKJ09> ) . ?y dblp:publishedIn 'Biol. Cybern.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/bc/PiotrkiewiczKJ09> dblp:publishedIn 'Biol. Cybern.' } }","paraphrases":["Did the authors of the publication 'Computer simulation study of the relationship between the profile of excitatory postsynaptic potential and stimulus-correlated motoneuron firing' not publish a paper in Biol. Cybern.?"],"info":{}}
{"id":"train_4931","question":"Have the authors of the paper 'Detecting tissue-specific early warning signals for complex diseases based on dynamical network biomarkers: study of type 2 diabetes by cross-tissue analysis' not published a publication in Briefings Bioinform.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bib/LiZLC14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/bib/LiZLC14> ) . ?y dblp:publishedIn 'Briefings Bioinform.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/bib/LiZLC14> dblp:publishedIn 'Briefings Bioinform.' } }","paraphrases":["Haven't the authors of the publication 'Detecting tissue-specific early warning signals for complex diseases based on dynamical network biomarkers: study of type 2 diabetes by cross-tissue analysis' published a publication in Briefings Bioinform.?"],"info":{}}
{"id":"train_4932","question":"Haven't the authors of the publication 'Optimal control of an inflammatory immune response model' published a publication in CDC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/BaraDD15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cdc/BaraDD15> ) . ?y dblp:publishedIn 'CDC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cdc/BaraDD15> dblp:publishedIn 'CDC' } }","paraphrases":["Did the authors of 'Optimal control of an inflammatory immune response model' not publish a paper in CDC?"],"info":{}}
{"id":"train_4933","question":"Have the authors of the paper 'The human DEPhOsphorylation database DEPOD: a 2015 update' not published the paper 'Joint CFO and channel estimation in OFDM-based massive MIMO systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/nar/DuanLK15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/istel/HojatianOSF16> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/istel/HojatianOSF16> != <https://dblp.org/rec/journals/nar/DuanLK15> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/nar/DuanLK15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/istel/HojatianOSF16> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/istel/HojatianOSF16> != <https://dblp.org/rec/journals/nar/DuanLK15> ) } }","paraphrases":["Did the authors of the publication 'The human DEPhOsphorylation database DEPOD: a 2015 update' not publish 'Joint CFO and channel estimation in OFDM-based massive MIMO systems'?"],"info":{}}
{"id":"train_4934","question":"Was 'Mod\\u00E8les multi-agents du processus d'adoption de mesures agri-environnementales : Decision multicrit\\u00E8re et interactions sociales (poster)' not published in 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/jfsma/DeffuantFBA99> dblp:yearOfPublication '1999' FILTER NOT EXISTS { <https://dblp.org/rec/conf/jfsma/DeffuantFBA99> dblp:yearOfPublication '1999' } }","paraphrases":["Wasn't the publication 'Mod\\u00E8les multi-agents du processus d'adoption de mesures agri-environnementales : Decision multicrit\\u00E8re et interactions sociales (poster)' published in 1999?"],"info":{}}
{"id":"train_4935","question":"Haven't the authors of the publication 'Bifurcation, stabilization, and ethanol productivity enhancement for a membrane fermentor' published a publication in Math. Comput. Model.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mcm/Mahecha-BoteroGE05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/mcm/Mahecha-BoteroGE05> ) . ?y dblp:publishedIn 'Math. Comput. Model.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/mcm/Mahecha-BoteroGE05> dblp:publishedIn 'Math. Comput. Model.' } }","paraphrases":["Did the authors of 'Bifurcation, stabilization, and ethanol productivity enhancement for a membrane fermentor' not publish a paper in Math. Comput. Model.?"],"info":{}}
{"id":"train_4937","question":"Did the authors of 'A comparison of interactivity in the Linux 26 scheduler and an MLFQ scheduler' not publish a paper in Softw. Pract. Exp.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/spe/TorreyCM07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/spe/TorreyCM07> ) . ?y dblp:publishedIn 'Softw. Pract. Exp.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/spe/TorreyCM07> dblp:publishedIn 'Softw. Pract. Exp.' } }","paraphrases":["Have the authors of the paper 'A comparison of interactivity in the Linux 26 scheduler and an MLFQ scheduler' not published a publication in Softw. Pract. Exp.?"],"info":{}}
{"id":"train_4938","question":"Did the authors of the publication 'Energy Analysis of Device Discovery for Bluetooth Low Energy' not publish 'Security Evaluation of CDMA2000'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vtc/LiuCMX13a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icwn/ErtaulNS10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icwn/ErtaulNS10> != <https://dblp.org/rec/conf/vtc/LiuCMX13a> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/vtc/LiuCMX13a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icwn/ErtaulNS10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icwn/ErtaulNS10> != <https://dblp.org/rec/conf/vtc/LiuCMX13a> ) } }","paraphrases":["Haven't the authors of the publication 'Energy Analysis of Device Discovery for Bluetooth Low Energy' published the paper 'Security Evaluation of CDMA2000'?"],"info":{}}
{"id":"train_4939","question":"Did the authors of the publication 'Compacting music signatures for efficient music retrieval' not publish 'More for less: adaptive labeling payments in online labor markets'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/edbt/CuiJOT08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/datamine/GevaSL19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/datamine/GevaSL19> != <https://dblp.org/rec/conf/edbt/CuiJOT08> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/edbt/CuiJOT08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/datamine/GevaSL19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/datamine/GevaSL19> != <https://dblp.org/rec/conf/edbt/CuiJOT08> ) } }","paraphrases":["Haven't the authors of the publication 'Compacting music signatures for efficient music retrieval' published the paper 'More for less: adaptive labeling payments in online labor markets'?"],"info":{}}
{"id":"train_4941","question":"Wasn't the publication 'A Cluster-Based Approach to Thesaurus Construction' published in 1988?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigir/Crouch88> dblp:yearOfPublication '1988' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sigir/Crouch88> dblp:yearOfPublication '1988' } }","paraphrases":["Wasn't the paper 'A Cluster-Based Approach to Thesaurus Construction' published in the year 1988?"],"info":{}}
{"id":"train_4942","question":"Wasn't the paper 'A Fuzzy Logic-Based Approach for Detecting Shifting Patterns in Cross-Cultural Data' published in the year 2005?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ieaaie/TsekourasPKKP05> dblp:yearOfPublication '2005' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ieaaie/TsekourasPKKP05> dblp:yearOfPublication '2005' } }","paraphrases":["Was 'A Fuzzy Logic-Based Approach for Detecting Shifting Patterns in Cross-Cultural Data' not published in 2005?"],"info":{}}
{"id":"train_4944","question":"Did the authors of 'Shape description from imperfect and incomplete data' not publish a paper in International Conference on Pattern Recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icpr/RaoN90> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icpr/RaoN90> ) . ?y dblp:publishedIn 'ICPR (1)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icpr/RaoN90> dblp:publishedIn 'ICPR (1)' } }","paraphrases":["Haven't the authors of the publication 'Shape description from imperfect and incomplete data' published a publication in International Conference on Pattern Recognition?"],"info":{}}
{"id":"train_4945","question":"Wasn't the paper 'Anticipatory signals in kinematics and muscle activity during functional grasp and release' published in the year 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bsn/BeckersFS15> dblp:yearOfPublication '2015' FILTER NOT EXISTS { <https://dblp.org/rec/conf/bsn/BeckersFS15> dblp:yearOfPublication '2015' } }","paraphrases":["Was 'Anticipatory signals in kinematics and muscle activity during functional grasp and release' not published in 2015?"],"info":{}}
{"id":"train_4947","question":"Wasn't the paper 'A 16-188-GHz Sub-Integer-N Frequency Synthesizer for 60-GHz Transceivers' published in the year 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jssc/Floyd08> dblp:yearOfPublication '2008' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jssc/Floyd08> dblp:yearOfPublication '2008' } }","paraphrases":["Was 'A 16-188-GHz Sub-Integer-N Frequency Synthesizer for 60-GHz Transceivers' not published in 2008?"],"info":{}}
{"id":"train_4948","question":"Wasn't the paper 'Improving Compiler and Run-Time Support for Adaptive Irregular Codes' published in the year 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEpact/HanT98> dblp:yearOfPublication '1998' FILTER NOT EXISTS { <https://dblp.org/rec/conf/IEEEpact/HanT98> dblp:yearOfPublication '1998' } }","paraphrases":["Was 'Improving Compiler and Run-Time Support for Adaptive Irregular Codes' not published in 1998?"],"info":{}}
{"id":"train_4949","question":"Wasn't the publication 'Adaptive Energy Management System Based on Low-Power Microcontroller with Energy harvesting at Maximum Power' published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcsc/HeoYLK12> dblp:yearOfPublication '2012' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jcsc/HeoYLK12> dblp:yearOfPublication '2012' } }","paraphrases":["Was 'Adaptive Energy Management System Based on Low-Power Microcontroller with Energy harvesting at Maximum Power' not published in 2012?"],"info":{}}
{"id":"train_4952","question":"Was 'Multilevel Accentuation and its Role in the Memorization of Narrative' not published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cmn/Sobchuk14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cmn/Sobchuk14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the paper 'Multilevel Accentuation and its Role in the Memorization of Narrative' published in the year 2014?"],"info":{}}
{"id":"train_4953","question":"Did the authors of 'Stunt driving via policy search' not publish a paper in IEEE International Conference on Robotics and Automation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icra/LauL12a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icra/LauL12a> ) . ?y dblp:publishedIn 'ICRA' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icra/LauL12a> dblp:publishedIn 'ICRA' } }","paraphrases":["Haven't the authors of the publication 'Stunt driving via policy search' published a publication in ICRA?"],"info":{}}
{"id":"train_4955","question":"Haven't the authors of the publication 'Triple band-notched UWB antenna design using a novel hybrid optimization technique based on DE and NMR algorithms' published a publication in Expert Syst. Appl.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eswa/SinghS21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/eswa/SinghS21> ) . ?y dblp:publishedIn 'Expert Syst. Appl.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/eswa/SinghS21> dblp:publishedIn 'Expert Syst. Appl.' } }","paraphrases":["Did the authors of the publication 'Triple band-notched UWB antenna design using a novel hybrid optimization technique based on DE and NMR algorithms' not publish a paper in Expert Syst. Appl.?"],"info":{}}
{"id":"train_4956","question":"Wasn't the paper 'Utilizing GCN and Meta-Learning Strategy in Unsupervised Domain Adaptation for Pancreatic Cancer Segmentation' published in the year 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/titb/LiFLQ22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/journals/titb/LiFLQ22> dblp:yearOfPublication '2022' } }","paraphrases":["Wasn't the publication 'Utilizing GCN and Meta-Learning Strategy in Unsupervised Domain Adaptation for Pancreatic Cancer Segmentation' published in 2022?"],"info":{}}
{"id":"train_4957","question":"Did the authors of the publication 'Ultrasonic backscattering in tissue: characterization through Nakagami-generalized inverse Gaussian distribution' not publish a paper in Comput. Biol. Medicine?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cbm/AgrawalK07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cbm/AgrawalK07> ) . ?y dblp:publishedIn 'Comput. Biol. Medicine' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cbm/AgrawalK07> dblp:publishedIn 'Comput. Biol. Medicine' } }","paraphrases":["Have the authors of the paper 'Ultrasonic backscattering in tissue: characterization through Nakagami-generalized inverse Gaussian distribution' not published a publication in Comput. Biol. Medicine?"],"info":{}}
{"id":"train_4958","question":"Have the authors of the paper 'Informatikjahr 2006: Ein Fazit' not published the paper 'What Makes for Good Views for Contrastive Learning?'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/insk/Jarke07> dblp:authoredBy ?x . <https://dblp.org/rec/conf/nips/Tian0PKSI20> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/nips/Tian0PKSI20> != <https://dblp.org/rec/journals/insk/Jarke07> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/insk/Jarke07> dblp:authoredBy ?x . <https://dblp.org/rec/conf/nips/Tian0PKSI20> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/nips/Tian0PKSI20> != <https://dblp.org/rec/journals/insk/Jarke07> ) } }","paraphrases":["Did the authors of 'Informatikjahr 2006: Ein Fazit' not publish 'What Makes for Good Views for Contrastive Learning?'?"],"info":{}}
{"id":"train_4960","question":"Have the authors of the paper 'A new architecture for improving focused crawling using deep neural network' not published a publication in J. Intell. Fuzzy Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jifs/ElArabyAMR19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jifs/ElArabyAMR19> ) . ?y dblp:publishedIn 'J. Intell. Fuzzy Syst.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jifs/ElArabyAMR19> dblp:publishedIn 'J. Intell. Fuzzy Syst.' } }","paraphrases":["Did the authors of 'A new architecture for improving focused crawling using deep neural network' not publish a paper in J. Intell. Fuzzy Syst.?"],"info":{}}
{"id":"train_4961","question":"Did the authors of 'Introduction of New Technologies to Competing Industrial Customers' not publish 'Energy consumption of subscriber devices in broadband network'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mansci/EratK06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jhsn/Borzycki12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/jhsn/Borzycki12> != <https://dblp.org/rec/journals/mansci/EratK06> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/mansci/EratK06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jhsn/Borzycki12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/jhsn/Borzycki12> != <https://dblp.org/rec/journals/mansci/EratK06> ) } }","paraphrases":["Have the authors of the paper 'Introduction of New Technologies to Competing Industrial Customers' not published the paper 'Energy consumption of subscriber devices in broadband network'?"],"info":{}}
{"id":"train_4962","question":"Wasn't the paper 'Four-Year Enterprise PACS Support Trend Analysis' published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jdi/OlbrishSRSI11> dblp:yearOfPublication '2011' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jdi/OlbrishSRSI11> dblp:yearOfPublication '2011' } }","paraphrases":["Was 'Four-Year Enterprise PACS Support Trend Analysis' not published in 2011?"],"info":{}}
{"id":"train_4963","question":"Did the authors of the publication 'Simulating Temporal Dynamics in Cryptocurrency Software Social Networks' not publish a paper in AMCIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcis/ChungVLHML19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/amcis/ChungVLHML19> ) . ?y dblp:publishedIn 'AMCIS' FILTER NOT EXISTS { <https://dblp.org/rec/conf/amcis/ChungVLHML19> dblp:publishedIn 'AMCIS' } }","paraphrases":["Have the authors of the paper 'Simulating Temporal Dynamics in Cryptocurrency Software Social Networks' not published a publication in AMCIS?"],"info":{}}
{"id":"train_4964","question":"Wasn't the paper 'Robust semi-automatic 2D-to-3D image conversion via residual-driven optimization' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ejivp/Yuan18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ejivp/Yuan18> dblp:yearOfPublication '2018' } }","paraphrases":["Was 'Robust semi-automatic 2D-to-3D image conversion via residual-driven optimization' not published in 2018?"],"info":{}}
{"id":"train_4965","question":"Wasn't the publication 'Incorporating Prior Financial Domain Knowledge into Neural Networks for Implied Volatility Surface Prediction' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kdd/ZhengYC21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/conf/kdd/ZhengYC21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the paper 'Incorporating Prior Financial Domain Knowledge into Neural Networks for Implied Volatility Surface Prediction' published in the year 2021?"],"info":{}}
{"id":"train_4966","question":"Haven't the authors of the publication 'Mapping Global Urban Impervious Surface and Green Space Fractions Using Google Earth Engine' published the paper 'Designing and implementing a family of intrusion detection systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/remotesensing/KuangHDLY21> dblp:authoredBy ?x . <https://dblp.org/rec/conf/sigsoft/VignaVK03> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/sigsoft/VignaVK03> != <https://dblp.org/rec/journals/remotesensing/KuangHDLY21> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/remotesensing/KuangHDLY21> dblp:authoredBy ?x . <https://dblp.org/rec/conf/sigsoft/VignaVK03> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/sigsoft/VignaVK03> != <https://dblp.org/rec/journals/remotesensing/KuangHDLY21> ) } }","paraphrases":["Did the authors of 'Mapping Global Urban Impervious Surface and Green Space Fractions Using Google Earth Engine' not publish 'Designing and implementing a family of intrusion detection systems'?"],"info":{}}
{"id":"train_4967","question":"Was 'Load Balancing and Locality in Hierarchical N-Body Algorithms on Distributed Memory Architectures' not published in 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hpcn/BaiardiBMP98> dblp:yearOfPublication '1998' FILTER NOT EXISTS { <https://dblp.org/rec/conf/hpcn/BaiardiBMP98> dblp:yearOfPublication '1998' } }","paraphrases":["Wasn't the paper 'Load Balancing and Locality in Hierarchical N-Body Algorithms on Distributed Memory Architectures' published in the year 1998?"],"info":{}}
{"id":"train_4968","question":"Have the authors of the paper 'ODAC: An Agent-Oriented Methodology Based on ODP' not published a publication in Auton. Agents Multi Agent Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/aamas/Gervais03> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/aamas/Gervais03> ) . ?y dblp:publishedIn 'Auton. Agents Multi Agent Syst.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/aamas/Gervais03> dblp:publishedIn 'Auton. Agents Multi Agent Syst.' } }","paraphrases":["Haven't the authors of the publication 'ODAC: An Agent-Oriented Methodology Based on ODP' published a publication in Auton. Agents Multi Agent Syst.?"],"info":{}}
{"id":"train_4970","question":"Was 'Corn cash price forecasting with neural networks' not published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cea/XuZ21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cea/XuZ21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the publication 'Corn cash price forecasting with neural networks' published in 2021?"],"info":{}}
{"id":"train_4971","question":"Wasn't the paper 'Incident Angle Measurement of Collimated Laser Based on the Pinhole Principle' published in the year 2010?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icira/PanZ10> dblp:yearOfPublication '2010' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icira/PanZ10> dblp:yearOfPublication '2010' } }","paraphrases":["Wasn't the publication 'Incident Angle Measurement of Collimated Laser Based on the Pinhole Principle' published in 2010?"],"info":{}}
{"id":"train_4972","question":"Did the authors of 'Immersive Virtual Reality App to Promote Healthy Eating in Children' not publish 'Overview of the Second Text REtrieval Conference (TREC-2)'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/FuentesANG20> dblp:authoredBy ?x . <https://dblp.org/rec/conf/trec/Harman93> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/trec/Harman93> != <https://dblp.org/rec/conf/hci/FuentesANG20> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/hci/FuentesANG20> dblp:authoredBy ?x . <https://dblp.org/rec/conf/trec/Harman93> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/trec/Harman93> != <https://dblp.org/rec/conf/hci/FuentesANG20> ) } }","paraphrases":["Have the authors of the paper 'Immersive Virtual Reality App to Promote Healthy Eating in Children' not published the paper 'Overview of the Second Text REtrieval Conference (TREC-2)'?"],"info":{}}
{"id":"train_4973","question":"Haven't the authors of the publication 'A Logic to Model Time in Cryptographic Protocols' published the paper 'Ellipsoid Approximation Using Random Vectors'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscsct/LeiLX08> dblp:authoredBy ?x . <https://dblp.org/rec/conf/colt/MendelsonP05> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/colt/MendelsonP05> != <https://dblp.org/rec/conf/iscsct/LeiLX08> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/iscsct/LeiLX08> dblp:authoredBy ?x . <https://dblp.org/rec/conf/colt/MendelsonP05> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/colt/MendelsonP05> != <https://dblp.org/rec/conf/iscsct/LeiLX08> ) } }","paraphrases":["Did the authors of the publication 'A Logic to Model Time in Cryptographic Protocols' not publish 'Ellipsoid Approximation Using Random Vectors'?"],"info":{}}
{"id":"train_4974","question":"Did the authors of 'Optimal mechanisms for selling information' not publish a paper in ACM Conference on Economics and Computation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigecom/BabaioffKL12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sigecom/BabaioffKL12> ) . ?y dblp:publishedIn 'EC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sigecom/BabaioffKL12> dblp:publishedIn 'EC' } }","paraphrases":["Haven't the authors of the publication 'Optimal mechanisms for selling information' published a publication in EC?"],"info":{}}
{"id":"train_4975","question":"Haven't the authors of the publication 'Heterogeneous Domains' e-Business Transactions Interoperability with the use of Generic Process Models' published a publication in IESA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iesa/KoussourisGSAK08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iesa/KoussourisGSAK08> ) . ?y dblp:publishedIn 'IESA' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iesa/KoussourisGSAK08> dblp:publishedIn 'IESA' } }","paraphrases":["Did the authors of the publication 'Heterogeneous Domains' e-Business Transactions Interoperability with the use of Generic Process Models' not publish a paper in IESA?"],"info":{}}
{"id":"train_4976","question":"Have the authors of the paper 'Ramanujan graphs and the spectral gap of supercomputing topologies' not published a publication in J. Supercomput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tjs/AksoyBYR21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tjs/AksoyBYR21> ) . ?y dblp:publishedIn 'J. Supercomput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tjs/AksoyBYR21> dblp:publishedIn 'J. Supercomput.' } }","paraphrases":["Did the authors of 'Ramanujan graphs and the spectral gap of supercomputing topologies' not publish a paper in J. Supercomput.?"],"info":{}}
{"id":"train_4977","question":"Wasn't the paper 'Flow Mobility Management in PMIPv6-based DMM (Distributed Mobility Management) Networks' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jowua/SunK14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jowua/SunK14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the publication 'Flow Mobility Management in PMIPv6-based DMM (Distributed Mobility Management) Networks' published in 2014?"],"info":{}}
