{"id":"train_4978","question":"Have the authors of the paper 'Degree-Bounded Generalized Polymatroids and Approximating the Metric Many-Visits TSP' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1911-09890> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1911-09890> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1911-09890> dblp:publishedIn 'CoRR' } }","paraphrases":["Did the authors of the publication 'Degree-Bounded Generalized Polymatroids and Approximating the Metric Many-Visits TSP' not publish a paper in CoRR?"],"info":{}}
{"id":"train_4979","question":"Have the authors of the paper 'Allocation of spinning reserves for autonomous grids subject to frequency stability constraints and short-term renewable power variations' not published the paper 'A Data Scientist's Guide to Start-Ups'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2203-07233> dblp:authoredBy ?x . <https://dblp.org/rec/journals/bigdata/ProvostWBEFP14> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/bigdata/ProvostWBEFP14> != <https://dblp.org/rec/journals/corr/abs-2203-07233> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2203-07233> dblp:authoredBy ?x . <https://dblp.org/rec/journals/bigdata/ProvostWBEFP14> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/bigdata/ProvostWBEFP14> != <https://dblp.org/rec/journals/corr/abs-2203-07233> ) } }","paraphrases":["Did the authors of the publication 'Allocation of spinning reserves for autonomous grids subject to frequency stability constraints and short-term renewable power variations' not publish 'A Data Scientist's Guide to Start-Ups'?"],"info":{}}
{"id":"train_4980","question":"Wasn't the publication 'On Parametric Obligation Policies: Enabling Privacy-Aware Information Lifecycle Management in Enterprises' published in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/policy/MontB07> dblp:yearOfPublication '2007' FILTER NOT EXISTS { <https://dblp.org/rec/conf/policy/MontB07> dblp:yearOfPublication '2007' } }","paraphrases":["Wasn't the paper 'On Parametric Obligation Policies: Enabling Privacy-Aware Information Lifecycle Management in Enterprises' published in the year 2007?"],"info":{}}
{"id":"train_4981","question":"Wasn't the publication 'Face Alignment with Two-Layer Shape Regression' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pcm/ZhangZ15> dblp:yearOfPublication '2015' FILTER NOT EXISTS { <https://dblp.org/rec/conf/pcm/ZhangZ15> dblp:yearOfPublication '2015' } }","paraphrases":["Wasn't the paper 'Face Alignment with Two-Layer Shape Regression' published in the year 2015?"],"info":{}}
{"id":"train_4982","question":"Haven't the authors of the publication 'Measurement of electrode current pulses from cochlear implants' published a publication in IEEE Trans. Instrum. Meas.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tim/TognolaBCNPRGS05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tim/TognolaBCNPRGS05> ) . ?y dblp:publishedIn 'IEEE Trans. Instrum. Meas.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tim/TognolaBCNPRGS05> dblp:publishedIn 'IEEE Trans. Instrum. Meas.' } }","paraphrases":["Did the authors of the publication 'Measurement of electrode current pulses from cochlear implants' not publish a paper in IEEE Trans. Instrum. Meas.?"],"info":{}}
{"id":"train_4983","question":"Haven't the authors of the publication 'Control Barrier Functions for Complete and Incomplete Information Stochastic Systems' published a publication in ACC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcc/Clark19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/amcc/Clark19> ) . ?y dblp:publishedIn 'ACC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/amcc/Clark19> dblp:publishedIn 'ACC' } }","paraphrases":["Have the authors of the paper 'Control Barrier Functions for Complete and Incomplete Information Stochastic Systems' not published a publication in ACC?"],"info":{}}
{"id":"train_4984","question":"Wasn't the paper 'Driver Fatigue Prediction Using Different Sensor Data with Deep Learning' published in the year 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icphys/UtomoYTH19> dblp:yearOfPublication '2019' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icphys/UtomoYTH19> dblp:yearOfPublication '2019' } }","paraphrases":["Was 'Driver Fatigue Prediction Using Different Sensor Data with Deep Learning' not published in 2019?"],"info":{}}
{"id":"train_4985","question":"Did the authors of the publication 'Smart Placement of Security Devices in Cloud Data Center Network' not publish 'Series misdemeanors'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/smartcr/MajhiD15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cca/Stoutemyer12a> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cca/Stoutemyer12a> != <https://dblp.org/rec/journals/smartcr/MajhiD15> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/smartcr/MajhiD15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cca/Stoutemyer12a> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cca/Stoutemyer12a> != <https://dblp.org/rec/journals/smartcr/MajhiD15> ) } }","paraphrases":["Have the authors of the paper 'Smart Placement of Security Devices in Cloud Data Center Network' not published the paper 'Series misdemeanors'?"],"info":{}}
{"id":"train_4986","question":"Have the authors of the paper 'Strategien zur Modellierung mobiler, multimedialer Tourismusinformationssysteme im FlyingPix Projekt' not published a publication in Grundlagen von Datenbanken?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gvd/EigenstetterWB06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/gvd/EigenstetterWB06> ) . ?y dblp:publishedIn 'Grundlagen von Datenbanken' FILTER NOT EXISTS { <https://dblp.org/rec/conf/gvd/EigenstetterWB06> dblp:publishedIn 'Grundlagen von Datenbanken' } }","paraphrases":["Did the authors of 'Strategien zur Modellierung mobiler, multimedialer Tourismusinformationssysteme im FlyingPix Projekt' not publish a paper in Grundlagen von Datenbanken?"],"info":{}}
{"id":"train_4991","question":"Wasn't the paper 'On switching Hinfinity controllers for a class of linear parameter varying systems' published in the year 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/scl/YanO07> dblp:yearOfPublication '2007' FILTER NOT EXISTS { <https://dblp.org/rec/journals/scl/YanO07> dblp:yearOfPublication '2007' } }","paraphrases":["Wasn't the publication 'On switching Hinfinity controllers for a class of linear parameter varying systems' published in 2007?"],"info":{}}
{"id":"train_4994","question":"Wasn't the publication 'Low-complexity time-varying frequency-shift equalization for doubly selective channels' published in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iswcs/Verde13> dblp:yearOfPublication '2013' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iswcs/Verde13> dblp:yearOfPublication '2013' } }","paraphrases":["Wasn't the paper 'Low-complexity time-varying frequency-shift equalization for doubly selective channels' published in the year 2013?"],"info":{}}
{"id":"train_4995","question":"Have the authors of the paper 'Dynamic Subscription to YANG Events and Datastores over RESTCONF' not published a publication in RFC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/rfc/rfc8650> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/rfc/rfc8650> ) . ?y dblp:publishedIn 'RFC' FILTER NOT EXISTS { <https://dblp.org/rec/journals/rfc/rfc8650> dblp:publishedIn 'RFC' } }","paraphrases":["Haven't the authors of the publication 'Dynamic Subscription to YANG Events and Datastores over RESTCONF' published a publication in RFC?"],"info":{}}
{"id":"train_4996","question":"Wasn't the publication 'Obtaining a threshold for the stewart index and its extension to ridge regression' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cstat/Rodriguez-Sanchez21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cstat/Rodriguez-Sanchez21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the paper 'Obtaining a threshold for the stewart index and its extension to ridge regression' published in the year 2021?"],"info":{}}
{"id":"train_4997","question":"Wasn't the paper 'Sensitive and fast mapping of di-base encoded reads' published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bioinformatics/HormozdiariHSEA11> dblp:yearOfPublication '2011' FILTER NOT EXISTS { <https://dblp.org/rec/journals/bioinformatics/HormozdiariHSEA11> dblp:yearOfPublication '2011' } }","paraphrases":["Was 'Sensitive and fast mapping of di-base encoded reads' not published in 2011?"],"info":{}}
{"id":"train_4999","question":"Was 'Validating the Grid Diversity Operator: An Infusion Technique for Diversity Maintenance in Population-Based Optimisation Algorithms' not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/evoW/SalahHS16> dblp:yearOfPublication '2016' FILTER NOT EXISTS { <https://dblp.org/rec/conf/evoW/SalahHS16> dblp:yearOfPublication '2016' } }","paraphrases":["Wasn't the publication 'Validating the Grid Diversity Operator: An Infusion Technique for Diversity Maintenance in Population-Based Optimisation Algorithms' published in 2016?"],"info":{}}
{"id":"train_5003","question":"Did the authors of the publication 'An integrated approach to the design of fault tolerant computing systems' not publish a paper in MICRO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/micro/CaillouetS74> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/micro/CaillouetS74> ) . ?y dblp:publishedIn 'MICRO' FILTER NOT EXISTS { <https://dblp.org/rec/conf/micro/CaillouetS74> dblp:publishedIn 'MICRO' } }","paraphrases":["Haven't the authors of the publication 'An integrated approach to the design of fault tolerant computing systems' published a publication in MICRO?"],"info":{}}
{"id":"train_5004","question":"Wasn't the publication 'Detecting Pitch Accents at the Word, Syllable and Vowel Level' published in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/naacl/RosenbergH09> dblp:yearOfPublication '2009' FILTER NOT EXISTS { <https://dblp.org/rec/conf/naacl/RosenbergH09> dblp:yearOfPublication '2009' } }","paraphrases":["Was 'Detecting Pitch Accents at the Word, Syllable and Vowel Level' not published in 2009?"],"info":{}}
{"id":"train_5006","question":"Wasn't the publication 'Biosurveillance using Routinely-collected Outpatient Data in Malawi' published in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amia/MumbaDE13> dblp:yearOfPublication '2013' FILTER NOT EXISTS { <https://dblp.org/rec/conf/amia/MumbaDE13> dblp:yearOfPublication '2013' } }","paraphrases":["Wasn't the paper 'Biosurveillance using Routinely-collected Outpatient Data in Malawi' published in the year 2013?"],"info":{}}
{"id":"train_5007","question":"Did the authors of the publication 'Reflexive Passagen und ihre Attribution' not publish a paper in DHd?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dhd/VarachkinaBGHD22a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/dhd/VarachkinaBGHD22a> ) . ?y dblp:publishedIn 'DHd' FILTER NOT EXISTS { <https://dblp.org/rec/conf/dhd/VarachkinaBGHD22a> dblp:publishedIn 'DHd' } }","paraphrases":["Haven't the authors of the publication 'Reflexive Passagen und ihre Attribution' published a publication in DHd?"],"info":{}}
{"id":"train_5009","question":"Wasn't the publication 'Bioinspired Motor Control for Articulated Robots [From the Guest Editors]' published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ram/VitielloIS16> dblp:yearOfPublication '2016' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ram/VitielloIS16> dblp:yearOfPublication '2016' } }","paraphrases":["Wasn't the paper 'Bioinspired Motor Control for Articulated Robots [From the Guest Editors]' published in the year 2016?"],"info":{}}
{"id":"train_5012","question":"Was 'Integrated support for systems design' not published in 1990?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iee/HaddleyS90> dblp:yearOfPublication '1990' FILTER NOT EXISTS { <https://dblp.org/rec/journals/iee/HaddleyS90> dblp:yearOfPublication '1990' } }","paraphrases":["Wasn't the publication 'Integrated support for systems design' published in 1990?"],"info":{}}
{"id":"train_5014","question":"Wasn't the paper 'Efficient distributed selective search' published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ir/KimCCM17> dblp:yearOfPublication '2017' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ir/KimCCM17> dblp:yearOfPublication '2017' } }","paraphrases":["Was 'Efficient distributed selective search' not published in 2017?"],"info":{}}
{"id":"train_5017","question":"Did the authors of the publication 'Subpopulation Discovery and Validation in Epidemiological Data' not publish 'Techniques for an energy aware parallel file system'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vissym/AlemzadehHNCIVS17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/green/KarakoyunluC12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/green/KarakoyunluC12> != <https://dblp.org/rec/conf/vissym/AlemzadehHNCIVS17> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/vissym/AlemzadehHNCIVS17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/green/KarakoyunluC12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/green/KarakoyunluC12> != <https://dblp.org/rec/conf/vissym/AlemzadehHNCIVS17> ) } }","paraphrases":["Haven't the authors of the publication 'Subpopulation Discovery and Validation in Epidemiological Data' published the paper 'Techniques for an energy aware parallel file system'?"],"info":{}}
{"id":"train_5018","question":"Haven't the authors of the publication 'MultiCite: Modeling realistic citations requires moving beyond the single-sentence single-label setting' published a publication in NAACL-HLT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/naacl/LauscherKKJCJL22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/naacl/LauscherKKJCJL22> ) . ?y dblp:publishedIn 'NAACL-HLT' FILTER NOT EXISTS { <https://dblp.org/rec/conf/naacl/LauscherKKJCJL22> dblp:publishedIn 'NAACL-HLT' } }","paraphrases":["Did the authors of 'MultiCite: Modeling realistic citations requires moving beyond the single-sentence single-label setting' not publish a paper in NAACL-HLT?"],"info":{}}
{"id":"train_5019","question":"Haven't the authors of the publication 'R\\u00E9solution incr\\u00E9mentale d'in\\u00E9quations lin\\u00E9air\\u00E9s \\u00E0 variables dans Z' published a publication in JFPLC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/jfplc/Mainguet99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/jfplc/Mainguet99> ) . ?y dblp:publishedIn 'JFPLC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/jfplc/Mainguet99> dblp:publishedIn 'JFPLC' } }","paraphrases":["Have the authors of the paper 'R\\u00E9solution incr\\u00E9mentale d'in\\u00E9quations lin\\u00E9air\\u00E9s \\u00E0 variables dans Z' not published a publication in JFPLC?"],"info":{}}
{"id":"train_5020","question":"Wasn't the paper 'Strategisches IT Management' published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/birthday/WobkingK06> dblp:yearOfPublication '2006' FILTER NOT EXISTS { <https://dblp.org/rec/conf/birthday/WobkingK06> dblp:yearOfPublication '2006' } }","paraphrases":["Wasn't the publication 'Strategisches IT Management' published in 2006?"],"info":{}}
{"id":"train_5021","question":"Have the authors of the paper 'Variational Symplectic Accelerated Optimization on Lie Groups' not published a publication in CDC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/LeeTL21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cdc/LeeTL21> ) . ?y dblp:publishedIn 'CDC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cdc/LeeTL21> dblp:publishedIn 'CDC' } }","paraphrases":["Did the authors of 'Variational Symplectic Accelerated Optimization on Lie Groups' not publish a paper in CDC?"],"info":{}}
{"id":"train_5023","question":"Wasn't the paper 'Colorimetric Paper-Based Sensors against Cancer Biomarkers' published in the year 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/CarneiroRMS22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/journals/sensors/CarneiroRMS22> dblp:yearOfPublication '2022' } }","paraphrases":["Wasn't the publication 'Colorimetric Paper-Based Sensors against Cancer Biomarkers' published in 2022?"],"info":{}}
{"id":"train_5024","question":"Did the authors of the publication 'Fault detection of two wheel inverted pendulum robot with center of gravity self-adjusting mechanism' not publish a paper in ROBIO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/robio/LiuGML16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/robio/LiuGML16> ) . ?y dblp:publishedIn 'ROBIO' FILTER NOT EXISTS { <https://dblp.org/rec/conf/robio/LiuGML16> dblp:publishedIn 'ROBIO' } }","paraphrases":["Haven't the authors of the publication 'Fault detection of two wheel inverted pendulum robot with center of gravity self-adjusting mechanism' published a publication in ROBIO?"],"info":{}}
{"id":"train_5025","question":"Did the authors of the publication 'A Survey on Synchronization Approach in MAC Layer Protocols' not publish a paper in Int. J. Bus. Data Commun. Netw.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijbdcn/ChandnaniKS17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijbdcn/ChandnaniKS17> ) . ?y dblp:publishedIn 'Int. J. Bus. Data Commun. Netw.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijbdcn/ChandnaniKS17> dblp:publishedIn 'Int. J. Bus. Data Commun. Netw.' } }","paraphrases":["Haven't the authors of the publication 'A Survey on Synchronization Approach in MAC Layer Protocols' published a publication in Int. J. Bus. Data Commun. Netw.?"],"info":{}}
{"id":"train_5026","question":"Did the authors of 'Exploring the Value of Cloud Services and QoE Factors on IPCentrex via the Means-End Chain Framework' not publish a paper in International Conference on Advances in Mobile Computing and Multimedia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/momm/WuCC14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/momm/WuCC14> ) . ?y dblp:publishedIn 'MoMM' FILTER NOT EXISTS { <https://dblp.org/rec/conf/momm/WuCC14> dblp:publishedIn 'MoMM' } }","paraphrases":["Haven't the authors of the publication 'Exploring the Value of Cloud Services and QoE Factors on IPCentrex via the Means-End Chain Framework' published a publication in MoMM?"],"info":{}}
{"id":"train_5027","question":"Was 'On the Tradeoff between Energy, Precision, and Accuracy in Federated Quantized Neural Networks' not published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2111-07911> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2111-07911> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the publication 'On the Tradeoff between Energy, Precision, and Accuracy in Federated Quantized Neural Networks' published in 2021?"],"info":{}}
{"id":"train_5028","question":"Wasn't the publication 'Security of DM Quantization Watermarking Schemes: A Practical Study for Digital Images' published in 2005?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwdw/BasH05> dblp:yearOfPublication '2005' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iwdw/BasH05> dblp:yearOfPublication '2005' } }","paraphrases":["Was 'Security of DM Quantization Watermarking Schemes: A Practical Study for Digital Images' not published in 2005?"],"info":{}}
{"id":"train_5029","question":"Was 'Colour, trust, satisfaction, and E-loyalty: the vietnamese experience of website design' not published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icmlsc/KhuongNNT18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icmlsc/KhuongNNT18> dblp:yearOfPublication '2018' } }","paraphrases":["Wasn't the paper 'Colour, trust, satisfaction, and E-loyalty: the vietnamese experience of website design' published in the year 2018?"],"info":{}}
{"id":"train_5031","question":"Haven't the authors of the publication 'Environmental Taxes in Newsvendor Supply Chains: A Mean-Downside-Risk Analysis' published a publication in IEEE Trans. Syst. Man Cybern. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsmc/ChanCCS20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tsmc/ChanCCS20> ) . ?y dblp:publishedIn 'IEEE Trans. Syst. Man Cybern. Syst.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tsmc/ChanCCS20> dblp:publishedIn 'IEEE Trans. Syst. Man Cybern. Syst.' } }","paraphrases":["Did the authors of the publication 'Environmental Taxes in Newsvendor Supply Chains: A Mean-Downside-Risk Analysis' not publish a paper in IEEE Trans. Syst. Man Cybern. Syst.?"],"info":{}}
{"id":"train_5033","question":"Haven't the authors of the publication 'Fusion de syst\\u00E8mes pour la recherche de passages dans des textes' published a publication in CORIA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/coria/KompaoreLM06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/coria/KompaoreLM06> ) . ?y dblp:publishedIn 'CORIA' FILTER NOT EXISTS { <https://dblp.org/rec/conf/coria/KompaoreLM06> dblp:publishedIn 'CORIA' } }","paraphrases":["Have the authors of the paper 'Fusion de syst\\u00E8mes pour la recherche de passages dans des textes' not published a publication in CORIA?"],"info":{}}
{"id":"train_5034","question":"Haven't the authors of the publication 'Security Vulnerabilities and Improvements of SPAM: A Secure Password Authentication Mechanism for Seamless Handover in Proxy Mobile IPv6 Networks' published a publication in Inf. Technol. Control.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/itc/FarashCIKA17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/itc/FarashCIKA17> ) . ?y dblp:publishedIn 'Inf. Technol. Control.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/itc/FarashCIKA17> dblp:publishedIn 'Inf. Technol. Control.' } }","paraphrases":["Did the authors of the publication 'Security Vulnerabilities and Improvements of SPAM: A Secure Password Authentication Mechanism for Seamless Handover in Proxy Mobile IPv6 Networks' not publish a paper in Inf. Technol. Control.?"],"info":{}}
{"id":"train_5035","question":"Did the authors of the publication 'Motion estimation from scaled orthographic projections without correspondences' not publish a paper in Image Vis. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ivc/LinGH94> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ivc/LinGH94> ) . ?y dblp:publishedIn 'Image Vis. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ivc/LinGH94> dblp:publishedIn 'Image Vis. Comput.' } }","paraphrases":["Have the authors of the paper 'Motion estimation from scaled orthographic projections without correspondences' not published a publication in Image Vis. Comput.?"],"info":{}}
{"id":"train_5036","question":"Wasn't the paper 'Mean-field games and two-point boundary value problems' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/MylvaganamBA14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cdc/MylvaganamBA14> dblp:yearOfPublication '2014' } }","paraphrases":["Was 'Mean-field games and two-point boundary value problems' not published in 2014?"],"info":{}}
{"id":"train_5037","question":"Did the authors of the publication 'On On-line Systems for Short-term Forecasting for Energy Systems' not publish a paper in OR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/or/NielsenNM02> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/or/NielsenNM02> ) . ?y dblp:publishedIn 'OR' FILTER NOT EXISTS { <https://dblp.org/rec/conf/or/NielsenNM02> dblp:publishedIn 'OR' } }","paraphrases":["Haven't the authors of the publication 'On On-line Systems for Short-term Forecasting for Energy Systems' published a publication in OR?"],"info":{}}
{"id":"train_5039","question":"Wasn't the publication 'Embankment dam break: Uncertainty of outflow based on fuzzy representation of breach formation parameters' published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jifs/TsakirisS14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jifs/TsakirisS14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the paper 'Embankment dam break: Uncertainty of outflow based on fuzzy representation of breach formation parameters' published in the year 2014?"],"info":{}}
{"id":"train_5040","question":"Wasn't the paper 'Representing Software Engineering Models: The TAME Goal Oriented Approach' published in the year 1992?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tse/OivoB92> dblp:yearOfPublication '1992' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tse/OivoB92> dblp:yearOfPublication '1992' } }","paraphrases":["Wasn't the publication 'Representing Software Engineering Models: The TAME Goal Oriented Approach' published in 1992?"],"info":{}}
{"id":"train_5041","question":"Have the authors of the paper 'Encoding cloth manipulations using a graph of states and transitions' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2009-14681> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2009-14681> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2009-14681> dblp:publishedIn 'CoRR' } }","paraphrases":["Haven't the authors of the publication 'Encoding cloth manipulations using a graph of states and transitions' published a publication in CoRR?"],"info":{}}
{"id":"train_5042","question":"Was 'Design and Motion Analysis of a Mobile Robot Based on Linkage Suspension' not published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jaciii/ChenWZZYW22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jaciii/ChenWZZYW22> dblp:yearOfPublication '2022' } }","paraphrases":["Wasn't the paper 'Design and Motion Analysis of a Mobile Robot Based on Linkage Suspension' published in the year 2022?"],"info":{}}
{"id":"train_5043","question":"Was 'Getting \\Messy\\ with Problems: The Challenges of Teaching \\Soft\\ OR' not published in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ited/Ackermann11> dblp:yearOfPublication '2011' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ited/Ackermann11> dblp:yearOfPublication '2011' } }","paraphrases":["Wasn't the publication 'Getting \\Messy\\ with Problems: The Challenges of Teaching \\Soft\\ OR' published in 2011?"],"info":{}}
{"id":"train_5044","question":"Wasn't the publication 'An oversampled filter bank multicarrier system for Cognitive Radio' published in 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pimrc/ZhangKS08> dblp:yearOfPublication '2008' FILTER NOT EXISTS { <https://dblp.org/rec/conf/pimrc/ZhangKS08> dblp:yearOfPublication '2008' } }","paraphrases":["Was 'An oversampled filter bank multicarrier system for Cognitive Radio' not published in 2008?"],"info":{}}
{"id":"train_5045","question":"Wasn't the publication 'M&C: A Software Solution to Reduce Errors Caused by Incoherent Caches on GPUs in Unstructured Graphic Algorithm' published in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ica3pp/WangWLQ13> dblp:yearOfPublication '2013' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ica3pp/WangWLQ13> dblp:yearOfPublication '2013' } }","paraphrases":["Wasn't the paper 'M&C: A Software Solution to Reduce Errors Caused by Incoherent Caches on GPUs in Unstructured Graphic Algorithm' published in the year 2013?"],"info":{}}
{"id":"train_5046","question":"Wasn't the paper 'Transformer in Convolutional Neural Networks' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2106-03180> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2106-03180> dblp:yearOfPublication '2021' } }","paraphrases":["Was 'Transformer in Convolutional Neural Networks' not published in 2021?"],"info":{}}
{"id":"train_5048","question":"Was 'On a class of convolutional codes' not published in 1983?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tit/Seguin83> dblp:yearOfPublication '1983' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tit/Seguin83> dblp:yearOfPublication '1983' } }","paraphrases":["Wasn't the publication 'On a class of convolutional codes' published in 1983?"],"info":{}}
{"id":"train_5052","question":"Was 'Detection and Visualization of Splat and Antisplat Events in Turbulent Flows' not published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tvcg/NsongaNFSGS20> dblp:yearOfPublication '2020' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tvcg/NsongaNFSGS20> dblp:yearOfPublication '2020' } }","paraphrases":["Wasn't the publication 'Detection and Visualization of Splat and Antisplat Events in Turbulent Flows' published in 2020?"],"info":{}}
