{"id":"train_4683","question":"Did the authors of 'Compensatory seeding in networks with varying avaliability of nodes' also publish a paper in the venue BDA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/asunam/JankowskiMK13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/asunam/JankowskiMK13> ) . ?y dblp:publishedIn 'BDA' }","paraphrases":["Did the authors of the publication 'Compensatory seeding in networks with varying avaliability of nodes' publish other papers in BDA?"],"info":{}}
{"id":"train_4684","question":"Did the authors of the publication 'Non-linear adaptive sliding mode switching control with average dwell-time' also publish 'Digital Inpainting'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijsysc/YuZF13> dblp:authoredBy ?x . <https://dblp.org/rec/conf/IEEEcit/Shih04> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/IEEEcit/Shih04> != <https://dblp.org/rec/journals/ijsysc/YuZF13> ) }","paraphrases":["Did the authors of the publication 'Non-linear adaptive sliding mode switching control with average dwell-time' also publish the publication 'Digital Inpainting'?"],"info":{}}
{"id":"train_4685","question":"Was 'Control Flow Reversal for Adjoint Code Generation' published in 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/scam/NaumannULF04> dblp:yearOfPublication '2004' }","paraphrases":["Was the paper 'Control Flow Reversal for Adjoint Code Generation' published in the year 2004?"],"info":{}}
{"id":"train_4686","question":"Was the publication 'Adaptive Rest Condition Potentials: First and Second Order Edge-Preserving Regularization' published in 2002?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cviu/RiveraM02> dblp:yearOfPublication '2002' }","paraphrases":["Was the publication 'Adaptive Rest Condition Potentials: First and Second Order Edge-Preserving Regularization' published in the year 2002?"],"info":{}}
{"id":"train_4687","question":"Was 'The computation of Gr\\u00F6bner bases on a shared memory multiprocessor' published in 1990?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/disco/Vidal90> dblp:yearOfPublication '1990' }","paraphrases":["Was the publication 'The computation of Gr\\u00F6bner bases on a shared memory multiprocessor' published in the year 1990?"],"info":{}}
{"id":"train_4688","question":"Was the publication 'Deep click feature based query merging for robust image recognition' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icimcs/ZhangTY18> dblp:yearOfPublication '2018' }","paraphrases":["Was 'Deep click feature based query merging for robust image recognition' published in 2018?"],"info":{}}
{"id":"train_4689","question":"Did the authors of 'latent-GLAT: Glancing at Latent Variables for Parallel Text Generation' also publish a paper in the venue International Conference on Intelligent Software Methodologies, Tools, and Techniques?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2204-02030> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2204-02030> ) . ?y dblp:publishedIn 'SoMeT' }","paraphrases":["Did the authors of the paper 'latent-GLAT: Glancing at Latent Variables for Parallel Text Generation' also publish a publication in SoMeT?"],"info":{}}
{"id":"train_4690","question":"Was the paper 'A Deep Pipelined Implementation of Hyperspectral Target Detection Algorithm on FPGA Using HLS' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/remotesensing/LeiLZXCWLZL18> dblp:yearOfPublication '2018' }","paraphrases":["Was 'A Deep Pipelined Implementation of Hyperspectral Target Detection Algorithm on FPGA Using HLS' published in 2018?"],"info":{}}
{"id":"train_4691","question":"Was the paper 'Topographic specificity of alpha power during auditory spatial attention' published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/neuroimage/DengCS20> dblp:yearOfPublication '2020' }","paraphrases":["Was 'Topographic specificity of alpha power during auditory spatial attention' published in 2020?"],"info":{}}
{"id":"train_4692","question":"Did the authors of 'A Parallel Boundary Element Method for the Electromagnetic Analysis of Large Structures With Lossy Conductors' also publish a paper in the venue MSM@WWW,MUSE@PKDD/ECML?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2108-03991> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2108-03991> ) . ?y dblp:publishedIn 'MSM@WWW,MUSE@PKDD/ECML' }","paraphrases":["Did the authors of the publication 'A Parallel Boundary Element Method for the Electromagnetic Analysis of Large Structures With Lossy Conductors' also publish a publication in MSM@WWW,MUSE@PKDD/ECML?"],"info":{}}
{"id":"train_4693","question":"Was the publication 'An assessment of online instructor e-learning readiness before, during, and after course delivery' published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jche/Gay16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'An assessment of online instructor e-learning readiness before, during, and after course delivery' published in the year 2016?"],"info":{}}
{"id":"train_4694","question":"Was the paper 'Multilateral bargaining with concession costs' published in the year 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jet/CaruanaEQ07> dblp:yearOfPublication '2007' }","paraphrases":["Was 'Multilateral bargaining with concession costs' published in 2007?"],"info":{}}
{"id":"train_4695","question":"Did the authors of the paper 'MORP: makespan optimization for processors with an embedded reconfigurable fabric' also publish a publication in ANSS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fpga/GrudnitskyBH14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/fpga/GrudnitskyBH14> ) . ?y dblp:publishedIn 'ANSS' }","paraphrases":["Did the authors of 'MORP: makespan optimization for processors with an embedded reconfigurable fabric' also publish a paper in the venue ANSS?"],"info":{}}
{"id":"train_4697","question":"Did the authors of the paper 'Multiresolution Textures from Image Sequences' also publish the publication 'CafeOBJ as a Tool for Behavioral System Verification'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cga/OfekSRW97> dblp:authoredBy ?x . <https://dblp.org/rec/conf/isss2/MoriF02> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/isss2/MoriF02> != <https://dblp.org/rec/journals/cga/OfekSRW97> ) }","paraphrases":["Did the authors of 'Multiresolution Textures from Image Sequences' also publish 'CafeOBJ as a Tool for Behavioral System Verification'?"],"info":{}}
{"id":"train_4698","question":"Did the authors of the paper 'A Simple and General Problem and its Optimal Randomized Online Algorithm Design with Competitive Analysis' also publish the paper 'Fast weak-KAM integrators for separable Hamiltonian systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/Zhang15g> dblp:authoredBy ?x . <https://dblp.org/rec/journals/moc/BouillardFZ16> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/moc/BouillardFZ16> != <https://dblp.org/rec/journals/corr/Zhang15g> ) }","paraphrases":["Did the authors of 'A Simple and General Problem and its Optimal Randomized Online Algorithm Design with Competitive Analysis' also publish the publication 'Fast weak-KAM integrators for separable Hamiltonian systems'?"],"info":{}}
{"id":"train_4699","question":"Did the authors of 'From Reengineering to Process Management - A Longitudinal Study of BPR in a Danish Manufacturing Company' also publish a paper in the venue ACCV (3)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hicss/LarsenB01> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/hicss/LarsenB01> ) . ?y dblp:publishedIn 'ACCV (3)' }","paraphrases":["Did the authors of the publication 'From Reengineering to Process Management - A Longitudinal Study of BPR in a Danish Manufacturing Company' also publish a publication in Asian Conference on Computer Vision?"],"info":{}}
{"id":"train_4704","question":"Was the paper 'Hybrid Cluster Computing Hardware and Software in the LOFAR Radio Telescope' published in the year 2003?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pdpta/SchaafBV03> dblp:yearOfPublication '2003' }","paraphrases":["Was the publication 'Hybrid Cluster Computing Hardware and Software in the LOFAR Radio Telescope' published in 2003?"],"info":{}}
{"id":"train_4707","question":"Did the authors of the publication 'Experiential Instruction of Metacognitive Strategies' also publish 'Mo Piu minority language: data base, first steps and first experiments'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/HamptonT20> dblp:authoredBy ?x . <https://dblp.org/rec/conf/sltu/Caelen-HaumontCCDHTLNPRSVVS10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/sltu/Caelen-HaumontCCDHTLNPRSVVS10> != <https://dblp.org/rec/conf/hci/HamptonT20> ) }","paraphrases":["Did the authors of 'Experiential Instruction of Metacognitive Strategies' also publish the publication 'Mo Piu minority language: data base, first steps and first experiments'?"],"info":{}}
{"id":"train_4712","question":"Did the authors of the publication 'Stabilization of Nonholonomic Systems Using Isospectral Flows' also publish a publication in ISNN (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamco/BlochDK00> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/siamco/BlochDK00> ) . ?y dblp:publishedIn 'ISNN (1)' }","paraphrases":["Did the authors of 'Stabilization of Nonholonomic Systems Using Isospectral Flows' also publish a paper in the venue International Symposium on Neural Networks?"],"info":{}}
{"id":"train_4714","question":"Did the authors of 'Individual and collective moral influences on intervention in cyberbullying' also publish a paper in the venue Artif. Intell. Law?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chb/AllisonB17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/chb/AllisonB17> ) . ?y dblp:publishedIn 'Artif. Intell. Law' }","paraphrases":["Did the authors of the publication 'Individual and collective moral influences on intervention in cyberbullying' publish other papers in Artif. Intell. Law?"],"info":{}}
{"id":"train_4716","question":"Do the authors of 'Verification of ML Systems via Reparameterization' have Oracle Labs, Burlington, MA, USA as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2007-06776> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Oracle Labs, Burlington, MA, USA' }","paraphrases":["Is Oracle Labs the primary affiliation of the authors of 'Verification of ML Systems via Reparameterization'?"],"info":{}}
{"id":"train_4717","question":"Did the authors of the publication 'A Neural Network-Based Joint Prognostic Model for Data Fusion and Remaining Useful Life Prediction' also publish a publication in Intelligent Information Processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tnn/GaoWW21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tnn/GaoWW21> ) . ?y dblp:publishedIn 'Intelligent Information Processing' }","paraphrases":["Did the authors of 'A Neural Network-Based Joint Prognostic Model for Data Fusion and Remaining Useful Life Prediction' also publish a paper in the venue Intelligent Information Processing?"],"info":{}}
{"id":"train_4718","question":"Was the paper 'Towards the formalization of SPARK 2014 semantics with explicit run-time checks using coq' published in the year 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigada/CourtieuACZRBHG13> dblp:yearOfPublication '2013' }","paraphrases":["Was 'Towards the formalization of SPARK 2014 semantics with explicit run-time checks using coq' published in 2013?"],"info":{}}
{"id":"train_4721","question":"Did the authors of 'Viper: An Efficient Hybrid PMem-DRAM Key-Value Store' also publish a paper in International Conference on Cyberworlds?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pvldb/BensonMR21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/pvldb/BensonMR21> ) . ?y dblp:publishedIn 'CW' }","paraphrases":["Did the authors of the publication 'Viper: An Efficient Hybrid PMem-DRAM Key-Value Store' also publish a publication in CW?"],"info":{}}
{"id":"train_4723","question":"Did the authors of the publication 'Real-time Emotion Recognition - Novel Method for Geometrical Facial Features Extraction' also publish 'Quantum Pushdown Automata'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/visapp/LoconsoleMAFO14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/quant-ph-0102054> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/corr/quant-ph-0102054> != <https://dblp.org/rec/conf/visapp/LoconsoleMAFO14> ) }","paraphrases":["Did the authors of 'Real-time Emotion Recognition - Novel Method for Geometrical Facial Features Extraction' also publish the publication 'Quantum Pushdown Automata'?"],"info":{}}
{"id":"train_4725","question":"Was the publication 'A Logic for SDSI's Linked Local Name Spaces' published in the year 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/csfw/HalpernM99> dblp:yearOfPublication '1999' }","paraphrases":["Was 'A Logic for SDSI's Linked Local Name Spaces' published in 1999?"],"info":{}}
{"id":"train_4726","question":"Did the authors of the publication 'Communicating Compliance: Developing a GDPR Privacy Label' also publish 'Conceptual Integration and Construction Coercion - - on the Neologism \\Tangqiang\\'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcis/FoxTLM18> dblp:authoredBy ?x . <https://dblp.org/rec/conf/clsw/Zhou15> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/clsw/Zhou15> != <https://dblp.org/rec/conf/amcis/FoxTLM18> ) }","paraphrases":["Did the authors of the publication 'Communicating Compliance: Developing a GDPR Privacy Label' also publish the publication 'Conceptual Integration and Construction Coercion - - on the Neologism \\Tangqiang\\'?"],"info":{}}
{"id":"train_4729","question":"Did the authors of the publication 'Access Control in a Port - A GeoRBAC Approach' also publish a publication in Measurement and Modeling of Computer Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/critis/OlivaresMPEPG15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/critis/OlivaresMPEPG15> ) . ?y dblp:publishedIn 'SIGMETRICS' }","paraphrases":["Did the authors of 'Access Control in a Port - A GeoRBAC Approach' also publish a paper in the venue SIGMETRICS?"],"info":{}}
{"id":"train_4730","question":"Was the publication 'Intergenerational Making with Young Children' published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fablearn/PerezJLW20> dblp:yearOfPublication '2020' }","paraphrases":["Was the paper 'Intergenerational Making with Young Children' published in the year 2020?"],"info":{}}
{"id":"train_4731","question":"Is Apple the primary affiliation of the authors of 'Controlling Home and Office Appliances with Smart Phones'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pervasive/NicholsM06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Apple' }","paraphrases":["Do the authors of 'Controlling Home and Office Appliances with Smart Phones' have Apple as their primary affiliation?"],"info":{}}
{"id":"train_4732","question":"Is Indian Institute of Technology Patna the primary affiliation of the authors of 'Sensor node tracking using semi-supervised Hidden Markov Models'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/adhoc/KumarTH15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Indian Institute of Technology Patna, India' }","paraphrases":["Do the authors of 'Sensor node tracking using semi-supervised Hidden Markov Models' have Indian Institute of Technology Patna as their primary affiliation?"],"info":{}}
{"id":"train_4734","question":"Was 'Multi-label Music Genre Classification from Audio, Text, and Images Using Deep Features' published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/OramasNBS17> dblp:yearOfPublication '2017' }","paraphrases":["Was the publication 'Multi-label Music Genre Classification from Audio, Text, and Images Using Deep Features' published in the year 2017?"],"info":{}}
{"id":"train_4735","question":"Was the publication 'Identification of Biological Activity Profiles Using Substructural Analysis and Genetic Algorithms' published in the year 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcisd/GilletWB98> dblp:yearOfPublication '1998' }","paraphrases":["Was the publication 'Identification of Biological Activity Profiles Using Substructural Analysis and Genetic Algorithms' published in 1998?"],"info":{}}
{"id":"train_4736","question":"Did the authors of the publication 'Efficient resource allocation for device-to-device communication underlaying LTE network' also publish the paper 'Linear Multicast Beamforming Schemes for Coded Caching'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wimob/ZulhasnineHS10> dblp:authoredBy ?x . <https://dblp.org/rec/conf/acssc/TolliKSK18> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/acssc/TolliKSK18> != <https://dblp.org/rec/conf/wimob/ZulhasnineHS10> ) }","paraphrases":["Did the authors of 'Efficient resource allocation for device-to-device communication underlaying LTE network' also publish the publication 'Linear Multicast Beamforming Schemes for Coded Caching'?"],"info":{}}
{"id":"train_4739","question":"Did the authors of the publication 'Independence of Contributing Retrieval Strategies in Data Fusion for Effective Information Retrieval' also publish 'Multi-modal Depression Estimation based on Sub-attentional Fusion'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecir/Smeaton98> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-2207-06180> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/corr/abs-2207-06180> != <https://dblp.org/rec/conf/ecir/Smeaton98> ) }","paraphrases":["Did the authors of the paper 'Independence of Contributing Retrieval Strategies in Data Fusion for Effective Information Retrieval' also publish the publication 'Multi-modal Depression Estimation based on Sub-attentional Fusion'?"],"info":{}}
{"id":"train_4740","question":"Was the publication 'Automatic and dynamic grounding method based on sensor data for agent-based simulation' published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wsc/YamaneOYYA17> dblp:yearOfPublication '2017' }","paraphrases":["Was the publication 'Automatic and dynamic grounding method based on sensor data for agent-based simulation' published in 2017?"],"info":{}}
{"id":"train_4741","question":"Did the authors of the publication 'Graph-of-Tweets: A Graph Merging Approach to Sub-event Identification' also publish a publication in J. Exp. Theor. Artif. Intell.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2101-03208> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2101-03208> ) . ?y dblp:publishedIn 'J. Exp. Theor. Artif. Intell.' }","paraphrases":["Did the authors of the publication 'Graph-of-Tweets: A Graph Merging Approach to Sub-event Identification' publish other papers in J. Exp. Theor. Artif. Intell.?"],"info":{}}
{"id":"train_4742","question":"Did the authors of 'Composition and tradeoff of non-functional attributes in software systems: research directions' also publish a paper in FGIT-FGCN (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigsoft/Potena07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sigsoft/Potena07> ) . ?y dblp:publishedIn 'FGIT-FGCN (2)' }","paraphrases":["Did the authors of the paper 'Composition and tradeoff of non-functional attributes in software systems: research directions' also publish a publication in FGIT-FGCN?"],"info":{}}
{"id":"train_4744","question":"Did the authors of the publication 'Clutter Mitigation Based on Spectral Depolarization Ratio for Dual-Polarization Weather Radars' also publish a publication in ROBIO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/staeors/YinCLW21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/staeors/YinCLW21> ) . ?y dblp:publishedIn 'ROBIO' }","paraphrases":["Did the authors of 'Clutter Mitigation Based on Spectral Depolarization Ratio for Dual-Polarization Weather Radars' also publish a paper in the venue ROBIO?"],"info":{}}
{"id":"train_4745","question":"Did the authors of 'Multi-Robot Task Allocation Based on Combinatorial Auction' also publish 'Discovery of Meaningful Rules in Time Series'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccma/WenZ21> dblp:authoredBy ?x . <https://dblp.org/rec/conf/kdd/Shokoohi-Yekta015> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/kdd/Shokoohi-Yekta015> != <https://dblp.org/rec/conf/iccma/WenZ21> ) }","paraphrases":["Did the authors of 'Multi-Robot Task Allocation Based on Combinatorial Auction' also publish the publication 'Discovery of Meaningful Rules in Time Series'?"],"info":{}}
{"id":"train_4746","question":"Was the paper 'SmartPads: a plug-N-play configurable tangible user interface' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mta/HafidhOKAE14> dblp:yearOfPublication '2014' }","paraphrases":["Was 'SmartPads: a plug-N-play configurable tangible user interface' published in 2014?"],"info":{}}
{"id":"train_4747","question":"Did the authors of the publication 'Surgery Scene Restoration for Robot Assisted Minimally Invasive Surgery' publish other papers in Period. Math. Hung.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2109-02253> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2109-02253> ) . ?y dblp:publishedIn 'Period. Math. Hung.' }","paraphrases":["Did the authors of the paper 'Surgery Scene Restoration for Robot Assisted Minimally Invasive Surgery' also publish a publication in Period. Math. Hung.?"],"info":{}}
{"id":"train_4748","question":"Did the authors of the publication 'Fully Three-Dimensional Tomographic Evolutionary Reconstruction in Nuclear Medicine' publish other papers in Sensors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ae/BousquetLR07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ae/BousquetLR07> ) . ?y dblp:publishedIn 'Sensors' }","paraphrases":["Did the authors of 'Fully Three-Dimensional Tomographic Evolutionary Reconstruction in Nuclear Medicine' also publish a paper in the venue Sensors?"],"info":{}}
{"id":"train_4752","question":"Is University of Qu\\u00E9bec the primary affiliation of the authors of 'A supervised training and learning method for building identification in remotely sensed imaging'?","sparql":"ASK { <https://dblp.org/rec/conf/rose/Tremblay-GosselinC13> <https://dblp.org/rdf/schema#authoredBy> ?x . ?x <https://dblp.org/rdf/schema#primaryAffiliation> 'University of Qu\\u00E9bec, Outaouais, Canada' }","paraphrases":["Do the authors of 'A supervised training and learning method for building identification in remotely sensed imaging' have University of Qu\\u00E9bec, Outaouais, Canada as their primary affiliation?"],"info":{}}
{"id":"train_4753","question":"Was 'Truthful Allocation of Virtual Machine Instances with the Notion of Combinatorial Auction' published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ic-nc/SrinivasanF14> dblp:yearOfPublication '2014' }","paraphrases":["Was the publication 'Truthful Allocation of Virtual Machine Instances with the Notion of Combinatorial Auction' published in the year 2014?"],"info":{}}
{"id":"train_4756","question":"Was the publication 'On the similarities between control based and behavior based visual servoing' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sac/FonooniH15> dblp:yearOfPublication '2015' }","paraphrases":["Was the publication 'On the similarities between control based and behavior based visual servoing' published in the year 2015?"],"info":{}}
{"id":"train_4758","question":"Did the authors of 'Hierarchical multi-scale stereoscopic image quality assessment based on visual mechanism' also publish a paper in IEEE Trans. Geosci. Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sivp/ChangLZ22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/sivp/ChangLZ22> ) . ?y dblp:publishedIn 'IEEE Trans. Geosci. Remote. Sens.' }","paraphrases":["Did the authors of 'Hierarchical multi-scale stereoscopic image quality assessment based on visual mechanism' also publish a paper in the venue IEEE Trans. Geosci. Remote. Sens.?"],"info":{}}
{"id":"train_4760","question":"Did the authors of the publication 'A data mining approach to guide students through the enrollment process based on academic performance' also publish a publication in ICIA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/umuai/SacinCPAVEO11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/umuai/SacinCPAVEO11> ) . ?y dblp:publishedIn 'ICIA' }","paraphrases":["Did the authors of 'A data mining approach to guide students through the enrollment process based on academic performance' also publish a paper in the venue ICIA?"],"info":{}}
{"id":"train_4763","question":"Was the paper 'A New Rateless Coded Cooperation Scheme for Multiple Access Channels' published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icc/0017011> dblp:yearOfPublication '2011' }","paraphrases":["Was 'A New Rateless Coded Cooperation Scheme for Multiple Access Channels' published in 2011?"],"info":{}}
{"id":"train_4764","question":"Did the authors of the publication 'Home network requirements The ESPRIT HS Proposal' also publish a publication in IEEE Trans. Netw. Sci. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ett/Babich94> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ett/Babich94> ) . ?y dblp:publishedIn 'IEEE Trans. Netw. Sci. Eng.' }","paraphrases":["Did the authors of the publication 'Home network requirements The ESPRIT HS Proposal' publish other papers in IEEE Trans. Netw. Sci. Eng.?"],"info":{}}
{"id":"train_4766","question":"Was the publication 'On the Pathway to Success: Becoming a Leading Earth Observation Centre Through the EXCELSIOR Project' published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/euromed/HadjimitsisKTMN18> dblp:yearOfPublication '2018' }","paraphrases":["Was the paper 'On the Pathway to Success: Becoming a Leading Earth Observation Centre Through the EXCELSIOR Project' published in the year 2018?"],"info":{}}
{"id":"train_4768","question":"Did the authors of the publication 'CycleISP: Real Image Restoration via Improved Data Synthesis' publish other papers in SAAIP@IJCAI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cvpr/ZamirAKHK0020> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cvpr/ZamirAKHK0020> ) . ?y dblp:publishedIn 'SAAIP@IJCAI' }","paraphrases":["Did the authors of the publication 'CycleISP: Real Image Restoration via Improved Data Synthesis' also publish a publication in SAAIP@IJCAI?"],"info":{}}
{"id":"train_4769","question":"Did the authors of the publication 'Equalized Time Reversal Beamforming for Indoor Wireless Communications' also publish the publication 'Integrating Structural IT Ambidexterity: A Multiple Case Study'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/Viteri-MeraT14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ecis/IhoM20> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ecis/IhoM20> != <https://dblp.org/rec/journals/corr/Viteri-MeraT14> ) }","paraphrases":["Did the authors of the paper 'Equalized Time Reversal Beamforming for Indoor Wireless Communications' also publish the paper 'Integrating Structural IT Ambidexterity: A Multiple Case Study'?"],"info":{}}
{"id":"train_4771","question":"Did the authors of the publication 'Mutual information and conditional mean estimation in Poisson channels' also publish a publication in Medical Image Anal.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/itw/GuoVS04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/itw/GuoVS04> ) . ?y dblp:publishedIn 'Medical Image Anal.' }","paraphrases":["Did the authors of 'Mutual information and conditional mean estimation in Poisson channels' also publish a paper in the venue Medical Image Anal.?"],"info":{}}
{"id":"train_4772","question":"Did the authors of '\\I see you're talking #HPV\\: communication patterns in the #HPV stream on twitter' also publish a paper in Future Gener. Comput. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigdoc/Harrison12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sigdoc/Harrison12> ) . ?y dblp:publishedIn 'Future Gener. Comput. Syst.' }","paraphrases":["Did the authors of the publication '\\I see you're talking #HPV\\: communication patterns in the #HPV stream on twitter' also publish a publication in Future Gener. Comput. Syst.?"],"info":{}}
{"id":"train_4773","question":"Was the publication 'Research on public opinion based on Big Data' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ACISicis/ShangSSH15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Research on public opinion based on Big Data' published in the year 2015?"],"info":{}}
