{"id":"train_6555","question":"Count the different affiliations of the authors of 'Column Generation for the Minimum Hyperplanes Clustering Problem'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/colognetwente/AmaldiCD08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Column Generation for the Minimum Hyperplanes Clustering Problem' have?"],"info":{}}
{"id":"train_6557","question":"Count the papers published by the authors of 'Interactive Radiotherapy Target Delineation with 3D-Fused Context Propagation' in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2012-06873> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["How many papers did the authors of 'Interactive Radiotherapy Target Delineation with 3D-Fused Context Propagation' publish in CoRR?"],"info":{}}
{"id":"train_6558","question":"Mention the count of papers published by the authors of 'Development of a NIC driver in C#' in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2107-12833> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["How many publications did the authors of the paper 'Development of a NIC driver in C#' publish in CoRR?"],"info":{}}
{"id":"train_6560","question":"How many papers did the authors of 'Even Pairs in Claw-Free Perfect Graphs' publish in J. Comb. Theory, Ser. B?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jct/SalesM98> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'J. Comb. Theory, Ser. B' }","paraphrases":["How many publications did the authors of the paper 'Even Pairs in Claw-Free Perfect Graphs' publish in J. Comb. Theory, Ser. B?"],"info":{}}
{"id":"train_6562","question":"How many papers did the authors of 'Security versus performance tradeoffs in RPC implementations for safe language systems' publish in 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sigopsE/ChangCHHE98> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1998' }","paraphrases":["In 1998, how many papers did the authors of 'Security versus performance tradeoffs in RPC implementations for safe language systems' publish?"],"info":{}}
{"id":"train_6564","question":"Mention the count of papers published by the authors of 'Enhancement of sensor network lifetime based on simple transmission power control technique' in ICCE.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iccel/KimCYK12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICCE' }","paraphrases":["How many publications did the authors of the paper 'Enhancement of sensor network lifetime based on simple transmission power control technique' publish in International Conference on Computers in Education?"],"info":{}}
{"id":"train_6565","question":"Count the different affiliations of the authors of 'A brain imaging study of the choice procedure'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/geb/RustichiniDGSP05> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'A brain imaging study of the choice procedure' have?"],"info":{}}
{"id":"train_6566","question":"How many papers did the authors of 'MOSEL: A FLexible Toolset for Monadic Second-Order Logic' publish in 1997?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/tacas/KelbMMG97> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1997' }","paraphrases":["In 1997, how many papers did the authors of 'MOSEL: A FLexible Toolset for Monadic Second-Order Logic' publish?"],"info":{}}
{"id":"train_6572","question":"Count the papers published by the authors of 'Secrecy over Multiple-Access Channel: A Game of Competition and Cooperation' in 2019.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jucs/ChenKV19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["How many papers did the authors of 'Secrecy over Multiple-Access Channel: A Game of Competition and Cooperation' publish in 2019?"],"info":{}}
{"id":"train_6575","question":"Count the different affiliations of the authors of 'A Discrete Homotopic Deformable Model Dealing with Objects with Different Local Dimensions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/dgci/CointepasBG99> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'A Discrete Homotopic Deformable Model Dealing with Objects with Different Local Dimensions' have?"],"info":{}}
{"id":"train_6576","question":"In 2019, how many papers did the authors of 'Multimodal adversarial network for cross-modal retrieval' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/kbs/HuPWX19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["How many papers did the authors of 'Multimodal adversarial network for cross-modal retrieval' publish in 2019?"],"info":{}}
{"id":"train_6577","question":"In 2001, how many papers did the authors of 'Reconstructing spatio-temporal activities of neural sources using an MEG vector beamformer technique' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tbe/SekiharaNPMM01> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2001' }","paraphrases":["How many papers did the authors of 'Reconstructing spatio-temporal activities of neural sources using an MEG vector beamformer technique' publish in 2001?"],"info":{}}
{"id":"train_6578","question":"Count the papers published by the authors of 'Large-Scale Lattice Gas Monte Carlo Simulations for the Generalized Ising Model' in 2011.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ipps/KerscherMSH11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2011' }","paraphrases":["In 2011, how many papers did the authors of 'Large-Scale Lattice Gas Monte Carlo Simulations for the Generalized Ising Model' publish?"],"info":{}}
{"id":"train_6580","question":"Count the different affiliations of the authors of 'Neural-Based Compensation of Nonlinearities in an Airplane Longitudinal Model with Dynamic-Inversion Control'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/cin/LiuLJ17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Neural-Based Compensation of Nonlinearities in an Airplane Longitudinal Model with Dynamic-Inversion Control' have?"],"info":{}}
{"id":"train_6581","question":"Count the papers published by the authors of 'Financial health prediction models using artificial neural networks, genetic algorithm and multivariate discriminant analysis: Iranian evidence' in Expert Syst. Appl..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/eswa/RafieiMB11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Expert Syst. Appl.' }","paraphrases":["Mention the count of papers published by the authors of 'Financial health prediction models using artificial neural networks, genetic algorithm and multivariate discriminant analysis: Iranian evidence' in Expert Syst. Appl.."],"info":{}}
{"id":"train_6582","question":"How many authors of 'A Coordinate Geometry Learning Environment with Game-Like Properties' have Carnegie Mellon University, Pittsburgh, USA as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/its/RaiBH10b> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Carnegie Mellon University, Pittsburgh, USA' }","paraphrases":["What is the count of authors of 'A Coordinate Geometry Learning Environment with Game-Like Properties' who have Carnegie Mellon University as their primary affiliation?"],"info":{}}
{"id":"train_6587","question":"Count the papers published by the authors of 'Time-continuous Estimation of Emotion in Music with Recurrent Neural Networks' in MediaEval.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/mediaeval/PellegriniB15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'MediaEval' }","paraphrases":["How many papers did the authors of 'Time-continuous Estimation of Emotion in Music with Recurrent Neural Networks' publish in MediaEval?"],"info":{}}
{"id":"train_6589","question":"Count the papers published by the authors of 'A Unified Design Theory for Class-E Resonant DC-DC Converter Topologies' in IEEE Access.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/access/PareschiBMRS19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE Access' }","paraphrases":["Mention the count of papers published by the authors of 'A Unified Design Theory for Class-E Resonant DC-DC Converter Topologies' in IEEE Access."],"info":{}}
{"id":"train_6590","question":"Count the different affiliations of the authors of 'Quality assurance and quality development: what will make a difference?'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ifip3-6/Calvert03> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Quality assurance and quality development: what will make a difference?' have?"],"info":{}}
{"id":"train_6592","question":"Count the different affiliations of the authors of 'Building forensics in: supporting the investigation of digital criminal activities (invited talk)'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sigsoft/Williams17a> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Building forensics in: supporting the investigation of digital criminal activities (invited talk)' have?"],"info":{}}
{"id":"train_6593","question":"In 2021, how many papers did the authors of 'Shift-BNN: Highly-Efficient Probabilistic Bayesian Neural Network Training via Memory-Friendly Pattern Retrieving' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/micro/WanXZWSF21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2021' }","paraphrases":["How many papers did the authors of 'Shift-BNN: Highly-Efficient Probabilistic Bayesian Neural Network Training via Memory-Friendly Pattern Retrieving' publish in 2021?"],"info":{}}
{"id":"train_6594","question":"Count the different affiliations of the authors of 'The linked class of Modula-3'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/sigplan/Levy88> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'The linked class of Modula-3' have?"],"info":{}}
{"id":"train_6596","question":"Count the different affiliations of the authors of 'Simplified Method of Speed Control of a DC Motor through DAS Using MATLAB-Based PID Controller and Study of its Application in a Voltage Control System of a DC Generator'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijmtie/ChattopadhyayB13> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Simplified Method of Speed Control of a DC Motor through DAS Using MATLAB-Based PID Controller and Study of its Application in a Voltage Control System of a DC Generator' have?"],"info":{}}
{"id":"train_6597","question":"Mention the count of papers published by the authors of 'Spatial Prisoner's Dilemma in a Network Environment Introducing Heterogeneous Information Distribution' in International Symposium on Information Assurance and Security.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ias/KuraokaFU06> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IAS' }","paraphrases":["How many papers did the authors of 'Spatial Prisoner's Dilemma in a Network Environment Introducing Heterogeneous Information Distribution' publish in IAS?"],"info":{}}
{"id":"train_6600","question":"Count the papers published by the authors of 'Performance Issues for Vertex Elimination Methods in Computing Jacobians Using Automatic Differentiation' in 2002.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iccS/TadjouddineFPR02> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2002' }","paraphrases":["In 2002, how many papers did the authors of 'Performance Issues for Vertex Elimination Methods in Computing Jacobians Using Automatic Differentiation' publish?"],"info":{}}
{"id":"train_6604","question":"Count the papers published by the authors of 'Using Gap Analysis to Improve System Acceptance' in Inf. Syst. Manag..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ism/RussellY06> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Inf. Syst. Manag.' }","paraphrases":["How many papers did the authors of 'Using Gap Analysis to Improve System Acceptance' publish in Inf. Syst. Manag.?"],"info":{}}
{"id":"train_6605","question":"In 2019, how many papers did the authors of 'The TMB path loss model for 5 GHz indoor WiFi scenarios: On the empirical relationship between RSSI, MCS, and spatial streams' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/wd/AdameCB19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["How many papers did the authors of 'The TMB path loss model for 5 GHz indoor WiFi scenarios: On the empirical relationship between RSSI, MCS, and spatial streams' publish in 2019?"],"info":{}}
{"id":"train_6610","question":"How many papers did the authors of 'EnvyDepth:  An Interface for Recovering Local Natural Illumination from Environment Maps' publish in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/cgf/BanterleCDCPS13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2013' }","paraphrases":["In 2013, how many papers did the authors of 'EnvyDepth:  An Interface for Recovering Local Natural Illumination from Environment Maps' publish?"],"info":{}}
{"id":"train_6611","question":"Count the papers published by the authors of 'Supporting Atlantic Cities and Ports Through Earth Observation' in 2021.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/igarss/WyniawskyjRFPGP21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2021' }","paraphrases":["How many papers did the authors of 'Supporting Atlantic Cities and Ports Through Earth Observation' publish in 2021?"],"info":{}}
{"id":"train_6615","question":"Count the papers published by the authors of 'Evolutionary Learning of Fuzzy Neural Network Using A Modified Genetic Algorithm' in 2003.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/his/SengT03> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2003' }","paraphrases":["In 2003, how many papers did the authors of 'Evolutionary Learning of Fuzzy Neural Network Using A Modified Genetic Algorithm' publish?"],"info":{}}
{"id":"train_6617","question":"How many papers did the authors of 'Driving skill analysis using machine learning The full curve and curve segmented cases' publish in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/itst/ChandrasiriNILYHSSMT12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2012' }","paraphrases":["In 2012, how many papers did the authors of 'Driving skill analysis using machine learning The full curve and curve segmented cases' publish?"],"info":{}}
{"id":"train_6620","question":"Mention the count of papers published by the authors of 'First Passage Problems for Nonstationary Discrete-Time Stochastic Control Systems' in Eur. J. Control.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ejcon/GuoHH12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Eur. J. Control' }","paraphrases":["How many papers did the authors of 'First Passage Problems for Nonstationary Discrete-Time Stochastic Control Systems' publish in Eur. J. Control?"],"info":{}}
{"id":"train_6623","question":"Count the papers published by the authors of 'Copyright Impacts of and on Government Programs' in 1976.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jcisd/Burchinal76> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1976' }","paraphrases":["How many papers did the authors of 'Copyright Impacts of and on Government Programs' publish in 1976?"],"info":{}}
{"id":"train_6625","question":"Count the different affiliations of the authors of 'Syntactic REAPPT: Exercises on Clitic Pronouning'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/slate/FreitasBM13> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Syntactic REAPPT: Exercises on Clitic Pronouning' have?"],"info":{}}
{"id":"train_6626","question":"In 2015, how many papers did the authors of 'Nature-Inspired Algorithms for Real-World Optimization Problems' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jam/FangLZH15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2015' }","paraphrases":["How many papers did the authors of 'Nature-Inspired Algorithms for Real-World Optimization Problems' publish in 2015?"],"info":{}}
{"id":"train_6627","question":"Count the papers published by the authors of 'Rate control on correlation coefficient of network delay' in IEEE Global Telecommunications Conference .","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/globecom/IkegamiNAT03> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'GLOBECOM' }","paraphrases":["How many papers did the authors of 'Rate control on correlation coefficient of network delay' publish in IEEE Global Telecommunications Conference ?"],"info":{}}
{"id":"train_6628","question":"Count the papers published by the authors of 'A Highly Efficient Implementation of I/O Functions on GPU' in 2012.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ipps/WuQHW12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2012' }","paraphrases":["How many papers did the authors of 'A Highly Efficient Implementation of I/O Functions on GPU' publish in 2012?"],"info":{}}
{"id":"train_6629","question":"How many authors of 'Matlab-Based Problem-Solving Environment for Geometric Processing of Surfaces' have University of Cantabria as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icms/GalvezI06> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Cantabria, Santander, Spain' }","paraphrases":["What is the count of authors of 'Matlab-Based Problem-Solving Environment for Geometric Processing of Surfaces' who have University of Cantabria as their primary affiliation?"],"info":{}}
{"id":"train_6630","question":"Mention the count of papers published by the authors of 'A hybrid silicon/InP integrated feedback stabilized mode-locked laser' in OFC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ofc/DavenportSH014> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'OFC' }","paraphrases":["How many publications did the authors of the paper 'A hybrid silicon/InP integrated feedback stabilized mode-locked laser' publish in OFC?"],"info":{}}
{"id":"train_6631","question":"Count the papers published by the authors of 'Individual differences in haemoglobin concentration influence bold fMRI functional connectivity and its correlation with cognition' in 2020.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/neuroimage/WardOOASFSEJ20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2020' }","paraphrases":["In 2020, how many papers did the authors of 'Individual differences in haemoglobin concentration influence bold fMRI functional connectivity and its correlation with cognition' publish?"],"info":{}}
{"id":"train_6632","question":"How many papers did the authors of 'A Mesh-Connected Area-Time Optimal VLSI Multiplier of Large Integers' publish in 1983?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tc/Preparata83> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1983' }","paraphrases":["In 1983, how many papers did the authors of 'A Mesh-Connected Area-Time Optimal VLSI Multiplier of Large Integers' publish?"],"info":{}}
{"id":"train_6635","question":"Mention the count of papers published by the authors of 'Improving Medication Adherence with Two-way Short Message Service Reminders in Sickle Cell Disease and Asthma' in Appl. Clin. Inform..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/aci/PernellDBRBC17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Appl. Clin. Inform.' }","paraphrases":["How many publications did the authors of the paper 'Improving Medication Adherence with Two-way Short Message Service Reminders in Sickle Cell Disease and Asthma' publish in Appl. Clin. Inform.?"],"info":{}}
{"id":"train_6639","question":"Count the papers published by the authors of 'An evaluation of the Reed-Solomon error-correcting codes usage for bio-cryptographic algorithms' in SACI.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/saci/VelciuPP15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'SACI' }","paraphrases":["Mention the count of papers published by the authors of 'An evaluation of the Reed-Solomon error-correcting codes usage for bio-cryptographic algorithms' in SACI."],"info":{}}
{"id":"train_6642","question":"Mention the count of papers published by the authors of 'Access Control Model Based on Trust and Risk Evaluation in IDMaaS' in ITNG.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/itng/LiuWBS15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ITNG' }","paraphrases":["Count the papers published by the authors of 'Access Control Model Based on Trust and Risk Evaluation in IDMaaS' in ITNG."],"info":{}}
{"id":"train_6643","question":"Count the papers published by the authors of 'MD-ART: a test case generation method without test oracle problem' in 2016.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/kbse/HuiH16> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2016' }","paraphrases":["How many papers did the authors of 'MD-ART: a test case generation method without test oracle problem' publish in 2016?"],"info":{}}
{"id":"train_6644","question":"Count the papers published by the authors of 'A partial replication approach for anywhere anytime mobile commenting' in CSCW.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cscw/XiaLSLDG14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CSCW' }","paraphrases":["Mention the count of papers published by the authors of 'A partial replication approach for anywhere anytime mobile commenting' in ACM Conference on Computer Supported Cooperative Work."],"info":{}}
{"id":"train_6645","question":"Count the papers published by the authors of 'A brief analysis of favorable and unfavorable conditions for future development of pharmaceutical E-commerce in China' in LISS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/liss/Wang16g> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'LISS' }","paraphrases":["Mention the count of papers published by the authors of 'A brief analysis of favorable and unfavorable conditions for future development of pharmaceutical E-commerce in China' in LISS."],"info":{}}
{"id":"train_6646","question":"Count the papers published by the authors of 'E-Government Evaluation: An Assessment Approach Using ROI vs ROR Matrix' in Int. J. Electron. Gov. Res..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijegr/Wong13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Int. J. Electron. Gov. Res.' }","paraphrases":["How many papers did the authors of 'E-Government Evaluation: An Assessment Approach Using ROI vs ROR Matrix' publish in Int. J. Electron. Gov. Res.?"],"info":{}}
{"id":"train_6654","question":"Mention the year in which the first papers of the authors of 'Consistency of Distributionally Robust Risk- and Chance-Constrained Optimization Under Wasserstein Ambiguity Sets' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/csysl/CherukuriH21> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Consistency of Distributionally Robust Risk- and Chance-Constrained Optimization Under Wasserstein Ambiguity Sets' published?"],"info":{}}
{"id":"train_6656","question":"Mention the author who has published the most papers among the authors of 'The generalized linear complementarity problem and an algorithm to find all its solutions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/mp/MoorVV92> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'The generalized linear complementarity problem and an algorithm to find all its solutions'?"],"info":{}}
{"id":"train_6657","question":"Which one has more number of authors, 'Plastic Waste is Exponentially Filling our Oceans, but where are the Robots?' or 'A Refined Mean Field Approximation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1809-00798> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/sigmetrics/GastH18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/corr/abs-1809-00798> , <https://dblp.org/rec/conf/sigmetrics/GastH18> ) AS ?answer ) }","paraphrases":["Between 'Plastic Waste is Exponentially Filling our Oceans, but where are the Robots?' and 'A Refined Mean Field Approximation', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6658","question":"Mention the author who has published the most papers among the authors of 'Asymptotic enumeration, global structure, and constrained evolution'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/dm/PromelST01> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Asymptotic enumeration, global structure, and constrained evolution'?"],"info":{}}
{"id":"train_6659","question":"Mention the primary affiliation of most of the authors of 'Faster fast evaluation of thin plate splines in two dimensions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jcam/BeatsonOR14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'Faster fast evaluation of thin plate splines in two dimensions'?"],"info":{}}
