{"id":"train_830","question":"List the titles of the papers that Bansal, T. published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/5260> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Tarun Bansal publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_831","question":"List the titles of the papers that Karol Draszawka published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/47/10537> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Karol Draszawka published and in which venues?"],"info":{}}
{"id":"train_832","question":"Which publications did Kaoru Saito author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/02/5485> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Saito, Kaoru and in which year."],"info":{}}
{"id":"train_833","question":"List the venues in which Yuri Demchenko published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/2010> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Demchenko, Y. published and in which venues."],"info":{}}
{"id":"train_834","question":"Which papers did author B. Ommer publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/11/4098> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Bj\\u00F6rn Ommer author and in which year?"],"info":{}}
{"id":"train_835","question":"List the titles of the papers that H. Barki published in the last 2 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/8074> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which H. Barki published papers in the last 2 years and the titles of these papers."],"info":{}}
{"id":"train_837","question":"Mention the other authors with whom Toshiyuki Sakai has co-authored papers in the last nine years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/118> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/64/118> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Toshiyuki Sakai in the last 9 years and where are they affiliated?"],"info":{}}
{"id":"train_838","question":"List the venues in which N\\u00E9stor \\u00C1lvarez-D\\u00EDaz published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/196/7168> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that N\\u00E9stor \\u00C1lvarez-D\\u00EDaz published and in which venues."],"info":{}}
{"id":"train_840","question":"Which publications did James M. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/165/0359> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by James MacKrill and in which year."],"info":{}}
{"id":"train_841","question":"What are the titles of the papers that Tao, J. published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/25/6764-1> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Jia Tao publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_844","question":"List the venues in which M. A. Neerincx published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/1468> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Mark A. Neerincx published and in which venues?"],"info":{}}
{"id":"train_845","question":"Mention the other authors with whom C. Qian has co-authored papers in the last four years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/147/2276> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/147/2276> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of C. Qian in the last four years and where are they affiliated?"],"info":{}}
{"id":"train_847","question":"List the titles of the papers that M. Mortensen published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/9223> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Mikael Mortensen published papers and the titles of these papers."],"info":{}}
{"id":"train_849","question":"Mention the other authors with whom Olaf Burkart has co-authored papers in the last nine years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/2924> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/95/2924> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Olaf Burkart in the last 9 years and where are they affiliated?"],"info":{}}
{"id":"train_850","question":"Which publications did T. Green author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/99/4334> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by T. Green and in which year."],"info":{}}
{"id":"train_852","question":"List the venues in which N. Nishida published papers in the last 3 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/519> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that N. Nishida published in the last three years and in which venues."],"info":{}}
{"id":"train_853","question":"List the venues in which Eugene L. Wachspress published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/5280> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Eugene L. Wachspress publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_854","question":"What are the titles of the papers that Urban, K. published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/36/4952> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Karsten Urban publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_855","question":"Mention the other authors with whom Klimeck, Gerhard has co-authored papers in the last three years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/78/1556> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/78/1556> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Klimeck, Gerhard in the last 3 years and where are they affiliated?"],"info":{}}
{"id":"train_856","question":"In which venues did Sezer, Mehmet publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/61/4336> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Mehmet Sezer published and in which venues?"],"info":{}}
{"id":"train_858","question":"Which publications did Rajeevardhan Gopalan author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/180/7205> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Rajeevardhan Gopalan publish and in which year?"],"info":{}}
{"id":"train_859","question":"Mention the papers published by Prantner, K. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/39/6735> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Kathrin Prantner publish and in which year?"],"info":{}}
{"id":"train_860","question":"Mention the other authors with whom Fouzi Harrag has co-authored papers in the last four years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/7709> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/30/7709> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Fouzi Harrag in the last 4 years and where are they affiliated?"],"info":{}}
{"id":"train_861","question":"List the titles of the papers that Tian He published in the last five years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/h/TianHe> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that T. He published in the last 5 years and in which venues?"],"info":{}}
{"id":"train_862","question":"What are the titles of the papers that B. Jeannet published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/03/5344> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Bertrand Jeannet publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_863","question":"Name the co-authors of Bixio Rimoldi in the last two years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/11/2041> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/11/2041> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Bixio Rimoldi in the last 2 years and where are they affiliated?"],"info":{}}
{"id":"train_868","question":"Mention the other authors with whom J. Chen has co-authored papers in the last 4 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/65/3494> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/65/3494> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Jyh-Horng Chen in the last 4 years and where are they affiliated?"],"info":{}}
{"id":"train_869","question":"Which papers did author Alantha Newman publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/n/AlanthaNewman> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Alantha Newman author and in which year?"],"info":{}}
{"id":"train_871","question":"List the venues in which Erland Jonsson published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/66/3855> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Jonsson, E. published and in which venues."],"info":{}}
{"id":"train_873","question":"List the venues in which Simpson, A. K. published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/s/AlexKSimpson> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Simpson, A. K. published and in which venues."],"info":{}}
{"id":"train_874","question":"List the venues in which Peiqi Su published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/144/5468> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did P. Su publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_878","question":"List the venues in which Bondavalli, A. published papers in the last four years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/31/4416> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Andrea Bondavalli published in the last 4 years and in which venues."],"info":{}}
{"id":"train_879","question":"Mention the papers published by Camps, O. I. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/69/6960> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Octavia I. Camps author and in which year?"],"info":{}}
{"id":"train_880","question":"Mention the other authors with whom Hamid Jafarkhani has co-authored papers in the last 3 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/73/5832> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/73/5832> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Hamid Jafarkhani in the last three years and where are they affiliated?"],"info":{}}
{"id":"train_881","question":"Mention the papers published by Kuroda, Ichiro and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/04/4772> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Kuroda, Ichiro author and in which year?"],"info":{}}
{"id":"train_882","question":"Who are the co-authors of M. Bode in the last seven years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/59/4054> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/59/4054> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Mathias Bode in the last seven years and where are they affiliated?"],"info":{}}
{"id":"train_884","question":"Mention the papers published by Pieters, R. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/68/7414> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Roel Pieters publish and in which year?"],"info":{}}
{"id":"train_887","question":"Name the co-authors of Sherman B. in the last 3 years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/24/4940> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/24/4940> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Sherman Braganza in the last 3 years and where are they affiliated?"],"info":{}}
{"id":"train_888","question":"Which publications did R. Mester author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/04/2727> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Rudolf Mester and in which year."],"info":{}}
{"id":"train_892","question":"Mention the papers published by Gutflaish, Eyal and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/200/8579> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Eyal Gutflaish author and in which year?"],"info":{}}
{"id":"train_893","question":"Mention the other authors with whom A. Akbariazirani has co-authored papers in the last six years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/36/9367> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/36/9367> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of A. Akbariazirani in the last 6 years and where are they affiliated?"],"info":{}}
{"id":"train_896","question":"Name the co-authors of Kurt Mehlhorn in the last 9 years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/m/KurtMehlhorn> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/m/KurtMehlhorn> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Mehlhorn, Kurt in the last nine years and where are they affiliated?"],"info":{}}
{"id":"train_897","question":"List the titles of the papers that A. Takei published in the last 9 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/249/0425> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that A. Takei published in the last nine years and in which venues?"],"info":{}}
{"id":"train_899","question":"List the venues in which Kundur, Deepa published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/3714> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Kundur, Deepa published and in which venues?"],"info":{}}
{"id":"train_900","question":"Mention the papers published by Yi-Bing Lin and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/l/YiBingLin> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Yi-Bing Lin publish and in which year?"],"info":{}}
{"id":"train_903","question":"Name the co-authors of Campbell, M. in the last seven years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/72/3339> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/72/3339> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Campbell, M. in the last 7 years and where are they affiliated?"],"info":{}}
{"id":"train_904","question":"Which papers did author Werner Ruckriegel publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/34/833> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Werner Ruckriegel and in which year."],"info":{}}
{"id":"train_905","question":"Mention the papers published by Christian A. Mueller and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/117/3215> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Christian A. Mueller publish and in which year?"],"info":{}}
{"id":"train_907","question":"Which publications did Boht\\u00E9, Sander M. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/15/5737> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Sander M. Boht\\u00E9 publish and in which year?"],"info":{}}
{"id":"train_908","question":"Mention the papers published by Dabran, Itai and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/45/3968> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Itai Dabran author and in which year?"],"info":{}}
{"id":"train_909","question":"Which publications did Jonas M. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/91/4352> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Jonas M. and in which year."],"info":{}}
{"id":"train_911","question":"What are the titles of the papers that Zhenpeng Wang published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/63/10180> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Zhenpeng Wang publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_912","question":"List the titles of the papers that Benjamin Egelund-M\\u00FCller published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/210/9429> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Egelund-M\\u00FCller, B. published and in which venues?"],"info":{}}
{"id":"train_914","question":"List the venues in which Artiom Kovnatsky published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/68/9060> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Artiom Kovnatsky publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_917","question":"In which venues did A. Avizienis publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/74/5913> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Algirdas Avizienis published and in which venues?"],"info":{}}
{"id":"train_918","question":"List the titles of the papers that Robert Dale published in the last three years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/92/5943> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Dale, Robert published in the last three years and in which venues?"],"info":{}}
{"id":"train_921","question":"Name the co-authors of Meng Y. in the last two years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/84/10773> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/84/10773> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Meng Y. in the last 2 years and where are they affiliated?"],"info":{}}
{"id":"train_922","question":"Name the co-authors of Michael A. Jacobs in the last 4 years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/71/4633> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/71/4633> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of M. A. Jacobs in the last four years and where are they affiliated?"],"info":{}}
{"id":"train_923","question":"Mention the other authors with whom Amoudruz, Lucas has co-authored papers in the last 7 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/217/9400> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/217/9400> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Amoudruz, Lucas in the last 7 years and where are they affiliated?"],"info":{}}
{"id":"train_927","question":"Which papers did author Samson Young publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/159/4925> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Samson Young and in which year."],"info":{}}
{"id":"train_928","question":"Which papers did author Stefan Vigerske publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/10/4489> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Vigerske, S. and in which year."],"info":{}}
{"id":"train_929","question":"List the venues in which George K. Georgoulas published papers in the last 6 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/45/9417> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that George K. Georgoulas published in the last 6 years and in which venues?"],"info":{}}
{"id":"train_930","question":"What are the titles of the papers that Zehavi, Meirav published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/133/1023> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Zehavi, Meirav publish papers and what are the titles of these papers?"],"info":{}}
