{"id":"train_4602","question":"Did the authors of 'SDN-based Resource Allocation in Edge and Cloud Computing Systems: An Evolutionary Stackelberg Differential Game Approach' also publish a paper in J. Glob. Optim.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2109-12543> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2109-12543> ) . ?y dblp:publishedIn 'J. Glob. Optim.' }","paraphrases":["Did the authors of the publication 'SDN-based Resource Allocation in Edge and Cloud Computing Systems: An Evolutionary Stackelberg Differential Game Approach' also publish a publication in J. Glob. Optim.?"],"info":{}}
{"id":"train_4603","question":"Is Chinese Academy of Sciences, Institute of Geographical Sciences and Natural Resources Research, State Key Laboratory of Resources and Environmental Information System, Beijing, China the primary affiliation of the authors of 'Quantitative Responses of Satellite-Derived Nighttime Lighting Signals to Anthropogenic Land-Use and Land-Cover Changes across China'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/remotesensing/Ma18b> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Chinese Academy of Sciences, Institute of Geographical Sciences and Natural Resources Research, State Key Laboratory of Resources and Environmental Information System, Beijing, China' }","paraphrases":["Do the authors of 'Quantitative Responses of Satellite-Derived Nighttime Lighting Signals to Anthropogenic Land-Use and Land-Cover Changes across China' have Chinese Academy of Sciences, Institute of Geographical Sciences and Natural Resources Research, State Key Laboratory of Resources and Environmental Information System, Beijing, China as their primary affiliation?"],"info":{}}
{"id":"train_4604","question":"Did the authors of the publication 'Effectiveness of Mobile Recommender Systems for Tourist Destinations: A User Evaluation' also publish a publication in SMM4H@AMIA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaaiss/ModschingKHG07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/aaaiss/ModschingKHG07> ) . ?y dblp:publishedIn 'SMM4H@AMIA' }","paraphrases":["Did the authors of 'Effectiveness of Mobile Recommender Systems for Tourist Destinations: A User Evaluation' also publish a paper in SMM4H@AMIA?"],"info":{}}
{"id":"train_4606","question":"Was 'Efficient Object Tracking in Compressed Video Streams with Graph Cuts' published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mmsp/SilvaGBSH18> dblp:yearOfPublication '2018' }","paraphrases":["Was the paper 'Efficient Object Tracking in Compressed Video Streams with Graph Cuts' published in the year 2018?"],"info":{}}
{"id":"train_4610","question":"Was the publication 'Towards Design and Implementation of a Language Technology based Information Processor for PDM Systems' published in the year 2010?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1008-1394> dblp:yearOfPublication '2010' }","paraphrases":["Was 'Towards Design and Implementation of a Language Technology based Information Processor for PDM Systems' published in 2010?"],"info":{}}
{"id":"train_4612","question":"Was the paper 'Fully automated algorithm for the segmentation of the middle and proximal phalanges of digitized hand radiographs' published in the year 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/miip/DuryeaJCG98> dblp:yearOfPublication '1998' }","paraphrases":["Was 'Fully automated algorithm for the segmentation of the middle and proximal phalanges of digitized hand radiographs' published in 1998?"],"info":{}}
{"id":"train_4613","question":"Was the publication 'Panel: Empirically-based Secure OS Design' published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nspw/WeberSSZ17> dblp:yearOfPublication '2017' }","paraphrases":["Was the paper 'Panel: Empirically-based Secure OS Design' published in the year 2017?"],"info":{}}
{"id":"train_4614","question":"Was the paper 'GPU Parallelization of HEVC In-Loop Filters' published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijpp/WangSMCJIRS17> dblp:yearOfPublication '2017' }","paraphrases":["Was the publication 'GPU Parallelization of HEVC In-Loop Filters' published in the year 2017?"],"info":{}}
{"id":"train_4616","question":"Did the authors of 'Sparse Code Multiple Access: Potentials and Challenges' also publish a paper in the venue AGILE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ojcs/RebhiHRC21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ojcs/RebhiHRC21> ) . ?y dblp:publishedIn 'AGILE' }","paraphrases":["Did the authors of 'Sparse Code Multiple Access: Potentials and Challenges' also publish a paper in AGILE?"],"info":{}}
{"id":"train_4618","question":"Did the authors of 'Fast Sparse Coding Inference with Historical Information' also publish 'Analysis of Behaviour Patterns of the Residents of a Smart House'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icdm/ZhangJS19> dblp:authoredBy ?x . <https://dblp.org/rec/conf/csoc/KlekaFF19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/csoc/KlekaFF19> != <https://dblp.org/rec/conf/icdm/ZhangJS19> ) }","paraphrases":["Did the authors of the paper 'Fast Sparse Coding Inference with Historical Information' also publish the publication 'Analysis of Behaviour Patterns of the Residents of a Smart House'?"],"info":{}}
{"id":"train_4619","question":"Was the publication 'Communication Complexity of Sum-Type Functions Invariant under Translation' published in the year 1995?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iandc/Tamm95> dblp:yearOfPublication '1995' }","paraphrases":["Was 'Communication Complexity of Sum-Type Functions Invariant under Translation' published in 1995?"],"info":{}}
{"id":"train_4620","question":"Was the publication 'PESAP: A Privacy Enhanced Social Application Platform' published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/socialcom/ReynaertGDDP12> dblp:yearOfPublication '2012' }","paraphrases":["Was the paper 'PESAP: A Privacy Enhanced Social Application Platform' published in the year 2012?"],"info":{}}
{"id":"train_4621","question":"Did the authors of 'Orthodox BLUP versus h-likelihood methods for inferences about random effects in Tweedie mixed models' also publish a paper in the venue Australas. J Comb.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sac/LeeH10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/sac/LeeH10> ) . ?y dblp:publishedIn 'Australas. J Comb.' }","paraphrases":["Did the authors of the publication 'Orthodox BLUP versus h-likelihood methods for inferences about random effects in Tweedie mixed models' also publish a publication in Australas. J Comb.?"],"info":{}}
{"id":"train_4622","question":"Did the authors of 'OpinionLink: Leveraging user opinions for product catalog enrichment' also publish 'Efficient temporal shortest path queries on evolving social graphs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ipm/MeloSMC19> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ssdbm/HuoT14> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ssdbm/HuoT14> != <https://dblp.org/rec/journals/ipm/MeloSMC19> ) }","paraphrases":["Did the authors of 'OpinionLink: Leveraging user opinions for product catalog enrichment' also publish the publication 'Efficient temporal shortest path queries on evolving social graphs'?"],"info":{}}
{"id":"train_4623","question":"Did the authors of the publication 'Incremental Detection of Local Community Structure' also publish a publication in High. Order Symb. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/asunam/Branting10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/asunam/Branting10> ) . ?y dblp:publishedIn 'High. Order Symb. Comput.' }","paraphrases":["Did the authors of the publication 'Incremental Detection of Local Community Structure' publish other papers in High. Order Symb. Comput.?"],"info":{}}
{"id":"train_4625","question":"Was the paper 'A simple approach to system modeling' published in the year 1981?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pe/Bard81> dblp:yearOfPublication '1981' }","paraphrases":["Was the publication 'A simple approach to system modeling' published in the year 1981?"],"info":{}}
{"id":"train_4626","question":"Did the authors of 'Autoware_Perf: A tracing and performance analysis framework for ROS 2 applications' also publish the publication 'An adaptive cartesian control scheme for manipulators'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jsa/LiHA22> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icra/Seraji87> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icra/Seraji87> != <https://dblp.org/rec/journals/jsa/LiHA22> ) }","paraphrases":["Did the authors of the paper 'Autoware_Perf: A tracing and performance analysis framework for ROS 2 applications' also publish the paper 'An adaptive cartesian control scheme for manipulators'?"],"info":{}}
{"id":"train_4627","question":"Was the paper 'Secure Sharing of Spatio-Temporal Data through Name-based Access Control' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/infocom/FanW21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Secure Sharing of Spatio-Temporal Data through Name-based Access Control' published in 2021?"],"info":{}}
{"id":"train_4628","question":"Was the publication 'Panacea: A low-latency, energy-efficient neighbor discovery protocol for wireless sensor networks' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wcnc/CaoGWC18> dblp:yearOfPublication '2018' }","paraphrases":["Was 'Panacea: A low-latency, energy-efficient neighbor discovery protocol for wireless sensor networks' published in 2018?"],"info":{}}
{"id":"train_4629","question":"Was the publication 'Co-simulation of RFIC with bondwire antenna via retarded PEEC method' published in the year 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscas/ZhangFNW12> dblp:yearOfPublication '2012' }","paraphrases":["Was the publication 'Co-simulation of RFIC with bondwire antenna via retarded PEEC method' published in 2012?"],"info":{}}
{"id":"train_4630","question":"Did the authors of the publication 'A Three Species Model to Simulate Application of Hyperbaric Oxygen Therapy to Chronic Wounds' also publish a publication in ISM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ploscb/FleggMBT09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ploscb/FleggMBT09> ) . ?y dblp:publishedIn 'ISM' }","paraphrases":["Did the authors of 'A Three Species Model to Simulate Application of Hyperbaric Oxygen Therapy to Chronic Wounds' also publish a paper in the venue ISM?"],"info":{}}
{"id":"train_4631","question":"Did the authors of 'Democratizing software: Open source, the hacker ethic, and beyond' also publish a paper in the venue J. Softw.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/firstmonday/Jesiek03> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/firstmonday/Jesiek03> ) . ?y dblp:publishedIn 'J. Softw.' }","paraphrases":["Did the authors of the publication 'Democratizing software: Open source, the hacker ethic, and beyond' publish other papers in J. Softw.?"],"info":{}}
{"id":"train_4632","question":"Did the authors of 'Demodulation of a Subsampled Direct Sequence Spread Spectrum Signal using Compressive Signal Processing' also publish a paper in the venue IEEE J. Sel. Areas Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1110-5176> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1110-5176> ) . ?y dblp:publishedIn 'IEEE J. Sel. Areas Commun.' }","paraphrases":["Did the authors of the paper 'Demodulation of a Subsampled Direct Sequence Spread Spectrum Signal using Compressive Signal Processing' also publish a publication in IEEE J. Sel. Areas Commun.?"],"info":{}}
{"id":"train_4633","question":"Was the publication 'Synthesizing panoramas for non-planar displays: a camera array workflow' published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/siggraph/MandalK18> dblp:yearOfPublication '2018' }","paraphrases":["Was the paper 'Synthesizing panoramas for non-planar displays: a camera array workflow' published in the year 2018?"],"info":{}}
{"id":"train_4634","question":"Did the authors of the paper 'Context-Awareness Micro-architecture for Smart Spaces' also publish the paper 'Decentralized sequencing of jobs on a single machine'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gpc/Pantsar-SyvaniemiKO11> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ssci/PeschKKM16> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ssci/PeschKKM16> != <https://dblp.org/rec/conf/gpc/Pantsar-SyvaniemiKO11> ) }","paraphrases":["Did the authors of the publication 'Context-Awareness Micro-architecture for Smart Spaces' also publish 'Decentralized sequencing of jobs on a single machine'?"],"info":{}}
{"id":"train_4635","question":"Did the authors of the paper 'Full-Aperture Azimuth Spatial-Variant Autofocus Based on Contrast Maximization for Highly Squinted Synthetic Aperture Radar' also publish the publication 'Load Model for Highway Bridges'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tgrs/HuangGZYT20> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ifip7-5/Nowak93> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ifip7-5/Nowak93> != <https://dblp.org/rec/journals/tgrs/HuangGZYT20> ) }","paraphrases":["Did the authors of 'Full-Aperture Azimuth Spatial-Variant Autofocus Based on Contrast Maximization for Highly Squinted Synthetic Aperture Radar' also publish 'Load Model for Highway Bridges'?"],"info":{}}
{"id":"train_4636","question":"Did the authors of 'Flashcast' also publish a paper in the venue Eur. Trans. Telecommun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apcc/JeongLC12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/apcc/JeongLC12> ) . ?y dblp:publishedIn 'Eur. Trans. Telecommun.' }","paraphrases":["Did the authors of 'Flashcast' also publish a paper in Eur. Trans. Telecommun.?"],"info":{}}
{"id":"train_4637","question":"Did the authors of the publication 'Handling Data Streams while Compiling C Programs onto Hardware' publish other papers in Intell. Autom. Soft Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isvlsi/MukherjeeJB04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/isvlsi/MukherjeeJB04> ) . ?y dblp:publishedIn 'Intell. Autom. Soft Comput.' }","paraphrases":["Did the authors of the paper 'Handling Data Streams while Compiling C Programs onto Hardware' also publish a publication in Intell. Autom. Soft Comput.?"],"info":{}}
{"id":"train_4639","question":"Was the publication 'Interactive Automated Fiber Type Identification' published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecoc/SeveDPBSSGBP18> dblp:yearOfPublication '2018' }","paraphrases":["Was the paper 'Interactive Automated Fiber Type Identification' published in the year 2018?"],"info":{}}
{"id":"train_4640","question":"Was the paper 'An Entropy Estimator Based on Polynomial Regression with Poisson Error Structure' published in the year 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iconip/HinoAM16> dblp:yearOfPublication '2016' }","paraphrases":["Was 'An Entropy Estimator Based on Polynomial Regression with Poisson Error Structure' published in 2016?"],"info":{}}
{"id":"train_4641","question":"Do the authors of 'Noncontact Heartbeat Detection by Viterbi Algorithm with Fusion of Beat-Beat Interval and Deep Learning-Driven Branch Metrics' have Keio University as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/YamamotoO21> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Keio University, Department of Information and Computer Science, Yokohama, Japan' }","paraphrases":["Is Keio University the primary affiliation of the authors of 'Noncontact Heartbeat Detection by Viterbi Algorithm with Fusion of Beat-Beat Interval and Deep Learning-Driven Branch Metrics'?"],"info":{}}
{"id":"train_4643","question":"Was 'Towards a Quantum-Like Cognitive Architecture for Decision-Making' published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1905-05176> dblp:yearOfPublication '2019' }","paraphrases":["Was the publication 'Towards a Quantum-Like Cognitive Architecture for Decision-Making' published in the year 2019?"],"info":{}}
{"id":"train_4644","question":"Did the authors of the paper 'Tidal flat digital evelvation model (DEM) construction by means of TanDEM-X' also publish the publication 'Citation patterns between impact-factor and questionable journals'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/igarss/LeeRLK16> dblp:authoredBy ?x . <https://dblp.org/rec/journals/scientometrics/KulczyckiHTK21> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/scientometrics/KulczyckiHTK21> != <https://dblp.org/rec/conf/igarss/LeeRLK16> ) }","paraphrases":["Did the authors of the paper 'Tidal flat digital evelvation model (DEM) construction by means of TanDEM-X' also publish the paper 'Citation patterns between impact-factor and questionable journals'?"],"info":{}}
{"id":"train_4645","question":"Was 'Generalized Hultman Numbers and the Distribution of Multi-break Distances' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/alcob/AlexeevPA15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Generalized Hultman Numbers and the Distribution of Multi-break Distances' published in the year 2015?"],"info":{}}
{"id":"train_4647","question":"Was the publication 'Controllability and Invariance Properties of Time-Periodic Systems' published in 2005?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijbc/Gayer05> dblp:yearOfPublication '2005' }","paraphrases":["Was the paper 'Controllability and Invariance Properties of Time-Periodic Systems' published in the year 2005?"],"info":{}}
{"id":"train_4648","question":"Was 'Expected Usability and Product Preference' published in 1997?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ACMdis/Keinonen97> dblp:yearOfPublication '1997' }","paraphrases":["Was the paper 'Expected Usability and Product Preference' published in the year 1997?"],"info":{}}
{"id":"train_4650","question":"Did the authors of 'Deterministic LQ preview tracking design' also publish a paper in ACC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tac/MoscaC95> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tac/MoscaC95> ) . ?y dblp:publishedIn 'ACC' }","paraphrases":["Did the authors of 'Deterministic LQ preview tracking design' also publish a paper in the venue Applied Computing Conference?"],"info":{}}
{"id":"train_4651","question":"Did the authors of 'Object tracking by features and particles selection in multiple subspace' also publish a paper in Multim. Tools Appl.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijcat/TianLMZ17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijcat/TianLMZ17> ) . ?y dblp:publishedIn 'Multim. Tools Appl.' }","paraphrases":["Did the authors of 'Object tracking by features and particles selection in multiple subspace' also publish a paper in the venue Multim. Tools Appl.?"],"info":{}}
{"id":"train_4653","question":"Was the paper 'Non-negative matrix factorisation for blind source separation in wavelet transform domain' published in the year 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iet-spr/HattayBN15> dblp:yearOfPublication '2015' }","paraphrases":["Was 'Non-negative matrix factorisation for blind source separation in wavelet transform domain' published in 2015?"],"info":{}}
{"id":"train_4658","question":"Did the authors of the publication 'Security Architecture Framework for Enterprises' also publish a publication in IROS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iceis/GrahamFSY20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iceis/GrahamFSY20> ) . ?y dblp:publishedIn 'IROS' }","paraphrases":["Did the authors of 'Security Architecture Framework for Enterprises' also publish a paper in IROS?"],"info":{}}
{"id":"train_4660","question":"Was the publication 'Excel 2013 Spreadsheet Inquire' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/OBeirne14> dblp:yearOfPublication '2014' }","paraphrases":["Was 'Excel 2013 Spreadsheet Inquire' published in 2014?"],"info":{}}
{"id":"train_4661","question":"Was the publication 'Multiprocessing scalable string matching algorithm for network intrusion detection system' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijhpsa/HnaifAAAN18> dblp:yearOfPublication '2018' }","paraphrases":["Was 'Multiprocessing scalable string matching algorithm for network intrusion detection system' published in 2018?"],"info":{}}
{"id":"train_4662","question":"Did the authors of 'The hierarchical traveling salesman problem' also publish a paper in the venue UCAmI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ol/PanchamgamXGDW13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ol/PanchamgamXGDW13> ) . ?y dblp:publishedIn 'UCAmI' }","paraphrases":["Did the authors of the publication 'The hierarchical traveling salesman problem' publish other papers in UCAmI?"],"info":{}}
{"id":"train_4663","question":"Did the authors of 'An Open Repository Model for Acquiring Knowledge About Scientific Experiments' also publish 'Ultrasonic-Based Localization of Cow Teats for Robotized Milking'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ekaw/OConnorREWGM16> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cas/SorrentiCV08> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cas/SorrentiCV08> != <https://dblp.org/rec/conf/ekaw/OConnorREWGM16> ) }","paraphrases":["Did the authors of the publication 'An Open Repository Model for Acquiring Knowledge About Scientific Experiments' also publish the publication 'Ultrasonic-Based Localization of Cow Teats for Robotized Milking'?"],"info":{}}
{"id":"train_4665","question":"Did the authors of the publication 'Linking energy system and macroeconomic growth models' also publish a publication in ISITA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cms/BauerEK08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cms/BauerEK08> ) . ?y dblp:publishedIn 'ISITA' }","paraphrases":["Did the authors of 'Linking energy system and macroeconomic growth models' also publish a paper in ISITA?"],"info":{}}
{"id":"train_4666","question":"Did the authors of the publication 'Adaptive Real-Time Removal of Impulse Noise in Medical Images' also publish the paper 'Constraint-based livespaces configuration management'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1709-02270> dblp:authoredBy ?x . <https://dblp.org/rec/conf/iui/StumptnerT06> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/iui/StumptnerT06> != <https://dblp.org/rec/journals/corr/abs-1709-02270> ) }","paraphrases":["Did the authors of the publication 'Adaptive Real-Time Removal of Impulse Noise in Medical Images' also publish 'Constraint-based livespaces configuration management'?"],"info":{}}
{"id":"train_4669","question":"Did the authors of 'Human-controlled iterative subclustering analysis' also publish a paper in Inf. Softw. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bigdataconf/KaipainenPA17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/bigdataconf/KaipainenPA17> ) . ?y dblp:publishedIn 'Inf. Softw. Technol.' }","paraphrases":["Did the authors of the publication 'Human-controlled iterative subclustering analysis' also publish a publication in Inf. Softw. Technol.?"],"info":{}}
{"id":"train_4670","question":"Did the authors of the publication 'Analytical and Simulation Results for the Stochastic Spatial Fitzhugh-Nagumo Model Neuron' also publish a publication in Intelligent Environments?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/neco/Tuckwell08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/neco/Tuckwell08> ) . ?y dblp:publishedIn 'Intelligent Environments' }","paraphrases":["Did the authors of the publication 'Analytical and Simulation Results for the Stochastic Spatial Fitzhugh-Nagumo Model Neuron' publish other papers in Intelligent Environments?"],"info":{}}
{"id":"train_4671","question":"Did the authors of 'FPGA Implementation of Viscous Function in a Package for Computational Fluid Dynamics' also publish the publication 'A Structural Adapting Self-organizing Maps Neural Network'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ic-nc/MishraHKFOA14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/isnn/XuZZ07> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/isnn/XuZZ07> != <https://dblp.org/rec/conf/ic-nc/MishraHKFOA14> ) }","paraphrases":["Did the authors of 'FPGA Implementation of Viscous Function in a Package for Computational Fluid Dynamics' also publish 'A Structural Adapting Self-organizing Maps Neural Network'?"],"info":{}}
{"id":"train_4672","question":"Was 'csTuner: Scalable Auto-tuning Framework for Complex Stencil Computation on GPUs' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cluster/SunLYJLDLQ21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'csTuner: Scalable Auto-tuning Framework for Complex Stencil Computation on GPUs' published in the year 2021?"],"info":{}}
{"id":"train_4673","question":"Was the publication 'Transmission Capacity Allocation in Zonal Electricity Markets' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ior/AravenaLPS21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Transmission Capacity Allocation in Zonal Electricity Markets' published in 2021?"],"info":{}}
{"id":"train_4675","question":"Do the authors of 'Theoretical, Qualitative, and Quantitative Analyses of Small-Document Approaches to Resource Selection' have University of Lugano as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tois/MarkovC14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Lugano, Switzerland' }","paraphrases":["Is University of Lugano, Switzerland the primary affiliation of the authors of 'Theoretical, Qualitative, and Quantitative Analyses of Small-Document Approaches to Resource Selection'?"],"info":{}}
{"id":"train_4676","question":"Did the authors of the paper 'Remote job entry and output through APL' also publish the paper 'Possibility and necessity integrals'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apl/Gujar75> dblp:authoredBy ?x . <https://dblp.org/rec/journals/fss/CoomanK96> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/fss/CoomanK96> != <https://dblp.org/rec/conf/apl/Gujar75> ) }","paraphrases":["Did the authors of the paper 'Remote job entry and output through APL' also publish the publication 'Possibility and necessity integrals'?"],"info":{}}
{"id":"train_4678","question":"Did the authors of the paper 'A Novel Approach to Visualize a Complete Spectrum of Alpha Diversity: Richness, Evenness and Abundance' also publish a publication in APSIPA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/worldcist/Amaya-TejeraSZ22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/worldcist/Amaya-TejeraSZ22> ) . ?y dblp:publishedIn 'APSIPA' }","paraphrases":["Did the authors of the publication 'A Novel Approach to Visualize a Complete Spectrum of Alpha Diversity: Richness, Evenness and Abundance' publish other papers in APSIPA?"],"info":{}}
{"id":"train_4679","question":"Did the authors of 'A Memetic Algorithm for Global Optimization in Chemical Process Synthesis Problems' also publish a paper in Int. J. Appl. Earth Obs. Geoinformation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tec/UrselmannBSE11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tec/UrselmannBSE11> ) . ?y dblp:publishedIn 'Int. J. Appl. Earth Obs. Geoinformation' }","paraphrases":["Did the authors of the publication 'A Memetic Algorithm for Global Optimization in Chemical Process Synthesis Problems' publish other papers in Int. J. Appl. Earth Obs. Geoinformation?"],"info":{}}
{"id":"train_4680","question":"Do the authors of 'Towards a secure ITS: Overview, challenges and solutions' have University of Franche-Comt\\u00E9 as their primary affiliation?","sparql":"ASK { <https://dblp.org/rec/journals/istr/SleemNC20> <https://dblp.org/rdf/schema#authoredBy> ?x . ?x <https://dblp.org/rdf/schema#primaryAffiliation> 'University of Franche-Comt\\u00E9, Institut FEMTO-ST, France' }","paraphrases":["Is University of Franche-Comt\\u00E9 the primary affiliation of the authors of 'Towards a secure ITS: Overview, challenges and solutions'?"],"info":{}}
{"id":"train_4682","question":"Was 'Linear vs Non-Linear Mapping in a Body Machine Interface Based on Electromyographic Signals' published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/biorob/PierellaSFCM18> dblp:yearOfPublication '2018' }","paraphrases":["Was the publication 'Linear vs Non-Linear Mapping in a Body Machine Interface Based on Electromyographic Signals' published in the year 2018?"],"info":{}}
