{"id":"train_3899","question":"Find the years in which the authors of 'The FlowVizMenu and Parallel Scatterplot Matrix: Hybrid Multidimensional Visualizations for Network Exploration' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvcg/ViauMCJ10> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tvcg/ViauMCJ10> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'The FlowVizMenu and Parallel Scatterplot Matrix: Hybrid Multidimensional Visualizations for Network Exploration' publishing?"],"info":{}}
{"id":"train_3900","question":"List the venues of the other papers published by the authors of 'Exploring Local Cultural Perspectives in User Interface Development in an Indian Offshoring Context: A View from the UK'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hcse/RessinOALP12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/hcse/RessinOALP12> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'Exploring Local Cultural Perspectives in User Interface Development in an Indian Offshoring Context: A View from the UK'?"],"info":{}}
{"id":"train_3902","question":"Where was the paper 'Impact of Self-Organization in P2P Overlays on Underlay Utilization' authored by Abboud, Osama published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iciw/PussepOAKS09> dblp:authoredBy <https://dblp.org/pid/51/7361> . <https://dblp.org/rec/conf/iciw/PussepOAKS09> dblp:publishedIn ?answer }","paraphrases":["Osama Abboud published the paper 'Impact of Self-Organization in P2P Overlays on Underlay Utilization' in which venue?"],"info":{}}
{"id":"train_3903","question":"In which other years were the authors of 'An Extended Robust H$_infty$Filter for Nonlinear Constrained Uncertain Systems' publishing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tsp/SeoYPL06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tsp/SeoYPL06> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'An Extended Robust H$_infty$Filter for Nonlinear Constrained Uncertain Systems' published in which other years?"],"info":{}}
{"id":"train_3905","question":"List the other publications published by the authors of 'A combined Mamdani-Sugeno fuzzy approach for localization in wireless sensor networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icwet/KumarKS11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/icwet/KumarKS11> ) }","paraphrases":["Which other publications were published by the authors of 'A combined Mamdani-Sugeno fuzzy approach for localization in wireless sensor networks'?"],"info":{}}
{"id":"train_3906","question":"Find the venue of the paper 'Linear regression without correspondence' authored by Kevin Shi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/HsuSS17> dblp:authoredBy <https://dblp.org/pid/200/7948> . <https://dblp.org/rec/journals/corr/HsuSS17> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'Linear regression without correspondence' authored by K. Shi."],"info":{}}
{"id":"train_3908","question":"Where was the paper 'Synchronization of Boolean Networks with Different Update Schemes' authored by Xingyuan Wang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcbb/ZhangWL14> dblp:authoredBy <https://dblp.org/pid/31/117> . <https://dblp.org/rec/journals/tcbb/ZhangWL14> dblp:publishedIn ?answer }","paraphrases":["Xingyuan W. published the paper 'Synchronization of Boolean Networks with Different Update Schemes' in which venue?"],"info":{}}
{"id":"train_3911","question":"List the venues of the other papers published by the authors of 'Deep Neural Networks for Czech Multi-label Document Classification'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cicling/LencK16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/cicling/LencK16> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Deep Neural Networks for Czech Multi-label Document Classification'?"],"info":{}}
{"id":"train_3912","question":"Mention the venue of the paper 'A Permission based Multilevel Parallel Solution for Distributed Mutual Exclusion' authored by Rahman, M. Ashiqur.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcp/RahmanA12> dblp:authoredBy <https://dblp.org/pid/18/6200> . <https://dblp.org/rec/journals/jcp/RahmanA12> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'A Permission based Multilevel Parallel Solution for Distributed Mutual Exclusion' authored by Rahman, M. Ashiqur published?"],"info":{}}
{"id":"train_3913","question":"Name the other publications published by the authors of 'The effect of classifier agreement on the accuracy of the combined classifier in decision level fusion'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tgrs/PetrakosBK01> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/tgrs/PetrakosBK01> ) }","paraphrases":["Which other papers were written by the authors of 'The effect of classifier agreement on the accuracy of the combined classifier in decision level fusion'?"],"info":{}}
{"id":"train_3914","question":"Mention the venue of the paper 'An integrated knowledge-based approach for modelling biochemical reaction networks' authored by Michael Binns.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cce/BinnsT11> dblp:authoredBy <https://dblp.org/pid/38/10526> . <https://dblp.org/rec/journals/cce/BinnsT11> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'An integrated knowledge-based approach for modelling biochemical reaction networks' authored by Binns, M. published?"],"info":{}}
{"id":"train_3915","question":"Find the years in which the authors of 'The SuMo server: 3D search for protein functional sites' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bioinformatics/JambonACDDG05> dblp:authoredBy ?x . <https://dblp.org/rec/journals/bioinformatics/JambonACDDG05> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'The SuMo server: 3D search for protein functional sites' publishing?"],"info":{}}
{"id":"train_3916","question":"Kaiser, Arnaud published the paper 'Energy-efficient routing in IPv6 home networks' in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icccn/KaiserB14> dblp:authoredBy <https://dblp.org/pid/98/7910> . <https://dblp.org/rec/conf/icccn/KaiserB14> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Energy-efficient routing in IPv6 home networks' authored by Arnaud Kaiser published?"],"info":{}}
{"id":"train_3918","question":"List the venues of the other papers published by the authors of 'Probing Chern number of quasicrystals with disorders in optical lattices'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/qip/LiuH21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/qip/LiuH21> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'Probing Chern number of quasicrystals with disorders in optical lattices'?"],"info":{}}
{"id":"train_3919","question":"List the other publications published by the authors of 'Bee Master: Detecting Host-Based Code Injection Attacks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dimva/BaraboschEG14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/dimva/BaraboschEG14> ) }","paraphrases":["Which other papers were written by the authors of 'Bee Master: Detecting Host-Based Code Injection Attacks'?"],"info":{}}
{"id":"train_3920","question":"List the venues of the other papers published by the authors of 'Entropy-of-likelihood Feature Selection for Image Correspondence'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccv/ToewsA03> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/iccv/ToewsA03> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'Entropy-of-likelihood Feature Selection for Image Correspondence'."],"info":{}}
{"id":"train_3921","question":"Find the venue of the paper 'Developing innovation in online learning' authored by Mishra, Sanjaya.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bjet/Mishra05> dblp:authoredBy <https://dblp.org/pid/73/7523> . <https://dblp.org/rec/journals/bjet/Mishra05> dblp:publishedIn ?answer }","paraphrases":["Mishra, Sanjaya published the paper 'Developing innovation in online learning' in which venue?"],"info":{}}
{"id":"train_3923","question":"Mention the venue of the paper 'Quantum constraint programming' authored by Herbert W..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/agp/PierroW01> dblp:authoredBy <https://dblp.org/pid/40/160> . <https://dblp.org/rec/conf/agp/PierroW01> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Quantum constraint programming' authored by Herbert W.."],"info":{}}
{"id":"train_3924","question":"Find the years in which the authors of 'Entering crossroads with blind corners A safe strategy for autonomous vehicles' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ivs/HoermannKNRD17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ivs/HoermannKNRD17> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Entering crossroads with blind corners A safe strategy for autonomous vehicles' published other papers."],"info":{}}
{"id":"train_3925","question":"Mention the venue of the paper 'Mobile Device Accessibility for the Visually Impaired: Problems Mapping and Empirical Study of Touch Screen Gestures' authored by Jes\\u00FAs P. Mena-Chalco.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ihc/DamacenoBM16> dblp:authoredBy <https://dblp.org/pid/86/8870> . <https://dblp.org/rec/conf/ihc/DamacenoBM16> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Mobile Device Accessibility for the Visually Impaired: Problems Mapping and Empirical Study of Touch Screen Gestures' authored by Jes\\u00FAs P. Mena-Chalco."],"info":{}}
{"id":"train_3926","question":"Mention the venue of the paper 'Inference of Concise DTDs from XML Data' authored by Schwentick, Thomas.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vldb/BexNST06> dblp:authoredBy <https://dblp.org/pid/s/TSchwentick> . <https://dblp.org/rec/conf/vldb/BexNST06> dblp:publishedIn ?answer }","paraphrases":["Schwentick, Thomas published the paper 'Inference of Concise DTDs from XML Data' in which venue?"],"info":{}}
{"id":"train_3928","question":"List the venues of the other papers published by the authors of 'Minimizing Expected Intrusion Detection Time in Adversarial Patrolling'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/atal/Klaska0MR22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/atal/Klaska0MR22> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Minimizing Expected Intrusion Detection Time in Adversarial Patrolling'?"],"info":{}}
{"id":"train_3929","question":"Mention the venues of the other papers published by the authors of 'Adaptive Finite-Time Synchronization Control for Teleoperation System With Varying Time Delays'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/ZhangSS18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/access/ZhangSS18> ) }","paraphrases":["List the venues of the other papers published by the authors of 'Adaptive Finite-Time Synchronization Control for Teleoperation System With Varying Time Delays'."],"info":{}}
{"id":"train_3930","question":"The authors of 'Asymptotic optimality of BestFit for stochastic bin packing' published in which other years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigmetrics/GhaderiZS14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/sigmetrics/GhaderiZS14> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Asymptotic optimality of BestFit for stochastic bin packing' publishing?"],"info":{}}
{"id":"train_3931","question":"List the other publications published by the authors of 'A Useful Taxonomy for Adversarial Robustness of Neural Networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1910-10679> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/corr/abs-1910-10679> ) }","paraphrases":["Which other publications were published by the authors of 'A Useful Taxonomy for Adversarial Robustness of Neural Networks'?"],"info":{}}
{"id":"train_3932","question":"Show the webpages of authors of 'Underlay Hybrid Satellite-Terrestrial Relay Networks under Realistic Hardware and Channel Conditions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vtc/AkhmetkaziyevNA21> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Underlay Hybrid Satellite-Terrestrial Relay Networks under Realistic Hardware and Channel Conditions'?"],"info":{}}
{"id":"train_3933","question":"List the years in which the authors of 'A system for reasoning with imprecise linguistic information' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijar/Schwartz91> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijar/Schwartz91> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'A system for reasoning with imprecise linguistic information' published in which other years?"],"info":{}}
{"id":"train_3934","question":"Mention the venues of the other papers published by the authors of 'Towards rapid interactive machine learning: evaluating tradeoffs of classification without representation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iui/ArendtSWVD19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/iui/ArendtSWVD19> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Towards rapid interactive machine learning: evaluating tradeoffs of classification without representation'?"],"info":{}}
{"id":"train_3936","question":"List the years in which the authors of '\\u4E00\\u79CD\\u57FA\\u4E8E\\u6D3B\\u6027\\u987A\\u5E8F\\u56FE\\u7684\\u8FD0\\u884C\\u65F6\\u9A8C\\u8BC1\\u7814\\u7A76 (Research of Runtime Verification Based on Live Sequence Chart)' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jsjkx/YeZYCC16> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jsjkx/YeZYCC16> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["Find the years in which the authors of '\\u4E00\\u79CD\\u57FA\\u4E8E\\u6D3B\\u6027\\u987A\\u5E8F\\u56FE\\u7684\\u8FD0\\u884C\\u65F6\\u9A8C\\u8BC1\\u7814\\u7A76 (Research of Runtime Verification Based on Live Sequence Chart)' published other papers."],"info":{}}
{"id":"train_3937","question":"Find the years in which the authors of 'Efficient protocols secure against guessing and replay attacks' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icccn/KeungS95> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icccn/KeungS95> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Efficient protocols secure against guessing and replay attacks' published in which other years?"],"info":{}}
{"id":"train_3940","question":"List the venues of the other papers published by the authors of 'Preliminary result of a novel yaw and pitch error estimation method for UAV-based FMCW InSAR'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/igarss/FuXWJW17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/igarss/FuXWJW17> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Preliminary result of a novel yaw and pitch error estimation method for UAV-based FMCW InSAR'?"],"info":{}}
{"id":"train_3941","question":"List the venues of the other papers published by the authors of 'Supporting digital video in a managed wireless network'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cm/Bahl98> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/cm/Bahl98> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Supporting digital video in a managed wireless network'?"],"info":{}}
{"id":"train_3943","question":"List the years in which the authors of 'Represented and Representing Dimensions in Relational Information Displays' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iv/ParkC04> dblp:authoredBy ?x . <https://dblp.org/rec/conf/iv/ParkC04> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["Find the years in which the authors of 'Represented and Representing Dimensions in Relational Information Displays' published other papers."],"info":{}}
{"id":"train_3944","question":"List the venues of the other papers published by the authors of 'A New De-noising Method for Infrared Spectrum'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icic/GaoZLS12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/icic/GaoZLS12> ) }","paraphrases":["In which venues were the other papers published by the authors of 'A New De-noising Method for Infrared Spectrum'?"],"info":{}}
{"id":"train_3946","question":"Mention the venue of the paper 'Elastic Scheduling of Parallel Real-Time Tasks with Discrete Utilizations' authored by J. Orr.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/rtns/OrrUGBADPBWA20> dblp:authoredBy <https://dblp.org/pid/152/2974> . <https://dblp.org/rec/conf/rtns/OrrUGBADPBWA20> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Elastic Scheduling of Parallel Real-Time Tasks with Discrete Utilizations' authored by J. Orr published?"],"info":{}}
{"id":"train_3950","question":"Show the webpages of authors of 'Variational Approaches for Auto-Encoding Generative Adversarial Networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/RoscaLWM17> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Variational Approaches for Auto-Encoding Generative Adversarial Networks' have which webpages?"],"info":{}}
{"id":"train_3952","question":"Mention the venues of the other papers published by the authors of 'Funktionsverteilung in einem Arbeitsplatzrechner'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pcomp/Bittmann81> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/pcomp/Bittmann81> ) }","paraphrases":["List the venues of the other papers published by the authors of 'Funktionsverteilung in einem Arbeitsplatzrechner'."],"info":{}}
{"id":"train_3953","question":"Show the webpages of authors of 'VLSI architectures for video compression-a survey'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pieee/PirschDG95> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'VLSI architectures for video compression-a survey' have which webpages?"],"info":{}}
{"id":"train_3955","question":"Mention the venue of the paper 'Normalised Diffusion Cosine Similarity and Its Use for Image Segmentation' authored by Jan Gaura.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icpram/GauraS15> dblp:authoredBy <https://dblp.org/pid/21/4409> . <https://dblp.org/rec/conf/icpram/GauraS15> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Normalised Diffusion Cosine Similarity and Its Use for Image Segmentation' authored by Jan G. published?"],"info":{}}
{"id":"train_3957","question":"Show the webpages of authors of 'Adaptive Inference for Face Recognition leveraging Deep Metric Learning-enabled Early Exits'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eusipco/PassalisT21> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Adaptive Inference for Face Recognition leveraging Deep Metric Learning-enabled Early Exits' have which webpages?"],"info":{}}
{"id":"train_3959","question":"List the years in which the authors of 'A realistic approach to evolutionary multiobjective portfolio optimization' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cec/ChiamML07> dblp:authoredBy ?x . <https://dblp.org/rec/conf/cec/ChiamML07> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'A realistic approach to evolutionary multiobjective portfolio optimization' publishing?"],"info":{}}
{"id":"train_3962","question":"Mention the venue of the paper 'Throughput and energy efficiency under queueing and secrecy constraints' authored by Mustafa Cenk Gursoy.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/acssc/OzmenG12> dblp:authoredBy <https://dblp.org/pid/54/5244> . <https://dblp.org/rec/conf/acssc/OzmenG12> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Throughput and energy efficiency under queueing and secrecy constraints' authored by Mustafa Cenk Gursoy published?"],"info":{}}
{"id":"train_3963","question":"Show the webpages of authors of 'Object recognition in compressed imagery'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ivc/SealesYHC98> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Object recognition in compressed imagery'?"],"info":{}}
{"id":"train_3965","question":"List the other publications published by the authors of 'High-Order Bound-Preserving Discontinuous Galerkin Methods for Stiff Multispecies Detonation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/siamsc/DuWQY19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/siamsc/DuWQY19> ) }","paraphrases":["Which other papers were written by the authors of 'High-Order Bound-Preserving Discontinuous Galerkin Methods for Stiff Multispecies Detonation'?"],"info":{}}
{"id":"train_3966","question":"Show the webpages of authors of 'Sensor Planning for 3D Object Search, '.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cviu/YeT99> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Sensor Planning for 3D Object Search, '?"],"info":{}}
{"id":"train_3967","question":"Find the venue of the paper 'A Framework for Measuring Security as a System Property in Cyberphysical Systems' authored by B. D. Czejdo.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/information/ZalewskiBCDKS16> dblp:authoredBy <https://dblp.org/pid/30/3110> . <https://dblp.org/rec/journals/information/ZalewskiBCDKS16> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'A Framework for Measuring Security as a System Property in Cyberphysical Systems' authored by B. D. Czejdo published?"],"info":{}}
{"id":"train_3968","question":"List the other publications published by the authors of 'High efficient link schedule with spatial reuse in IEEE 80216 relay enabled networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icnc/WangPAL16> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/icnc/WangPAL16> ) }","paraphrases":["Name the other publications published by the authors of 'High efficient link schedule with spatial reuse in IEEE 80216 relay enabled networks'."],"info":{}}
{"id":"train_3969","question":"Find the years in which the authors of 'Mobile Ontology-based Reasoning and Feedback (MORF) Health Monitoring System' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icdim/DocksteaderB08> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icdim/DocksteaderB08> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Mobile Ontology-based Reasoning and Feedback (MORF) Health Monitoring System' publishing?"],"info":{}}
{"id":"train_3970","question":"Find the venue of the paper 'Assesment of Online Bank GUI based on User Experience Evaluation - A Case Study' authored by Kamil Kolodziejczyk.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/data/Plechawska-WojcikK14> dblp:authoredBy <https://dblp.org/pid/151/7017> . <https://dblp.org/rec/conf/data/Plechawska-WojcikK14> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'Assesment of Online Bank GUI based on User Experience Evaluation - A Case Study' authored by Kolodziejczyk, Kamil."],"info":{}}
{"id":"train_3971","question":"Mention the venues of the other papers published by the authors of 'Hard real-time embedded operating systems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mam/Cooling94a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/mam/Cooling94a> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Hard real-time embedded operating systems'?"],"info":{}}
{"id":"train_3978","question":"Mention the venue of the paper 'Characterizing the Impact of Intermittent Hardware Faults on Programs' authored by Pattabiraman, Karthik.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tr/RashidPG15> dblp:authoredBy <https://dblp.org/pid/91/5344> . <https://dblp.org/rec/journals/tr/RashidPG15> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Characterizing the Impact of Intermittent Hardware Faults on Programs' authored by Pattabiraman, Karthik published?"],"info":{}}
{"id":"train_3979","question":"Mention the venues of the other papers published by the authors of 'Cardinal: an R package for statistical analysis of mass spectrometry-based imaging experiments'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bioinformatics/BemisHEFVMSV15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/bioinformatics/BemisHEFVMSV15> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Cardinal: an R package for statistical analysis of mass spectrometry-based imaging experiments'?"],"info":{}}
{"id":"train_3980","question":"Find the years in which the authors of 'A Single Proof of Classical Behaviour in da Costa's Cn Systems' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/entcs/OsorioC15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/entcs/OsorioC15> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'A Single Proof of Classical Behaviour in da Costa's Cn Systems' publishing?"],"info":{}}
{"id":"train_3981","question":"List the other publications published by the authors of 'A hierarchical image matting model for blood vessel segmentation in retinal images'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/saem/SwathiSSBBV22> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/saem/SwathiSSBBV22> ) }","paraphrases":["Name the other publications published by the authors of 'A hierarchical image matting model for blood vessel segmentation in retinal images'."],"info":{}}
