{"id":"train_6239","question":"In J. Cogn. Neurosci. in 2018, what are the titles of the papers on Component event?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jocn/TurkEDHNFFZB18> dblp:publishedIn 'J. Cogn. Neurosci.' . <https://dblp.org/rec/journals/jocn/TurkEDHNFFZB18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/jocn/TurkEDHNFFZB18> dblp:title ?answer }","paraphrases":["In the year 2018 in J. Cogn. Neurosci., what are the titles of the research papers on Component event?"],"info":{}}
{"id":"train_6240","question":"In Int. J. Mach. Learn. Cybern. in 2022, who are the authors that published papers about Scale selection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mlc/ZhengWBT22> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/mlc/ZhengWBT22> dblp:publishedIn 'Int. J. Mach. Learn. Cybern.' . <https://dblp.org/rec/journals/mlc/ZhengWBT22> dblp:yearOfPublication '2022' }","paraphrases":["In the year 2022 in Int. J. Mach. Learn. Cybern., who are the authors that published research papers about Scale selection?"],"info":{}}
{"id":"train_6241","question":"What are the titles of the papers on Resonator antenna that were published in IEEE Access in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/ZhaoLCFC21> dblp:publishedIn 'IEEE Access' . <https://dblp.org/rec/journals/access/ZhaoLCFC21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/access/ZhaoLCFC21> dblp:title ?answer }","paraphrases":["In 2021 in IEEE Access, what are the titles of the papers on Resonator antenna?"],"info":{}}
{"id":"train_6242","question":"What are the titles of the papers on Marker genes that were published in BMC Bioinform. in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bmcbi/GhodsiLP11> dblp:publishedIn 'BMC Bioinform.' . <https://dblp.org/rec/journals/bmcbi/GhodsiLP11> dblp:yearOfPublication '2011' . <https://dblp.org/rec/journals/bmcbi/GhodsiLP11> dblp:title ?answer }","paraphrases":["In 2011 in BMC Bioinform., what are the titles of the papers on Marker genes?"],"info":{}}
{"id":"train_6243","question":"In 1989 in International Computer Software and Applications Conference, who are the authors that published papers about Quality assurance?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/compsac/HondaMK89> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/compsac/HondaMK89> dblp:publishedIn 'COMPSAC' . <https://dblp.org/rec/conf/compsac/HondaMK89> dblp:yearOfPublication '1989' }","paraphrases":["Who are the authors that published papers about Quality assurance in International Computer Software and Applications Conference in 1989?"],"info":{}}
{"id":"train_6244","question":"In the year 2000 in NIPS, who are the authors that published research papers about Arrival estimation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/nips/RoscaRJR99> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/nips/RoscaRJR99> dblp:publishedIn 'NIPS' . <https://dblp.org/rec/conf/nips/RoscaRJR99> dblp:yearOfPublication '2000' }","paraphrases":["Who are the authors that published papers about Arrival estimation in NIPS in 2000?"],"info":{}}
{"id":"train_6245","question":"In 2011 in Lang. Linguistics Compass, who are the authors that published papers about Language processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/llc/MorfordH11> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/llc/MorfordH11> dblp:publishedIn 'Lang. Linguistics Compass' . <https://dblp.org/rec/journals/llc/MorfordH11> dblp:yearOfPublication '2011' }","paraphrases":["Who are the authors that published papers about Language processing in Lang. Linguistics Compass in 2011?"],"info":{}}
{"id":"train_6246","question":"When was the research paper on Design technique by Imperial College London, UK published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icassp/AhmadiCK76> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Imperial College London, UK' . <https://dblp.org/rec/conf/icassp/AhmadiCK76> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Design technique by Imperial College London published?"],"info":{}}
{"id":"train_6247","question":"In CoRR in 2015, what are the titles of the papers on Cake cutting protocol?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/AzizM15> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/AzizM15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/journals/corr/AzizM15> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Cake cutting protocol that were published in CoRR in 2015?"],"info":{}}
{"id":"train_6248","question":"In CoRR in 2022, what are the titles of the papers on Time video?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2205-12634> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2205-12634> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2205-12634> dblp:title ?answer }","paraphrases":["In 2022 in CoRR, what are the titles of the papers on Time video?"],"info":{}}
{"id":"train_6250","question":"In the year 2014 in CoRR, who are the authors that published research papers about Risk assessment algorithm?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/MomaniTA14> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/MomaniTA14> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/MomaniTA14> dblp:yearOfPublication '2014' }","paraphrases":["Who are the authors that published papers about Risk assessment algorithm in CoRR in 2014?"],"info":{}}
{"id":"train_6251","question":"Who are the authors that published papers about Definition generation in CoRR in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2203-12926> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-2203-12926> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2203-12926> dblp:yearOfPublication '2022' }","paraphrases":["In CoRR in 2022, who are the authors that published papers about Definition generation?"],"info":{}}
{"id":"train_6252","question":"In the year 2021 in IEEE International Performance Computing and Communications Conference, who are the authors that published research papers about Incentive mechanism?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ipccc/GuoWLS21> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ipccc/GuoWLS21> dblp:publishedIn 'IPCCC' . <https://dblp.org/rec/conf/ipccc/GuoWLS21> dblp:yearOfPublication '2021' }","paraphrases":["Who are the authors that published papers about Incentive mechanism in IEEE International Performance Computing and Communications Conference in 2021?"],"info":{}}
{"id":"train_6253","question":"In 1994 in Random Struct. Algorithms, who are the authors that published papers about Steiner trees?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/rsa/DeneenST94> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/rsa/DeneenST94> dblp:publishedIn 'Random Struct. Algorithms' . <https://dblp.org/rec/journals/rsa/DeneenST94> dblp:yearOfPublication '1994' }","paraphrases":["In Random Struct. Algorithms in 1994, who are the authors that published papers about Steiner trees?"],"info":{}}
{"id":"train_6254","question":"Who are the authors that published papers about Suite generation in GECCO in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gecco/ShamshiriRFM15> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/gecco/ShamshiriRFM15> dblp:publishedIn 'GECCO' . <https://dblp.org/rec/conf/gecco/ShamshiriRFM15> dblp:yearOfPublication '2015' }","paraphrases":["In the year 2015 in Genetic and Evolutionary Computations, who are the authors that published research papers about Suite generation?"],"info":{}}
{"id":"train_6255","question":"In Inf. Syst. Frontiers in 2016, what are the titles of the papers on Supply chain?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/isf/TanWC16> dblp:publishedIn 'Inf. Syst. Frontiers' . <https://dblp.org/rec/journals/isf/TanWC16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/journals/isf/TanWC16> dblp:title ?answer }","paraphrases":["In the year 2016 in Inf. Syst. Frontiers, what are the titles of the research papers on Supply chain?"],"info":{}}
{"id":"train_6256","question":"Who are the authors that published papers about Learning features in CoRR in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1912-00283> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-1912-00283> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-1912-00283> dblp:yearOfPublication '2019' }","paraphrases":["In CoRR in 2019, who are the authors that published papers about Learning features?"],"info":{}}
{"id":"train_6257","question":"In Comput. Commun. Rev. in 2000, what are the titles of the papers on Traffic engineering?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ccr/LagoaC00> dblp:publishedIn 'Comput. Commun. Rev.' . <https://dblp.org/rec/journals/ccr/LagoaC00> dblp:yearOfPublication '2000' . <https://dblp.org/rec/journals/ccr/LagoaC00> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Traffic engineering that were published in Comput. Commun. Rev. in 2000?"],"info":{}}
{"id":"train_6258","question":"In CDC in 2021, who are the authors that published papers about Play networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cdc/StudliYSM21> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/cdc/StudliYSM21> dblp:publishedIn 'CDC' . <https://dblp.org/rec/conf/cdc/StudliYSM21> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in CDC, who are the authors that published papers about Play networks?"],"info":{}}
{"id":"train_6259","question":"Who are the authors that published papers about Sensor networks in Softw. Pract. Exp. in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spe/MooreTPC14> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/spe/MooreTPC14> dblp:publishedIn 'Softw. Pract. Exp.' . <https://dblp.org/rec/journals/spe/MooreTPC14> dblp:yearOfPublication '2014' }","paraphrases":["In the year 2014 in Softw. Pract. Exp., who are the authors that published research papers about Sensor networks?"],"info":{}}
{"id":"train_6260","question":"In TSD in 2013, who are the authors that published papers about Language model?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/tsd/ChaloupkaNCM13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/tsd/ChaloupkaNCM13> dblp:publishedIn 'TSD' . <https://dblp.org/rec/conf/tsd/ChaloupkaNCM13> dblp:yearOfPublication '2013' }","paraphrases":["Who are the authors that published papers about Language model in TSD in 2013?"],"info":{}}
{"id":"train_6261","question":"Tsinghua University published a paper on Assembly line in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/candie/SunWP20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Tsinghua University, Department of Automation, TNList, Beijing, China' . <https://dblp.org/rec/journals/candie/SunWP20> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Assembly line by Tsinghua University, Department of Automation, TNList, Beijing, China published?"],"info":{}}
{"id":"train_6262","question":"In 1979 in Notre Dame J. Formal Log., what are the titles of the papers on Meyer semantics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ndjfl/Dunn79> dblp:publishedIn 'Notre Dame J. Formal Log.' . <https://dblp.org/rec/journals/ndjfl/Dunn79> dblp:yearOfPublication '1979' . <https://dblp.org/rec/journals/ndjfl/Dunn79> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Meyer semantics that were published in Notre Dame J. Formal Log. in 1979?"],"info":{}}
{"id":"train_6263","question":"In Autom. in 2011, what are the titles of the papers on Feedback stabilization?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/automatica/ZevinP11> dblp:publishedIn 'Autom.' . <https://dblp.org/rec/journals/automatica/ZevinP11> dblp:yearOfPublication '2011' . <https://dblp.org/rec/journals/automatica/ZevinP11> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Feedback stabilization that were published in Autom. in 2011?"],"info":{}}
{"id":"train_6264","question":"In GECCO Companion in 2022, who are the authors that published papers about Portfolio construction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gecco/MunozSK22> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/gecco/MunozSK22> dblp:publishedIn 'GECCO Companion' . <https://dblp.org/rec/conf/gecco/MunozSK22> dblp:yearOfPublication '2022' }","paraphrases":["Who are the authors that published papers about Portfolio construction in GECCO Companion in 2022?"],"info":{}}
{"id":"train_6265","question":"What are the titles of the papers on Animal bias that were published in CoRR in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2203-05140> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2203-05140> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2203-05140> dblp:title ?answer }","paraphrases":["In the year 2022 in CoRR, what are the titles of the research papers on Animal bias?"],"info":{}}
{"id":"train_6266","question":"In 2021 in SECRYPT, what are the titles of the papers on Set intersection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/secrypt/Andreea21> dblp:publishedIn 'SECRYPT' . <https://dblp.org/rec/conf/secrypt/Andreea21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/conf/secrypt/Andreea21> dblp:title ?answer }","paraphrases":["In the year 2021 in International Conference on Information Security and Cryptography, what are the titles of the research papers on Set intersection?"],"info":{}}
{"id":"train_6267","question":"What are the titles of the papers on Data selection that were published in CVPR in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cvpr/JoneidiVEWRLS20> dblp:publishedIn 'CVPR' . <https://dblp.org/rec/conf/cvpr/JoneidiVEWRLS20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/conf/cvpr/JoneidiVEWRLS20> dblp:title ?answer }","paraphrases":["In the year 2020 in IEEE Conference on Computer Vision and Pattern Recognition, what are the titles of the research papers on Data selection?"],"info":{}}
{"id":"train_6268","question":"When was the research paper on Mode decomposition by Nagoya University, Japan published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/visapp/HaqFK20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Nagoya University, Japan' . <https://dblp.org/rec/conf/visapp/HaqFK20> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Mode decomposition by Nagoya University published?"],"info":{}}
{"id":"train_6269","question":"In 2020 in ECCV (1), who are the authors that published papers about Feature sampling?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eccv/XieZZHL20> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/eccv/XieZZHL20> dblp:publishedIn 'ECCV (1)' . <https://dblp.org/rec/conf/eccv/XieZZHL20> dblp:yearOfPublication '2020' }","paraphrases":["In ECCV (1) in 2020, who are the authors that published papers about Feature sampling?"],"info":{}}
{"id":"train_6270","question":"In the year 2014 in OTM Workshops, what are the titles of the research papers on Homecare self?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/otm/TaweelBM14> dblp:publishedIn 'OTM Workshops' . <https://dblp.org/rec/conf/otm/TaweelBM14> dblp:yearOfPublication '2014' . <https://dblp.org/rec/conf/otm/TaweelBM14> dblp:title ?answer }","paraphrases":["In 2014 in OTM Workshops, what are the titles of the papers on Homecare self?"],"info":{}}
{"id":"train_6271","question":"In the year 1972 in SWAT, what are the titles of the research papers on Program equivalence?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/focs/Rosen72> dblp:publishedIn 'SWAT' . <https://dblp.org/rec/conf/focs/Rosen72> dblp:yearOfPublication '1972' . <https://dblp.org/rec/conf/focs/Rosen72> dblp:title ?answer }","paraphrases":["In SWAT in 1972, what are the titles of the papers on Program equivalence?"],"info":{}}
{"id":"train_6272","question":"In CogSci in 2011, who are the authors that published papers about Memory task?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cogsci/KachergisRS11> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/cogsci/KachergisRS11> dblp:publishedIn 'CogSci' . <https://dblp.org/rec/conf/cogsci/KachergisRS11> dblp:yearOfPublication '2011' }","paraphrases":["In the year 2011 in CogSci, who are the authors that published research papers about Memory task?"],"info":{}}
{"id":"train_6273","question":"In 2004 in VRCAI, who are the authors that published papers about Images database?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vrcai/BertiMSBRT04> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/vrcai/BertiMSBRT04> dblp:publishedIn 'VRCAI' . <https://dblp.org/rec/conf/vrcai/BertiMSBRT04> dblp:yearOfPublication '2004' }","paraphrases":["In the year 2004 in VRCAI, who are the authors that published research papers about Images database?"],"info":{}}
{"id":"train_6274","question":"What are the titles of the papers on Signal transition that were published in VLSI Design in 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vlsid/ParkN96> dblp:publishedIn 'VLSI Design' . <https://dblp.org/rec/conf/vlsid/ParkN96> dblp:yearOfPublication '1996' . <https://dblp.org/rec/conf/vlsid/ParkN96> dblp:title ?answer }","paraphrases":["In 1996 in VLSI Design, what are the titles of the papers on Signal transition?"],"info":{}}
{"id":"train_6275","question":"Who are the authors that published papers about Factorization algorithm in FPT in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fpt/MeintanisP07> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/fpt/MeintanisP07> dblp:publishedIn 'FPT' . <https://dblp.org/rec/conf/fpt/MeintanisP07> dblp:yearOfPublication '2007' }","paraphrases":["In 2007 in FPT, who are the authors that published papers about Factorization algorithm?"],"info":{}}
{"id":"train_6276","question":"In the year 2019 in INCoS, what are the titles of the research papers on Space optics communication?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/incos/TsujimuraIY18> dblp:publishedIn 'INCoS' . <https://dblp.org/rec/conf/incos/TsujimuraIY18> dblp:yearOfPublication '2019' . <https://dblp.org/rec/conf/incos/TsujimuraIY18> dblp:title ?answer }","paraphrases":["In 2019 in INCoS, what are the titles of the papers on Space optics communication?"],"info":{}}
{"id":"train_6277","question":"Who are the authors that published papers about Diffserv networks in IEEE International Performance Computing and Communications Conference in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ipccc/AthuraliyaS06> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ipccc/AthuraliyaS06> dblp:publishedIn 'IPCCC' . <https://dblp.org/rec/conf/ipccc/AthuraliyaS06> dblp:yearOfPublication '2006' }","paraphrases":["In IPCCC in 2006, who are the authors that published papers about Diffserv networks?"],"info":{}}
{"id":"train_6279","question":"In 2020 in J. Syst. Sci. Complex., who are the authors that published papers about Observation noises?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jossac/SongH20> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jossac/SongH20> dblp:publishedIn 'J. Syst. Sci. Complex.' . <https://dblp.org/rec/journals/jossac/SongH20> dblp:yearOfPublication '2020' }","paraphrases":["In J. Syst. Sci. Complex. in 2020, who are the authors that published papers about Observation noises?"],"info":{}}
{"id":"train_6280","question":"In 1980 in International Conference on Conceptual Modelling, what are the titles of the papers on Relationship model?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/er/ChanL79> dblp:publishedIn 'ER' . <https://dblp.org/rec/conf/er/ChanL79> dblp:yearOfPublication '1980' . <https://dblp.org/rec/conf/er/ChanL79> dblp:title ?answer }","paraphrases":["In International Conference on Conceptual Modelling in 1980, what are the titles of the papers on Relationship model?"],"info":{}}
{"id":"train_6281","question":"What are the titles of the papers on Hippocampus segmentation that were published in NeuroImage in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/neuroimage/LiuLYWMSX20> dblp:publishedIn 'NeuroImage' . <https://dblp.org/rec/journals/neuroimage/LiuLYWMSX20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/neuroimage/LiuLYWMSX20> dblp:title ?answer }","paraphrases":["In NeuroImage in 2020, what are the titles of the papers on Hippocampus segmentation?"],"info":{}}
{"id":"train_6282","question":"What are the titles of the papers on System monitors that were published in IEEE Access in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/KhanEDM21> dblp:publishedIn 'IEEE Access' . <https://dblp.org/rec/journals/access/KhanEDM21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/access/KhanEDM21> dblp:title ?answer }","paraphrases":["In 2021 in IEEE Access, what are the titles of the papers on System monitors?"],"info":{}}
{"id":"train_6283","question":"What are the titles of the papers on Nursing students that were published in Int. J. Emerg. Technol. Learn. in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijet/QaisarLLBAK20> dblp:publishedIn 'Int. J. Emerg. Technol. Learn.' . <https://dblp.org/rec/journals/ijet/QaisarLLBAK20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/ijet/QaisarLLBAK20> dblp:title ?answer }","paraphrases":["In 2020 in Int. J. Emerg. Technol. Learn., what are the titles of the papers on Nursing students?"],"info":{}}
{"id":"train_6284","question":"In Scalable Comput. Pract. Exp. in 2008, who are the authors that published papers about Data mining?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/scpe/Langin08> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/scpe/Langin08> dblp:publishedIn 'Scalable Comput. Pract. Exp.' . <https://dblp.org/rec/journals/scpe/Langin08> dblp:yearOfPublication '2008' }","paraphrases":["In 2008 in Scalable Comput. Pract. Exp., who are the authors that published papers about Data mining?"],"info":{}}
{"id":"train_6285","question":"In 2021 in AGIT Journal, who are the authors that published papers about Subsurface structures?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/agit/HoferSEHWNF21> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/agit/HoferSEHWNF21> dblp:publishedIn 'AGIT Journal' . <https://dblp.org/rec/journals/agit/HoferSEHWNF21> dblp:yearOfPublication '2021' }","paraphrases":["In the year 2021 in AGIT Journal, who are the authors that published research papers about Subsurface structures?"],"info":{}}
{"id":"train_6286","question":"In the year 2015 in International Conference on Simulation and Modeling Methodologies, Technologies and Applications, what are the titles of the research papers on Learning machines?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/simultech/GedeonO15> dblp:publishedIn 'SIMULTECH' . <https://dblp.org/rec/conf/simultech/GedeonO15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/conf/simultech/GedeonO15> dblp:title ?answer }","paraphrases":["In 2015 in SIMULTECH, what are the titles of the papers on Learning machines?"],"info":{}}
{"id":"train_6287","question":"In INFOCOM in 2006, who are the authors that published papers about Flow throughput?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/infocom/GarettoSK06> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/infocom/GarettoSK06> dblp:publishedIn 'INFOCOM' . <https://dblp.org/rec/conf/infocom/GarettoSK06> dblp:yearOfPublication '2006' }","paraphrases":["In 2006 in INFOCOM, who are the authors that published papers about Flow throughput?"],"info":{}}
{"id":"train_6288","question":"Who are the authors that published papers about Polarization crosstalk effects in Remote. Sens. in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/remotesensing/LuHOBVRKGLTHW21> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/remotesensing/LuHOBVRKGLTHW21> dblp:publishedIn 'Remote. Sens.' . <https://dblp.org/rec/journals/remotesensing/LuHOBVRKGLTHW21> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in Remote. Sens., who are the authors that published papers about Polarization crosstalk effects?"],"info":{}}
{"id":"train_6289","question":"In EMBC in 2013, who are the authors that published papers about Drugs delivery?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/embc/JonckheereDJKCL13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/embc/JonckheereDJKCL13> dblp:publishedIn 'EMBC' . <https://dblp.org/rec/conf/embc/JonckheereDJKCL13> dblp:yearOfPublication '2013' }","paraphrases":["In the year 2013 in EMBC, who are the authors that published research papers about Drugs delivery?"],"info":{}}
{"id":"train_6290","question":"Who are the authors that published papers about Belief propagation in IEEE Trans. Inf. Theory in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tit/OkOSY18> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/tit/OkOSY18> dblp:publishedIn 'IEEE Trans. Inf. Theory' . <https://dblp.org/rec/journals/tit/OkOSY18> dblp:yearOfPublication '2018' }","paraphrases":["In IEEE Trans. Inf. Theory in 2018, who are the authors that published papers about Belief propagation?"],"info":{}}
{"id":"train_6291","question":"In Int. J. Comput. Games Technol. in 2017, what are the titles of the papers on Science education?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcgt/JamonnakC17> dblp:publishedIn 'Int. J. Comput. Games Technol.' . <https://dblp.org/rec/journals/ijcgt/JamonnakC17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/journals/ijcgt/JamonnakC17> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Science education that were published in Int. J. Comput. Games Technol. in 2017?"],"info":{}}
{"id":"train_6292","question":"University of Texas at El Paso, USA published a paper on Cascade vulnerability problem in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/msv/ServinC08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Texas at El Paso, USA' . <https://dblp.org/rec/conf/msv/ServinC08> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Cascade vulnerability problem by University of Texas at El Paso, USA published?"],"info":{}}
{"id":"train_6293","question":"In the year 2019 in Medical Image Anal., what are the titles of the research papers on Learning agents?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mia/AlansaryOLFHVKV19> dblp:publishedIn 'Medical Image Anal.' . <https://dblp.org/rec/journals/mia/AlansaryOLFHVKV19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/journals/mia/AlansaryOLFHVKV19> dblp:title ?answer }","paraphrases":["In 2019 in Medical Image Anal., what are the titles of the papers on Learning agents?"],"info":{}}
{"id":"train_6294","question":"In Robotica in 2015, who are the authors that published papers about Tracking system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/robotica/HernandezVCHR15> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/robotica/HernandezVCHR15> dblp:publishedIn 'Robotica' . <https://dblp.org/rec/journals/robotica/HernandezVCHR15> dblp:yearOfPublication '2015' }","paraphrases":["Who are the authors that published papers about Tracking system in Robotica in 2015?"],"info":{}}
{"id":"train_6295","question":"In SENSORNETS in 2018, who are the authors that published papers about Target recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sensornets/Al-SabhanS18> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/sensornets/Al-SabhanS18> dblp:publishedIn 'SENSORNETS' . <https://dblp.org/rec/conf/sensornets/Al-SabhanS18> dblp:yearOfPublication '2018' }","paraphrases":["In the year 2018 in SENSORNETS, who are the authors that published research papers about Target recognition?"],"info":{}}
