{"id":"train_721","question":"Which publications did S. Rahimi author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/11/9216> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Salim Rahimi publish and in which year?"],"info":{}}
{"id":"train_724","question":"List the titles of the papers that Xiaohua J. published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/j/XiaohuaJia> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Xiaohua Jia published papers and the titles of these papers."],"info":{}}
{"id":"train_725","question":"Who are the co-authors of Tinku A. in the last two years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/04/6171> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/04/6171> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Tinku A. in the last 2 years and where are they affiliated?"],"info":{}}
{"id":"train_726","question":"Which publications did Jaime Kaminski author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/78/8670> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Jaime Kaminski and in which year."],"info":{}}
{"id":"train_727","question":"What are the titles of the papers that F. Colone published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/89/9898> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did F. Colone publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_730","question":"Mention the papers published by Oliver Kohnke and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/09/6611> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Oliver Kohnke author and in which year?"],"info":{}}
{"id":"train_732","question":"List the titles of the papers that Riccardo Scopigno published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/37/7861> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Riccardo Scopigno published and in which venues?"],"info":{}}
{"id":"train_733","question":"List the titles of the papers that Etienne Birmel\\u00E9 published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/5741> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Etienne Birmel\\u00E9 published and in which venues?"],"info":{}}
{"id":"train_736","question":"Mention the papers published by Christos Koukouvinos and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/43/87> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author C. Koukouvinos publish and in which year?"],"info":{}}
{"id":"train_739","question":"Mention the papers published by M. S. Gudaitis and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/99/5752> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did M. S. Gudaitis author and in which year?"],"info":{}}
{"id":"train_741","question":"Name the co-authors of Nasser Alzeidi in the last 4 years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/87/4929> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/87/4929> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Nasser A. in the last four years and where are they affiliated?"],"info":{}}
{"id":"train_743","question":"Mention the papers published by Raofen W. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/117/4504> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Raofen Wang publish and in which year?"],"info":{}}
{"id":"train_745","question":"Mention the papers published by J. A. Jordan Jr. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/53/4800> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Jr., J. A. Jordan publish and in which year?"],"info":{}}
{"id":"train_746","question":"Which publications did Wen Yu author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/75/3061-1> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Yu, Wen publish and in which year?"],"info":{}}
{"id":"train_747","question":"Mention the papers published by Robinson, D. T. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/85/4572> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Robinson, D. T. author and in which year?"],"info":{}}
{"id":"train_748","question":"Which publications did Muneeb Khan author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/122/9974> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Muneeb K. and in which year."],"info":{}}
{"id":"train_749","question":"Mention the papers published by Babu Sena Paul and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/210/9101> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Paul, B. Sena author and in which year?"],"info":{}}
{"id":"train_752","question":"What are the titles of the papers that Georg Rose published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/04/4271> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Georg Rose publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_753","question":"What are the titles of the papers that Fatimah Khalid published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/98/10159> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Khalid, Fatimah publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_754","question":"List the venues in which Jiawei Luo published papers in the last 6 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/52/3974-1> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Jiawei Luo published in the last 6 years and in which venues?"],"info":{}}
{"id":"train_758","question":"What are the titles of the papers that Chadi A. published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/a/ChadiAssi> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Chadi A. publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_761","question":"Who are the co-authors of L. A. Suchman in the last eight years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/20/1916> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/20/1916> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Lucy A. Suchman in the last 8 years and where are they affiliated?"],"info":{}}
{"id":"train_763","question":"Mention the other authors with whom Dekhil, Mohamed has co-authored papers in the last 3 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/87/3477> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/87/3477> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Mohamed Dekhil in the last 3 years and where are they affiliated?"],"info":{}}
{"id":"train_770","question":"In which venues did Wan, X. publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/07/1521> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Xiaojun Wan published and in which venues?"],"info":{}}
{"id":"train_771","question":"Mention the other authors with whom Stephen A. Zahorian has co-authored papers in the last six years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/8762> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/76/8762> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Zahorian, Stephen A. in the last 6 years and where are they affiliated?"],"info":{}}
{"id":"train_772","question":"Who are the co-authors of Zhixiang Chen in the last eight years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/70/3894-1> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/70/3894-1> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Zhixiang C. in the last eight years and where are they affiliated?"],"info":{}}
{"id":"train_773","question":"Mention the papers published by Fengming Hui and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/138/8672> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Fengming Hui publish and in which year?"],"info":{}}
{"id":"train_774","question":"List the venues in which Alexey O. Shigarov published papers in the last two years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/152/4570> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Alexey O. Shigarov published in the last two years and in which venues."],"info":{}}
{"id":"train_778","question":"List the titles of the papers that Mondal, S. published in the last 4 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/177/4760> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Sanjib Mondal published papers in the last four years and the titles of these papers."],"info":{}}
{"id":"train_779","question":"Which publications did Yasuaki I. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/18/5925> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Yasuaki Ito publish and in which year?"],"info":{}}
{"id":"train_780","question":"List the venues in which Henrik Sandberg published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/50/2611> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Henrik Sandberg publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_781","question":"Which papers did author J. Li publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/23/6950> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by J. Li and in which year."],"info":{}}
{"id":"train_782","question":"Which publications did Djamel Benazzouz author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/117/9222> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Djamel B. publish and in which year?"],"info":{}}
{"id":"train_783","question":"List the venues in which F. Chiba published papers in the last 5 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/59/9483> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that F. Chiba published in the last 5 years and in which venues?"],"info":{}}
{"id":"train_784","question":"Mention the papers published by Sarath Guttikunda and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/305/9640> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Sarath Guttikunda publish and in which year?"],"info":{}}
{"id":"train_785","question":"List the titles of the papers that Besser, Karl-Ludwig published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/236/3790> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Besser, Karl-Ludwig published and in which venues?"],"info":{}}
{"id":"train_786","question":"List the venues in which Mohammad Reza Aref published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/91/4838> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Mohammad Reza Aref published and in which venues?"],"info":{}}
{"id":"train_787","question":"List the venues in which Suoping Hu published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/223/1032> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Suoping Hu published and in which venues."],"info":{}}
{"id":"train_788","question":"List the venues in which K. Karlapalem published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/k/KKarlapalem> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Kamalakar Karlapalem published and in which venues."],"info":{}}
{"id":"train_789","question":"Which publications did Mouad Bahi author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/18/7454> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Mouad Bahi publish and in which year?"],"info":{}}
{"id":"train_790","question":"List the venues in which A. Rezaeian published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/162/2728> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did A. Rezaeian publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_794","question":"List the titles of the papers that Marco Monteiro published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/47/2749> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Marco Monteiro publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_796","question":"Mention the other authors with whom Fred B. Schneider has co-authored papers in the last 6 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/s/FredBSchneider> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/s/FredBSchneider> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Schneider, Fred B. in the last six years and where are they affiliated?"],"info":{}}
{"id":"train_797","question":"List the venues in which William L. Kuechler Jr. published papers in the last 5 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/159> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that William L. Kuechler Jr. published in the last 5 years and in which venues."],"info":{}}
{"id":"train_799","question":"Mention the papers published by Katherina Haase and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/183/4420> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Katherina Haase author and in which year?"],"info":{}}
{"id":"train_801","question":"Mention the papers published by Ioannis K. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/79/5692> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Ioannis Krikidis publish and in which year?"],"info":{}}
{"id":"train_802","question":"List the titles of the papers that Esra \\u00C7etin published in the last 2 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/151/2443> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Esra \\u00C7etin published papers in the last two years and the titles of these papers."],"info":{}}
{"id":"train_803","question":"Mention the other authors with whom Naiyan W. has co-authored papers in the last 6 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/31/9922> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/31/9922> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Naiyan W. in the last six years and where are they affiliated?"],"info":{}}
{"id":"train_804","question":"What are the titles of the papers that Jingfa Liu published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/90/7079> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Liu, Jingfa publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_805","question":"Which publications did J. Kim author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/19/615> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Jinwook Kim publish and in which year?"],"info":{}}
{"id":"train_806","question":"List the venues in which Zhuang, B. published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/51/8081> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Zhuang, B. publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_808","question":"Mention the papers published by Meng Lee and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/91/10920> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Meng L. publish and in which year?"],"info":{}}
{"id":"train_811","question":"Mention the other authors with whom Ron Sun has co-authored papers in the last 9 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/s/RSun> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/s/RSun> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Ron Sun in the last 9 years and where are they affiliated?"],"info":{}}
{"id":"train_814","question":"Which publications did Prathima Agrawal author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/65/6018> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Prathima Agrawal and in which year."],"info":{}}
{"id":"train_816","question":"Mention the other authors with whom Giorgio Di Natale has co-authored papers in the last 4 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/71/5847> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/71/5847> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Giorgio Di Natale in the last four years and where are they affiliated?"],"info":{}}
{"id":"train_817","question":"Which papers did author Valentin Montmirail publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/183/0871> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Valentin Montmirail author and in which year?"],"info":{}}
{"id":"train_818","question":"Mention the papers published by Margherita Peruzzini and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/76/8777> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Margherita P. publish and in which year?"],"info":{}}
{"id":"train_819","question":"Mention the papers published by Bonnie Stewart and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/170/2475> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Bonnie Stewart publish and in which year?"],"info":{}}
{"id":"train_821","question":"List the titles of the papers that Derick Wood published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/w/DerickWood> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which D. Wood published papers and the titles of these papers."],"info":{}}
{"id":"train_822","question":"List the titles of the papers that J\\u00F6rg Henseler published in the last 3 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/25/10867> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Henseler, J. published in the last three years and in which venues?"],"info":{}}
{"id":"train_823","question":"Which publications did Seitz, Peter author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/90/6929> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Seitz, Peter publish and in which year?"],"info":{}}
{"id":"train_824","question":"List the venues in which Hai Liu published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/46/2375-4> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Liu, H. publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_825","question":"Which publications did Su\\u00E1rez, Antonio J. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/71/2089> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Antonio J. Su\\u00E1rez publish and in which year?"],"info":{}}
{"id":"train_826","question":"In which venues did Luj\\u00E1n, Mikel publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/32/3102> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Mikel Luj\\u00E1n published and in which venues?"],"info":{}}
{"id":"train_827","question":"Who are the co-authors of Mike W. in the last five years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/99/3> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/99/3> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Mike Wald in the last five years and where are they affiliated?"],"info":{}}
{"id":"train_828","question":"Which publications did Thad Starner author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/s/ThadStarner> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Thad Starner and in which year."],"info":{}}
{"id":"train_829","question":"List the venues in which Kallas, Maya published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/09/10617> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Maya Kallas published and in which venues?"],"info":{}}
