{"id":"train_6711","question":"Between 'Using Domain Knowledge to Systematically Guide Feature Selection' and 'DB-Enabled Peers for Managing Distributed Data', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcai/Groves13> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/apweb/OoiST03> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/ijcai/Groves13> , <https://dblp.org/rec/conf/apweb/OoiST03> ) AS ?answer ) }","paraphrases":["Between 'Using Domain Knowledge to Systematically Guide Feature Selection' and 'DB-Enabled Peers for Managing Distributed Data', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6712","question":"Between 'Weakly Supervised Semantic Segmentation Based on Co-segmentation' and 'Mining Mobile Users' Activities Based on Search Query Text and Context', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/bmvc/ShenLLS017> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/pakdd/PengWS12> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/bmvc/ShenLLS017> , <https://dblp.org/rec/conf/pakdd/PengWS12> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Weakly Supervised Semantic Segmentation Based on Co-segmentation' or 'Mining Mobile Users' Activities Based on Search Query Text and Context'?"],"info":{}}
{"id":"train_6714","question":"Between 'Improvement of Suboptimal Siphon- and FBM-Based Control Model of a Well-Known S3PR' and 'Proposition of a Parallel and Distributed Algorithm for the Dimensionality Reduction with Apache Spark', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tase/Chao11> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/sca2/ZbakhMYBK17> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tase/Chao11> , <https://dblp.org/rec/conf/sca2/ZbakhMYBK17> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Improvement of Suboptimal Siphon- and FBM-Based Control Model of a Well-Known S3PR' or 'Proposition of a Parallel and Distributed Algorithm for the Dimensionality Reduction with Apache Spark'?"],"info":{}}
{"id":"train_6715","question":"Between 'Reducing the local alphabet size in tiling systems by means of 2D comma-free codes' and 'Every outer-1-Plane Graph has a Right Angle Crossing Drawing', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2206-05208> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ijcga/DehkordiE12> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/corr/abs-2206-05208> , <https://dblp.org/rec/journals/ijcga/DehkordiE12> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Reducing the local alphabet size in tiling systems by means of 2D comma-free codes' or 'Every outer-1-Plane Graph has a Right Angle Crossing Drawing'?"],"info":{}}
{"id":"train_6717","question":"Mention the author who has published the most papers among the authors of 'System Design of Perceptual Quality-Regulable H264 Video Encoder'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icmcs/WuFC12> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'System Design of Perceptual Quality-Regulable H264 Video Encoder'?"],"info":{}}
{"id":"train_6718","question":"Where are most of the authors of 'On strategies for building effective ensembles of relative clustering validity criteria' from?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/kais/JaskowiakMFCZS16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'On strategies for building effective ensembles of relative clustering validity criteria'?"],"info":{}}
{"id":"train_6719","question":"Mention the author who has published the most papers among the authors of 'A Fuzzy Approach to the Geography of Industrial Districts'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sac/FacchinettiMP00> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'A Fuzzy Approach to the Geography of Industrial Districts'?"],"info":{}}
{"id":"train_6721","question":"Mention the author who has published the most papers among the authors of 'AC-3 bit stream watermarking'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/wifs/ChenABD12> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'AC-3 bit stream watermarking'?"],"info":{}}
{"id":"train_6723","question":"Mention the author who has published the most papers among the authors of 'Toward Active Boundary Conditions for Variable Friction Touchscreens'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/haptics/LeeKG14> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Toward Active Boundary Conditions for Variable Friction Touchscreens'?"],"info":{}}
{"id":"train_6725","question":"Between 'Comparative study of data preparation methods in quantum clustering algorithms' and 'Sparsity-based MIMO noise radar for multiple target estimation', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/niss/OuedrhiriBRH21> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/ieeesam/GogineniN12> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/niss/OuedrhiriBRH21> , <https://dblp.org/rec/conf/ieeesam/GogineniN12> ) AS ?answer ) }","paraphrases":["Between 'Comparative study of data preparation methods in quantum clustering algorithms' and 'Sparsity-based MIMO noise radar for multiple target estimation', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6727","question":"Which one has more number of authors, 'Activity-based Twitter sampling for content-based and user-centric prediction models' or 'Modelling Non-verbal Sounds for Speech Recognition'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/hcis/AghababaeiM17> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/naacl/Ward89a> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/hcis/AghababaeiM17> , <https://dblp.org/rec/conf/naacl/Ward89a> ) AS ?answer ) }","paraphrases":["Between 'Activity-based Twitter sampling for content-based and user-centric prediction models' and 'Modelling Non-verbal Sounds for Speech Recognition', which paper has more authors?"],"info":{}}
{"id":"train_6728","question":"To which institution are the majority of the authors of 'A Universal Modular Hybrid LDO With Fast Load Transient Response and Programmable PSRR in 14-nm CMOS Featuring Dynamic Clamp Strength Tuning' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jssc/LiuKNWASRTD21> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'A Universal Modular Hybrid LDO With Fast Load Transient Response and Programmable PSRR in 14-nm CMOS Featuring Dynamic Clamp Strength Tuning' from?"],"info":{}}
{"id":"train_6729","question":"Mention the author who has published the most papers among the authors of 'The Effect of Country of Origin Service Quality and Brand Redeployment after M&A: The Case of Tiger Air-Mandala Airline'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijabim/AnggraeniH16> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'The Effect of Country of Origin Service Quality and Brand Redeployment after M&A: The Case of Tiger Air-Mandala Airline'?"],"info":{}}
{"id":"train_6730","question":"Mention the primary affiliation of most of the authors of 'Shape recognition with edge-based features'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/bmvc/MikolajczykZS03> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'Shape recognition with edge-based features'?"],"info":{}}
{"id":"train_6732","question":"Which one has more number of authors, 'Federated Clustering for Electricity Consumption Pattern Extraction' or 'Estimating Land Subsidence in Relation to Urban Expansion in Semarang City, Indonesia, Using InSAR and Optical Change Detection Methods'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tsg/WangJGKSH22> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/igarss/KochGDBGH19> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tsg/WangJGKSH22> , <https://dblp.org/rec/conf/igarss/KochGDBGH19> ) AS ?answer ) }","paraphrases":["Between 'Federated Clustering for Electricity Consumption Pattern Extraction' and 'Estimating Land Subsidence in Relation to Urban Expansion in Semarang City, Indonesia, Using InSAR and Optical Change Detection Methods', which paper has more authors?"],"info":{}}
{"id":"train_6733","question":"Which one has more number of authors, 'A dual-stage attention-based Conv-LSTM network for spatio-temporal correlation and multivariate time series prediction' or 'Automatic sequences and generalised polynomials'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijis/XiaoYZQZL21> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/corr/ByszewskiK17> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/ijis/XiaoYZQZL21> , <https://dblp.org/rec/journals/corr/ByszewskiK17> ) AS ?answer ) }","paraphrases":["Between 'A dual-stage attention-based Conv-LSTM network for spatio-temporal correlation and multivariate time series prediction' and 'Automatic sequences and generalised polynomials', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6734","question":"Between 'Cohort Characteristics and Factors Associated with Cannabis Use among Adolescents in Canada Using Pattern Discovery and Disentanglement Method' and 'A Late Fusion CNN for Digital Matting', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2109-01739> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/cvpr/ZhangGFRHBX19> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/corr/abs-2109-01739> , <https://dblp.org/rec/conf/cvpr/ZhangGFRHBX19> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Cohort Characteristics and Factors Associated with Cannabis Use among Adolescents in Canada Using Pattern Discovery and Disentanglement Method' or 'A Late Fusion CNN for Digital Matting'?"],"info":{}}
{"id":"train_6735","question":"Where are most of the authors of 'Neural Architecture Optimization' from?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/nips/LuoTQCL18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'Neural Architecture Optimization' affiliated?"],"info":{}}
{"id":"train_6739","question":"Which one was published first, 'A Typology of Online Communities and Community Supporting Platforms' or 'Library functions identification in binary code by using graph isomorphism testings'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hicss/Stanoevska-SlabevaS01> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/wcre/QiuSM15> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/hicss/Stanoevska-SlabevaS01> , <https://dblp.org/rec/conf/wcre/QiuSM15> ) AS ?answer ) }","paraphrases":["Between 'A Typology of Online Communities and Community Supporting Platforms' and 'Library functions identification in binary code by using graph isomorphism testings', which paper was published earlier?"],"info":{}}
{"id":"train_6741","question":"Mention the year in which the first papers of the authors of 'The MATS robotic system to assist disabled people in their home environments' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/iros/GimenezBSG03> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["In which year were the first papers of the authors of 'The MATS robotic system to assist disabled people in their home environments' published?"],"info":{}}
{"id":"train_6742","question":"Mention the author who has published the most papers among the authors of 'A novel method for protein 3D-structure similarity measure based on n-gram modeling'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/bibe/RazmaraD08> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'A novel method for protein 3D-structure similarity measure based on n-gram modeling'?"],"info":{}}
{"id":"train_6743","question":"Mention the year in which the first papers of the authors of 'Forecasting the coronavirus disease 2019 pandemic in India using machine learning and statistical models' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/ijmno/SaxenaS22> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Forecasting the coronavirus disease 2019 pandemic in India using machine learning and statistical models' published?"],"info":{}}
{"id":"train_6744","question":"Between 'Piecewise linear classifiers with an appropriate number of hyperplanes' and 'Vom Suchen und Finden funktioneller Module in biologischen Netzwerken: Ein neuer Ansatz zur integrierten Netzwerkanalyse in der Systembiologie [Assembly of the Interactome, Characterization of Functional Modules and Novel Approaches to the Analysis of Signaling Networks in Human Platelets]', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pr/TenmotoKS98> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/gi/Dittrich08> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/pr/TenmotoKS98> , <https://dblp.org/rec/conf/gi/Dittrich08> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Piecewise linear classifiers with an appropriate number of hyperplanes' or 'Vom Suchen und Finden funktioneller Module in biologischen Netzwerken: Ein neuer Ansatz zur integrierten Netzwerkanalyse in der Systembiologie [Assembly of the Interactome, Characterization of Functional Modules and Novel Approaches to the Analysis of Signaling Networks in Human Platelets]'?"],"info":{}}
{"id":"train_6745","question":"Which one was published first, 'Dynamic Active-Passive Beamforming for Intelligent Reflecting Surface Aided UAV Communications' or 'Vision based global localisation using a 3D environmental model created by a laser range scanner'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/globecom/Zhu0GGTX21> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/iros/HoJ08> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/globecom/Zhu0GGTX21> , <https://dblp.org/rec/conf/iros/HoJ08> ) AS ?answer ) }","paraphrases":["Between 'Dynamic Active-Passive Beamforming for Intelligent Reflecting Surface Aided UAV Communications' and 'Vision based global localisation using a 3D environmental model created by a laser range scanner', which paper was published earlier?"],"info":{}}
{"id":"train_6746","question":"Between 'Pricing for a Hybrid Delivery Model of Video Streaming' and 'Did Karadzic Possess the Mens Rea for Genocide in Srebrenica?', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigmetrics/GregoireHK16> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/aiia/CeruttiR21> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/sigmetrics/GregoireHK16> , <https://dblp.org/rec/conf/aiia/CeruttiR21> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Pricing for a Hybrid Delivery Model of Video Streaming' or 'Did Karadzic Possess the Mens Rea for Genocide in Srebrenica?'?"],"info":{}}
{"id":"train_6747","question":"Name the primary affiliation of most of the authors of 'A Random Access Protocol for RIS-Aided Wireless Communications'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2203-03377> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'A Random Access Protocol for RIS-Aided Wireless Communications' from?"],"info":{}}
{"id":"train_6748","question":"Mention the author who has published the most papers among the authors of 'Logic between Expressivity and Complexity'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cade/Benthem10> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Logic between Expressivity and Complexity'?"],"info":{}}
{"id":"train_6750","question":"Mention the primary affiliation of most of the authors of 'An operational characterization of mutual information in algorithmic information theory'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-1710-05984> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'An operational characterization of mutual information in algorithmic information theory' from?"],"info":{}}
{"id":"train_6751","question":"Between 'Time Series Classification in Reservoir- and Model-Space: A Comparison' and 'A Composed Approach for Automatic Classification of Web Services Robustness', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/annpr/AswolinskiyRS16> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/IEEEscc/OliveiraLV11> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/annpr/AswolinskiyRS16> , <https://dblp.org/rec/conf/IEEEscc/OliveiraLV11> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Time Series Classification in Reservoir- and Model-Space: A Comparison' or 'A Composed Approach for Automatic Classification of Web Services Robustness'?"],"info":{}}
{"id":"train_6753","question":"Mention the author who has published the most papers among the authors of 'Overview of WebCLEF 2008'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/clef/JijkounR08> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Overview of WebCLEF 2008'?"],"info":{}}
{"id":"train_6754","question":"Between 'Integration of information retrieval and database management systems' and 'Design metrics in quantum turbulence simulations: How physics influences software architecture', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/riao/DeogunR85> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/sp/RousonX04> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/riao/DeogunR85> , <https://dblp.org/rec/journals/sp/RousonX04> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Integration of information retrieval and database management systems' or 'Design metrics in quantum turbulence simulations: How physics influences software architecture'?"],"info":{}}
{"id":"train_6756","question":"Between 'MultiTrack: Multi-User Tracking and Activity Recognition Using Commodity WiFi' and 'Bioblitz Data on the Semantic Web', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/chi/TanZWY19> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/semweb/SachsHWP08> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/chi/TanZWY19> , <https://dblp.org/rec/conf/semweb/SachsHWP08> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'MultiTrack: Multi-User Tracking and Activity Recognition Using Commodity WiFi' or 'Bioblitz Data on the Semantic Web'?"],"info":{}}
{"id":"train_6757","question":"Mention the primary affiliation of most of the authors of 'Optimised Learning from Demonstrations for Collaborative Robots'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/rcim/WangHZLZ21> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'Optimised Learning from Demonstrations for Collaborative Robots'?"],"info":{}}
{"id":"train_6759","question":"Which one was published first, 'Overview of the OMA Secure Content IDentification Mechanism' or 'Normative Multi-Agent Systems and Kelsenian Jurisprudence'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icmcs/ZengLWB10> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/abs-1709-02018> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/icmcs/ZengLWB10> , <https://dblp.org/rec/journals/corr/abs-1709-02018> ) AS ?answer ) }","paraphrases":["Between 'Overview of the OMA Secure Content IDentification Mechanism' and 'Normative Multi-Agent Systems and Kelsenian Jurisprudence', which paper was published earlier?"],"info":{}}
{"id":"train_6761","question":"Which one has more number of authors, 'An Autonomous Sailboat for Environment Monitoring' or 'Automated State-based Online Testing Real-time Embedded Software with RTEdge'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icufn/AngNCWCF22> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/modelsward/HasanainLG15> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/icufn/AngNCWCF22> , <https://dblp.org/rec/conf/modelsward/HasanainLG15> ) AS ?answer ) }","paraphrases":["Between 'An Autonomous Sailboat for Environment Monitoring' and 'Automated State-based Online Testing Real-time Embedded Software with RTEdge', which paper has more authors?"],"info":{}}
{"id":"train_6762","question":"Mention the author who has published the most papers among the authors of 'Research on Caravan Seaborne Loading Scheme Based on Greedy Algorithm'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/acai2/SunJWZL19> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Research on Caravan Seaborne Loading Scheme Based on Greedy Algorithm'?"],"info":{}}
{"id":"train_6763","question":"Name the primary affiliation of most of the authors of 'Friendly bin packing instances without Integer Round-up Property'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/mp/CapraraDDIR15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'Friendly bin packing instances without Integer Round-up Property' affiliated?"],"info":{}}
{"id":"train_6764","question":"Which one was published first, 'Fault Diagnosis in Analog Circuits Using Element Modulation' or 'Generalizing Complete Semantics to Bipolar Argumentation Frameworks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dt/WalkerAL92> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/ecsqaru/Potyka21> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/dt/WalkerAL92> , <https://dblp.org/rec/conf/ecsqaru/Potyka21> ) AS ?answer ) }","paraphrases":["Between 'Fault Diagnosis in Analog Circuits Using Element Modulation' and 'Generalizing Complete Semantics to Bipolar Argumentation Frameworks', which paper was published earlier?"],"info":{}}
{"id":"train_6766","question":"Between 'A Hybrid Cloud Approach for Secure Authorized Deduplication' and 'Effects of Social Status on Foetal Growth Using Obstetric Ultrasonography - A Biometric Approach', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tpds/0002L0LL15> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/imtic/AnsariCPMBRC08> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tpds/0002L0LL15> , <https://dblp.org/rec/conf/imtic/AnsariCPMBRC08> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'A Hybrid Cloud Approach for Secure Authorized Deduplication' or 'Effects of Social Status on Foetal Growth Using Obstetric Ultrasonography - A Biometric Approach'?"],"info":{}}
{"id":"train_6767","question":"Between 'Inferences on Mycobacterium Leprae Host Immune Response Escape and Antibiotic Resistance Using Genomic Data and GenomeFastScreen' and 'A humanistic approach to user services', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pacbb/Lopez-Fernandez20> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/siguccs/Allen76> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/pacbb/Lopez-Fernandez20> , <https://dblp.org/rec/conf/siguccs/Allen76> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Inferences on Mycobacterium Leprae Host Immune Response Escape and Antibiotic Resistance Using Genomic Data and GenomeFastScreen' or 'A humanistic approach to user services'?"],"info":{}}
{"id":"train_6768","question":"To which institution are the majority of the authors of 'Model-Driven Design for the Visual Analysis of Heterogeneous Data' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tvcg/StreitSLSS12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Model-Driven Design for the Visual Analysis of Heterogeneous Data' from?"],"info":{}}
