{"id":"train_5055","question":"Was 'Realizing wireless power transfer in cellular networks' not published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icc/HuangL14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icc/HuangL14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the paper 'Realizing wireless power transfer in cellular networks' published in the year 2014?"],"info":{}}
{"id":"train_5056","question":"Wasn't the publication 'Compensating Method of the Height Anomalies for Ultra-High Earth's Gravity Field Model' published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wpc/QingwuJXZMZ17> dblp:yearOfPublication '2017' FILTER NOT EXISTS { <https://dblp.org/rec/journals/wpc/QingwuJXZMZ17> dblp:yearOfPublication '2017' } }","paraphrases":["Was 'Compensating Method of the Height Anomalies for Ultra-High Earth's Gravity Field Model' not published in 2017?"],"info":{}}
{"id":"train_5057","question":"Have the authors of the paper 'Exponentially stable guaranteed cost control for continuous and discrete-time Takagi-Sugeno fuzzy systems' not published a publication in Neurocomputing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijon/PangLJZ16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijon/PangLJZ16> ) . ?y dblp:publishedIn 'Neurocomputing' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijon/PangLJZ16> dblp:publishedIn 'Neurocomputing' } }","paraphrases":["Did the authors of the publication 'Exponentially stable guaranteed cost control for continuous and discrete-time Takagi-Sugeno fuzzy systems' not publish a paper in Neurocomputing?"],"info":{}}
{"id":"train_5059","question":"Wasn't the paper 'Brain computer interface controlled automatic electric drive for neuro-aid system' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bspc/GuptaDTMGS21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/bspc/GuptaDTMGS21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the publication 'Brain computer interface controlled automatic electric drive for neuro-aid system' published in 2021?"],"info":{}}
{"id":"train_5061","question":"Wasn't the publication 'Flex Distribution for Bounded-Suboptimal Multi-Agent Path Finding' published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaai/Chan0GHSK22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/conf/aaai/Chan0GHSK22> dblp:yearOfPublication '2022' } }","paraphrases":["Was 'Flex Distribution for Bounded-Suboptimal Multi-Agent Path Finding' not published in 2022?"],"info":{}}
{"id":"train_5062","question":"Haven't the authors of the publication 'Can Partial Strong Labels Boost Multi-label Object Recognition?' published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/YangZZGWC15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/YangZZGWC15> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/YangZZGWC15> dblp:publishedIn 'CoRR' } }","paraphrases":["Have the authors of the paper 'Can Partial Strong Labels Boost Multi-label Object Recognition?' not published a publication in CoRR?"],"info":{}}
{"id":"train_5063","question":"Have the authors of the paper 'Performance Evaluation of Rural e-Health Scenarios: Users and QoS Management' not published a publication in EMBC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/MartinezGVF06a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/embc/MartinezGVF06a> ) . ?y dblp:publishedIn 'EMBC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/embc/MartinezGVF06a> dblp:publishedIn 'EMBC' } }","paraphrases":["Haven't the authors of the publication 'Performance Evaluation of Rural e-Health Scenarios: Users and QoS Management' published a publication in EMBC?"],"info":{}}
{"id":"train_5067","question":"Wasn't the publication 'Robust Training Symbol Assisted Least Squares Estimation for Direct Conversion Receivers with Oscillator IQ-Imbalance' published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wpc/ChouLW17> dblp:yearOfPublication '2017' FILTER NOT EXISTS { <https://dblp.org/rec/journals/wpc/ChouLW17> dblp:yearOfPublication '2017' } }","paraphrases":["Wasn't the paper 'Robust Training Symbol Assisted Least Squares Estimation for Direct Conversion Receivers with Oscillator IQ-Imbalance' published in the year 2017?"],"info":{}}
{"id":"train_5068","question":"Wasn't the publication 'Developing new data envelopment analysis models to evaluate the efficiency in Ontario Universities' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/joi/GhimireAW21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/joi/GhimireAW21> dblp:yearOfPublication '2021' } }","paraphrases":["Was 'Developing new data envelopment analysis models to evaluate the efficiency in Ontario Universities' not published in 2021?"],"info":{}}
{"id":"train_5069","question":"Haven't the authors of the publication 'Integer colorings with no rainbow k-term arithmetic progression' published a publication in Eur. J. Comb.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ejc/LiWZ22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ejc/LiWZ22> ) . ?y dblp:publishedIn 'Eur. J. Comb.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ejc/LiWZ22> dblp:publishedIn 'Eur. J. Comb.' } }","paraphrases":["Did the authors of 'Integer colorings with no rainbow k-term arithmetic progression' not publish a paper in Eur. J. Comb.?"],"info":{}}
{"id":"train_5070","question":"Did the authors of 'Handwritten digit recognition: benchmarking of state-of-the-art techniques' not publish 'Children and adults differ in their strategies for social learning'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pr/LiuNSF03> dblp:authoredBy ?x . <https://dblp.org/rec/conf/cogsci/LiederSHGX15> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/cogsci/LiederSHGX15> != <https://dblp.org/rec/journals/pr/LiuNSF03> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/pr/LiuNSF03> dblp:authoredBy ?x . <https://dblp.org/rec/conf/cogsci/LiederSHGX15> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/cogsci/LiederSHGX15> != <https://dblp.org/rec/journals/pr/LiuNSF03> ) } }","paraphrases":["Have the authors of the paper 'Handwritten digit recognition: benchmarking of state-of-the-art techniques' not published the paper 'Children and adults differ in their strategies for social learning'?"],"info":{}}
{"id":"train_5071","question":"Wasn't the publication 'On the Parallel Decomposability of Geometric Problems' published in 1989?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/compgeom/AtallahT89> dblp:yearOfPublication '1989' FILTER NOT EXISTS { <https://dblp.org/rec/conf/compgeom/AtallahT89> dblp:yearOfPublication '1989' } }","paraphrases":["Wasn't the paper 'On the Parallel Decomposability of Geometric Problems' published in the year 1989?"],"info":{}}
{"id":"train_5074","question":"Did the authors of 'Particle swarm optimizer with self-adjusting neighborhoods' not publish a paper in Genetic and Evolutionary Computations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gecco/ChenHZ10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/gecco/ChenHZ10> ) . ?y dblp:publishedIn 'GECCO' FILTER NOT EXISTS { <https://dblp.org/rec/conf/gecco/ChenHZ10> dblp:publishedIn 'GECCO' } }","paraphrases":["Have the authors of the paper 'Particle swarm optimizer with self-adjusting neighborhoods' not published a publication in GECCO?"],"info":{}}
{"id":"train_5076","question":"Did the authors of the publication 'Counterpropagation with Delays with Applications in Time Series Prediction' not publish a paper in International Conference on Artificial Neural Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icann/Fierascu05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icann/Fierascu05> ) . ?y dblp:publishedIn 'ICANN (2)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icann/Fierascu05> dblp:publishedIn 'ICANN (2)' } }","paraphrases":["Have the authors of the paper 'Counterpropagation with Delays with Applications in Time Series Prediction' not published a publication in ICANN (2)?"],"info":{}}
{"id":"train_5077","question":"Was 'Data replication techniques in the mobile ad hoc networks' not published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijpcc/NamiR19> dblp:yearOfPublication '2019' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijpcc/NamiR19> dblp:yearOfPublication '2019' } }","paraphrases":["Wasn't the paper 'Data replication techniques in the mobile ad hoc networks' published in the year 2019?"],"info":{}}
{"id":"train_5078","question":"Have the authors of the paper 'A Control System of PLC's Stereo Garage Based on Photoelectric Sensor' not published the paper 'Rational quadratic circles are parametrized by chord length'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijoe/YangJHTZ17> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cagd/Farin06a> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cagd/Farin06a> != <https://dblp.org/rec/journals/ijoe/YangJHTZ17> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijoe/YangJHTZ17> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cagd/Farin06a> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cagd/Farin06a> != <https://dblp.org/rec/journals/ijoe/YangJHTZ17> ) } }","paraphrases":["Did the authors of the publication 'A Control System of PLC's Stereo Garage Based on Photoelectric Sensor' not publish 'Rational quadratic circles are parametrized by chord length'?"],"info":{}}
{"id":"train_5079","question":"Haven't the authors of the publication 'Pattern-based feature extraction for fault detection in quality relevant process control' published a publication in ETFA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/etfa/PeruzzoHL17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/etfa/PeruzzoHL17> ) . ?y dblp:publishedIn 'ETFA' FILTER NOT EXISTS { <https://dblp.org/rec/conf/etfa/PeruzzoHL17> dblp:publishedIn 'ETFA' } }","paraphrases":["Did the authors of the publication 'Pattern-based feature extraction for fault detection in quality relevant process control' not publish a paper in ETFA?"],"info":{}}
{"id":"train_5080","question":"Haven't the authors of the publication 'Partitioning 2-edge-colored complete multipartite graphs into monochromatic cycles, paths and trees' published a publication in J. Comb. Optim.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jco/JinKLW06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jco/JinKLW06> ) . ?y dblp:publishedIn 'J. Comb. Optim.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jco/JinKLW06> dblp:publishedIn 'J. Comb. Optim.' } }","paraphrases":["Did the authors of 'Partitioning 2-edge-colored complete multipartite graphs into monochromatic cycles, paths and trees' not publish a paper in J. Comb. Optim.?"],"info":{}}
{"id":"train_5082","question":"Did the authors of 'A BFGS-ICA algorithm and application in localization of brain activities' not publish a paper in Neurocomputing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijon/ChenYZ05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijon/ChenYZ05> ) . ?y dblp:publishedIn 'Neurocomputing' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijon/ChenYZ05> dblp:publishedIn 'Neurocomputing' } }","paraphrases":["Have the authors of the paper 'A BFGS-ICA algorithm and application in localization of brain activities' not published a publication in Neurocomputing?"],"info":{}}
{"id":"train_5083","question":"Wasn't the paper 'Automatic Conversational Helpdesk Solution using Seq2Seq and Slot-filling Models' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cikm/PatidarAVS18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cikm/PatidarAVS18> dblp:yearOfPublication '2018' } }","paraphrases":["Was 'Automatic Conversational Helpdesk Solution using Seq2Seq and Slot-filling Models' not published in 2018?"],"info":{}}
{"id":"train_5084","question":"Haven't the authors of the publication 'Improved Document Representation for Classification Tasks for the Intelligence Community' published a publication in AAAI Spring Symposium: AI Technologies for Homeland Security?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaaiss/YilmazelSBL05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/aaaiss/YilmazelSBL05> ) . ?y dblp:publishedIn 'AAAI Spring Symposium: AI Technologies for Homeland Security' FILTER NOT EXISTS { <https://dblp.org/rec/conf/aaaiss/YilmazelSBL05> dblp:publishedIn 'AAAI Spring Symposium: AI Technologies for Homeland Security' } }","paraphrases":["Did the authors of the publication 'Improved Document Representation for Classification Tasks for the Intelligence Community' not publish a paper in AAAI Spring Symposium: AI Technologies for Homeland Security?"],"info":{}}
{"id":"train_5086","question":"Have the authors of the paper 'Learning relation axioms from text: An automatic Web-based approach' not published the paper 'Design and testing of a controllable miniature jumping robot'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eswa/SanchezMT12> dblp:authoredBy ?x . <https://dblp.org/rec/conf/iros/ZhaoXGMX10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/iros/ZhaoXGMX10> != <https://dblp.org/rec/journals/eswa/SanchezMT12> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/eswa/SanchezMT12> dblp:authoredBy ?x . <https://dblp.org/rec/conf/iros/ZhaoXGMX10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/iros/ZhaoXGMX10> != <https://dblp.org/rec/journals/eswa/SanchezMT12> ) } }","paraphrases":["Did the authors of 'Learning relation axioms from text: An automatic Web-based approach' not publish 'Design and testing of a controllable miniature jumping robot'?"],"info":{}}
{"id":"train_5087","question":"Did the authors of 'Autonomic analysis of social networks' not publish a paper in International Conference on Computer Supported Cooperative Work in Design?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cscwd/SilvaSO11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cscwd/SilvaSO11> ) . ?y dblp:publishedIn 'CSCWD' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cscwd/SilvaSO11> dblp:publishedIn 'CSCWD' } }","paraphrases":["Have the authors of the paper 'Autonomic analysis of social networks' not published a publication in CSCWD?"],"info":{}}
{"id":"train_5088","question":"Haven't the authors of the publication 'Neural Machine Translation with Universal Visual Representation' published a publication in ICLR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iclr/0001C0USLZ20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iclr/0001C0USLZ20> ) . ?y dblp:publishedIn 'ICLR' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iclr/0001C0USLZ20> dblp:publishedIn 'ICLR' } }","paraphrases":["Have the authors of the paper 'Neural Machine Translation with Universal Visual Representation' not published a publication in ICLR?"],"info":{}}
{"id":"train_5089","question":"Wasn't the publication 'Do banks change their liquidity ratios based on network characteristics?' published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eor/ArdekaniDT20> dblp:yearOfPublication '2020' FILTER NOT EXISTS { <https://dblp.org/rec/journals/eor/ArdekaniDT20> dblp:yearOfPublication '2020' } }","paraphrases":["Was 'Do banks change their liquidity ratios based on network characteristics?' not published in 2020?"],"info":{}}
{"id":"train_5093","question":"Wasn't the paper 'Learning a goal-oriented model for energy efficient adaptive applications in data centers' published in the year 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/isci/VitaliPO15> dblp:yearOfPublication '2015' FILTER NOT EXISTS { <https://dblp.org/rec/journals/isci/VitaliPO15> dblp:yearOfPublication '2015' } }","paraphrases":["Wasn't the publication 'Learning a goal-oriented model for energy efficient adaptive applications in data centers' published in 2015?"],"info":{}}
{"id":"train_5095","question":"Wasn't the publication 'A 037W 143dB-Dynamic-Range 1Mpixel Backside-Illuminated Charge-Focusing SPAD Image Sensor with Pixel-Wise Exposure Control and Adaptive Clocked Recharging' published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isscc/OtaMSSKEMMTAHMT22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/conf/isscc/OtaMSSKEMMTAHMT22> dblp:yearOfPublication '2022' } }","paraphrases":["Wasn't the paper 'A 037W 143dB-Dynamic-Range 1Mpixel Backside-Illuminated Charge-Focusing SPAD Image Sensor with Pixel-Wise Exposure Control and Adaptive Clocked Recharging' published in the year 2022?"],"info":{}}
{"id":"train_5096","question":"Wasn't the publication 'A compact phenomenological digital neuron implementing the 20 Izhikevich behaviors' published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/biocas/FrenkelLB17> dblp:yearOfPublication '2017' FILTER NOT EXISTS { <https://dblp.org/rec/conf/biocas/FrenkelLB17> dblp:yearOfPublication '2017' } }","paraphrases":["Wasn't the paper 'A compact phenomenological digital neuron implementing the 20 Izhikevich behaviors' published in the year 2017?"],"info":{}}
{"id":"train_5097","question":"Did the authors of 'Embedding Test Pattern Generation into Design' not publish a paper in EUROCAST?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eurocast/FeitenH89> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/eurocast/FeitenH89> ) . ?y dblp:publishedIn 'EUROCAST' FILTER NOT EXISTS { <https://dblp.org/rec/conf/eurocast/FeitenH89> dblp:publishedIn 'EUROCAST' } }","paraphrases":["Haven't the authors of the publication 'Embedding Test Pattern Generation into Design' published a publication in EUROCAST?"],"info":{}}
{"id":"train_5098","question":"Haven't the authors of the publication 'Semantic based events signaling for AAL systems' published a publication in J. Ambient Intell. Humaniz. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jaihc/ModoniVTSC18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jaihc/ModoniVTSC18> ) . ?y dblp:publishedIn 'J. Ambient Intell. Humaniz. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jaihc/ModoniVTSC18> dblp:publishedIn 'J. Ambient Intell. Humaniz. Comput.' } }","paraphrases":["Did the authors of 'Semantic based events signaling for AAL systems' not publish a paper in J. Ambient Intell. Humaniz. Comput.?"],"info":{}}
{"id":"train_5100","question":"Haven't the authors of the publication 'Incorrect Operations of Pilot Scheme with Ground Overcurrent Protection' published the paper 'Adjacent channel interference in IEEE 80211n'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccece/GouveiaNR19a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/wcnc/ZubowS12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/wcnc/ZubowS12> != <https://dblp.org/rec/conf/ccece/GouveiaNR19a> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/ccece/GouveiaNR19a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/wcnc/ZubowS12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/wcnc/ZubowS12> != <https://dblp.org/rec/conf/ccece/GouveiaNR19a> ) } }","paraphrases":["Did the authors of the publication 'Incorrect Operations of Pilot Scheme with Ground Overcurrent Protection' not publish 'Adjacent channel interference in IEEE 80211n'?"],"info":{}}
{"id":"train_5102","question":"Did the authors of 'An improved P2P lookup protocol model' not publish a paper in Clust. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cluster/XuSS10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cluster/XuSS10> ) . ?y dblp:publishedIn 'Clust. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cluster/XuSS10> dblp:publishedIn 'Clust. Comput.' } }","paraphrases":["Have the authors of the paper 'An improved P2P lookup protocol model' not published a publication in Clust. Comput.?"],"info":{}}
{"id":"train_5104","question":"Did the authors of the publication 'A sequential niching memetic algorithm for continuous multimodal function optimization' not publish 'The Capacity of the Product Channel'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/VitelaC12> dblp:authoredBy ?x . <https://dblp.org/rec/journals/iandc/Augustin68> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/iandc/Augustin68> != <https://dblp.org/rec/journals/amc/VitelaC12> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/amc/VitelaC12> dblp:authoredBy ?x . <https://dblp.org/rec/journals/iandc/Augustin68> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/iandc/Augustin68> != <https://dblp.org/rec/journals/amc/VitelaC12> ) } }","paraphrases":["Have the authors of the paper 'A sequential niching memetic algorithm for continuous multimodal function optimization' not published the paper 'The Capacity of the Product Channel'?"],"info":{}}
{"id":"train_5105","question":"Was '3LSPG: Forensic Tool Evaluation by Three Layer Stochastic Process-Based Generation of Data' not published in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwcf/YannikosFWS10> dblp:yearOfPublication '2011' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iwcf/YannikosFWS10> dblp:yearOfPublication '2011' } }","paraphrases":["Wasn't the publication '3LSPG: Forensic Tool Evaluation by Three Layer Stochastic Process-Based Generation of Data' published in 2011?"],"info":{}}
{"id":"train_5106","question":"Wasn't the paper 'The performance of QoS-aware IP multicast routing protocols' published in the year 2003?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/networks/TsengC03> dblp:yearOfPublication '2003' FILTER NOT EXISTS { <https://dblp.org/rec/journals/networks/TsengC03> dblp:yearOfPublication '2003' } }","paraphrases":["Wasn't the publication 'The performance of QoS-aware IP multicast routing protocols' published in 2003?"],"info":{}}
{"id":"train_5107","question":"Haven't the authors of the publication 'Image Restoration Using Piecewise Iterative Curve Fitting and Texture Synthesis' published a publication in ICIC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icic/SunYYZ08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icic/SunYYZ08> ) . ?y dblp:publishedIn 'ICIC (1)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icic/SunYYZ08> dblp:publishedIn 'ICIC (1)' } }","paraphrases":["Did the authors of 'Image Restoration Using Piecewise Iterative Curve Fitting and Texture Synthesis' not publish a paper in ICIC (1)?"],"info":{}}
{"id":"train_5108","question":"Did the authors of the publication '\\u03C7-bounded families of oriented graphs' not publish a paper in J. Graph Theory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jgt/AboulkerBBCHMZ18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jgt/AboulkerBBCHMZ18> ) . ?y dblp:publishedIn 'J. Graph Theory' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jgt/AboulkerBBCHMZ18> dblp:publishedIn 'J. Graph Theory' } }","paraphrases":["Haven't the authors of the publication '\\u03C7-bounded families of oriented graphs' published a publication in J. Graph Theory?"],"info":{}}
{"id":"train_5110","question":"Haven't the authors of the publication 'Performance Evaluation of Identity and Access Management Systems in Federated Environments' published a publication in Infoscale?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/infoscale/SchellDH09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/infoscale/SchellDH09> ) . ?y dblp:publishedIn 'Infoscale' FILTER NOT EXISTS { <https://dblp.org/rec/conf/infoscale/SchellDH09> dblp:publishedIn 'Infoscale' } }","paraphrases":["Did the authors of 'Performance Evaluation of Identity and Access Management Systems in Federated Environments' not publish a paper in Infoscale?"],"info":{}}
{"id":"train_5111","question":"Wasn't the paper 'Scalable and Congestion-Aware Routing for Autonomous Mobility-On-Demand Via Frank-Wolfe Optimization' published in the year 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/rss/SoloveySP19> dblp:yearOfPublication '2019' FILTER NOT EXISTS { <https://dblp.org/rec/conf/rss/SoloveySP19> dblp:yearOfPublication '2019' } }","paraphrases":["Wasn't the publication 'Scalable and Congestion-Aware Routing for Autonomous Mobility-On-Demand Via Frank-Wolfe Optimization' published in 2019?"],"info":{}}
{"id":"train_5114","question":"Wasn't the paper 'Relationship between text and action conceptions of programming: a phenomenographic and quantitative perspective' published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iticse/EckerdalLLS11> dblp:yearOfPublication '2011' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iticse/EckerdalLLS11> dblp:yearOfPublication '2011' } }","paraphrases":["Wasn't the publication 'Relationship between text and action conceptions of programming: a phenomenographic and quantitative perspective' published in 2011?"],"info":{}}
{"id":"train_5116","question":"Wasn't the publication 'Masked Label Prediction: Unified Message Passing Model for Semi-Supervised Classification' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcai/ShiHFZWS21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ijcai/ShiHFZWS21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the paper 'Masked Label Prediction: Unified Message Passing Model for Semi-Supervised Classification' published in the year 2021?"],"info":{}}
{"id":"train_5117","question":"Was 'Coarse-Grain Cluster Analysis of Tensors With Application to Climate Biome Identification' not published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2001-07827> dblp:yearOfPublication '2020' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2001-07827> dblp:yearOfPublication '2020' } }","paraphrases":["Wasn't the paper 'Coarse-Grain Cluster Analysis of Tensors With Application to Climate Biome Identification' published in the year 2020?"],"info":{}}
{"id":"train_5120","question":"Wasn't the paper 'Validity of Heavy-Traffic Steady-State Approximations in Multiclass Queueing Networks: The Case of Queue-Ratio Disciplines' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mor/Gurvich14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/journals/mor/Gurvich14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the publication 'Validity of Heavy-Traffic Steady-State Approximations in Multiclass Queueing Networks: The Case of Queue-Ratio Disciplines' published in 2014?"],"info":{}}
{"id":"train_5121","question":"Did the authors of 'Does aspect-oriented modeling help improve the readability of UML state machines?' not publish a paper in Softw. Syst. Model.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sosym/AliYB14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/sosym/AliYB14> ) . ?y dblp:publishedIn 'Softw. Syst. Model.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/sosym/AliYB14> dblp:publishedIn 'Softw. Syst. Model.' } }","paraphrases":["Have the authors of the paper 'Does aspect-oriented modeling help improve the readability of UML state machines?' not published a publication in Softw. Syst. Model.?"],"info":{}}
{"id":"train_5122","question":"Haven't the authors of the publication 'Relationships between Blogging Activeness and the Characteristics of Participants and Blogs during Teaching Practice and Induction Year' published the paper 'Cooperation Between Stations in Wireless Networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icwl/LuikT14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icnp/ForteS07> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icnp/ForteS07> != <https://dblp.org/rec/conf/icwl/LuikT14> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/icwl/LuikT14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icnp/ForteS07> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icnp/ForteS07> != <https://dblp.org/rec/conf/icwl/LuikT14> ) } }","paraphrases":["Did the authors of 'Relationships between Blogging Activeness and the Characteristics of Participants and Blogs during Teaching Practice and Induction Year' not publish 'Cooperation Between Stations in Wireless Networks'?"],"info":{}}
{"id":"train_5124","question":"Wasn't the publication 'The Computational Structure of the Clifford Groups' published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/els/Smith18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/conf/els/Smith18> dblp:yearOfPublication '2018' } }","paraphrases":["Was 'The Computational Structure of the Clifford Groups' not published in 2018?"],"info":{}}
{"id":"train_5125","question":"Was 'P Systems with Active Membranes Working in Sublinear Space' not published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/membrane/ZandronLMMP14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/conf/membrane/ZandronLMMP14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the publication 'P Systems with Active Membranes Working in Sublinear Space' published in 2014?"],"info":{}}
