{"id":"train_6297","question":"Who are the authors that published papers about Extremity range in MMVR in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mmvr/YanKBANJH13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/mmvr/YanKBANJH13> dblp:publishedIn 'MMVR' . <https://dblp.org/rec/conf/mmvr/YanKBANJH13> dblp:yearOfPublication '2013' }","paraphrases":["In the year 2013 in MMVR, who are the authors that published research papers about Extremity range?"],"info":{}}
{"id":"train_6298","question":"In CSNDSP in 2012, who are the authors that published papers about Code reservation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/csndsp/VardakasMLS12> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/csndsp/VardakasMLS12> dblp:publishedIn 'CSNDSP' . <https://dblp.org/rec/conf/csndsp/VardakasMLS12> dblp:yearOfPublication '2012' }","paraphrases":["Who are the authors that published papers about Code reservation in CSNDSP in 2012?"],"info":{}}
{"id":"train_6299","question":"In 2019 in CoRR, who are the authors that published papers about Graph labeling?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1911-03757> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-1911-03757> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-1911-03757> dblp:yearOfPublication '2019' }","paraphrases":["Who are the authors that published papers about Graph labeling in CoRR in 2019?"],"info":{}}
{"id":"train_6300","question":"Count the papers published by the authors of 'Impacts of monetary instruments on overnight spread under the interest rate corridor framework: evidence from China' in 2021.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/bpmj/ChangFHH21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2021' }","paraphrases":["In 2021, how many papers did the authors of 'Impacts of monetary instruments on overnight spread under the interest rate corridor framework: evidence from China' publish?"],"info":{}}
{"id":"train_6301","question":"Mention the count of papers published by the authors of 'Semi-automatic Composition of Geospatial Web Services Using JBoss Rules' in RuleML.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ruleml/ZahariaVB08> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'RuleML' }","paraphrases":["How many publications did the authors of the paper 'Semi-automatic Composition of Geospatial Web Services Using JBoss Rules' publish in RuleML?"],"info":{}}
{"id":"train_6303","question":"Count the different affiliations of the authors of 'Eccentric Regularization: Minimizing Hyperspherical Energy without explicit projection'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2104-11610> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Eccentric Regularization: Minimizing Hyperspherical Energy without explicit projection' have?"],"info":{}}
{"id":"train_6307","question":"What is the count of authors of 'Neuro-fuzzy Control of Autonomous Robotics' who have University of Texas at Arlington, TX, USA as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/reference/complexity/StinguL09> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Texas at Arlington, TX, USA' }","paraphrases":["How many authors of 'Neuro-fuzzy Control of Autonomous Robotics' have University of Texas at Arlington as their primary affiliation?"],"info":{}}
{"id":"train_6309","question":"Count the different affiliations of the authors of 'On computing the inverse DFT'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tsp/DuhamelPE88> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'On computing the inverse DFT' have?"],"info":{}}
{"id":"train_6310","question":"Mention the count of papers published by the authors of 'Object Tracking in Random Access Sensor Networks: Extended Kalman Filtering with State Overlapping' in INFOCOM Workshops.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/infocom/AlimadadiSC19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'INFOCOM Workshops' }","paraphrases":["How many publications did the authors of the paper 'Object Tracking in Random Access Sensor Networks: Extended Kalman Filtering with State Overlapping' publish in INFOCOM Workshops?"],"info":{}}
{"id":"train_6314","question":"Count the papers published by the authors of 'Against Backdoor Attacks In Federated Learning With Differential Privacy' in 2022.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icassp/MiaoYHLH22> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2022' }","paraphrases":["How many papers did the authors of 'Against Backdoor Attacks In Federated Learning With Differential Privacy' publish in 2022?"],"info":{}}
{"id":"train_6315","question":"Count the different affiliations of the authors of 'HIPER: Heuristic-based infrastructure expansion through partition reconnection for efficient Virtual Network Embedding'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cnsm/LuizelliBBG14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'HIPER: Heuristic-based infrastructure expansion through partition reconnection for efficient Virtual Network Embedding' have?"],"info":{}}
{"id":"train_6316","question":"In 2019, how many papers did the authors of 'Singular Perturbation Analysis of a Regularized MEMS Model' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/siamads/IuorioPS19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["How many papers did the authors of 'Singular Perturbation Analysis of a Regularized MEMS Model' publish in 2019?"],"info":{}}
{"id":"train_6317","question":"Count the papers published by the authors of 'End-to-End Error-Rate Based Incremental Relaying for AF Cooperative Communications' in IEEE Commun. Lett..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/icl/Lee13c> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE Commun. Lett.' }","paraphrases":["How many publications did the authors of the paper 'End-to-End Error-Rate Based Incremental Relaying for AF Cooperative Communications' publish in IEEE Commun. Lett.?"],"info":{}}
{"id":"train_6320","question":"How many papers did the authors of 'Scrabble puzzle challenge' publish in Inroads?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/inroads/Barr20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Inroads' }","paraphrases":["How many publications did the authors of the paper 'Scrabble puzzle challenge' publish in Inroads?"],"info":{}}
{"id":"train_6321","question":"In 2007, how many papers did the authors of 'Pruning Bio-Ontologies' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/hicss/KimCH07> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2007' }","paraphrases":["How many papers did the authors of 'Pruning Bio-Ontologies' publish in 2007?"],"info":{}}
{"id":"train_6322","question":"How many papers did the authors of 'An Ensemble Model for Sentiment Analysis of Hindi-English Code-Mixed Data' publish in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-1806-04450> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2018' }","paraphrases":["In 2018, how many papers did the authors of 'An Ensemble Model for Sentiment Analysis of Hindi-English Code-Mixed Data' publish?"],"info":{}}
{"id":"train_6324","question":"How many authors of 'Head Pose Estimation and Augmented Reality Tracking: An Integrated System and Evaluation for Monitoring Driver Awareness' have University of California as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tits/Murphy-ChutorianT10> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of California, San Diego, USA' }","paraphrases":["What is the count of authors of 'Head Pose Estimation and Augmented Reality Tracking: An Integrated System and Evaluation for Monitoring Driver Awareness' who have University of California, San Diego, USA as their primary affiliation?"],"info":{}}
{"id":"train_6325","question":"Count the papers published by the authors of 'Trajectory-User Linking via Graph Neural Network' in ICC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icc/0002CWCZ21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICC' }","paraphrases":["How many papers did the authors of 'Trajectory-User Linking via Graph Neural Network' publish in ICC?"],"info":{}}
{"id":"train_6326","question":"Count the different affiliations of the authors of 'GAmera: An Automatic Mutant Generation System for WS-BPEL Compositions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ecows/Dominguez-JimenezEGM09> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'GAmera: An Automatic Mutant Generation System for WS-BPEL Compositions' have?"],"info":{}}
{"id":"train_6327","question":"Count the papers published by the authors of 'Designing a Low-Power LNA and Filter for Portable EEG Acquisition Applications' in IEEE Access.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/access/MoradiDT21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE Access' }","paraphrases":["Mention the count of papers published by the authors of 'Designing a Low-Power LNA and Filter for Portable EEG Acquisition Applications' in IEEE Access."],"info":{}}
{"id":"train_6328","question":"Count the papers published by the authors of 'NOMA Clustering for Improved Multicast IoT Schemes' in 2022.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jsan/ElouafadiEB22> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2022' }","paraphrases":["In 2022, how many papers did the authors of 'NOMA Clustering for Improved Multicast IoT Schemes' publish?"],"info":{}}
{"id":"train_6329","question":"Count the papers published by the authors of 'Learning representations for creative design using evolution' in 1996.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/aiedam/SchnierG96> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1996' }","paraphrases":["In 1996, how many papers did the authors of 'Learning representations for creative design using evolution' publish?"],"info":{}}
{"id":"train_6330","question":"Count the papers published by the authors of 'Modular Verification of Information Flow Security in Component-Based Systems' in SEFM.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sefm/GreinerMB17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'SEFM' }","paraphrases":["How many papers did the authors of 'Modular Verification of Information Flow Security in Component-Based Systems' publish in International Conference on Software Engineering and Formal Methods?"],"info":{}}
{"id":"train_6334","question":"Mention the count of papers published by the authors of 'Sound sample detection and numerosity estimation using auditory display' in ACM Trans. Appl. Percept..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tap/GamperDBP13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ACM Trans. Appl. Percept.' }","paraphrases":["How many publications did the authors of the paper 'Sound sample detection and numerosity estimation using auditory display' publish in ACM Trans. Appl. Percept.?"],"info":{}}
{"id":"train_6336","question":"Count the papers published by the authors of 'Substrate noise-aware floorplanning for mixed-signal SOCs' in ISCAS (2).","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iscas/JeskeBCW04> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ISCAS (2)' }","paraphrases":["How many publications did the authors of the paper 'Substrate noise-aware floorplanning for mixed-signal SOCs' publish in ISCAS (2)?"],"info":{}}
{"id":"train_6337","question":"Mention the count of papers published by the authors of 'Optimal Random Access for a Cognitive Radio Terminal with Energy Harvesting Capability' in IEEE Commun. Lett..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/icl/ShafieS13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE Commun. Lett.' }","paraphrases":["Count the papers published by the authors of 'Optimal Random Access for a Cognitive Radio Terminal with Energy Harvesting Capability' in IEEE Commun. Lett.."],"info":{}}
{"id":"train_6338","question":"Count the papers published by the authors of 'Brazilian Symposium on Programming Languages (SBLP 2010)' in 2014.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/scp/AldrichL14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2014' }","paraphrases":["In 2014, how many papers did the authors of 'Brazilian Symposium on Programming Languages (SBLP 2010)' publish?"],"info":{}}
{"id":"train_6341","question":"Count the papers published by the authors of 'StorHouse Metanoia - New Applications for Database, Storage & Data Warehousing' in 2001.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sigmod/CarinoKKB01> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2001' }","paraphrases":["In 2001, how many papers did the authors of 'StorHouse Metanoia - New Applications for Database, Storage & Data Warehousing' publish?"],"info":{}}
{"id":"train_6344","question":"Count the different affiliations of the authors of 'The problem determination of Functional Dependencies between attributes Relation Scheme in the Relational Data Model El problema de determinar Dependencias Funcionales entre atributos en los esquemas en el Modelo Relacional'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-cs-0701114> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'The problem determination of Functional Dependencies between attributes Relation Scheme in the Relational Data Model El problema de determinar Dependencias Funcionales entre atributos en los esquemas en el Modelo Relacional' have?"],"info":{}}
{"id":"train_6346","question":"In 2017, how many papers did the authors of 'Reference Range Number Lines Preferred by Latino Adults for Display of Clinical and Patient-Reported Outcome Data' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/amia/Arcia17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2017' }","paraphrases":["How many papers did the authors of 'Reference Range Number Lines Preferred by Latino Adults for Display of Clinical and Patient-Reported Outcome Data' publish in 2017?"],"info":{}}
{"id":"train_6349","question":"Count the different affiliations of the authors of 'Computing Almost Exact Probabilities of Differential Hash Collision Paths by Applying Appropriate Stochastic Methods'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/iacr/GebhardtIS08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Computing Almost Exact Probabilities of Differential Hash Collision Paths by Applying Appropriate Stochastic Methods' have?"],"info":{}}
{"id":"train_6353","question":"Count the different affiliations of the authors of 'Security of 2t-Root Identification and Signatures'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/eccc/ECCC-TR96-019> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Security of 2t-Root Identification and Signatures' have?"],"info":{}}
{"id":"train_6355","question":"Count the different affiliations of the authors of 'Rational orthogonal bases satisfying the Bedrosian identity'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/adcm/TanSY10> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Rational orthogonal bases satisfying the Bedrosian identity' have?"],"info":{}}
{"id":"train_6357","question":"Count the different affiliations of the authors of 'Preliminary Steps in Designing and Implementing a Privilege Verifier for PMI'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iadis/BerbecaruL04> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Preliminary Steps in Designing and Implementing a Privilege Verifier for PMI' have?"],"info":{}}
{"id":"train_6359","question":"Count the different affiliations of the authors of 'Measurement-based Massive-MIMO Channel Characterization for Outdoor LoS Scenarios'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/pimrc/HaoYRAZ18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Measurement-based Massive-MIMO Channel Characterization for Outdoor LoS Scenarios' have?"],"info":{}}
{"id":"train_6360","question":"How many authors of 'Cut-Elimination for Quantified Conditional Logic' have FU Berlin as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jphil/Benzmuller17> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'FU Berlin, Department of Mathematics and Computer Science, Germany' }","paraphrases":["What is the count of authors of 'Cut-Elimination for Quantified Conditional Logic' who have FU Berlin as their primary affiliation?"],"info":{}}
{"id":"train_6361","question":"Mention the count of papers published by the authors of 'SeCo: Exploring Sequence Supervision for Unsupervised Representation Learning' in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2008-00975> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Count the papers published by the authors of 'SeCo: Exploring Sequence Supervision for Unsupervised Representation Learning' in CoRR."],"info":{}}
{"id":"train_6363","question":"How many papers did the authors of 'Inference for asymptotically independent samples of extremes' publish in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ma/GuillouPR18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2018' }","paraphrases":["In 2018, how many papers did the authors of 'Inference for asymptotically independent samples of extremes' publish?"],"info":{}}
{"id":"train_6365","question":"How many papers did the authors of 'EEG-Based Emotion Recognition Using a Wrapper-Based Feature Selection Method' publish in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/aisi/AbdelAalAH17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2018' }","paraphrases":["In 2018, how many papers did the authors of 'EEG-Based Emotion Recognition Using a Wrapper-Based Feature Selection Method' publish?"],"info":{}}
{"id":"train_6367","question":"Count the different affiliations of the authors of 'A series of revisions of David Poole's specificity'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/amai/WirthS16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'A series of revisions of David Poole's specificity' have?"],"info":{}}
{"id":"train_6368","question":"Count the different affiliations of the authors of 'Partitioning a graph of bounded tree-width to connected subgraphs of almost uniform size'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jda/ItoZN06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Partitioning a graph of bounded tree-width to connected subgraphs of almost uniform size' have?"],"info":{}}
{"id":"train_6369","question":"Count the different affiliations of the authors of 'On properties of multicast routing trees'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijcomsys/JanicM06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'On properties of multicast routing trees' have?"],"info":{}}
{"id":"train_6370","question":"Count the different affiliations of the authors of 'Spoken WordNet'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/wordnet/KashyapSS19> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Spoken WordNet' have?"],"info":{}}
{"id":"train_6372","question":"Mention the count of papers published by the authors of 'Updates to FuncLab, a Matlab based GUI for handling receiver functions' in Comput. Geosci..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/gandc/PorrittM18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Comput. Geosci.' }","paraphrases":["How many publications did the authors of the paper 'Updates to FuncLab, a Matlab based GUI for handling receiver functions' publish in Comput. Geosci.?"],"info":{}}
{"id":"train_6375","question":"Count the papers published by the authors of 'Memorization in NLP Fine-tuning Methods' in 2022.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2205-12506> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2022' }","paraphrases":["In 2022, how many papers did the authors of 'Memorization in NLP Fine-tuning Methods' publish?"],"info":{}}
{"id":"train_6376","question":"Count the different affiliations of the authors of 'Reverse Classification Accuracy: Predicting Segmentation Performance in the Absence of Ground Truth'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/ValindriaLBKARR17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Reverse Classification Accuracy: Predicting Segmentation Performance in the Absence of Ground Truth' have?"],"info":{}}
{"id":"train_6378","question":"Count the papers published by the authors of 'Understanding How Pair Programming Actually Works in Industry: Mechanisms, Patterns, and Dynamics' in 2022.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/books/sp/22/Zieris22> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2022' }","paraphrases":["In 2022, how many papers did the authors of 'Understanding How Pair Programming Actually Works in Industry: Mechanisms, Patterns, and Dynamics' publish?"],"info":{}}
{"id":"train_6380","question":"How many papers did the authors of 'Multi-target channel inversion power control for block-fading channels with multiple antennas' publish in 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icc/0006LC04> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2004' }","paraphrases":["In 2004, how many papers did the authors of 'Multi-target channel inversion power control for block-fading channels with multiple antennas' publish?"],"info":{}}
{"id":"train_6382","question":"How many papers did the authors of 'Smart Cities: The Hopes and Hypes' publish in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-1907-05702> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["In 2019, how many papers did the authors of 'Smart Cities: The Hopes and Hypes' publish?"],"info":{}}
{"id":"train_6383","question":"Mention the count of papers published by the authors of 'Motor-Cortex-Like Recurrent Neural Network and Multitask Learning for the Control of Musculoskeletal Systems' in IEEE Trans. Cogn. Dev. Syst..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tamd/ChenQ22> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE Trans. Cogn. Dev. Syst.' }","paraphrases":["How many papers did the authors of 'Motor-Cortex-Like Recurrent Neural Network and Multitask Learning for the Control of Musculoskeletal Systems' publish in IEEE Trans. Cogn. Dev. Syst.?"],"info":{}}
{"id":"train_6385","question":"Count the papers published by the authors of 'Identifying suspicious activities through DNS failure graph analysis' in ICNP.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icnp/JiangCJLZ10> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICNP' }","paraphrases":["How many papers did the authors of 'Identifying suspicious activities through DNS failure graph analysis' publish in ICNP?"],"info":{}}
{"id":"train_6386","question":"Count the different affiliations of the authors of 'Real-Time Embedded Computer Vision on UAVs: - UAVision2020 Workshop Summary'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/eccv/BeeckOVTSG20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Real-Time Embedded Computer Vision on UAVs: - UAVision2020 Workshop Summary' have?"],"info":{}}
{"id":"train_6388","question":"How many authors of 'Mosaic representations of video sequences based on slice image analysis' have Chinese Academy of Sciences, National Laboratory of Pattern Recognition, Institute of Automation, Beijing, China as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/prl/FengLM02> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Chinese Academy of Sciences, National Laboratory of Pattern Recognition, Institute of Automation, Beijing, China' }","paraphrases":["What is the count of authors of 'Mosaic representations of video sequences based on slice image analysis' who have Chinese Academy of Sciences as their primary affiliation?"],"info":{}}
{"id":"train_6390","question":"How many papers did the authors of 'Generalization of the potential method for blending three surfaces' publish in 1992?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/cad/OhkuraK92> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1992' }","paraphrases":["In 1992, how many papers did the authors of 'Generalization of the potential method for blending three surfaces' publish?"],"info":{}}
{"id":"train_6391","question":"Count the papers published by the authors of 'Provenance Across Evidence Combination in Theory of Belief Functions' in 2018.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/fusion/KowalskiM18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2018' }","paraphrases":["In 2018, how many papers did the authors of 'Provenance Across Evidence Combination in Theory of Belief Functions' publish?"],"info":{}}
