{"id":"train_4066","question":"The authors of 'Transmission Through Large Intelligent Surfaces: A New Frontier in Wireless Communications' published in which other years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1902-08463> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-1902-08463> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Transmission Through Large Intelligent Surfaces: A New Frontier in Wireless Communications' publishing?"],"info":{}}
{"id":"train_4068","question":"Find the years in which the authors of 'Comparing cooperative and non-cooperative crash risk-assessment' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ivs/DemmelGR13> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ivs/DemmelGR13> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Comparing cooperative and non-cooperative crash risk-assessment' published other papers."],"info":{}}
{"id":"train_4069","question":"Mention the venues of the other papers published by the authors of 'TotemBioNet Enrichment Methodology: Application to the Qualitative Regulatory Network of the Cell Metabolism'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/biostec/GibartBCC21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/biostec/GibartBCC21> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'TotemBioNet Enrichment Methodology: Application to the Qualitative Regulatory Network of the Cell Metabolism'?"],"info":{}}
{"id":"train_4070","question":"Mention the venue of the paper 'Finding relevant sequences in time series containing crisp, interval, and fuzzy interval data' authored by Weiyi Liu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tsmc/LiaoTL04> dblp:authoredBy <https://dblp.org/pid/44/1169> . <https://dblp.org/rec/journals/tsmc/LiaoTL04> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Finding relevant sequences in time series containing crisp, interval, and fuzzy interval data' authored by Liu, W.."],"info":{}}
{"id":"train_4071","question":"Show the webpages of authors of 'Hybrid Group Anomaly Detection for Sequence Data: Application to Trajectory Data Analytics'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tits/BelhadiDS0L22> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Hybrid Group Anomaly Detection for Sequence Data: Application to Trajectory Data Analytics'?"],"info":{}}
{"id":"train_4072","question":"List the venues of the other papers published by the authors of 'Robust Optimal ECO-driving Control with Uncertain Traffic Signal Timing'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amcc/SunSM18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/amcc/SunSM18> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Robust Optimal ECO-driving Control with Uncertain Traffic Signal Timing'?"],"info":{}}
{"id":"train_4073","question":"Mention the venues of the other papers published by the authors of 'A study on third party component reuse in Java enterprise open source software'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cbse/SchwittekE13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/cbse/SchwittekE13> ) }","paraphrases":["List the venues of the other papers published by the authors of 'A study on third party component reuse in Java enterprise open source software'."],"info":{}}
{"id":"train_4075","question":"Mention the venues of the other papers published by the authors of 'Security Policy Composition for Composite Services'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icwe/SatohT08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/icwe/SatohT08> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Security Policy Composition for Composite Services'?"],"info":{}}
{"id":"train_4076","question":"Mention the venues of the other papers published by the authors of 'A Clinical Dataset and Various Baselines for Chromosome Instance Segmentation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcbb/HuangLYCGZFLY22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/tcbb/HuangLYCGZFLY22> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'A Clinical Dataset and Various Baselines for Chromosome Instance Segmentation'?"],"info":{}}
{"id":"train_4077","question":"Mandayam T. Raghunath published the paper 'Designing a New Form Factor for Wearable Computing' in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pervasive/NarayanaswamiR02> dblp:authoredBy <https://dblp.org/pid/74/1222> . <https://dblp.org/rec/journals/pervasive/NarayanaswamiR02> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Designing a New Form Factor for Wearable Computing' authored by Mandayam T. Raghunath published?"],"info":{}}
{"id":"train_4080","question":"Find the venue of the paper 'Relational learning helps in three-way classification of Alzheimer patients from structural magnetic resonance images of the brain' authored by S. Joshi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mlc/NatarajanSJEKDK14> dblp:authoredBy <https://dblp.org/pid/32/4660> . <https://dblp.org/rec/journals/mlc/NatarajanSJEKDK14> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'Relational learning helps in three-way classification of Alzheimer patients from structural magnetic resonance images of the brain' authored by S. Joshi."],"info":{}}
{"id":"train_4082","question":"Mention the venues of the other papers published by the authors of 'HME: A Hyperbolic Metric Embedding Approach for Next-POI Recommendation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigir/FengTCCLL20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/sigir/FengTCCLL20> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'HME: A Hyperbolic Metric Embedding Approach for Next-POI Recommendation'?"],"info":{}}
{"id":"train_4083","question":"Mention the venue of the paper 'Adapting SQuaRE for Quality Assessment of Artificial Intelligence Systems' authored by Kuwajima, H..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1908-02134> dblp:authoredBy <https://dblp.org/pid/30/2301> . <https://dblp.org/rec/journals/corr/abs-1908-02134> dblp:publishedIn ?answer }","paraphrases":["Kuwajima, H. published the paper 'Adapting SQuaRE for Quality Assessment of Artificial Intelligence Systems' in which venue?"],"info":{}}
{"id":"train_4086","question":"List the venues of the other papers published by the authors of 'Alcohol consumption detection through behavioural analysis using intelligent systems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/eswa/RobinelP14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/eswa/RobinelP14> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Alcohol consumption detection through behavioural analysis using intelligent systems'?"],"info":{}}
{"id":"train_4087","question":"Find the venue of the paper 'Efficient Parallel Algorithms for Path Problems in Directed Graphs' authored by Joan M. Lucas.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/algorithmica/LucasS92> dblp:authoredBy <https://dblp.org/pid/90/187> . <https://dblp.org/rec/journals/algorithmica/LucasS92> dblp:publishedIn ?answer }","paraphrases":["Joan M. Lucas published the paper 'Efficient Parallel Algorithms for Path Problems in Directed Graphs' in which venue?"],"info":{}}
{"id":"train_4088","question":"Mention the venue of the paper 'Integrated LFSR Reseeding, Test-Access Optimization, and Test Scheduling for Core-Based System-on-Chip' authored by Seongmoon W..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcad/WangCW09> dblp:authoredBy <https://dblp.org/pid/02/1412> . <https://dblp.org/rec/journals/tcad/WangCW09> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Integrated LFSR Reseeding, Test-Access Optimization, and Test Scheduling for Core-Based System-on-Chip' authored by Seongmoon W.."],"info":{}}
{"id":"train_4089","question":"In which other years were the authors of 'Segmentation of Shadowed Buildings in Dense Urban Areas from Aerial Photographs' publishing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/remotesensing/Susaki12> dblp:authoredBy ?x . <https://dblp.org/rec/journals/remotesensing/Susaki12> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Segmentation of Shadowed Buildings in Dense Urban Areas from Aerial Photographs' published in which other years?"],"info":{}}
{"id":"train_4090","question":"Mention the venue of the paper 'Relatively Inexact Proximal Point Algorithm and Linear Convergence Analysis' authored by Ram U. Verma.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijmmsc/Verma09> dblp:authoredBy <https://dblp.org/pid/15/7004> . <https://dblp.org/rec/journals/ijmmsc/Verma09> dblp:publishedIn ?answer }","paraphrases":["Ram U. Verma published the paper 'Relatively Inexact Proximal Point Algorithm and Linear Convergence Analysis' in which venue?"],"info":{}}
{"id":"train_4091","question":"List the years in which the authors of 'VLBI phase-calibration system suitable for very-wide-band and ultra-high-frequency operation' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tim/KiuchiTKAM99> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tim/KiuchiTKAM99> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["Find the years in which the authors of 'VLBI phase-calibration system suitable for very-wide-band and ultra-high-frequency operation' published other papers."],"info":{}}
{"id":"train_4092","question":"List the venues of the other papers published by the authors of 'Interval Type-2 Fuzzy Logic Systems Made Simple'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tfs/MendelJL06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/tfs/MendelJL06> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'Interval Type-2 Fuzzy Logic Systems Made Simple'."],"info":{}}
{"id":"train_4094","question":"Find the years in which the authors of 'MultiResolution Complexity Analysis - A Novel Method for Partitioning Datasets into Regions of Different Classification Complexity' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icpram/ArmanoT15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icpram/ArmanoT15> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'MultiResolution Complexity Analysis - A Novel Method for Partitioning Datasets into Regions of Different Classification Complexity' publishing?"],"info":{}}
{"id":"train_4095","question":"Find the years in which the authors of 'Transfer Learning for the Choquet Integral' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fuzzIEEE/MurrayIPASHPE19> dblp:authoredBy ?x . <https://dblp.org/rec/conf/fuzzIEEE/MurrayIPASHPE19> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Transfer Learning for the Choquet Integral' published in which other years?"],"info":{}}
{"id":"train_4096","question":"Name the other publications published by the authors of 'Text Retrieval from Document Images Based on Word Shape Analysis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/apin/TanHSYX03> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/apin/TanHSYX03> ) }","paraphrases":["Which other papers were written by the authors of 'Text Retrieval from Document Images Based on Word Shape Analysis'?"],"info":{}}
{"id":"train_4097","question":"List the other publications published by the authors of 'A new domain decomposition for B-spline Neural Networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcnn/CabritaRK10> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/ijcnn/CabritaRK10> ) }","paraphrases":["Name the other publications published by the authors of 'A new domain decomposition for B-spline Neural Networks'."],"info":{}}
{"id":"train_4098","question":"Find the years in which the authors of 'Multi-viewport based 3D convolutional neural network for 360-degree video quality assessment' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mta/GuoHC22> dblp:authoredBy ?x . <https://dblp.org/rec/journals/mta/GuoHC22> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Multi-viewport based 3D convolutional neural network for 360-degree video quality assessment' published other papers."],"info":{}}
{"id":"train_4099","question":"Mention the venue of the paper 'New method for generating handwritten Chinese character samples' authored by Z. Pan.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/drr/ZhangPS97> dblp:authoredBy <https://dblp.org/pid/83/8389> . <https://dblp.org/rec/conf/drr/ZhangPS97> dblp:publishedIn ?answer }","paraphrases":["Zhi-geng Pan published the paper 'New method for generating handwritten Chinese character samples' in which venue?"],"info":{}}
{"id":"train_4101","question":"Find the venue of the paper 'Low-Complexity Distributed-Arithmetic-Based Pipelined Architecture for an LSTM Network' authored by Khan, Mohd. Tasleem.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvlsi/YalamarthyDKS20> dblp:authoredBy <https://dblp.org/pid/198/2061> . <https://dblp.org/rec/journals/tvlsi/YalamarthyDKS20> dblp:publishedIn ?answer }","paraphrases":["Mohd. Tasleem Khan published the paper 'Low-Complexity Distributed-Arithmetic-Based Pipelined Architecture for an LSTM Network' in which venue?"],"info":{}}
{"id":"train_4104","question":"Find the years in which the authors of 'Collaborative robots are rapidly providing major improvements in productivity, safety, programing ease, portability and cost while addressing many new applications' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/irob/Bloss16> dblp:authoredBy ?x . <https://dblp.org/rec/journals/irob/Bloss16> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Collaborative robots are rapidly providing major improvements in productivity, safety, programing ease, portability and cost while addressing many new applications' publishing?"],"info":{}}
{"id":"train_4109","question":"List the other publications published by the authors of 'On the power of structural decompositions of graph-based representations of constraint problems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ai/GrecoS10> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/ai/GrecoS10> ) }","paraphrases":["Which other publications were published by the authors of 'On the power of structural decompositions of graph-based representations of constraint problems'?"],"info":{}}
{"id":"train_4110","question":"Mention the venues of the other papers published by the authors of 'Adaptive Serious Games for Emergency Evacuation Training'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/incos/CapuanoK15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/incos/CapuanoK15> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'Adaptive Serious Games for Emergency Evacuation Training'?"],"info":{}}
{"id":"train_4112","question":"What are the webpages of authors of 'Electronic Lottery Tickets as Micropayments'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fc/Rivest97a> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Electronic Lottery Tickets as Micropayments' have which webpages?"],"info":{}}
{"id":"train_4114","question":"List the years in which the authors of 'Pan-Sharpening Based on Transformer With Redundancy Reduction' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/lgrs/ZhangLZWS22> dblp:authoredBy ?x . <https://dblp.org/rec/journals/lgrs/ZhangLZWS22> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Pan-Sharpening Based on Transformer With Redundancy Reduction' publishing?"],"info":{}}
{"id":"train_4116","question":"List the venues of the other papers published by the authors of 'The knowledge web: Learning and collaborating on the web'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ets/Paliwala99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/ets/Paliwala99> ) }","paraphrases":["In which venues were the other papers published by the authors of 'The knowledge web: Learning and collaborating on the web'?"],"info":{}}
{"id":"train_4119","question":"Find the venue of the paper 'A combined hierarchical and steepest-descent clustering algorithm' authored by Mel A. Colter.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/isci/Colter79> dblp:authoredBy <https://dblp.org/pid/25/2049> . <https://dblp.org/rec/journals/isci/Colter79> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'A combined hierarchical and steepest-descent clustering algorithm' authored by Mel A. Colter."],"info":{}}
{"id":"train_4120","question":"Find the years in which the authors of 'Quasi-Monte Carlo methods for the Kou model' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mcma/Baldeaux08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/mcma/Baldeaux08> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Quasi-Monte Carlo methods for the Kou model' published in which other years?"],"info":{}}
{"id":"train_4121","question":"Name the other publications published by the authors of 'Voronoia: analyzing packing in protein structures'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/nar/RotherHGGP09> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/nar/RotherHGGP09> ) }","paraphrases":["List the other publications published by the authors of 'Voronoia: analyzing packing in protein structures'."],"info":{}}
{"id":"train_4124","question":"Name the other publications published by the authors of 'Design of a Low-Power and Low-Latency MAC Protocol with Nodes Grouping and Transmission Pipelining in Wireless Sensor Networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vtc/ChenWC08> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/vtc/ChenWC08> ) }","paraphrases":["Which other publications were published by the authors of 'Design of a Low-Power and Low-Latency MAC Protocol with Nodes Grouping and Transmission Pipelining in Wireless Sensor Networks'?"],"info":{}}
{"id":"train_4125","question":"The authors of 'A Privacy Protection Evaluation Mechanism for Dynamic Data Based on Chunk-Confusion' published in which other years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/vlsisp/ShiCZC17> dblp:authoredBy ?x . <https://dblp.org/rec/journals/vlsisp/ShiCZC17> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'A Privacy Protection Evaluation Mechanism for Dynamic Data Based on Chunk-Confusion' publishing?"],"info":{}}
{"id":"train_4130","question":"In which other years were the authors of 'Oscillatory behavior of the second order functional differential equations' publishing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/appml/Baculikova17> dblp:authoredBy ?x . <https://dblp.org/rec/journals/appml/Baculikova17> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Oscillatory behavior of the second order functional differential equations' published in which other years?"],"info":{}}
{"id":"train_4131","question":"List the years in which the authors of 'Reflections on industrial research [leadership reflections]' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spm/Winters05> dblp:authoredBy ?x . <https://dblp.org/rec/journals/spm/Winters05> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Reflections on industrial research [leadership reflections]' published in which other years?"],"info":{}}
{"id":"train_4132","question":"Name the other publications published by the authors of 'Modeling and Analysis of the Uplink Local Delay in MEC-Based VANETs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvt/WuZ20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/tvt/WuZ20> ) }","paraphrases":["Which other publications were published by the authors of 'Modeling and Analysis of the Uplink Local Delay in MEC-Based VANETs'?"],"info":{}}
{"id":"train_4133","question":"List the other publications published by the authors of 'Exploring the Underlying Structure of Personal Web Usage in the Workplace'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cbsn/AnandarajanSD11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/cbsn/AnandarajanSD11> ) }","paraphrases":["Which other papers were written by the authors of 'Exploring the Underlying Structure of Personal Web Usage in the Workplace'?"],"info":{}}
{"id":"train_4134","question":"Find the years in which the authors of 'Multinational R&D in China: differentiation and integration of global R&D networks' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijtm/WangLX14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijtm/WangLX14> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Multinational R&D in China: differentiation and integration of global R&D networks' published other papers."],"info":{}}
{"id":"train_4135","question":"List the venues of the other papers published by the authors of 'Multidisciplinary Learning Material and Effect in a Technological University - A Case Study of Technology and Life Application in General Education'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icitl/ShuC18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/icitl/ShuC18> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'Multidisciplinary Learning Material and Effect in a Technological University - A Case Study of Technology and Life Application in General Education'?"],"info":{}}
{"id":"train_4136","question":"Mention the venues of the other papers published by the authors of 'GTTC: A Low-Expenditure IoT Multi-Task Coordinated Distributed Computing Framework with Fog Computing'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/globecom/XiaoXCZM19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/globecom/XiaoXCZM19> ) }","paraphrases":["In which venues were the other papers published by the authors of 'GTTC: A Low-Expenditure IoT Multi-Task Coordinated Distributed Computing Framework with Fog Computing'?"],"info":{}}
{"id":"train_4140","question":"The authors of 'A System-Wide Approach to Physician Efficiency and Utilization Rates for Non-Operating Room Anesthesia Sites' have which webpages?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jms/TsaiHBOEU17> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'A System-Wide Approach to Physician Efficiency and Utilization Rates for Non-Operating Room Anesthesia Sites'?"],"info":{}}
{"id":"train_4141","question":"List the other publications published by the authors of 'Statistical profile of science and technology in India and Brazil'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/scientometrics/Sikka97> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/scientometrics/Sikka97> ) }","paraphrases":["Name the other publications published by the authors of 'Statistical profile of science and technology in India and Brazil'."],"info":{}}
{"id":"train_4142","question":"Find the venue of the paper 'Intelligent Computation Offloading for MEC-Based Cooperative Vehicle Infrastructure System: A Deep Reinforcement Learning Approach' authored by Feng, Zhiyong.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvt/YangW0CL022> dblp:authoredBy <https://dblp.org/pid/48/195-1> . <https://dblp.org/rec/journals/tvt/YangW0CL022> dblp:publishedIn ?answer }","paraphrases":["Zhiyong Feng published the paper 'Intelligent Computation Offloading for MEC-Based Cooperative Vehicle Infrastructure System: A Deep Reinforcement Learning Approach' in which venue?"],"info":{}}
{"id":"train_4143","question":"Maria L. published the paper 'Nowcasting the Stance of Social Media Users in a Sudden Vote: The Case of the Greek Referendum' in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cikm/TsakalidisACL18> dblp:authoredBy <https://dblp.org/pid/65/6264> . <https://dblp.org/rec/conf/cikm/TsakalidisACL18> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Nowcasting the Stance of Social Media Users in a Sudden Vote: The Case of the Greek Referendum' authored by Maria L. published?"],"info":{}}
{"id":"train_4144","question":"Find the venue of the paper 'Timing Analysis Using Functional Analysis' authored by Iyengar, Vijay S..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tc/BrandI88> dblp:authoredBy <https://dblp.org/pid/60/6657> . <https://dblp.org/rec/journals/tc/BrandI88> dblp:publishedIn ?answer }","paraphrases":["Iyengar, Vijay S. published the paper 'Timing Analysis Using Functional Analysis' in which venue?"],"info":{}}
{"id":"train_4146","question":"List the years in which the authors of 'Service domains' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ibmsj/TanVXTD04> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ibmsj/TanVXTD04> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Service domains' publishing?"],"info":{}}
{"id":"train_4148","question":"List the years in which the authors of 'On the Weak Consistency of Permutation Tests' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cssc/PesarinS13> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cssc/PesarinS13> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'On the Weak Consistency of Permutation Tests' publishing?"],"info":{}}
