{"id":"train_6006","question":"In 2012 in J. Syst. Control. Eng., who are the authors that published papers about Motor systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jsce/TsaiH12> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jsce/TsaiH12> dblp:publishedIn 'J. Syst. Control. Eng.' . <https://dblp.org/rec/journals/jsce/TsaiH12> dblp:yearOfPublication '2012' }","paraphrases":["Who are the authors that published papers about Motor systems in J. Syst. Control. Eng. in 2012?"],"info":{}}
{"id":"train_6007","question":"In the year 2005 in J. Inf. Commun. Ethics Soc., who are the authors that published research papers about Non-?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jices/Vedder05> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jices/Vedder05> dblp:publishedIn 'J. Inf. Commun. Ethics Soc.' . <https://dblp.org/rec/journals/jices/Vedder05> dblp:yearOfPublication '2005' }","paraphrases":["Who are the authors that published papers about Non- in J. Inf. Commun. Ethics Soc. in 2005?"],"info":{}}
{"id":"train_6008","question":"Who are the authors that published papers about Point regression in IEEE Trans. Geosci. Remote. Sens. in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tgrs/ZhangALFWGLD21> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/tgrs/ZhangALFWGLD21> dblp:publishedIn 'IEEE Trans. Geosci. Remote. Sens.' . <https://dblp.org/rec/journals/tgrs/ZhangALFWGLD21> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in IEEE Trans. Geosci. Remote. Sens., who are the authors that published papers about Point regression?"],"info":{}}
{"id":"train_6009","question":"Carnegie Mellon University, Electrical and Computer Engineering, Pittsburgh, PA, USA published a paper on Domain dereverberation in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icassp/KumarSRS11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Carnegie Mellon University, Electrical and Computer Engineering, Pittsburgh, PA, USA' . <https://dblp.org/rec/conf/icassp/KumarSRS11> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Domain dereverberation by Carnegie Mellon University published?"],"info":{}}
{"id":"train_6010","question":"In Neural Comput. Appl. in 2021, what are the titles of the papers on Bearing capacity?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/nca/MoayediR21> dblp:publishedIn 'Neural Comput. Appl.' . <https://dblp.org/rec/journals/nca/MoayediR21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/nca/MoayediR21> dblp:title ?answer }","paraphrases":["In 2021 in Neural Comput. Appl., what are the titles of the papers on Bearing capacity?"],"info":{}}
{"id":"train_6011","question":"In 2009 in International Conference on Complex, Intelligent and Software Intensive Systems, what are the titles of the papers on Region protection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cisis-spain/TzouveliNK08> dblp:publishedIn 'CISIS' . <https://dblp.org/rec/conf/cisis-spain/TzouveliNK08> dblp:yearOfPublication '2009' . <https://dblp.org/rec/conf/cisis-spain/TzouveliNK08> dblp:title ?answer }","paraphrases":["In the year 2009 in CISIS, what are the titles of the research papers on Region protection?"],"info":{}}
{"id":"train_6012","question":"In 2017 in Comput. Optim. Appl., what are the titles of the papers on Hjb equations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/coap/KangW17> dblp:publishedIn 'Comput. Optim. Appl.' . <https://dblp.org/rec/journals/coap/KangW17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/journals/coap/KangW17> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Hjb equations that were published in Comput. Optim. Appl. in 2017?"],"info":{}}
{"id":"train_6013","question":"In 2017 in PLoS Comput. Biol., who are the authors that published papers about Ion channel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ploscb/MartinMCCC17> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ploscb/MartinMCCC17> dblp:publishedIn 'PLoS Comput. Biol.' . <https://dblp.org/rec/journals/ploscb/MartinMCCC17> dblp:yearOfPublication '2017' }","paraphrases":["In PLoS Comput. Biol. in 2017, who are the authors that published papers about Ion channel?"],"info":{}}
{"id":"train_6014","question":"In International Symposium on Technology and Society in 2015, who are the authors that published papers about Bungee research?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/istas/DeardenT15> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/istas/DeardenT15> dblp:publishedIn 'ISTAS' . <https://dblp.org/rec/conf/istas/DeardenT15> dblp:yearOfPublication '2015' }","paraphrases":["Who are the authors that published papers about Bungee research in ISTAS in 2015?"],"info":{}}
{"id":"train_6015","question":"In the year 2017 in IJCAI, what are the titles of the research papers on Shapley algorithm?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcai/VaishG17> dblp:publishedIn 'IJCAI' . <https://dblp.org/rec/conf/ijcai/VaishG17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/conf/ijcai/VaishG17> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Shapley algorithm that were published in International Joint Conference on Artificial Intelligence in 2017?"],"info":{}}
{"id":"train_6016","question":"In the year 2013 in Sensors, who are the authors that published research papers about Rate gyro?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/SuFLLL13> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/sensors/SuFLLL13> dblp:publishedIn 'Sensors' . <https://dblp.org/rec/journals/sensors/SuFLLL13> dblp:yearOfPublication '2013' }","paraphrases":["In Sensors in 2013, who are the authors that published papers about Rate gyro?"],"info":{}}
{"id":"train_6017","question":"In the year 1986 in ACM SIGCSE Bull., who are the authors that published research papers about Computer graphics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigcse/Mahoney86> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/sigcse/Mahoney86> dblp:publishedIn 'ACM SIGCSE Bull.' . <https://dblp.org/rec/journals/sigcse/Mahoney86> dblp:yearOfPublication '1986' }","paraphrases":["Who are the authors that published papers about Computer graphics in ACM SIGCSE Bull. in 1986?"],"info":{}}
{"id":"train_6018","question":"In Bus. Process. Manag. J. in 2004, who are the authors that published papers about Business processes?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bpmj/Grieger04> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/bpmj/Grieger04> dblp:publishedIn 'Bus. Process. Manag. J.' . <https://dblp.org/rec/journals/bpmj/Grieger04> dblp:yearOfPublication '2004' }","paraphrases":["In 2004 in Bus. Process. Manag. J., who are the authors that published papers about Business processes?"],"info":{}}
{"id":"train_6019","question":"In GIIS in 2019, who are the authors that published papers about Consensus mechanisms?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/giis/CarraraRAM19> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/giis/CarraraRAM19> dblp:publishedIn 'GIIS' . <https://dblp.org/rec/conf/giis/CarraraRAM19> dblp:yearOfPublication '2019' }","paraphrases":["Who are the authors that published papers about Consensus mechanisms in GIIS in 2019?"],"info":{}}
{"id":"train_6020","question":"When was the research paper on Peucker line by University of Hull, Hull, UK published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spe/VaughanWB91> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Hull, Hull, UK' . <https://dblp.org/rec/journals/spe/VaughanWB91> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Peucker line by University of Hull published?"],"info":{}}
{"id":"train_6021","question":"What are the titles of the papers on Shelf interconnection that were published in OFC in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ofc/MoraisP16> dblp:publishedIn 'OFC' . <https://dblp.org/rec/conf/ofc/MoraisP16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/conf/ofc/MoraisP16> dblp:title ?answer }","paraphrases":["In the year 2016 in OFC, what are the titles of the research papers on Shelf interconnection?"],"info":{}}
{"id":"train_6022","question":"In MASCOTS in 2006, who are the authors that published papers about Performance network?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mascots/ApostolopoulosH06> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/mascots/ApostolopoulosH06> dblp:publishedIn 'MASCOTS' . <https://dblp.org/rec/conf/mascots/ApostolopoulosH06> dblp:yearOfPublication '2006' }","paraphrases":["Who are the authors that published papers about Performance network in Symposium Model Analysis and Simulation of Computer and Telecommunications Systems in 2006?"],"info":{}}
{"id":"train_6023","question":"Who are the authors that published papers about Deficiency compensation in ICASSP in 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icassp/SeilerK08> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icassp/SeilerK08> dblp:publishedIn 'ICASSP' . <https://dblp.org/rec/conf/icassp/SeilerK08> dblp:yearOfPublication '2008' }","paraphrases":["In ICASSP in 2008, who are the authors that published papers about Deficiency compensation?"],"info":{}}
{"id":"train_6024","question":"In GCCE in 2021, what are the titles of the papers on Data rate?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gcce/KawadeCK21> dblp:publishedIn 'GCCE' . <https://dblp.org/rec/conf/gcce/KawadeCK21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/conf/gcce/KawadeCK21> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Data rate that were published in GCCE in 2021?"],"info":{}}
{"id":"train_6025","question":"In 2001 in IDEAS, who are the authors that published papers about Time decision support?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ideas/DelicDD01> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ideas/DelicDD01> dblp:publishedIn 'IDEAS' . <https://dblp.org/rec/conf/ideas/DelicDD01> dblp:yearOfPublication '2001' }","paraphrases":["In the year 2001 in International Database Engineering and Applications Symposium, who are the authors that published research papers about Time decision support?"],"info":{}}
{"id":"train_6026","question":"In the year 2004 in Numer. Algorithms, who are the authors that published research papers about Network inventory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/na/Chausova04> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/na/Chausova04> dblp:publishedIn 'Numer. Algorithms' . <https://dblp.org/rec/journals/na/Chausova04> dblp:yearOfPublication '2004' }","paraphrases":["In Numer. Algorithms in 2004, who are the authors that published papers about Network inventory?"],"info":{}}
{"id":"train_6027","question":"Mention the year in which University of Central Florida published a paper on Novelty search.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gecco/LehmanS11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Central Florida, Orlando, USA' . <https://dblp.org/rec/conf/gecco/LehmanS11> dblp:yearOfPublication ?answer }","paraphrases":["University of Central Florida, Orlando, USA published a paper on Novelty search in what year?"],"info":{}}
{"id":"train_6028","question":"In the year 2014 in Electron. Notes Discret. Math., what are the titles of the research papers on Adjacency algebras?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/endm/Sharafdini14> dblp:publishedIn 'Electron. Notes Discret. Math.' . <https://dblp.org/rec/journals/endm/Sharafdini14> dblp:yearOfPublication '2014' . <https://dblp.org/rec/journals/endm/Sharafdini14> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Adjacency algebras that were published in Electron. Notes Discret. Math. in 2014?"],"info":{}}
{"id":"train_6029","question":"In 2011 in CSEE, what are the titles of the papers on Oilseed rape?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/csee2/ZhuLSH11> dblp:publishedIn 'CSEE (2)' . <https://dblp.org/rec/conf/csee2/ZhuLSH11> dblp:yearOfPublication '2011' . <https://dblp.org/rec/conf/csee2/ZhuLSH11> dblp:title ?answer }","paraphrases":["In CSEE (2) in 2011, what are the titles of the papers on Oilseed rape?"],"info":{}}
{"id":"train_6031","question":"Who are the authors that published papers about Model retrieval in Int. J. Geogr. Inf. Sci. in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/gis/WangZTLF17> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/gis/WangZTLF17> dblp:publishedIn 'Int. J. Geogr. Inf. Sci.' . <https://dblp.org/rec/journals/gis/WangZTLF17> dblp:yearOfPublication '2017' }","paraphrases":["In the year 2017 in Int. J. Geogr. Inf. Sci., who are the authors that published research papers about Model retrieval?"],"info":{}}
{"id":"train_6032","question":"In J. Cheminformatics in 2013, who are the authors that published papers about Type zeolite?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcheminf/StueckenschneiderMMS13> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jcheminf/StueckenschneiderMMS13> dblp:publishedIn 'J. Cheminformatics' . <https://dblp.org/rec/journals/jcheminf/StueckenschneiderMMS13> dblp:yearOfPublication '2013' }","paraphrases":["Who are the authors that published papers about Type zeolite in J. Cheminformatics in 2013?"],"info":{}}
{"id":"train_6033","question":"In 2012 in International Conference on Parallel Processing, what are the titles of the papers on Reputation systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icpp/LiSS12> dblp:publishedIn 'ICPP' . <https://dblp.org/rec/conf/icpp/LiSS12> dblp:yearOfPublication '2012' . <https://dblp.org/rec/conf/icpp/LiSS12> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Reputation systems that were published in International Conference on Parallel Processing in 2012?"],"info":{}}
{"id":"train_6034","question":"In Eng. Appl. Artif. Intell. in 2019, who are the authors that published papers about Noise reduction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/eaai/HenriquezR19> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/eaai/HenriquezR19> dblp:publishedIn 'Eng. Appl. Artif. Intell.' . <https://dblp.org/rec/journals/eaai/HenriquezR19> dblp:yearOfPublication '2019' }","paraphrases":["In 2019 in Eng. Appl. Artif. Intell., who are the authors that published papers about Noise reduction?"],"info":{}}
{"id":"train_6035","question":"What are the titles of the papers on Time span that were published in Quantum Inf. Comput. in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/qic/Fassarella15> dblp:publishedIn 'Quantum Inf. Comput.' . <https://dblp.org/rec/journals/qic/Fassarella15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/journals/qic/Fassarella15> dblp:title ?answer }","paraphrases":["In 2015 in Quantum Inf. Comput., what are the titles of the papers on Time span?"],"info":{}}
{"id":"train_6036","question":"Who are the authors that published papers about Fuel cell in Proc. IEEE in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pieee/Chan07a> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/pieee/Chan07a> dblp:publishedIn 'Proc. IEEE' . <https://dblp.org/rec/journals/pieee/Chan07a> dblp:yearOfPublication '2007' }","paraphrases":["In Proc. IEEE in 2007, who are the authors that published papers about Fuel cell?"],"info":{}}
{"id":"train_6037","question":"In 2009 in International Conference on Interactive Digital Storytelling, what are the titles of the papers on Cyber fiction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icids/Drinkall09> dblp:publishedIn 'ICIDS' . <https://dblp.org/rec/conf/icids/Drinkall09> dblp:yearOfPublication '2009' . <https://dblp.org/rec/conf/icids/Drinkall09> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Cyber fiction that were published in International Conference on Interactive Digital Storytelling in 2009?"],"info":{}}
{"id":"train_6038","question":"In the year 2019 in IEEE J. Biomed. Health Informatics, what are the titles of the research papers on Blood pressure?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/titb/JoshiG19> dblp:publishedIn 'IEEE J. Biomed. Health Informatics' . <https://dblp.org/rec/journals/titb/JoshiG19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/journals/titb/JoshiG19> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Blood pressure that were published in IEEE J. Biomed. Health Informatics in 2019?"],"info":{}}
{"id":"train_6039","question":"In 2014 in Int. J. Syst. Sci., who are the authors that published papers about Failure network?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijsysc/HuangL14> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ijsysc/HuangL14> dblp:publishedIn 'Int. J. Syst. Sci.' . <https://dblp.org/rec/journals/ijsysc/HuangL14> dblp:yearOfPublication '2014' }","paraphrases":["In the year 2014 in Int. J. Syst. Sci., who are the authors that published research papers about Failure network?"],"info":{}}
{"id":"train_6040","question":"In the year 2018 in IEEE Trans. Cybern., who are the authors that published research papers about Velocity estimation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcyb/LiLJWF18> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/tcyb/LiLJWF18> dblp:publishedIn 'IEEE Trans. Cybern.' . <https://dblp.org/rec/journals/tcyb/LiLJWF18> dblp:yearOfPublication '2018' }","paraphrases":["In 2018 in IEEE Trans. Cybern., who are the authors that published papers about Velocity estimation?"],"info":{}}
{"id":"train_6041","question":"In 2018 in CoRR, who are the authors that published papers about Video classification?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1807-01026> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-1807-01026> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-1807-01026> dblp:yearOfPublication '2018' }","paraphrases":["In CoRR in 2018, who are the authors that published papers about Video classification?"],"info":{}}
{"id":"train_6042","question":"In the year 2004 in IEEE International Conference on Computer and Information Technology, what are the titles of the research papers on Information technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cit/XiaWS04> dblp:publishedIn 'CIT' . <https://dblp.org/rec/conf/cit/XiaWS04> dblp:yearOfPublication '2004' . <https://dblp.org/rec/conf/cit/XiaWS04> dblp:title ?answer }","paraphrases":["In 2004 in IEEE International Conference on Computer and Information Technology, what are the titles of the papers on Information technology?"],"info":{}}
{"id":"train_6043","question":"Who are the authors that published papers about Interface tool in ICRA in 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icra/GowdyB99> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icra/GowdyB99> dblp:publishedIn 'ICRA' . <https://dblp.org/rec/conf/icra/GowdyB99> dblp:yearOfPublication '1999' }","paraphrases":["In the year 1999 in ICRA, who are the authors that published research papers about Interface tool?"],"info":{}}
{"id":"train_6044","question":"In the year 2018 in IEEE Trans. Medical Imaging, what are the titles of the research papers on Frequency conductivity tensor imaging?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tmi/ChauhanIKSMS18> dblp:publishedIn 'IEEE Trans. Medical Imaging' . <https://dblp.org/rec/journals/tmi/ChauhanIKSMS18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/tmi/ChauhanIKSMS18> dblp:title ?answer }","paraphrases":["In 2018 in IEEE Trans. Medical Imaging, what are the titles of the papers on Frequency conductivity tensor imaging?"],"info":{}}
{"id":"train_6045","question":"In the year 2006 in KR, who are the authors that published research papers about Description logics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/kr/CalvaneseGLLR06> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/kr/CalvaneseGLLR06> dblp:publishedIn 'KR' . <https://dblp.org/rec/conf/kr/CalvaneseGLLR06> dblp:yearOfPublication '2006' }","paraphrases":["In International Conference on the Principles of Knowledge Representation and Reasoning in 2006, who are the authors that published papers about Description logics?"],"info":{}}
{"id":"train_6046","question":"In ICCE in 2017, what are the titles of the papers on Stereo image defogging?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccel/KimPPP17> dblp:publishedIn 'ICCE' . <https://dblp.org/rec/conf/iccel/KimPPP17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/conf/iccel/KimPPP17> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Stereo image defogging that were published in International Conference on Computers in Education in 2017?"],"info":{}}
{"id":"train_6047","question":"In 2013 in IEEE Conference on Computer Vision and Pattern Recognition, what are the titles of the papers on Tag taxonomy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cvpr/ZhengJ13> dblp:publishedIn 'CVPR' . <https://dblp.org/rec/conf/cvpr/ZhengJ13> dblp:yearOfPublication '2013' . <https://dblp.org/rec/conf/cvpr/ZhengJ13> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Tag taxonomy that were published in IEEE Conference on Computer Vision and Pattern Recognition in 2013?"],"info":{}}
{"id":"train_6048","question":"In Cryptologia in 1995, who are the authors that published papers about Hand cipher system part?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cryptologia/Meulen95a> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/cryptologia/Meulen95a> dblp:publishedIn 'Cryptologia' . <https://dblp.org/rec/journals/cryptologia/Meulen95a> dblp:yearOfPublication '1995' }","paraphrases":["Who are the authors that published papers about Hand cipher system part in Cryptologia in 1995?"],"info":{}}
{"id":"train_6049","question":"In IEEE Access in 2021, who are the authors that published papers about Bit security?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/LeeKN21a> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/access/LeeKN21a> dblp:publishedIn 'IEEE Access' . <https://dblp.org/rec/journals/access/LeeKN21a> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in IEEE Access, who are the authors that published papers about Bit security?"],"info":{}}
{"id":"train_6050","question":"What are the titles of the papers on Precision positionning that were published in ECC in 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eucc/BoichotDDLP99> dblp:publishedIn 'ECC' . <https://dblp.org/rec/conf/eucc/BoichotDDLP99> dblp:yearOfPublication '1999' . <https://dblp.org/rec/conf/eucc/BoichotDDLP99> dblp:title ?answer }","paraphrases":["In the year 1999 in ECC, what are the titles of the research papers on Precision positionning?"],"info":{}}
{"id":"train_6051","question":"In 2022 in CoRR, what are the titles of the papers on Prediction market?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2201-06924> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2201-06924> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2201-06924> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Prediction market that were published in CoRR in 2022?"],"info":{}}
{"id":"train_6052","question":"What are the titles of the papers on Optimization approach that were published in Sensors in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/WangC17> dblp:publishedIn 'Sensors' . <https://dblp.org/rec/journals/sensors/WangC17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/journals/sensors/WangC17> dblp:title ?answer }","paraphrases":["In the year 2017 in Sensors, what are the titles of the research papers on Optimization approach?"],"info":{}}
{"id":"train_6054","question":"In IEEE International Geoscience and Remote Sensing Symposium in 2012, what are the titles of the papers on Monitoring applications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/igarss/BaumgartnerK12> dblp:publishedIn 'IGARSS' . <https://dblp.org/rec/conf/igarss/BaumgartnerK12> dblp:yearOfPublication '2012' . <https://dblp.org/rec/conf/igarss/BaumgartnerK12> dblp:title ?answer }","paraphrases":["In 2012 in IEEE International Geoscience and Remote Sensing Symposium, what are the titles of the papers on Monitoring applications?"],"info":{}}
{"id":"train_6055","question":"When was the research paper on -b by Royal Institute of Technology published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/eccc/ECCC-TR99-039> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Royal Institute of Technology, Stockholm, Sweden' . <https://dblp.org/rec/journals/eccc/ECCC-TR99-039> dblp:yearOfPublication ?answer }","paraphrases":["Royal Institute of Technology, Stockholm, Sweden published a paper on -b in what year?"],"info":{}}
{"id":"train_6057","question":"In 2020 in DICTA, who are the authors that published papers about Fish detection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dicta/ShenN20> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/dicta/ShenN20> dblp:publishedIn 'DICTA' . <https://dblp.org/rec/conf/dicta/ShenN20> dblp:yearOfPublication '2020' }","paraphrases":["In the year 2020 in Digital Image Computing Techniques and Applications, who are the authors that published research papers about Fish detection?"],"info":{}}
{"id":"train_6058","question":"In the year 1993 in CAV, what are the titles of the research papers on Logic model?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cav/ClarkeFJ93> dblp:publishedIn 'CAV' . <https://dblp.org/rec/conf/cav/ClarkeFJ93> dblp:yearOfPublication '1993' . <https://dblp.org/rec/conf/cav/ClarkeFJ93> dblp:title ?answer }","paraphrases":["In 1993 in Computer Aided Verification, what are the titles of the papers on Logic model?"],"info":{}}
{"id":"train_6059","question":"In i-com in 2008, what are the titles of the papers on Branchenreport usability?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/icom/DiefenbachH08> dblp:publishedIn 'i-com' . <https://dblp.org/rec/journals/icom/DiefenbachH08> dblp:yearOfPublication '2008' . <https://dblp.org/rec/journals/icom/DiefenbachH08> dblp:title ?answer }","paraphrases":["In the year 2008 in i-com, what are the titles of the research papers on Branchenreport usability?"],"info":{}}
{"id":"train_6060","question":"In the year 2014 in AIM, who are the authors that published research papers about Extremity rehabilitation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aimech/LiQWJS14> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/aimech/LiQWJS14> dblp:publishedIn 'AIM' . <https://dblp.org/rec/conf/aimech/LiQWJS14> dblp:yearOfPublication '2014' }","paraphrases":["In 2014 in AIM, who are the authors that published papers about Extremity rehabilitation?"],"info":{}}
{"id":"train_6061","question":"In the year 1997 in J. Comput. Biol., what are the titles of the research papers on Sequence alignment?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcb/Benson97> dblp:publishedIn 'J. Comput. Biol.' . <https://dblp.org/rec/journals/jcb/Benson97> dblp:yearOfPublication '1997' . <https://dblp.org/rec/journals/jcb/Benson97> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Sequence alignment that were published in J. Comput. Biol. in 1997?"],"info":{}}
{"id":"train_6062","question":"In 1991 in AI Commun., who are the authors that published papers about Task level frameworks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/aicom/Sstolze91> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/aicom/Sstolze91> dblp:publishedIn 'AI Commun.' . <https://dblp.org/rec/journals/aicom/Sstolze91> dblp:yearOfPublication '1991' }","paraphrases":["Who are the authors that published papers about Task level frameworks in AI Commun. in 1991?"],"info":{}}
