{"id":"train_2445","question":"What papers did K. Chen publish in Int. J. Prod. Res. and APSIPA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/130/0891> { ?answer dblp:publishedIn 'Int. J. Prod. Res.' } UNION { ?answer dblp:publishedIn 'APSIPA' } }","paraphrases":["In Int. J. Prod. Res. and APSIPA, what papers did Kuen-Suan Chen publish?"],"info":{}}
{"id":"train_2446","question":"List all the papers that Felix Lindner and Bentzen, Martin Mose published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/25/2707-1> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/45/8414> } }","paraphrases":["What are the papers that Lindner, Felix and Bentzen, Martin Mose published?"],"info":{}}
{"id":"train_2448","question":"List all the primary affiliations of G. C\\u00E1mara Ch\\u00E1vez and Edward Cayllahua.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/147/6674> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/152/8330> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of G. C\\u00E1mara Ch\\u00E1vez and Edward Cayllahua?"],"info":{}}
{"id":"train_2449","question":"What papers did Yang Xiang publish in IEEE Trans. Parallel Distributed Syst. and ICATPN?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/50/2192-1> { ?answer dblp:publishedIn 'IEEE Trans. Parallel Distributed Syst.' } UNION { ?answer dblp:publishedIn 'ICATPN' } }","paraphrases":["In IEEE Trans. Parallel Distributed Syst. and ICATPN, what papers did Yang X. publish?"],"info":{}}
{"id":"train_2450","question":"Name the author who published the paper on Engineering graphics and has the name Long.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cad/PengLL14> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Engineering graphics and has the name Min?"],"info":{}}
{"id":"train_2451","question":"Which author published the paper on Delay variations and has the name Ji?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/DongCGJYC19> dblp:authoredBy ?answer }","paraphrases":["Which author named Ji published the paper on Delay variations?"],"info":{}}
{"id":"train_2452","question":"Mention the publication on Feature selection that was published by Tarik in Int. J. Inf. Syst. Model. Des..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/186/7642> . ?answer dblp:publishedIn 'Int. J. Inf. Syst. Model. Des.' }","paraphrases":["Which paper on Feature selection was published by Tarik in Int. J. Inf. Syst. Model. Des.?"],"info":{}}
{"id":"train_2454","question":"Name the venue in which Luping published the paper about Class separability.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tnn/ZhouWS10> dblp:authoredBy <https://dblp.org/pid/45/933> . <https://dblp.org/rec/journals/tnn/ZhouWS10> dblp:publishedIn ?answer }","paraphrases":["In which venue did Luping publish the paper about Class separability?"],"info":{}}
{"id":"train_2455","question":"Name the author who published the paper on Image translation and has the name Shan.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2007-14050> dblp:authoredBy ?answer }","paraphrases":["Which author named Shan published the paper on Image translation?"],"info":{}}
{"id":"train_2456","question":"Which paper on Ac inverter was published by Gulez in Simul. Model. Pract. Theory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/4014> . ?answer dblp:publishedIn 'Simul. Model. Pract. Theory' }","paraphrases":["Which research paper on Ac inverter was published by Kayhan in Simul. Model. Pract. Theory?"],"info":{}}
{"id":"train_2457","question":"Mention the publication on Face recognition that was published by Singh in BTAS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/75/3512> . ?answer dblp:publishedIn 'BTAS' }","paraphrases":["Which research paper on Face recognition was published by Singh in BTAS?"],"info":{}}
{"id":"train_2458","question":"Which research paper on Wind scenarios was published by Analui in SSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/184/9184> . ?answer dblp:publishedIn 'SSP' }","paraphrases":["Which paper on Wind scenarios was published by Bita in SSP?"],"info":{}}
{"id":"train_2459","question":"Which research paper on Adams relaxations was published by Thapper in SIAM J. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/77/4663> . ?answer dblp:publishedIn 'SIAM J. Comput.' }","paraphrases":["Which paper on Adams relaxations was published by Johan in SIAM J. Comput.?"],"info":{}}
{"id":"train_2461","question":"Name the author who published the paper on Radio resource and has the name Stephen.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/crowncom/AhmedHKPM09> dblp:authoredBy ?answer }","paraphrases":["Which author named Stephen published the paper on Radio resource?"],"info":{}}
{"id":"train_2463","question":"Which author published the paper on Analyzer generator and has the name Nawrocki?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ipl/Nawrocki91> dblp:authoredBy ?answer }","paraphrases":["Which author named Nawrocki published the paper on Analyzer generator?"],"info":{}}
{"id":"train_2464","question":"Which research paper on Linear systems was published by Tarbouriech in IEEE Trans. Autom. Control.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/819> . ?answer dblp:publishedIn 'IEEE Trans. Autom. Control.' }","paraphrases":["Which paper on Linear systems was published by Sophie in IEEE Trans. Autom. Control.?"],"info":{}}
{"id":"train_2465","question":"Name the venue in which Fnaiech published the paper about Date recognition.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iajit/ZaafouriSF15> dblp:authoredBy <https://dblp.org/pid/17/1440> . <https://dblp.org/rec/journals/iajit/ZaafouriSF15> dblp:publishedIn ?answer }","paraphrases":["In which venue did Fnaiech publish the paper about Date recognition?"],"info":{}}
{"id":"train_2466","question":"Which research paper on Particle swarm was published by Su in ISCE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/211/5441> . ?answer dblp:publishedIn 'ISCE' }","paraphrases":["Which paper on Particle swarm was published by Su in ISCE?"],"info":{}}
{"id":"train_2467","question":"Which paper on -triangulations was published by Jan in Adv. Eng. Softw.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/71/9748> . ?answer dblp:publishedIn 'Adv. Eng. Softw.' }","paraphrases":["Which research paper on -triangulations was published by Jan in Adv. Eng. Softw.?"],"info":{}}
{"id":"train_2469","question":"Name the venue in which L\\u00E1szl\\u00F3 published the paper about Isoperimetric inequality.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/focs/LovaszS90> dblp:authoredBy <https://dblp.org/pid/l/LaszloLovasz> . <https://dblp.org/rec/conf/focs/LovaszS90> dblp:publishedIn ?answer }","paraphrases":["L\\u00E1szl\\u00F3 published the paper on Isoperimetric inequality in which venue?"],"info":{}}
{"id":"train_2470","question":"Mihai published the paper on Video watermarking in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spic/HasnaouiM14> dblp:authoredBy <https://dblp.org/pid/22/7033> . <https://dblp.org/rec/journals/spic/HasnaouiM14> dblp:publishedIn ?answer }","paraphrases":["In which venue did Mihai publish the paper about Video watermarking?"],"info":{}}
{"id":"train_2472","question":"Name the author who published the paper on Subspace method and has the name Hua.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isspa/Abed-MeraimH96> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Subspace method and has the name Hua?"],"info":{}}
{"id":"train_2473","question":"Mention the publication on Business model that was published by Susan in Bled eConference.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/9100> . ?answer dblp:publishedIn 'Bled eConference' }","paraphrases":["Which paper on Business model was published by Susan in Bled eConference?"],"info":{}}
{"id":"train_2477","question":"Which author named Bettinger published the paper on State surveillance?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dihu/BettingerM20> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on State surveillance and has the name Bettinger?"],"info":{}}
{"id":"train_2478","question":"Which research paper on Data streams was published by Vinay in J. Supercomput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/295/7041> . ?answer dblp:publishedIn 'J. Supercomput.' }","paraphrases":["Which paper on Data streams was published by Kumar in J. Supercomput.?"],"info":{}}
{"id":"train_2479","question":"Which paper on Energy harvesting was published by Wang in IEEE Access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/37/2062> . ?answer dblp:publishedIn 'IEEE Access' }","paraphrases":["Which research paper on Energy harvesting was published by Huiming in IEEE Access?"],"info":{}}
{"id":"train_2480","question":"Which author named Bill published the paper on Life issue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/crossroads/Stevenson01a> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Life issue and has the name Stevenson?"],"info":{}}
{"id":"train_2481","question":"Which author named Seidl published the paper on Surface representation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ssd/SeidlK95> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Surface representation and has the name Thomas?"],"info":{}}
{"id":"train_2482","question":"Which author named Guillen published the paper on Carbon monoxide?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/Guillen-Bonilla18> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Carbon monoxide and has the name Trinidad."],"info":{}}
{"id":"train_2483","question":"Which research paper on Optimization problems was published by Xiaojing in CSO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/99/4049> . ?answer dblp:publishedIn 'CSO' }","paraphrases":["Which paper on Optimization problems was published by Xiaojing in CSO?"],"info":{}}
{"id":"train_2484","question":"In which venue did Unoki publish the paper about Information hiding?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/speech/WangYWU19> dblp:authoredBy <https://dblp.org/pid/73/1580> . <https://dblp.org/rec/journals/speech/WangYWU19> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Unoki published the paper about Information hiding."],"info":{}}
{"id":"train_2485","question":"In which venue did Andrew publish the paper about Web logs?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscis/EvansNMPW04> dblp:authoredBy <https://dblp.org/pid/23/5805> . <https://dblp.org/rec/conf/iscis/EvansNMPW04> dblp:publishedIn ?answer }","paraphrases":["Walker published the paper on Web logs in which venue?"],"info":{}}
{"id":"train_2486","question":"T. published the paper on Term power constraints in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ciss/AmariucaiWK07> dblp:authoredBy <https://dblp.org/pid/91/3099> . <https://dblp.org/rec/conf/ciss/AmariucaiWK07> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which George published the paper about Term power constraints."],"info":{}}
{"id":"train_2487","question":"Which author published the paper on Surveillance cameras and has the name Kharitonenko?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/avss/LiKLW06> dblp:authoredBy ?answer }","paraphrases":["Which author named Igor published the paper on Surveillance cameras?"],"info":{}}
{"id":"train_2488","question":"Name the author who published the paper on Search results and has the name Belkin.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/asist/ShahLGB12> dblp:authoredBy ?answer }","paraphrases":["Which author named Belkin published the paper on Search results?"],"info":{}}
{"id":"train_2489","question":"Sreekanth published the paper on Software development in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ansoft/RamAGSRR00> dblp:authoredBy <https://dblp.org/pid/63/776> . <https://dblp.org/rec/journals/ansoft/RamAGSRR00> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Sreekanth published the paper about Software development."],"info":{}}
{"id":"train_2491","question":"Which paper on Person re- was published by Shi in PRCV (3)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/97/3742> . ?answer dblp:publishedIn 'PRCV (3)' }","paraphrases":["Which research paper on Person re- was published by Guangming in PRCV (3)?"],"info":{}}
{"id":"train_2492","question":"Name the author who published the paper on Depth map and has the name Oh.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spic/Oh14> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Depth map and has the name Byung?"],"info":{}}
{"id":"train_2494","question":"Which author published the paper on Source spaceborne and has the name Zhenhua?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/remotesensing/ZhangCM22> dblp:authoredBy ?answer }","paraphrases":["Which author named Zhang published the paper on Source spaceborne?"],"info":{}}
{"id":"train_2496","question":"Pitassi published the paper on Communication lifting in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/GoosP017> dblp:authoredBy <https://dblp.org/pid/p/TPitassi> . <https://dblp.org/rec/journals/corr/GoosP017> dblp:publishedIn ?answer }","paraphrases":["In which venue did Pitassi publish the paper about Communication lifting?"],"info":{}}
{"id":"train_2498","question":"Which author named Ou published the paper on Control strategy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iros/OuX03> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Control strategy and has the name Yongsheng?"],"info":{}}
{"id":"train_2499","question":"Name the venue in which Tian published the paper about Center networks.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcs/HaoT21> dblp:authoredBy <https://dblp.org/pid/177/8025> . <https://dblp.org/rec/journals/tcs/HaoT21> dblp:publishedIn ?answer }","paraphrases":["In which venue did Tian publish the paper about Center networks?"],"info":{}}
{"id":"train_2500","question":"Name the author who published the paper on Function framework and has the name Ding.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tase/LuoZD13> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Function framework and has the name Han?"],"info":{}}
{"id":"train_2501","question":"Which paper on Thruchip design was published by Yasuhiro in ASP-DAC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/91/9944> . ?answer dblp:publishedIn 'ASP-DAC' }","paraphrases":["Mention the publication on Thruchip design that was published by Yasuhiro in ASP-DAC."],"info":{}}
{"id":"train_2502","question":"In which venue did Schwarz publish the paper about Team level?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amcis/SchwarzS15> dblp:authoredBy <https://dblp.org/pid/04/1060> . <https://dblp.org/rec/conf/amcis/SchwarzS15> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Schwarz published the paper about Team level."],"info":{}}
{"id":"train_2503","question":"Mention the publication on Ethernet networks that was published by Golash in Bell Labs Tech. J..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/84/5747> . ?answer dblp:publishedIn 'Bell Labs Tech. J.' }","paraphrases":["Which research paper on Ethernet networks was published by Golash in Bell Labs Tech. J.?"],"info":{}}
{"id":"train_2504","question":"Name the author who published the paper on Level interconnect and has the name Z..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/glvlsi/Shamsi0PJ18> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Level interconnect and has the name David?"],"info":{}}
{"id":"train_2505","question":"Name the venue in which Wesolowski published the paper about Interference cancellation.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/GhaziW19> dblp:authoredBy <https://dblp.org/pid/99/2173> . <https://dblp.org/rec/journals/access/GhaziW19> dblp:publishedIn ?answer }","paraphrases":["Krzysztof published the paper on Interference cancellation in which venue?"],"info":{}}
{"id":"train_2506","question":"Name the venue in which Spedaletti published the paper about Classroom situations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/behaviourIT/PapaPS98> dblp:authoredBy <https://dblp.org/pid/56/5841> . <https://dblp.org/rec/journals/behaviourIT/PapaPS98> dblp:publishedIn ?answer }","paraphrases":["Sandra published the paper on Classroom situations in which venue?"],"info":{}}
{"id":"train_2507","question":"Name the venue in which J\\u00E9rome published the paper about Object tracking.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icra/DurandH03> dblp:authoredBy <https://dblp.org/pid/12/5556> . <https://dblp.org/rec/conf/icra/DurandH03> dblp:publishedIn ?answer }","paraphrases":["In which venue did J\\u00E9rome publish the paper about Object tracking?"],"info":{}}
{"id":"train_2508","question":"Name the venue in which Guolong published the paper about Gaussian process regression.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/ZhangWCZ19> dblp:authoredBy <https://dblp.org/pid/243/8879> . <https://dblp.org/rec/journals/sensors/ZhangWCZ19> dblp:publishedIn ?answer }","paraphrases":["In which venue did Guolong publish the paper about Gaussian process regression?"],"info":{}}
{"id":"train_2509","question":"Which paper on Type detection was published by Aydogdu in SIU?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/225/3365> . ?answer dblp:publishedIn 'SIU' }","paraphrases":["Mention the publication on Type detection that was published by Aydogdu in SIU."],"info":{}}
{"id":"train_2511","question":"Name the venue in which Gonzalez published the paper about Channel routing algorithms.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/integration/GonzalezZ94> dblp:authoredBy <https://dblp.org/pid/g/TFGonzalez> . <https://dblp.org/rec/journals/integration/GonzalezZ94> dblp:publishedIn ?answer }","paraphrases":["Gonzalez published the paper on Channel routing algorithms in which venue?"],"info":{}}
{"id":"train_2512","question":"Name the venue in which Graf published the paper about Privacy model.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dbsec/BiskupG88> dblp:authoredBy <https://dblp.org/pid/74/3205> . <https://dblp.org/rec/conf/dbsec/BiskupG88> dblp:publishedIn ?answer }","paraphrases":["Graf published the paper on Privacy model in which venue?"],"info":{}}
{"id":"train_2513","question":"In which venue did Barclay publish the paper about Microcomputer system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cryptologia/BarclayB82> dblp:authoredBy <https://dblp.org/pid/166/8455> . <https://dblp.org/rec/journals/cryptologia/BarclayB82> dblp:publishedIn ?answer }","paraphrases":["S. published the paper on Microcomputer system in which venue?"],"info":{}}
{"id":"train_2514","question":"Which author published the paper on Rendering approach and has the name Tong?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icra/WangTSZ15> dblp:authoredBy ?answer }","paraphrases":["Which author named Hao published the paper on Rendering approach?"],"info":{}}
{"id":"train_2515","question":"Which research paper on Soccer robot was published by Yoichiro in AMiRE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/44/2120> . ?answer dblp:publishedIn 'AMiRE' }","paraphrases":["Which paper on Soccer robot was published by Yoichiro in AMiRE?"],"info":{}}
{"id":"train_2516","question":"In which venue did Fang-Li publish the paper about Mobile computing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jssc/YuanWYM15> dblp:authoredBy <https://dblp.org/pid/65/8053> . <https://dblp.org/rec/journals/jssc/YuanWYM15> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Fang-Li published the paper about Mobile computing."],"info":{}}
{"id":"train_2517","question":"Mention the publication on Cycle construction that was published by Bin in ICC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/98/4432-2> . ?answer dblp:publishedIn 'ICC' }","paraphrases":["Which paper on Cycle construction was published by Bin in ICC?"],"info":{}}
{"id":"train_2518","question":"In which venue did G. publish the paper about Intensity discrimination?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icassp/HuettelC02> dblp:authoredBy <https://dblp.org/pid/17/2785> . <https://dblp.org/rec/conf/icassp/HuettelC02> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Lisa published the paper about Intensity discrimination."],"info":{}}
{"id":"train_2520","question":"Which paper on Neighbor graphs was published by Mishne in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/125/3214> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Mention the publication on Neighbor graphs that was published by Gal in CoRR."],"info":{}}
{"id":"train_2521","question":"In which venue did Gao publish the paper about Resource portrait?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hucc/LinZGLP20> dblp:authoredBy <https://dblp.org/pid/184/4278> . <https://dblp.org/rec/conf/hucc/LinZGLP20> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Tianqi published the paper about Resource portrait."],"info":{}}
{"id":"train_2522","question":"Which paper on Data fusion was published by Longhao in Appl. Intell.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/316/0830> . ?answer dblp:publishedIn 'Appl. Intell.' }","paraphrases":["Which research paper on Data fusion was published by Zhu in Appl. Intell.?"],"info":{}}
{"id":"train_2523","question":"Name the author who published the paper on Rank order and has the name Philippe.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigpro/Salembier92> dblp:authoredBy ?answer }","paraphrases":["Which author named Salembier published the paper on Rank order?"],"info":{}}
{"id":"train_2524","question":"Which paper on Traffic models was published by Ferling in MMB?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/214/4203> . ?answer dblp:publishedIn 'MMB' }","paraphrases":["Mention the publication on Traffic models that was published by Ferling in MMB."],"info":{}}
{"id":"train_2525","question":"Mention the publication on Shot demonstration that was published by Ying in Int. J. Autom. Comput..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/1805> . ?answer dblp:publishedIn 'Int. J. Autom. Comput.' }","paraphrases":["Which paper on Shot demonstration was published by Ying in Int. J. Autom. Comput.?"],"info":{}}
{"id":"train_2526","question":"Which author named Sadaoki published the paper on Speech recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/interspeech/IwanoSF02> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Speech recognition and has the name Sadaoki."],"info":{}}
{"id":"train_2527","question":"Which research paper on App periodicity was published by Han in ICIMCS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/94/9625-2> . ?answer dblp:publishedIn 'ICIMCS' }","paraphrases":["Mention the publication on App periodicity that was published by Di in ICIMCS."],"info":{}}
{"id":"train_2528","question":"In which venue did Arthur publish the paper about Plan recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aaai/SmithL13> dblp:authoredBy <https://dblp.org/pid/09/6868> . <https://dblp.org/rec/conf/aaai/SmithL13> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Smith published the paper about Plan recognition."],"info":{}}
{"id":"train_2529","question":"In which venue did Huangang publish the paper about Ramp loss?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/prl/XiaoWX17> dblp:authoredBy <https://dblp.org/pid/64/8665> . <https://dblp.org/rec/journals/prl/XiaoWX17> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Huangang published the paper about Ramp loss."],"info":{}}
{"id":"train_2530","question":"In which venue did K. publish the paper about Store performance models?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/eor/PaulerTG09> dblp:authoredBy <https://dblp.org/pid/72/6211> . <https://dblp.org/rec/journals/eor/PaulerTG09> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Dinesh published the paper about Store performance models."],"info":{}}
{"id":"train_2531","question":"Name the venue in which Zelkowitz published the paper about Software specification process.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ac/Zelkowitz93> dblp:authoredBy <https://dblp.org/pid/z/MarvinVZelkowitz> . <https://dblp.org/rec/journals/ac/Zelkowitz93> dblp:publishedIn ?answer }","paraphrases":["In which venue did Marvin publish the paper about Software specification process?"],"info":{}}
{"id":"train_2532","question":"Which author named Cinnati published the paper on Cryptosystem processor?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscas/LoiK13> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Cryptosystem processor and has the name Cinnati?"],"info":{}}
{"id":"train_2534","question":"Adi published the paper on Uml method in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/asm/HassanSAL10> dblp:authoredBy <https://dblp.org/pid/24/408> . <https://dblp.org/rec/conf/asm/HassanSAL10> dblp:publishedIn ?answer }","paraphrases":["In which venue did Adi publish the paper about Uml method?"],"info":{}}
{"id":"train_2535","question":"Which research paper on Module property was published by Stefan in International Conference on Agents and Artificial Intelligence?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/06/9388> . ?answer dblp:publishedIn 'ICAART (Revised Selected Papers)' }","paraphrases":["Which paper on Module property was published by Jakob in ICAART (Revised Selected Papers)?"],"info":{}}
{"id":"train_2536","question":"Which paper on Modulation design was published by Ng in VTC Fall?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/6170> . ?answer dblp:publishedIn 'VTC Fall' }","paraphrases":["Which research paper on Modulation design was published by Ng in VTC Fall?"],"info":{}}
