{"id":"train_108","question":"Which publications did Yingke Zhu author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/199/7648> }","paraphrases":["Which papers did the author Yingke Z. write?"],"info":{}}
{"id":"train_109","question":"What are the papers written by the person Min H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/44/1356-2> }","paraphrases":["What are the papers written by Min H.?"],"info":{}}
{"id":"train_110","question":"Which publications did Jeong Heo author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/937> }","paraphrases":["What are the papers written by Jeong Heo?"],"info":{}}
{"id":"train_111","question":"What are the papers written by Toshikazu Wada?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/00/4781> }","paraphrases":["What are the papers written by the person Toshikazu Wada?"],"info":{}}
{"id":"train_112","question":"Find the primary affiliation of M. Omair Shafiq.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/47/5921> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Shafiq, M. Omair?"],"info":{}}
{"id":"train_113","question":"Find the primary affiliation of Soumaya C..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/57/689> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Soumaya Cherkaoui."],"info":{}}
{"id":"train_114","question":"Which papers did the author Youssef El Hajj Shehadeh write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/8863> }","paraphrases":["What are the papers written by Youssef El Hajj Shehadeh?"],"info":{}}
{"id":"train_115","question":"Which papers did the author Jacqueline Ayel write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/28/6326> }","paraphrases":["What are the papers written by the person Jacqueline A.?"],"info":{}}
{"id":"train_116","question":"Which publications did Guirao, J. Luis Garc\\u00EDa author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/75/6661> }","paraphrases":["Which papers did the author Guirao, J. Luis Garc\\u00EDa write?"],"info":{}}
{"id":"train_117","question":"What are the papers written by the person Guo, Qinghua?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/18/5331-2> }","paraphrases":["What are the papers written by Qinghua Guo?"],"info":{}}
{"id":"train_118","question":"Which publications did Young-Kyu Yang author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/05/6854> }","paraphrases":["What are the papers written by Yang, Young-Kyu?"],"info":{}}
{"id":"train_119","question":"What are the papers written by the person Huaxiong Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/52/4513> }","paraphrases":["Which publications did Huaxiong Wang author?"],"info":{}}
{"id":"train_120","question":"Which papers did the author Tag Gon Kim write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/23/5196> }","paraphrases":["What are the papers written by Kim, T. Gon?"],"info":{}}
{"id":"train_121","question":"Which papers did the author Thaddeus Tarpey write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/40/7357> }","paraphrases":["What are the papers written by the person Thaddeus T.?"],"info":{}}
{"id":"train_122","question":"Which publications did Mutlu, B. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/158/0641> }","paraphrases":["What are the papers written by Begum Mutlu?"],"info":{}}
{"id":"train_123","question":"What are the papers written by S. Daud Khan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/138/0460> }","paraphrases":["Which publications did Sultan Daud Khan author?"],"info":{}}
{"id":"train_124","question":"Which papers did the author Yi Jiang write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/3172-4> }","paraphrases":["What are the papers written by the person Yi Jiang?"],"info":{}}
{"id":"train_125","question":"Which publications did Abdallah Ben Saida author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/214/1299> }","paraphrases":["What are the papers written by Abdallah B. Saida?"],"info":{}}
{"id":"train_126","question":"Show the Wikidata ID of the person Dennis Hofheinz.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/74/3914> dblp:wikidata ?answer }","paraphrases":["The author Dennis Hofheinz is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_127","question":"What is the webpage of the person Andrea L. Lacaita?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/52/2681> dblp:webpage ?answer }","paraphrases":["What is the webpage of Andrea L. Lacaita?"],"info":{}}
{"id":"train_128","question":"What are the papers written by Wijnand A. IJsselsteijn?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/i/WijnandIJsselsteijn> }","paraphrases":["Which publications did Wijnand A. IJsselsteijn author?"],"info":{}}
{"id":"train_129","question":"Which publications did R. Rao author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/17/570> }","paraphrases":["Which papers did the author Ravishankar Rao write?"],"info":{}}
{"id":"train_130","question":"Which publications did Filho, H. Tertuliano author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/156/3490> }","paraphrases":["What are the papers written by Filho, H. Tertuliano?"],"info":{}}
{"id":"train_131","question":"What are the papers written by the person Li, H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/88/5785-1> }","paraphrases":["Which publications did Li, H. author?"],"info":{}}
{"id":"train_132","question":"Which publications did Verjus, H. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/40/1653> }","paraphrases":["Which papers did the author Verjus, H. write?"],"info":{}}
{"id":"train_133","question":"What are the papers written by the person Wu, Fengjiang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/129/9251> }","paraphrases":["Which publications did Fengjiang Wu author?"],"info":{}}
{"id":"train_134","question":"Find the primary affiliation of Alessandro Orso.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/35/805> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Alessandro Orso."],"info":{}}
{"id":"train_135","question":"Which publications did W. Wu author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/92/382-5> }","paraphrases":["What are the papers written by W. Wu?"],"info":{}}
{"id":"train_136","question":"What are the papers written by Herbert Rosmanith?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/75/40> }","paraphrases":["Which publications did Herbert Rosmanith author?"],"info":{}}
{"id":"train_137","question":"Which publications did Gerbracht, E. H.-A. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/32/6397> }","paraphrases":["Which papers did the author Eberhard H.-A. Gerbracht write?"],"info":{}}
{"id":"train_138","question":"What are the papers written by the person Kamel Alreshedy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/227/2827> }","paraphrases":["Which publications did Kamel Alreshedy author?"],"info":{}}
{"id":"train_139","question":"Which papers did the author Michael D. Mumford write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/81/11124> }","paraphrases":["What are the papers written by Michael D. Mumford?"],"info":{}}
{"id":"train_140","question":"What are the papers written by the person Mike E. Davies?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/d/MikeEDavis> }","paraphrases":["What are the papers written by Mike E. Davies?"],"info":{}}
{"id":"train_141","question":"Show the Wikidata ID of the person Dominik Macko.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/26/9782> dblp:wikidata ?answer }","paraphrases":["The author Dominik Macko is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_142","question":"What are the papers written by Mu, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/51/3325> }","paraphrases":["Which publications did Mu, Y. author?"],"info":{}}
{"id":"train_143","question":"Which publications did M. S. Hsiao author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/56/3227> }","paraphrases":["What are the papers written by the person Michael S. Hsiao?"],"info":{}}
{"id":"train_144","question":"Which papers did the author M. Huber write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/4487> }","paraphrases":["Which publications did M. Huber author?"],"info":{}}
{"id":"train_145","question":"What are the papers written by the person DukHo Chang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/04/8305> }","paraphrases":["Which publications did DukHo Chang author?"],"info":{}}
{"id":"train_146","question":"What are the papers written by the person G. K. Thiruvathukal?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/97/6279> }","paraphrases":["Which papers did the author George K. Thiruvathukal write?"],"info":{}}
{"id":"train_148","question":"Find the primary affiliation of Ahmed, S. Ejaz.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/19/715> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Ahmed, S. Ejaz?"],"info":{}}
{"id":"train_149","question":"Which publications did Alouf, Sara author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/a/SaraAlouf> }","paraphrases":["What are the papers written by Alouf, Sara?"],"info":{}}
{"id":"train_150","question":"Which papers did the author Todd L. Pittinsky write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/275/8033> }","paraphrases":["What are the papers written by Todd L. Pittinsky?"],"info":{}}
{"id":"train_151","question":"What is the webpage of the person Sebastian W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/17/9378> dblp:webpage ?answer }","paraphrases":["What is the webpage of Sebastian Weis?"],"info":{}}
{"id":"train_152","question":"What are the papers written by Jiang, S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/6713> }","paraphrases":["Which publications did Jiang, S. author?"],"info":{}}
{"id":"train_153","question":"What are the papers written by Chuan Wu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/3772> }","paraphrases":["Which publications did Chuan Wu author?"],"info":{}}
{"id":"train_154","question":"What is the primary affiliation of David R. Traum?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/48/2932> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of David R. Traum."],"info":{}}
{"id":"train_155","question":"Which publications did Fleurianne Bertrand author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/146/3561> }","paraphrases":["What are the papers written by the person Fleurianne Bertrand?"],"info":{}}
{"id":"train_156","question":"Which papers did the author V. L. Lajish write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/153/1926> }","paraphrases":["What are the papers written by the person V. L. Lajish?"],"info":{}}
{"id":"train_158","question":"What is the webpage of John E. Beasley?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/07/2039> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person John E. Beasley?"],"info":{}}
{"id":"train_159","question":"What is the webpage of the person Manuel V. Hermenegildo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/h/ManuelVHermenegildo> dblp:webpage ?answer }","paraphrases":["What is the webpage of Manuel V. Hermenegildo?"],"info":{}}
{"id":"train_160","question":"What is the webpage of Fran\\u00E7ois Bry?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/b/FrancoisBry> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Bry, F.?"],"info":{}}
{"id":"train_161","question":"Ke L. is primarily affiliated to which institution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/75/6627-11> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Ke L.."],"info":{}}
{"id":"train_162","question":"What are the papers written by the person Suad Kunosic?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/220/0295> }","paraphrases":["Which papers did the author S. Kunosic write?"],"info":{}}
{"id":"train_163","question":"Which papers did the author Roman Sotner write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/10428> }","paraphrases":["What are the papers written by the person Roman S.?"],"info":{}}
{"id":"train_164","question":"Find the primary affiliation of Ke Xu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/181/2626-3> dblp:primaryAffiliation ?answer }","paraphrases":["Ke Xu is primarily affiliated to which institution?"],"info":{}}
{"id":"train_165","question":"What are the papers written by the person James G. Oxley?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/45/558> }","paraphrases":["Which papers did the author James G. Oxley write?"],"info":{}}
{"id":"train_166","question":"Which publications did F. Luo author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/81/9252> }","paraphrases":["Which papers did the author Fan Luo write?"],"info":{}}
{"id":"train_167","question":"What are the papers written by Guillaume Chapuy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/87/4051> }","paraphrases":["Which publications did Chapuy, G. author?"],"info":{}}
{"id":"train_168","question":"Which papers did the author J. Zhao write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/69/5882-16> }","paraphrases":["What are the papers written by the person J. Zhao?"],"info":{}}
{"id":"train_169","question":"Which papers did the author Thomas J. Marlowe write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/3333> }","paraphrases":["Which publications did Thomas J. Marlowe author?"],"info":{}}
{"id":"train_170","question":"What are the papers written by Robert Shearer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/10255> }","paraphrases":["Which papers did the author R. Shearer write?"],"info":{}}
{"id":"train_171","question":"Which papers did the author Gennady L. Andrienko write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/a/GennadyLAndrienko> }","paraphrases":["What are the papers written by the person Gennady L. Andrienko?"],"info":{}}
{"id":"train_172","question":"What is the Wikidata ID of Wenge Xu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/220/3687> dblp:wikidata ?answer }","paraphrases":["The author Wenge X. is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_173","question":"Find the primary affiliation of Chambers, C..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/c/CraigChambers> dblp:primaryAffiliation ?answer }","paraphrases":["Chambers, C. is primarily affiliated to which institution?"],"info":{}}
{"id":"train_174","question":"What are the papers written by Gunawan, D.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/44/10155> }","paraphrases":["Which publications did Gunawan, D. author?"],"info":{}}
{"id":"train_175","question":"What are the papers written by H. Liu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/18/9462-1> }","paraphrases":["What are the papers written by the person H. Liu?"],"info":{}}
{"id":"train_176","question":"Which publications did Greg G. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/22> }","paraphrases":["What are the papers written by Greg G.?"],"info":{}}
{"id":"train_177","question":"What is the Wikidata ID of Alexander Artikis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/a/AArtikis> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person A. Artikis."],"info":{}}
{"id":"train_178","question":"What are the papers written by the person Askhat I. Diveev?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/179/9806> }","paraphrases":["Which papers did the author Askhat I. Diveev write?"],"info":{}}
{"id":"train_179","question":"Which publications did Kazushi K. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/144/1940> }","paraphrases":["What are the papers written by the person Kazushi K.?"],"info":{}}
{"id":"train_180","question":"The author Frank Leymann is associated with which Wikidata identifier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/l/FrankLeymann> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Leymann, F.?"],"info":{}}
{"id":"train_181","question":"Find the primary affiliation of Kwang-il Hwang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/12/5394> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of K. Hwang."],"info":{}}
{"id":"train_182","question":"What are the papers written by G. Rayna?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/11/177> }","paraphrases":["Which publications did Gerhard Rayna author?"],"info":{}}
{"id":"train_183","question":"What are the papers written by the person Dillencourt, M. B.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/d/MBDillencourt> }","paraphrases":["What are the papers written by Michael B. Dillencourt?"],"info":{}}
{"id":"train_184","question":"What are the papers written by K. Samanci?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/199/2017> }","paraphrases":["Which publications did K. Samanci author?"],"info":{}}
{"id":"train_185","question":"Which papers did the author Fran\\u00E7ois D. write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/4306> }","paraphrases":["What are the papers written by the person Fran\\u00E7ois D.?"],"info":{}}
{"id":"train_186","question":"Which papers did the author Evanthia Papadopoulou write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/93/4868> }","paraphrases":["What are the papers written by the person Evanthia Papadopoulou?"],"info":{}}
{"id":"train_187","question":"What are the papers written by the person Shenghua L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/32/2527> }","paraphrases":["Which publications did Shenghua Liu author?"],"info":{}}
{"id":"train_188","question":"Which publications did Sami Muhaidat author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/7881> }","paraphrases":["What are the papers written by Sami Muhaidat?"],"info":{}}
{"id":"train_189","question":"Which papers did the author R. d. Almeida write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/82/2141> }","paraphrases":["What are the papers written by R. d. Almeida?"],"info":{}}
{"id":"train_190","question":"What are the papers written by the person Erik Demeulemeester?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/1626> }","paraphrases":["What are the papers written by Demeulemeester, Erik?"],"info":{}}
{"id":"train_191","question":"Which publications did Liping Zhang author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/48/6735> }","paraphrases":["Which papers did the author Liping Zhang write?"],"info":{}}
{"id":"train_192","question":"Which publications did Yassine Aoudni author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/50/10811> }","paraphrases":["What are the papers written by Yassine A.?"],"info":{}}
{"id":"train_193","question":"Which publications did Jean M. Alexander author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/122/7898> }","paraphrases":["Which papers did the author Jean M. Alexander write?"],"info":{}}
{"id":"train_194","question":"What are the papers written by A. Gr\\u00F6pl?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/73/681> }","paraphrases":["What are the papers written by the person A. Gr\\u00F6pl?"],"info":{}}
{"id":"train_195","question":"What are the papers written by the person X. Liu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/41/3705> }","paraphrases":["What are the papers written by Xiaoli Liu?"],"info":{}}
{"id":"train_196","question":"What are the papers written by Pirzadeh, H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/168/8354> }","paraphrases":["What are the papers written by the person Hessam Pirzadeh?"],"info":{}}
{"id":"train_197","question":"Which publications did Calefato, F. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/48/5662> }","paraphrases":["What are the papers written by the person Calefato, F.?"],"info":{}}
{"id":"train_198","question":"What are the papers written by Song Yu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/54/1216> }","paraphrases":["Which publications did Song Y. author?"],"info":{}}
{"id":"train_199","question":"Show the Wikidata ID of the person Kim, Dongwoo.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/15/398-1> dblp:wikidata ?answer }","paraphrases":["The author Kim, Dongwoo is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_200","question":"Which papers did the author Praful V. Bhansali write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/7002> }","paraphrases":["What are the papers written by Praful V. Bhansali?"],"info":{}}
{"id":"train_201","question":"What are the papers written by Junfeng W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/06/5271> }","paraphrases":["Which publications did Junfeng Wu author?"],"info":{}}
{"id":"train_202","question":"Which papers did the author Rosalsky, Andrew write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/118/8060> }","paraphrases":["What are the papers written by the person Andrew Rosalsky?"],"info":{}}
{"id":"train_203","question":"Show the Wikidata ID of the person Jararweh, Yaser.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/53/4234> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Yaser Jararweh?"],"info":{}}
{"id":"train_204","question":"Which papers did the author J. Mostafa write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/6061> }","paraphrases":["What are the papers written by the person J. Mostafa?"],"info":{}}
{"id":"train_205","question":"Find the primary affiliation of Roy-Chowdhury, A. K..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/c/AmitKRoyChowdhury> dblp:primaryAffiliation ?answer }","paraphrases":["Amit K. Roy-Chowdhury is primarily affiliated to which institution?"],"info":{}}
{"id":"train_206","question":"Which papers did the author Philipp Frank write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/67/8275> }","paraphrases":["Which publications did Frank, P. author?"],"info":{}}
{"id":"train_207","question":"What are the papers written by the person Muralidharan, Raghavan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/203/8594> }","paraphrases":["What are the papers written by Muralidharan, Raghavan?"],"info":{}}
{"id":"train_208","question":"Which publications did Affaf S. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/256/1228> }","paraphrases":["Which papers did the author Affaf S. write?"],"info":{}}
{"id":"train_209","question":"What are the papers written by the person Roughan, J. L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/57/5070> }","paraphrases":["Which publications did J. L. Roughan author?"],"info":{}}
{"id":"train_210","question":"What are the papers written by Torsten Zesch?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/39/4042> }","paraphrases":["What are the papers written by the person Torsten Zesch?"],"info":{}}
{"id":"train_211","question":"What is the Wikidata ID of Mike Thelwall?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/t/MikeThelwall> dblp:wikidata ?answer }","paraphrases":["The author Mike Thelwall is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_212","question":"What are the papers written by the person Aydin Babakhani?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/09/8133> }","paraphrases":["Which papers did the author Aydin Babakhani write?"],"info":{}}
{"id":"train_213","question":"Which publications did Peter L. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/49/5258> }","paraphrases":["Which papers did the author Peter L. write?"],"info":{}}
{"id":"train_214","question":"What is the Wikidata ID of T. Terada?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/67/1709> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person T. Terada."],"info":{}}
