{"id":"train_1655","question":"Was the paper 'A New MAC Protocol Using AWRR/DT in Broadband Wireless Networks: Novel Contention Methods' not published by Jae-Young Pyun in IEICE Trans. Fundam. Electron. Commun. Comput. Sci.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ieiceta/ShimPK02> dblp:authoredBy <https://dblp.org/pid/25/763> . <https://dblp.org/rec/journals/ieiceta/ShimPK02> dblp:publishedIn 'IEICE Trans. Fundam. Electron. Commun. Comput. Sci.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ieiceta/ShimPK02> dblp:authoredBy <https://dblp.org/pid/25/763> . <https://dblp.org/rec/journals/ieiceta/ShimPK02> dblp:publishedIn 'IEICE Trans. Fundam. Electron. Commun. Comput. Sci.' } }","paraphrases":["Has the paper 'A New MAC Protocol Using AWRR/DT in Broadband Wireless Networks: Novel Contention Methods' not been published by Jae-Young P. in IEICE Trans. Fundam. Electron. Commun. Comput. Sci.?"],"info":{}}
{"id":"train_1656","question":"Was the paper 'Apport des ontologies pour le calcul de la similarit\\u00E9 s\\u00E9mantique au sein d'un syst\\u00E8me de recommandation' not co-authored by Abel, Marie-H\\u00E9l\\u00E8ne and Le Ngoc Luyen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2205-12539> dblp:authoredBy <https://dblp.org/pid/53/4888> . <https://dblp.org/rec/journals/corr/abs-2205-12539> dblp:authoredBy <https://dblp.org/pid/321/0993> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2205-12539> dblp:authoredBy <https://dblp.org/pid/53/4888> . <https://dblp.org/rec/journals/corr/abs-2205-12539> dblp:authoredBy <https://dblp.org/pid/321/0993> } }","paraphrases":["Did Abel, Marie-H\\u00E9l\\u00E8ne and Le N. Luyen not co-author the paper 'Apport des ontologies pour le calcul de la similarit\\u00E9 s\\u00E9mantique au sein d'un syst\\u00E8me de recommandation'?"],"info":{}}
{"id":"train_1658","question":"Did Tomas Olovsson and P. Kleberger not co-author the paper 'Protecting Vehicles Against Unauthorised Diagnostics Sessions Using Trusted Third Parties'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/safecomp/KlebergerO13> dblp:authoredBy <https://dblp.org/pid/03/1347> . <https://dblp.org/rec/conf/safecomp/KlebergerO13> dblp:authoredBy <https://dblp.org/pid/46/11146> FILTER NOT EXISTS { <https://dblp.org/rec/conf/safecomp/KlebergerO13> dblp:authoredBy <https://dblp.org/pid/03/1347> . <https://dblp.org/rec/conf/safecomp/KlebergerO13> dblp:authoredBy <https://dblp.org/pid/46/11146> } }","paraphrases":["Was the paper 'Protecting Vehicles Against Unauthorised Diagnostics Sessions Using Trusted Third Parties' not co-authored by Tomas O. and P. Kleberger?"],"info":{}}
{"id":"train_1659","question":"Has the paper 'Adversarial Attacks on Face Detectors Using Neural Net Based Constrained Optimization' not been published by Bose, Avishek Joey in MMSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mmsp/BoseA18> dblp:authoredBy <https://dblp.org/pid/174/3372> . <https://dblp.org/rec/conf/mmsp/BoseA18> dblp:publishedIn 'MMSP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/mmsp/BoseA18> dblp:authoredBy <https://dblp.org/pid/174/3372> . <https://dblp.org/rec/conf/mmsp/BoseA18> dblp:publishedIn 'MMSP' } }","paraphrases":["Did Avishek Joey Bose not publish the paper 'Adversarial Attacks on Face Detectors Using Neural Net Based Constrained Optimization' in MMSP?"],"info":{}}
{"id":"train_1660","question":"Was the paper 'Bayesian neural networks for weak solution of PDEs with uncertainty quantification' not published by Xiaoxuan Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2101-04879> dblp:authoredBy <https://dblp.org/pid/28/11049> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2101-04879> dblp:authoredBy <https://dblp.org/pid/28/11049> } }","paraphrases":["Wasn't the paper 'Bayesian neural networks for weak solution of PDEs with uncertainty quantification' not published by the author Zhang, X.?"],"info":{}}
{"id":"train_1661","question":"Was the paper 'Interleaver design for turbo codes from convergence analysis' not published by Gilles Mesnager in IEEE Trans. Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcom/YuBVDM06> dblp:authoredBy <https://dblp.org/pid/91/436> . <https://dblp.org/rec/journals/tcom/YuBVDM06> dblp:publishedIn 'IEEE Trans. Commun.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tcom/YuBVDM06> dblp:authoredBy <https://dblp.org/pid/91/436> . <https://dblp.org/rec/journals/tcom/YuBVDM06> dblp:publishedIn 'IEEE Trans. Commun.' } }","paraphrases":["Has the paper 'Interleaver design for turbo codes from convergence analysis' not been published by Gilles Mesnager in IEEE Trans. Commun.?"],"info":{}}
{"id":"train_1662","question":"Was the paper 'Computer Minimization of Multivalued Switching Functions' not published by Peter T. Cheung in IEEE Trans. Computers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tc/SuC72a> dblp:authoredBy <https://dblp.org/pid/178/5008> . <https://dblp.org/rec/journals/tc/SuC72a> dblp:publishedIn 'IEEE Trans. Computers' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tc/SuC72a> dblp:authoredBy <https://dblp.org/pid/178/5008> . <https://dblp.org/rec/journals/tc/SuC72a> dblp:publishedIn 'IEEE Trans. Computers' } }","paraphrases":["Did P. T. Cheung not publish the paper 'Computer Minimization of Multivalued Switching Functions' in IEEE Trans. Computers?"],"info":{}}
{"id":"train_1663","question":"Wasn't the paper 'RapidSmith: Do-It-Yourself CAD Tools for Xilinx FPGAs' published by the author Lamprecht, J. in FPL?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fpl/LavinPLLNH11> dblp:authoredBy <https://dblp.org/pid/72/9612> . <https://dblp.org/rec/conf/fpl/LavinPLLNH11> dblp:publishedIn 'FPL' FILTER NOT EXISTS { <https://dblp.org/rec/conf/fpl/LavinPLLNH11> dblp:authoredBy <https://dblp.org/pid/72/9612> . <https://dblp.org/rec/conf/fpl/LavinPLLNH11> dblp:publishedIn 'FPL' } }","paraphrases":["Has the paper 'RapidSmith: Do-It-Yourself CAD Tools for Xilinx FPGAs' not been published by Jaren Lamprecht in FPL?"],"info":{}}
{"id":"train_1664","question":"Didn't Tebaldini, Stefano publish the paper 'Polarimetric time-frequency analysis of vessels in Spotlight SAR images'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/igarss/BandaFT14> dblp:authoredBy <https://dblp.org/pid/65/6977> FILTER NOT EXISTS { <https://dblp.org/rec/conf/igarss/BandaFT14> dblp:authoredBy <https://dblp.org/pid/65/6977> } }","paraphrases":["Was the paper 'Polarimetric time-frequency analysis of vessels in Spotlight SAR images' not published by the person Tebaldini, Stefano?"],"info":{}}
{"id":"train_1665","question":"Was the paper 'Segmentation of Pathological Features of Rat Bile Duct Carcinoma from Hyperspectral Images' not co-authored by Jiansheng Wang and Qingli Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bmei/WangHZSL18> dblp:authoredBy <https://dblp.org/pid/152/4738> . <https://dblp.org/rec/conf/bmei/WangHZSL18> dblp:authoredBy <https://dblp.org/pid/77/8026> FILTER NOT EXISTS { <https://dblp.org/rec/conf/bmei/WangHZSL18> dblp:authoredBy <https://dblp.org/pid/152/4738> . <https://dblp.org/rec/conf/bmei/WangHZSL18> dblp:authoredBy <https://dblp.org/pid/77/8026> } }","paraphrases":["Have Jiansheng Wang and Q. Li not co-authored the paper 'Segmentation of Pathological Features of Rat Bile Duct Carcinoma from Hyperspectral Images'?"],"info":{}}
{"id":"train_1667","question":"Have Qixin Sun and Xiujuan Chai not co-authored the paper 'Multi-level feature fusion for fruit bearing branch keypoint detection'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cea/SunCZZS21> dblp:authoredBy <https://dblp.org/pid/116/7741> . <https://dblp.org/rec/journals/cea/SunCZZS21> dblp:authoredBy <https://dblp.org/pid/57/6273> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cea/SunCZZS21> dblp:authoredBy <https://dblp.org/pid/116/7741> . <https://dblp.org/rec/journals/cea/SunCZZS21> dblp:authoredBy <https://dblp.org/pid/57/6273> } }","paraphrases":["Was the paper 'Multi-level feature fusion for fruit bearing branch keypoint detection' not co-authored by Sun, Q. and X. Chai?"],"info":{}}
{"id":"train_1668","question":"Did I. Daizadeh not publish the paper 'An intellectual property-based corporate strategy: An R&D spend, patent, trademark, media communication, and market price innovation agenda' in Scientometrics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/scientometrics/Daizadeh09> dblp:authoredBy <https://dblp.org/pid/52/540> . <https://dblp.org/rec/journals/scientometrics/Daizadeh09> dblp:publishedIn 'Scientometrics' FILTER NOT EXISTS { <https://dblp.org/rec/journals/scientometrics/Daizadeh09> dblp:authoredBy <https://dblp.org/pid/52/540> . <https://dblp.org/rec/journals/scientometrics/Daizadeh09> dblp:publishedIn 'Scientometrics' } }","paraphrases":["Was the paper 'An intellectual property-based corporate strategy: An R&D spend, patent, trademark, media communication, and market price innovation agenda' not published by I. Daizadeh in Scientometrics?"],"info":{}}
{"id":"train_1669","question":"Was the paper 'Hybrid input shaping and PD-type Fuzzy Logic control scheme of a gantry crane system' not co-authored by Najidah Hambali and Najidah Ishak?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEcca/AhmadNHI09> dblp:authoredBy <https://dblp.org/pid/122/8086> . <https://dblp.org/rec/conf/IEEEcca/AhmadNHI09> dblp:authoredBy <https://dblp.org/pid/122/7950> FILTER NOT EXISTS { <https://dblp.org/rec/conf/IEEEcca/AhmadNHI09> dblp:authoredBy <https://dblp.org/pid/122/8086> . <https://dblp.org/rec/conf/IEEEcca/AhmadNHI09> dblp:authoredBy <https://dblp.org/pid/122/7950> } }","paraphrases":["Have Najidah Hambali and Najidah Ishak not co-authored the paper 'Hybrid input shaping and PD-type Fuzzy Logic control scheme of a gantry crane system'?"],"info":{}}
{"id":"train_1670","question":"Did M. Imran Azim not publish the paper 'P2P Negawatt Trading: A Potential Alternative to Demand-side Management'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isgta/AzimT21> dblp:authoredBy <https://dblp.org/pid/248/8155> FILTER NOT EXISTS { <https://dblp.org/rec/conf/isgta/AzimT21> dblp:authoredBy <https://dblp.org/pid/248/8155> } }","paraphrases":["Wasn't the paper 'P2P Negawatt Trading: A Potential Alternative to Demand-side Management' not published by the author Azim, M. Imran?"],"info":{}}
{"id":"train_1672","question":"Have Virmani, Lakshay and Anurag Singh not co-authored the paper 'Image Corpus Representative Summarization'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bigmm/SinghVV19> dblp:authoredBy <https://dblp.org/pid/255/0265> . <https://dblp.org/rec/conf/bigmm/SinghVV19> dblp:authoredBy <https://dblp.org/pid/73/10122> FILTER NOT EXISTS { <https://dblp.org/rec/conf/bigmm/SinghVV19> dblp:authoredBy <https://dblp.org/pid/255/0265> . <https://dblp.org/rec/conf/bigmm/SinghVV19> dblp:authoredBy <https://dblp.org/pid/73/10122> } }","paraphrases":["Was the paper 'Image Corpus Representative Summarization' not co-authored by Virmani, Lakshay and Anurag Singh?"],"info":{}}
{"id":"train_1674","question":"Did Gu, D. not publish the paper 'A competence-time-quality scheduling model of multi-skilled staff for IT project portfolio'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/candie/ChenLGZ20> dblp:authoredBy <https://dblp.org/pid/195/0064> FILTER NOT EXISTS { <https://dblp.org/rec/journals/candie/ChenLGZ20> dblp:authoredBy <https://dblp.org/pid/195/0064> } }","paraphrases":["Wasn't the paper 'A competence-time-quality scheduling model of multi-skilled staff for IT project portfolio' not published by the author Dongxiao Gu?"],"info":{}}
{"id":"train_1675","question":"Didn't M. David publish the paper 'Trade-Off Lower Bounds for Stack Machines'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/coco/DavidP10> dblp:authoredBy <https://dblp.org/pid/29/6126> FILTER NOT EXISTS { <https://dblp.org/rec/conf/coco/DavidP10> dblp:authoredBy <https://dblp.org/pid/29/6126> } }","paraphrases":["Wasn't the paper 'Trade-Off Lower Bounds for Stack Machines' not published by the author M. David?"],"info":{}}
{"id":"train_1676","question":"Wasn't the paper 'Fine Grained Attribute Based Access Control Model for Privacy Protection' published by the author Si, Tran The in FDSE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fdse/ThiSD16> dblp:authoredBy <https://dblp.org/pid/188/7068> . <https://dblp.org/rec/conf/fdse/ThiSD16> dblp:publishedIn 'FDSE' FILTER NOT EXISTS { <https://dblp.org/rec/conf/fdse/ThiSD16> dblp:authoredBy <https://dblp.org/pid/188/7068> . <https://dblp.org/rec/conf/fdse/ThiSD16> dblp:publishedIn 'FDSE' } }","paraphrases":["Did Tran The Si not publish the paper 'Fine Grained Attribute Based Access Control Model for Privacy Protection' in FDSE?"],"info":{}}
{"id":"train_1677","question":"Was the paper 'Model-based recognition of human walking in dynamic scenes' not co-authored by Jia-Ching Cheng and Moura, Jos\\u00E9 M. F.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mmsp/ChengM97> dblp:authoredBy <https://dblp.org/pid/76/2583> . <https://dblp.org/rec/conf/mmsp/ChengM97> dblp:authoredBy <https://dblp.org/pid/m/JMFMoura> FILTER NOT EXISTS { <https://dblp.org/rec/conf/mmsp/ChengM97> dblp:authoredBy <https://dblp.org/pid/76/2583> . <https://dblp.org/rec/conf/mmsp/ChengM97> dblp:authoredBy <https://dblp.org/pid/m/JMFMoura> } }","paraphrases":["Have Cheng, J. and Jos\\u00E9 M. F. Moura not co-authored the paper 'Model-based recognition of human walking in dynamic scenes'?"],"info":{}}
{"id":"train_1679","question":"Was the paper 'Macro Generation Algorithms for LSI Custom Chip Design' not published by Bernard V.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ibmrd/Vergnieres80> dblp:authoredBy <https://dblp.org/pid/264/8704> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ibmrd/Vergnieres80> dblp:authoredBy <https://dblp.org/pid/264/8704> } }","paraphrases":["Has Bernard Vergnieres not published the paper 'Macro Generation Algorithms for LSI Custom Chip Design'?"],"info":{}}
{"id":"train_1680","question":"Wasn't the paper 'Estimating 3-dimensional liver motion using deep learning and 2-dimensional ultrasound images' not published by the person named Ryosuke Kondo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cars/YagasakiKNKIMON20> dblp:authoredBy <https://dblp.org/pid/161/1144> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cars/YagasakiKNKIMON20> dblp:authoredBy <https://dblp.org/pid/161/1144> } }","paraphrases":["Has Ryosuke K. not published the paper 'Estimating 3-dimensional liver motion using deep learning and 2-dimensional ultrasound images'?"],"info":{}}
{"id":"train_1681","question":"Has J. J. Allan III not published the paper 'Design optimization by adaptive control'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dac/ReynoldsA72> dblp:authoredBy <https://dblp.org/pid/77/5272> FILTER NOT EXISTS { <https://dblp.org/rec/conf/dac/ReynoldsA72> dblp:authoredBy <https://dblp.org/pid/77/5272> } }","paraphrases":["Was the paper 'Design optimization by adaptive control' not published by John J. Allan III?"],"info":{}}
{"id":"train_1682","question":"Did D. Petrisan and Overill, Richard E. not co-author the paper 'SIGLOG monthly 205'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siglog/Petrisan20a> dblp:authoredBy <https://dblp.org/pid/72/3703> . <https://dblp.org/rec/journals/siglog/Petrisan20a> dblp:authoredBy <https://dblp.org/pid/95/1596> FILTER NOT EXISTS { <https://dblp.org/rec/journals/siglog/Petrisan20a> dblp:authoredBy <https://dblp.org/pid/72/3703> . <https://dblp.org/rec/journals/siglog/Petrisan20a> dblp:authoredBy <https://dblp.org/pid/95/1596> } }","paraphrases":["Have D. Petrisan and Overill, Richard E. not co-authored the paper 'SIGLOG monthly 205'?"],"info":{}}
{"id":"train_1683","question":"Did G. Flegar not publish the paper 'Variable-Size Batched LU for Small Matrices and Its Integration into Block-Jacobi Preconditioning' in ICPP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icpp/AnztDFQ17> dblp:authoredBy <https://dblp.org/pid/193/9905> . <https://dblp.org/rec/conf/icpp/AnztDFQ17> dblp:publishedIn 'ICPP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icpp/AnztDFQ17> dblp:authoredBy <https://dblp.org/pid/193/9905> . <https://dblp.org/rec/conf/icpp/AnztDFQ17> dblp:publishedIn 'ICPP' } }","paraphrases":["Was the paper 'Variable-Size Batched LU for Small Matrices and Its Integration into Block-Jacobi Preconditioning' not published by G. Flegar in International Conference on Parallel Processing?"],"info":{}}
{"id":"train_1685","question":"Has the paper 'Tutorial on VLSI Partitioning' not been published by Chung-Kuan C. in VLSI Design?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/vlsi/ChenC00> dblp:authoredBy <https://dblp.org/pid/c/ChungKuanCheng> . <https://dblp.org/rec/journals/vlsi/ChenC00> dblp:publishedIn 'VLSI Design' FILTER NOT EXISTS { <https://dblp.org/rec/journals/vlsi/ChenC00> dblp:authoredBy <https://dblp.org/pid/c/ChungKuanCheng> . <https://dblp.org/rec/journals/vlsi/ChenC00> dblp:publishedIn 'VLSI Design' } }","paraphrases":["Wasn't the paper 'Tutorial on VLSI Partitioning' published by the author Chung-Kuan Cheng in VLSI Design?"],"info":{}}
{"id":"train_1687","question":"Was the paper 'Control Contribution identifies Top Driver Nodes in Complex Networks' not co-authored by Frank Schweitzer and Y. Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/advcs/ZhangGS19> dblp:authoredBy <https://dblp.org/pid/67/4271> . <https://dblp.org/rec/journals/advcs/ZhangGS19> dblp:authoredBy <https://dblp.org/pid/04/3348> FILTER NOT EXISTS { <https://dblp.org/rec/journals/advcs/ZhangGS19> dblp:authoredBy <https://dblp.org/pid/67/4271> . <https://dblp.org/rec/journals/advcs/ZhangGS19> dblp:authoredBy <https://dblp.org/pid/04/3348> } }","paraphrases":["Did Frank S. and Y. Zhang not co-author the paper 'Control Contribution identifies Top Driver Nodes in Complex Networks'?"],"info":{}}
{"id":"train_1688","question":"Did Xue-Min Song not publish the paper 'Research on Hydroelastic Response of an FMRC Hexagon Enclosed Platform' in Symmetry?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/symmetry/LiuXZYWS21> dblp:authoredBy <https://dblp.org/pid/299/3680> . <https://dblp.org/rec/journals/symmetry/LiuXZYWS21> dblp:publishedIn 'Symmetry' FILTER NOT EXISTS { <https://dblp.org/rec/journals/symmetry/LiuXZYWS21> dblp:authoredBy <https://dblp.org/pid/299/3680> . <https://dblp.org/rec/journals/symmetry/LiuXZYWS21> dblp:publishedIn 'Symmetry' } }","paraphrases":["Was the paper 'Research on Hydroelastic Response of an FMRC Hexagon Enclosed Platform' not published by Song, Xue-Min in Symmetry?"],"info":{}}
{"id":"train_1689","question":"Have Lee, H. W. and Kim, S. H. not co-authored the paper 'Relative enhancements of ozone, carbon monoxide, nitrogen dioxide, and aerosols at the Earth's surface during Asian dust episodes in spring'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/igarss/MoonKSLKL02> dblp:authoredBy <https://dblp.org/pid/83/2937> . <https://dblp.org/rec/conf/igarss/MoonKSLKL02> dblp:authoredBy <https://dblp.org/pid/04/2329> FILTER NOT EXISTS { <https://dblp.org/rec/conf/igarss/MoonKSLKL02> dblp:authoredBy <https://dblp.org/pid/83/2937> . <https://dblp.org/rec/conf/igarss/MoonKSLKL02> dblp:authoredBy <https://dblp.org/pid/04/2329> } }","paraphrases":["Was the paper 'Relative enhancements of ozone, carbon monoxide, nitrogen dioxide, and aerosols at the Earth's surface during Asian dust episodes in spring' not co-authored by H. W. Lee and Kim, S. H.?"],"info":{}}
{"id":"train_1690","question":"Have Mohammad Javad Deriss and Clark, N. J. not co-authored the paper 'Review of topics related to autism spectrum disorder on Twitter'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/netmahib/Deriss19> dblp:authoredBy <https://dblp.org/pid/246/3384> . <https://dblp.org/rec/journals/netmahib/Deriss19> dblp:authoredBy <https://dblp.org/pid/314/9230> FILTER NOT EXISTS { <https://dblp.org/rec/journals/netmahib/Deriss19> dblp:authoredBy <https://dblp.org/pid/246/3384> . <https://dblp.org/rec/journals/netmahib/Deriss19> dblp:authoredBy <https://dblp.org/pid/314/9230> } }","paraphrases":["Was the paper 'Review of topics related to autism spectrum disorder on Twitter' not co-authored by Deriss, M. Javad and Nicholas J. Clark?"],"info":{}}
{"id":"train_1691","question":"Was the paper 'Coverage Optimization in DSL Networks by Low-Complexity Discrete Spectrum Balancing' not published by Martin Wolkerstorfer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/WolkerstorferN11> dblp:authoredBy <https://dblp.org/pid/95/8859> FILTER NOT EXISTS { <https://dblp.org/rec/conf/globecom/WolkerstorferN11> dblp:authoredBy <https://dblp.org/pid/95/8859> } }","paraphrases":["Didn't Martin Wolkerstorfer publish the paper 'Coverage Optimization in DSL Networks by Low-Complexity Discrete Spectrum Balancing'?"],"info":{}}
{"id":"train_1692","question":"Was the paper 'A performance analysis of the network formation process in IEEE 802154e TSCH wireless sensor/actuator networks' not co-authored by Giuseppe Anastasi and Domenico De Guglielmo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscc/GuglielmoSAC14> dblp:authoredBy <https://dblp.org/pid/82/2448> . <https://dblp.org/rec/conf/iscc/GuglielmoSAC14> dblp:authoredBy <https://dblp.org/pid/119/9072> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iscc/GuglielmoSAC14> dblp:authoredBy <https://dblp.org/pid/82/2448> . <https://dblp.org/rec/conf/iscc/GuglielmoSAC14> dblp:authoredBy <https://dblp.org/pid/119/9072> } }","paraphrases":["Have Giuseppe Anastasi and D. De Guglielmo not co-authored the paper 'A performance analysis of the network formation process in IEEE 802154e TSCH wireless sensor/actuator networks'?"],"info":{}}
{"id":"train_1695","question":"Has Zhu, Yufei not published the paper 'Primary and secondary QoS guranteed spectrum sharing protocol with optimal time allocation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chinacom/ZhuLPLH15> dblp:authoredBy <https://dblp.org/pid/183/1629> FILTER NOT EXISTS { <https://dblp.org/rec/conf/chinacom/ZhuLPLH15> dblp:authoredBy <https://dblp.org/pid/183/1629> } }","paraphrases":["Wasn't the paper 'Primary and secondary QoS guranteed spectrum sharing protocol with optimal time allocation' not published by the author Yufei Zhu?"],"info":{}}
{"id":"train_1696","question":"Have Wang, Chih-Hung and Chih-Yu Liu not co-authored the paper 'A new ring signature scheme with signer-admission property'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/isci/WangL07> dblp:authoredBy <https://dblp.org/pid/21/1084> . <https://dblp.org/rec/journals/isci/WangL07> dblp:authoredBy <https://dblp.org/pid/72/2345> FILTER NOT EXISTS { <https://dblp.org/rec/journals/isci/WangL07> dblp:authoredBy <https://dblp.org/pid/21/1084> . <https://dblp.org/rec/journals/isci/WangL07> dblp:authoredBy <https://dblp.org/pid/72/2345> } }","paraphrases":["Was the paper 'A new ring signature scheme with signer-admission property' not co-authored by Wang, Chih-Hung and C. Liu?"],"info":{}}
{"id":"train_1698","question":"Was the paper 'Clustering-based feature selection for black-box weather temperature prediction' not published by Zahra Karevan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcnn/KarevanS16> dblp:authoredBy <https://dblp.org/pid/157/6788> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ijcnn/KarevanS16> dblp:authoredBy <https://dblp.org/pid/157/6788> } }","paraphrases":["Didn't Zahra Karevan publish the paper 'Clustering-based feature selection for black-box weather temperature prediction'?"],"info":{}}
{"id":"train_1699","question":"Wasn't the paper 'The Mathematical Theory of Dynamic Load Balancing in Cellular Networks' published by the author Yanmaz, Evsen in IEEE Trans. Mob. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tmc/TonguzY08> dblp:authoredBy <https://dblp.org/pid/44/849> . <https://dblp.org/rec/journals/tmc/TonguzY08> dblp:publishedIn 'IEEE Trans. Mob. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tmc/TonguzY08> dblp:authoredBy <https://dblp.org/pid/44/849> . <https://dblp.org/rec/journals/tmc/TonguzY08> dblp:publishedIn 'IEEE Trans. Mob. Comput.' } }","paraphrases":["Was the paper 'The Mathematical Theory of Dynamic Load Balancing in Cellular Networks' not published by Yanmaz, Evsen in IEEE Trans. Mob. Comput.?"],"info":{}}
{"id":"train_1700","question":"Was the paper 'Self-similarity Analysis and Application of Network Traffic' not published by Qianmu Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mobicase/XuLM19> dblp:authoredBy <https://dblp.org/pid/31/2728> FILTER NOT EXISTS { <https://dblp.org/rec/conf/mobicase/XuLM19> dblp:authoredBy <https://dblp.org/pid/31/2728> } }","paraphrases":["Wasn't the paper 'Self-similarity Analysis and Application of Network Traffic' not published by the person named Li, Q.?"],"info":{}}
{"id":"train_1701","question":"Was the paper 'Public cloud computing for Software as a Service platforms' not co-authored by Michal Sobon and Piotr Nawrocki?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/aghcs/NawrockiS14> dblp:authoredBy <https://dblp.org/pid/152/7518> . <https://dblp.org/rec/journals/aghcs/NawrockiS14> dblp:authoredBy <https://dblp.org/pid/41/7718> FILTER NOT EXISTS { <https://dblp.org/rec/journals/aghcs/NawrockiS14> dblp:authoredBy <https://dblp.org/pid/152/7518> . <https://dblp.org/rec/journals/aghcs/NawrockiS14> dblp:authoredBy <https://dblp.org/pid/41/7718> } }","paraphrases":["Did Michal Sobon and P. Nawrocki not co-author the paper 'Public cloud computing for Software as a Service platforms'?"],"info":{}}
{"id":"train_1702","question":"Did Snoeck, Monique not publish the paper 'Academic and Industry Training for Data Modelling: Ideas for Mutual Benefit'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icse/BogdanovaS22> dblp:authoredBy <https://dblp.org/pid/70/2587> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icse/BogdanovaS22> dblp:authoredBy <https://dblp.org/pid/70/2587> } }","paraphrases":["Was the paper 'Academic and Industry Training for Data Modelling: Ideas for Mutual Benefit' not published by Monique Snoeck?"],"info":{}}
{"id":"train_1705","question":"Has Huan Zhao not published the paper 'Kullback-Leibler Divergence-Based Visual Servoing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aimech/LiZD21> dblp:authoredBy <https://dblp.org/pid/15/3548> FILTER NOT EXISTS { <https://dblp.org/rec/conf/aimech/LiZD21> dblp:authoredBy <https://dblp.org/pid/15/3548> } }","paraphrases":["Did Zhao, H. not publish the paper 'Kullback-Leibler Divergence-Based Visual Servoing'?"],"info":{}}
{"id":"train_1706","question":"Has the paper 'Multi-Domain Transfer Learning for Early Diagnosis of Alzheimer's Disease' not been published by Daoqiang Z. in Neuroinformatics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ni/ChengLSLZ17> dblp:authoredBy <https://dblp.org/pid/03/2763> . <https://dblp.org/rec/journals/ni/ChengLSLZ17> dblp:publishedIn 'Neuroinformatics' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ni/ChengLSLZ17> dblp:authoredBy <https://dblp.org/pid/03/2763> . <https://dblp.org/rec/journals/ni/ChengLSLZ17> dblp:publishedIn 'Neuroinformatics' } }","paraphrases":["Wasn't the paper 'Multi-Domain Transfer Learning for Early Diagnosis of Alzheimer's Disease' published by the author Daoqiang Z. in Neuroinformatics?"],"info":{}}
{"id":"train_1707","question":"Wasn't the paper 'A decision tree based approach towards adaptive modeling of big data applications' published by the author Giannakopoulos, I. in IEEE BigData?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bigdataconf/GiannakopoulosT17> dblp:authoredBy <https://dblp.org/pid/156/7390> . <https://dblp.org/rec/conf/bigdataconf/GiannakopoulosT17> dblp:publishedIn 'IEEE BigData' FILTER NOT EXISTS { <https://dblp.org/rec/conf/bigdataconf/GiannakopoulosT17> dblp:authoredBy <https://dblp.org/pid/156/7390> . <https://dblp.org/rec/conf/bigdataconf/GiannakopoulosT17> dblp:publishedIn 'IEEE BigData' } }","paraphrases":["Has the paper 'A decision tree based approach towards adaptive modeling of big data applications' not been published by Giannakopoulos, I. in IEEE BigData?"],"info":{}}
{"id":"train_1708","question":"Did Igor R. Shafarevich and Aleksei I. Kostrikin not co-author the paper 'Algebra II - noncommutative rings ; identities'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/daglib/0091051> dblp:authoredBy <https://dblp.org/pid/245/0409> . <https://dblp.org/rec/books/daglib/0091051> dblp:authoredBy <https://dblp.org/pid/245/0494> FILTER NOT EXISTS { <https://dblp.org/rec/books/daglib/0091051> dblp:authoredBy <https://dblp.org/pid/245/0409> . <https://dblp.org/rec/books/daglib/0091051> dblp:authoredBy <https://dblp.org/pid/245/0494> } }","paraphrases":["Was the paper 'Algebra II - noncommutative rings ; identities' not co-authored by Igor R. Shafarevich and A. I. Kostrikin?"],"info":{}}
{"id":"train_1709","question":"Was the paper 'Event-driven Surgical Gesture Segmentation and Task Recognition for Ocular Trauma Simulation' not published by Moore, J. Cho in Intelligent Environments?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/intenv/NoviBSOMA12> dblp:authoredBy <https://dblp.org/pid/118/4920> . <https://dblp.org/rec/conf/intenv/NoviBSOMA12> dblp:publishedIn 'Intelligent Environments (Workshops)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/intenv/NoviBSOMA12> dblp:authoredBy <https://dblp.org/pid/118/4920> . <https://dblp.org/rec/conf/intenv/NoviBSOMA12> dblp:publishedIn 'Intelligent Environments (Workshops)' } }","paraphrases":["Has the paper 'Event-driven Surgical Gesture Segmentation and Task Recognition for Ocular Trauma Simulation' not been published by Moore, J. Cho in Intelligent Environments (Workshops)?"],"info":{}}
