{"id":"train_6962","question":"Between 'Lightweight power line communications for Smart Grid applications with standard RFID tags' and 'Survey: Concentration Inequalities and Martingale Inequalities: A Survey', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/globecom/HuettnerKMZ12> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/im/ChungL06> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/globecom/HuettnerKMZ12> , <https://dblp.org/rec/journals/im/ChungL06> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Lightweight power line communications for Smart Grid applications with standard RFID tags' or 'Survey: Concentration Inequalities and Martingale Inequalities: A Survey'?"],"info":{}}
{"id":"train_6963","question":"Mention the author who has published the most papers among the authors of 'Erratum to \\Reformulating table constraints using functional dependencies - an application to explanation generation\\'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/constraints/CambazardO10> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Erratum to \\Reformulating table constraints using functional dependencies - an application to explanation generation\\'?"],"info":{}}
{"id":"train_6964","question":"Mention the year in which the first papers of the authors of 'Automatic call section segmentation for contact-center calls' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/cikm/Park07> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Automatic call section segmentation for contact-center calls' published?"],"info":{}}
{"id":"train_6966","question":"Between 'An Abductive Question-Answer System for the Minimal Logic of Formal Inconsistency mbC' and 'Newton's iteration and the sparse Hensel algorithm (Extended Abstract)', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sLogica/ChlebowskiGU22> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/issac/Zippel81> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/sLogica/ChlebowskiGU22> , <https://dblp.org/rec/conf/issac/Zippel81> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'An Abductive Question-Answer System for the Minimal Logic of Formal Inconsistency mbC' or 'Newton's iteration and the sparse Hensel algorithm (Extended Abstract)'?"],"info":{}}
{"id":"train_6967","question":"Mention the author who has published the most papers among the authors of 'Direct Super-Resolution and Registration Using Raw CFA Images'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cvpr/GotohO04> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Direct Super-Resolution and Registration Using Raw CFA Images'?"],"info":{}}
{"id":"train_6968","question":"Which one was published first, 'A Study on MIMO Interference Canceller for Reverse-Link in HAPS Multi-Gateways' or 'Benchmarking for Graph Transformation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vtc/FujiiOF20a> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/vl/VarroSV05> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/vtc/FujiiOF20a> , <https://dblp.org/rec/conf/vl/VarroSV05> ) AS ?answer ) }","paraphrases":["Between 'A Study on MIMO Interference Canceller for Reverse-Link in HAPS Multi-Gateways' and 'Benchmarking for Graph Transformation', which paper was published earlier?"],"info":{}}
{"id":"train_6970","question":"Mention the author who has published the most papers among the authors of 'An SRP Target Mode to Improve Read Performance of SRP-Based IB-SANs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ispa/JiangHHWZH07> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'An SRP Target Mode to Improve Read Performance of SRP-Based IB-SANs'?"],"info":{}}
{"id":"train_6972","question":"Name the primary affiliation of most of the authors of 'Convex Drawings of Internally Triconnected Plane Graphs on O(n2) Grids'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/isaac/ZhouN09> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'Convex Drawings of Internally Triconnected Plane Graphs on O(n2) Grids' affiliated?"],"info":{}}
{"id":"train_6974","question":"What is the primary affiliation of most of the authors of the paper 'Guest Editorial'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/aai/PettaM00> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Guest Editorial' from?"],"info":{}}
{"id":"train_6975","question":"Between 'Turing Memorial Lecture Facing Up to Faults' and 'Graph-Based Approach For Representing Business Process Models In Case Of Measuring Business Logic Dependencies', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cj/Randell00> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/mcis/MironovG17> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/cj/Randell00> , <https://dblp.org/rec/conf/mcis/MironovG17> ) AS ?answer ) }","paraphrases":["Between 'Turing Memorial Lecture Facing Up to Faults' and 'Graph-Based Approach For Representing Business Process Models In Case Of Measuring Business Logic Dependencies', which paper has more authors?"],"info":{}}
{"id":"train_6977","question":"Which one was published first, 'Fast frequency-hopping dynamic multiple-access for cognitive radios: Suboptimum noncoherent maximum-likelihood multiuser detection' or 'DC charger selection scheme for electric vehicle-based tours visiting multiple destinations'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iswcs/ZhangYZ10> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/racs/LeeP14> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/iswcs/ZhangYZ10> , <https://dblp.org/rec/conf/racs/LeeP14> ) AS ?answer ) }","paraphrases":["Between 'Fast frequency-hopping dynamic multiple-access for cognitive radios: Suboptimum noncoherent maximum-likelihood multiuser detection' and 'DC charger selection scheme for electric vehicle-based tours visiting multiple destinations', which paper was published earlier?"],"info":{}}
{"id":"train_6978","question":"Between 'Is Your Game Generator Working? Evaluating Gemini, an Intentional Generator' and 'A Requirements Engineering Process Adapted to Global Software Development', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aiide/OsbornDASDTWM19> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/cleiej/MighettiH16> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/aiide/OsbornDASDTWM19> , <https://dblp.org/rec/journals/cleiej/MighettiH16> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Is Your Game Generator Working? Evaluating Gemini, an Intentional Generator' or 'A Requirements Engineering Process Adapted to Global Software Development'?"],"info":{}}
{"id":"train_6979","question":"Between 'Guest Editorial: Special Issue on Advances in Vehicle Routing' and 'Editorial: Marr Prize and Honorable Mentions at ICCV 2005', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/transci/ChristiansenHL13> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ijcv/Schnorr07> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/transci/ChristiansenHL13> , <https://dblp.org/rec/journals/ijcv/Schnorr07> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Guest Editorial: Special Issue on Advances in Vehicle Routing' or 'Editorial: Marr Prize and Honorable Mentions at ICCV 2005'?"],"info":{}}
{"id":"train_6982","question":"Between 'Language processing in connection with speech translation at ATR interpreting telephony research laboratories' and 'Special issue on \\computer graphics and virtual reality\\', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/speech/KurematsuIMS91> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/vlc/HungSH03> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/speech/KurematsuIMS91> , <https://dblp.org/rec/journals/vlc/HungSH03> ) AS ?answer ) }","paraphrases":["Between 'Language processing in connection with speech translation at ATR interpreting telephony research laboratories' and 'Special issue on \\computer graphics and virtual reality\\', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6983","question":"Between 'Automatic \\Ground Truth\\ Annotation and Industrial Workpiece Dataset Generation for Deep Learning' and 'Systems Engineering for Assessment of Virtual Power System Implementations', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijautcomp/LiuW20> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/ifip12/LukovicK13> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/ijautcomp/LiuW20> , <https://dblp.org/rec/conf/ifip12/LukovicK13> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Automatic \\Ground Truth\\ Annotation and Industrial Workpiece Dataset Generation for Deep Learning' or 'Systems Engineering for Assessment of Virtual Power System Implementations'?"],"info":{}}
{"id":"train_6986","question":"Which one was published first, 'Microcomputer Playfulness: Developing a Measure With Workplace Implications' or 'Hacking for a cause'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/misq/WebsterM92> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/firstmonday/Still05> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/misq/WebsterM92> , <https://dblp.org/rec/journals/firstmonday/Still05> ) AS ?answer ) }","paraphrases":["Between 'Microcomputer Playfulness: Developing a Measure With Workplace Implications' and 'Hacking for a cause', which paper was published earlier?"],"info":{}}
{"id":"train_6987","question":"Mention the primary affiliation of most of the authors of 'Three-dimensional aerial base station location for sudden traffic with deep reinforcement learning in 5G mmWave networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijdsn/YuGHSWD20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Three-dimensional aerial base station location for sudden traffic with deep reinforcement learning in 5G mmWave networks' from?"],"info":{}}
{"id":"train_6988","question":"Mention the author who has published the most papers among the authors of 'Discovering Cyclic Causal Models by Independent Components Analysis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-1206-3273> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Discovering Cyclic Causal Models by Independent Components Analysis'?"],"info":{}}
{"id":"train_6990","question":"Mention the author who has published the most papers among the authors of 'Spatial random modeling of vehicular traffic in VANETs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/itsc/LiuGW17> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Spatial random modeling of vehicular traffic in VANETs'?"],"info":{}}
{"id":"train_6991","question":"Between 'Visualizing DNS traffic' and 'A modular approach to training', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vizsec/RenKG06> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/siguccs/Kraus86> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/vizsec/RenKG06> , <https://dblp.org/rec/conf/siguccs/Kraus86> ) AS ?answer ) }","paraphrases":["Between 'Visualizing DNS traffic' and 'A modular approach to training', which paper has more authors?"],"info":{}}
{"id":"train_6992","question":"Between 'Self-Aligned Double Patterning Aware Pin Access and Standard Cell Layout Co-Optimization' and 'On Performance Prediction of Parallel Computations with Precedent Constraints', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcad/XuCYYP15> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/tpds/LiangT00> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tcad/XuCYYP15> , <https://dblp.org/rec/journals/tpds/LiangT00> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Self-Aligned Double Patterning Aware Pin Access and Standard Cell Layout Co-Optimization' or 'On Performance Prediction of Parallel Computations with Precedent Constraints'?"],"info":{}}
{"id":"train_6993","question":"Between 'Parameter Estimation in Bayesian Networks from Incomplete Databases' and 'Consensus for Crosschain Communications', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ida/RamoniS98> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/abs-2004-09494> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/ida/RamoniS98> , <https://dblp.org/rec/journals/corr/abs-2004-09494> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Parameter Estimation in Bayesian Networks from Incomplete Databases' or 'Consensus for Crosschain Communications'?"],"info":{}}
{"id":"train_6995","question":"Between 'Discovering topics from dark websites' and 'Visible-Band Nanosecond Pulsed Laser Damage Thresholds of Silicon 2D Imaging Arrays', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cics/YangLKE09> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/sensors/WestgateJ22> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/cics/YangLKE09> , <https://dblp.org/rec/journals/sensors/WestgateJ22> ) AS ?answer ) }","paraphrases":["Between 'Discovering topics from dark websites' and 'Visible-Band Nanosecond Pulsed Laser Damage Thresholds of Silicon 2D Imaging Arrays', which paper has more authors?"],"info":{}}
{"id":"train_6996","question":"Mention the primary affiliation of most of the authors of 'A new FCA algorithm enabling analyzing of complex and dynamic data sets'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/soco/GajdosS14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Name the primary affiliation of most of the authors of 'A new FCA algorithm enabling analyzing of complex and dynamic data sets'."],"info":{}}
{"id":"train_6997","question":"Between 'IR models: foundations and relationships' and 'Modellbasierte Regelung pneumatisch betriebener Herzunterst\\u00FCtzungssysteme', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigir/Roelleke12> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/at/SievertDLAS11> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/sigir/Roelleke12> , <https://dblp.org/rec/journals/at/SievertDLAS11> ) AS ?answer ) }","paraphrases":["Between 'IR models: foundations and relationships' and 'Modellbasierte Regelung pneumatisch betriebener Herzunterst\\u00FCtzungssysteme', which paper has more authors?"],"info":{}}
{"id":"train_6998","question":"Which one was published first, 'Blind Adversarial Pruning: Balance Accuracy, Efficiency and Robustness' or 'PROMETHEUS database: A multimodal corpus for research on modeling and interpreting human behavior'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2004-05913> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/icdsp/NtalampirasASGP09> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/corr/abs-2004-05913> , <https://dblp.org/rec/conf/icdsp/NtalampirasASGP09> ) AS ?answer ) }","paraphrases":["Between 'Blind Adversarial Pruning: Balance Accuracy, Efficiency and Robustness' and 'PROMETHEUS database: A multimodal corpus for research on modeling and interpreting human behavior', which paper was published earlier?"],"info":{}}
{"id":"train_6999","question":"Which one was published first, '2018 IEEE Transactions on Control Systems Technology Outstanding Paper Award' or 'Instance-Based Non-standard Inferences in $\\\\mathcal{EL}$ with Subjective Probabilities'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcst/Ruppert19> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/semweb/PenalozaT13> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/tcst/Ruppert19> , <https://dblp.org/rec/conf/semweb/PenalozaT13> ) AS ?answer ) }","paraphrases":["Between '2018 IEEE Transactions on Control Systems Technology Outstanding Paper Award' and 'Instance-Based Non-standard Inferences in $\\\\mathcal{EL}$ with Subjective Probabilities', which paper was published earlier?"],"info":{}}
