{"id":"train_2173","question":"What papers did Hamid Aghvami publish in IEEE Trans. Mob. Comput. and J. Int. Comput. Games Assoc.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/a/AHAghvami> { ?answer dblp:publishedIn 'IEEE Trans. Mob. Comput.' } UNION { ?answer dblp:publishedIn 'J. Int. Comput. Games Assoc.' } }","paraphrases":["In IEEE Trans. Mob. Comput. and J. Int. Comput. Games Assoc., what papers did Hamid A. publish?"],"info":{}}
{"id":"train_2174","question":"List all the papers that Schilling, K. and H. Suman published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/34/6450> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/50/3979> } }","paraphrases":["What are the papers that Schilling, K. and H. Suman published?"],"info":{}}
{"id":"train_2175","question":"In IWDC and Vis. Comput., what papers did Anand S. Jalal publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/2594> { ?answer dblp:publishedIn 'IWDC' } UNION { ?answer dblp:publishedIn 'Vis. Comput.' } }","paraphrases":["What papers did Anand S. Jalal publish in IWDC and Vis. Comput.?"],"info":{}}
{"id":"train_2178","question":"List all the papers that Kennedy E. and Beakcheol Jang published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/153/2184> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/64/8342> } }","paraphrases":["What are the papers that Kennedy E. and Jang, Beakcheol published?"],"info":{}}
{"id":"train_2179","question":"List all the papers that Sang C. Park and Shuai Han published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/28/5463> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/59/9242-1> } }","paraphrases":["What are the papers that Sang C. Park and Shuai Han published?"],"info":{}}
{"id":"train_2180","question":"What are the primary affiliations of Jim Pugh and A. Martinoli?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/16/747> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/m/AMartinoli> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Pugh, J. and A. Martinoli."],"info":{}}
{"id":"train_2181","question":"List all the papers that Haihao S. and Yun Wang published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/83/4358> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/36/3235> } }","paraphrases":["What are the papers that Haihao S. and Yun Wang published?"],"info":{}}
{"id":"train_2182","question":"In IEEE Computer Graphics and Applications and Ubiquity, what papers did Rushmeier, H. E. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/13/6571> { ?answer dblp:publishedIn 'IEEE Computer Graphics and Applications' } UNION { ?answer dblp:publishedIn 'Ubiquity' } }","paraphrases":["What papers did Rushmeier, H. E. publish in IEEE Computer Graphics and Applications and Ubiquity?"],"info":{}}
{"id":"train_2184","question":"What are the papers that Vincent Verillotte and Keith W. Ross published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/17/3447> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/r/KWRoss> } }","paraphrases":["List all the papers that Vincent Verillotte and Keith W. Ross published."],"info":{}}
{"id":"train_2185","question":"In CURAC and Automated Software Engineering Conference, what papers did Kathy J. Schilling publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/59/7922> { ?answer dblp:publishedIn 'CURAC' } UNION { ?answer dblp:publishedIn 'ASE' } }","paraphrases":["What papers did Kathy J. Schilling publish in CURAC and Automated Software Engineering Conference?"],"info":{}}
{"id":"train_2188","question":"In Int. J. Circuit Theory Appl. and Sensors, what papers did R. Kammari publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/247/3670> { ?answer dblp:publishedIn 'Int. J. Circuit Theory Appl.' } UNION { ?answer dblp:publishedIn 'Sensors' } }","paraphrases":["What papers did R. Kammari publish in Int. J. Circuit Theory Appl. and Sensors?"],"info":{}}
{"id":"train_2189","question":"What papers did Reza Tavakkoli-Moghaddam publish in SOHOMA and Int. J. Sens. Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/15/1215> { ?answer dblp:publishedIn 'SOHOMA' } UNION { ?answer dblp:publishedIn 'Int. J. Sens. Networks' } }","paraphrases":["In SOHOMA and Int. J. Sens. Networks, what papers did Tavakkoli-Moghaddam, Reza publish?"],"info":{}}
{"id":"train_2190","question":"In ISSCC and Inf. Secur. Tech. Rep., what papers did Zeynep Toprak Deniz publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/28/6867> { ?answer dblp:publishedIn 'ISSCC' } UNION { ?answer dblp:publishedIn 'Inf. Secur. Tech. Rep.' } }","paraphrases":["What papers did Zeynep Toprak Deniz publish in ISSCC and Inf. Secur. Tech. Rep.?"],"info":{}}
{"id":"train_2191","question":"List all the papers that Abhishek Dixit and Sonali published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/122/5422> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/186/2975> } }","paraphrases":["What are the papers that Dixit, Abhishek and Sonali published?"],"info":{}}
{"id":"train_2192","question":"List all the papers that Yen-Ting Cheng and Lin, Jyun-Ting published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/188/6831> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/147/0962> } }","paraphrases":["What are the papers that Y. Cheng and Jyun-Ting Lin published?"],"info":{}}
{"id":"train_2193","question":"List all the papers that R. Szeto and Kunyi Lu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/198/0479> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/271/1110> } }","paraphrases":["What are the papers that Ryan Szeto and Kunyi Lu published?"],"info":{}}
{"id":"train_2194","question":"What papers did Mario E. Salgado publish in CDC and TREC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/4887> { ?answer dblp:publishedIn 'CDC' } UNION { ?answer dblp:publishedIn 'TREC' } }","paraphrases":["In CDC and TREC, what papers did Mario E. Salgado publish?"],"info":{}}
{"id":"train_2195","question":"In NeuroImage and IEEE Trans. Knowl. Data Eng., what papers did J. J. A. Van Berkum publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/4638> { ?answer dblp:publishedIn 'NeuroImage' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Knowl. Data Eng.' } }","paraphrases":["What papers did J. J. A. Van Berkum publish in NeuroImage and IEEE Trans. Knowl. Data Eng.?"],"info":{}}
{"id":"train_2196","question":"In Discret. Appl. Math. and J. Comput. Phys., what papers did Kathryn F. Jones publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/91/3832> { ?answer dblp:publishedIn 'Discret. Appl. Math.' } UNION { ?answer dblp:publishedIn 'J. Comput. Phys.' } }","paraphrases":["What papers did Jones, Kathryn F. publish in Discret. Appl. Math. and J. Comput. Phys.?"],"info":{}}
{"id":"train_2198","question":"What papers did S. Schwartz publish in Neural Comput. Appl. and CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/273/0050> { ?answer dblp:publishedIn 'Neural Comput. Appl.' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["In Neural Comput. Appl. and CoRR, what papers did S\\u00E9bastien Schwartz publish?"],"info":{}}
{"id":"train_2199","question":"What papers did Rong-Chin L. publish in Pattern Recognit. and ACL (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/73/342> { ?answer dblp:publishedIn 'Pattern Recognit.' } UNION { ?answer dblp:publishedIn 'ACL (1)' } }","paraphrases":["In Pattern Recognit. and ACL (1), what papers did Rong-Chin L. publish?"],"info":{}}
{"id":"train_2201","question":"In IEEE Trans. Intell. Transp. Syst. and Int. J. Math. Math. Sci., what papers did Edmund K. Burke publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/EdmundKBurke> { ?answer dblp:publishedIn 'IEEE Trans. Intell. Transp. Syst.' } UNION { ?answer dblp:publishedIn 'Int. J. Math. Math. Sci.' } }","paraphrases":["What papers did Edmund K. Burke publish in IEEE Trans. Intell. Transp. Syst. and Int. J. Math. Math. Sci.?"],"info":{}}
{"id":"train_2203","question":"What papers did Christopher Williamson publish in CoRR and International Conference for High Performance Computing, Networking, Storage and Analysis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/724> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'SC' } }","paraphrases":["In CoRR and SC, what papers did Christopher Williamson publish?"],"info":{}}
{"id":"train_2204","question":"List all the primary affiliations of Mark O. Riedl and N. Sugandh.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/r/MarkORiedl> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/62/2952> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Riedl, M. O. and Neha Sugandh?"],"info":{}}
{"id":"train_2205","question":"What papers did Shen, H. publish in Bioinform. and IEEE International Conference on Computer and Information Technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/4415> { ?answer dblp:publishedIn 'Bioinform.' } UNION { ?answer dblp:publishedIn 'CIT' } }","paraphrases":["In Bioinform. and CIT, what papers did Hong-Bin Shen publish?"],"info":{}}
{"id":"train_2207","question":"What are the papers that Peng Du and X. Yang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/02/6086> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/175/6867> } }","paraphrases":["List all the papers that Du, Peng and X. Yang published."],"info":{}}
{"id":"train_2208","question":"What papers did K. W. Kim publish in ICC and IEEE/RSJ International Conference on Intelligent Robots and Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/12/4291> { ?answer dblp:publishedIn 'ICC' } UNION { ?answer dblp:publishedIn 'IROS' } }","paraphrases":["In ICC and IROS, what papers did K. W. Kim publish?"],"info":{}}
{"id":"train_2209","question":"List all the papers that Zhengbing Z. and Luoyu Z. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/183/5777> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/221/6343> } }","paraphrases":["What are the papers that Zhengbing Z. and Luoyu Z. published?"],"info":{}}
{"id":"train_2210","question":"In HPCS and IEEE Trans. Syst. Man Cybern. Syst., what papers did Paul Stocker publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/167/5713> { ?answer dblp:publishedIn 'HPCS' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Syst. Man Cybern. Syst.' } }","paraphrases":["What papers did Paul Stocker publish in HPCS and IEEE Trans. Syst. Man Cybern. Syst.?"],"info":{}}
{"id":"train_2211","question":"In CoRR and SIU, what papers did Kankanhalli, Mohan S. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/09/3613> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'SIU' } }","paraphrases":["What papers did Mohan S. Kankanhalli publish in CoRR and SIU?"],"info":{}}
{"id":"train_2212","question":"List all the primary affiliations of Renato De Mori and Dario A..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/86/129> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/04/3433> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Mori, R. De and Dario Albesano?"],"info":{}}
{"id":"train_2213","question":"List all the papers that Daniel Abrich and Kwiatkowski, J. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/61/7015> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/45/4357> } }","paraphrases":["What are the papers that Daniel Abrich and Jan Kwiatkowski published?"],"info":{}}
{"id":"train_2214","question":"In MDAI and ICUFN, what papers did A. Pradera publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/11/1854> { ?answer dblp:publishedIn 'MDAI' } UNION { ?answer dblp:publishedIn 'ICUFN' } }","paraphrases":["What papers did A. Pradera publish in MDAI and ICUFN?"],"info":{}}
{"id":"train_2215","question":"List all the primary affiliations of He, Xiangjian and Chao Ma.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/75/2122> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/79/1552-5> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of He, Xiangjian and Chao Ma?"],"info":{}}
{"id":"train_2216","question":"What papers did Subramanya D. publish in CoRR and IVCNZ?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/76/3788> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'IVCNZ' } }","paraphrases":["In CoRR and Image and Vision Computing Conference, what papers did Subramanya D. publish?"],"info":{}}
{"id":"train_2218","question":"List all the papers that D. Chakraborty and Craig Stanfill published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/167/7232> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/03/2817> } }","paraphrases":["What are the papers that D. Chakraborty and Craig Stanfill published?"],"info":{}}
{"id":"train_2219","question":"List all the papers that Philip L. Lopes and Yannakakis, G. N. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/151/3871> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/05/2576> } }","paraphrases":["What are the papers that Philip L. Lopes and Yannakakis, G. N. published?"],"info":{}}
{"id":"train_2220","question":"What are the primary affiliations of Yunhao Liu and J. Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/27/2403> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/75/3699> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Liu, Yunhao and J. Wang."],"info":{}}
{"id":"train_2221","question":"List all the papers that Hayden Wimmer and Jie Du published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/21/10831> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/74/6131> } }","paraphrases":["What are the papers that Hayden Wimmer and Jie D. published?"],"info":{}}
{"id":"train_2222","question":"List all the papers that Alberto S. and Debbah, M. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/s/AlbertoSuarez2> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/75/4085> } }","paraphrases":["What are the papers that Alberto Su\\u00E1rez and Debbah, M. published?"],"info":{}}
{"id":"train_2225","question":"List all the papers that Reuter-Oppermann, M. and Wolff, C. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/156/3045> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/165/0728> } }","paraphrases":["What are the papers that Melanie Reuter-Oppermann and Wolff, C. published?"],"info":{}}
{"id":"train_2226","question":"List all the papers that Gunawath Mudiyanselage Roshan Indika Godaliyadda and Suren Sritharan published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/17/10413> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/250/9404> } }","paraphrases":["What are the papers that Godaliyadda, G. Mudiyanselage Roshan Indika and Sritharan, S. published?"],"info":{}}
{"id":"train_2228","question":"List all the papers that Yuanbin Wang and Yang, H. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/15/8462> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/18/4919> } }","paraphrases":["What are the papers that Yuanbin Wang and Huayong Yang published?"],"info":{}}
{"id":"train_2229","question":"List all the papers that Dhillon, Sarabpreet Kaur and L. Ramaswamy published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/159/9052> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/r/LakshmishRamaswamy> } }","paraphrases":["What are the papers that Sarabpreet Kaur Dhillon and Lakshmish Ramaswamy published?"],"info":{}}
{"id":"train_2230","question":"List all the papers that A. Knapp and Stephan Janisch published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/58/2631> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/26/5167> } }","paraphrases":["What are the papers that A. Knapp and Janisch, Stephan published?"],"info":{}}
{"id":"train_2231","question":"List all the papers that Jong Hyuk Park and Joon-Min Gil published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/p/JongHyukPark> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/91/2995> } }","paraphrases":["What are the papers that Jong Hyuk Park and Joon-Min Gil published?"],"info":{}}
{"id":"train_2232","question":"In ECIS and NIPS, what papers did Alemayehu Molla publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/217> { ?answer dblp:publishedIn 'ECIS' } UNION { ?answer dblp:publishedIn 'NIPS' } }","paraphrases":["What papers did Alemayehu Molla publish in ECIS and NIPS?"],"info":{}}
{"id":"train_2233","question":"List all the primary affiliations of Lin, Y. and Yuan-Cheng Lai.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/l/YingDarLin> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/12/2250> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Lin, Y. and Yuan-Cheng L.?"],"info":{}}
{"id":"train_2234","question":"In IEEE Syst. J. and International Conference on Web Information Systems and Technologies, what papers did Diptendu S. Roy publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/10604> { ?answer dblp:publishedIn 'IEEE Syst. J.' } UNION { ?answer dblp:publishedIn 'WEBIST (2)' } }","paraphrases":["What papers did Diptendu Sinha Roy publish in IEEE Syst. J. and WEBIST (2)?"],"info":{}}
{"id":"train_2235","question":"What are the papers that Makoto Uchida and Yanbin Wu published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/92/1021> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/39/9266> } }","paraphrases":["List all the papers that Makoto Uchida and Wu, Yanbin published."],"info":{}}
{"id":"train_2236","question":"What are the papers that Maximillian Chen and S. Sahay published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/271/5890> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/18/4070> } }","paraphrases":["List all the papers that Chen, Maximillian and Saurav Sahay published."],"info":{}}
{"id":"train_2237","question":"What papers did Dorner, Daniel G. publish in Inf. Res. and Int. J. Hum. Comput. Interact.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/7469> { ?answer dblp:publishedIn 'Inf. Res.' } UNION { ?answer dblp:publishedIn 'Int. J. Hum. Comput. Interact.' } }","paraphrases":["In Inf. Res. and Int. J. Hum. Comput. Interact., what papers did Daniel G. Dorner publish?"],"info":{}}
{"id":"train_2238","question":"List all the papers that Yoshihiro Tsujino and Koshiro M. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/07/3237> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/269/7869> } }","paraphrases":["What are the papers that Yoshihiro Tsujino and Koshiro Matsumoto published?"],"info":{}}
{"id":"train_2239","question":"What papers did Casimiro, A. publish in WORDS and 4OR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/15/445> { ?answer dblp:publishedIn 'WORDS' } UNION { ?answer dblp:publishedIn '4OR' } }","paraphrases":["In WORDS and 4OR, what papers did Ant\\u00F3nio Casimiro publish?"],"info":{}}
{"id":"train_2240","question":"List all the papers that Tuomas Sandholm and Farina, Gabriele published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/s/TuomasSandholm> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/159/2090> } }","paraphrases":["What are the papers that Tuomas Sandholm and Farina, Gabriele published?"],"info":{}}
{"id":"train_2241","question":"List all the papers that Gregory Shakhnarovich and Yuval Bahat published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/17/1926> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/159/8756> } }","paraphrases":["What are the papers that G. Shakhnarovich and Yuval Bahat published?"],"info":{}}
{"id":"train_2242","question":"List all the papers that Philipp Schlatter and Luca Guastoni published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/97/10761> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/258/0946> } }","paraphrases":["What are the papers that Schlatter, P. and Luca Guastoni published?"],"info":{}}
{"id":"train_2243","question":"In Int. J. Commun. Syst. and CHI Extended Abstracts, what papers did Gebrehiwet Gebrekrstos Lema publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/254/1626> { ?answer dblp:publishedIn 'Int. J. Commun. Syst.' } UNION { ?answer dblp:publishedIn 'CHI Extended Abstracts' } }","paraphrases":["What papers did Lema, Gebrehiwet Gebrekrstos publish in Int. J. Commun. Syst. and CHI Extended Abstracts?"],"info":{}}
{"id":"train_2244","question":"What papers did Emmanuel Syrmoudis publish in Proc. Priv. Enhancing Technol. and International Conference on Semantics Knowledge and Grid?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/293/2325> { ?answer dblp:publishedIn 'Proc. Priv. Enhancing Technol.' } UNION { ?answer dblp:publishedIn 'SKG' } }","paraphrases":["In Proc. Priv. Enhancing Technol. and International Conference on Semantics Knowledge and Grid, what papers did Emmanuel Syrmoudis publish?"],"info":{}}
{"id":"train_2246","question":"What are the papers that Hua S. and Zhen Ye published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/06/162> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/46/5245> } }","paraphrases":["List all the papers that Hua Shu and Ye, Z. published."],"info":{}}
{"id":"train_2247","question":"List all the papers that Revithis, S. and M. Rupp published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/61/1810> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/66/6059> } }","paraphrases":["What are the papers that Revithis, S. and Markus Rupp published?"],"info":{}}
{"id":"train_2248","question":"List all the primary affiliations of Chung, Heejoon and Shuang Wang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/148/1800> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/86/220-2> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Chung, Heejoon and Shuang Wang?"],"info":{}}
{"id":"train_2250","question":"In IEEE Trans. Circuits Syst. II Express Briefs and Int. J. Semantic Comput., what papers did Mohammad Hassan Khooban publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/128/3981> { ?answer dblp:publishedIn 'IEEE Trans. Circuits Syst. II Express Briefs' } UNION { ?answer dblp:publishedIn 'Int. J. Semantic Comput.' } }","paraphrases":["What papers did Mohammad H. Khooban publish in IEEE Trans. Circuits Syst. II Express Briefs and Int. J. Semantic Comput.?"],"info":{}}
{"id":"train_2251","question":"What are the papers that Lei W. and Yajie Zhang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/181/2817> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/14/9919> } }","paraphrases":["List all the papers that Lei Wang and Yajie Z. published."],"info":{}}
{"id":"train_2252","question":"List all the papers that R. Hasanzadeh Fereydooni and Mazinan, A. Hooshang published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/265/9690> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/78/8629> } }","paraphrases":["What are the papers that R. Hasanzadeh Fereydooni and Amir Hooshang Mazinan published?"],"info":{}}
{"id":"train_2253","question":"In Shape Modeling International and UMAP (Adjunct Publication), what papers did Akleman, Ergun publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/13/568> { ?answer dblp:publishedIn 'Shape Modeling International' } UNION { ?answer dblp:publishedIn 'UMAP (Adjunct Publication)' } }","paraphrases":["What papers did Akleman, Ergun publish in Shape Modeling International and UMAP (Adjunct Publication)?"],"info":{}}
{"id":"train_2255","question":"What papers did Surridge, Mike publish in HPCN and Discret. Appl. Math.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/08/2722> { ?answer dblp:publishedIn 'HPCN' } UNION { ?answer dblp:publishedIn 'Discret. Appl. Math.' } }","paraphrases":["In HPCN and Discret. Appl. Math., what papers did Surridge, Mike publish?"],"info":{}}
{"id":"train_2256","question":"What papers did Mohammed M. Alani publish in J. Inf. Secur. Appl. and Int. J. Distance Educ. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/120/8718> { ?answer dblp:publishedIn 'J. Inf. Secur. Appl.' } UNION { ?answer dblp:publishedIn 'Int. J. Distance Educ. Technol.' } }","paraphrases":["In J. Inf. Secur. Appl. and Int. J. Distance Educ. Technol., what papers did Mohammed M. Alani publish?"],"info":{}}
{"id":"train_2257","question":"What papers did Lainem, T. publish in HICSS and IROS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/64/3406> { ?answer dblp:publishedIn 'HICSS' } UNION { ?answer dblp:publishedIn 'IROS' } }","paraphrases":["In HICSS and IROS, what papers did Lainem, T. publish?"],"info":{}}
{"id":"train_2259","question":"List all the papers that M. K. Ibrahim and Almiladi, A. Sulaiman published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/05/3608> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/17/8309> } }","paraphrases":["What are the papers that M. K. Ibrahim and Abdurazzag Sulaiman Almiladi published?"],"info":{}}
{"id":"train_2260","question":"List all the papers that Andrea Frosini and M. Sciortino published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/31/3654> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/86/6093> } }","paraphrases":["What are the papers that Frosini, A. and Marinella Sciortino published?"],"info":{}}
{"id":"train_2261","question":"List all the papers that Park, C. and Kim, Dae Young published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/03/1731> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/63/270> } }","paraphrases":["What are the papers that Chong-Kwon Park and Kim, Dae Young published?"],"info":{}}
