{"id":"train_1119","question":"Was the paper 'Recovering logical structure from Charm++ event traces' co-authored by Hamann, Bernd and B\\u00F6hme, David?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sc/IsaacsBLBGSHB15> dblp:authoredBy <https://dblp.org/pid/75/4849> . <https://dblp.org/rec/conf/sc/IsaacsBLBGSHB15> dblp:authoredBy <https://dblp.org/pid/89/5516> }","paraphrases":["Have Hamann, Bernd and David B\\u00F6hme co-authored the paper 'Recovering logical structure from Charm++ event traces'?"],"info":{}}
{"id":"train_1120","question":"Did K. Huang and Jing Yang co-author the paper 'Unconditional Authentication Based on Physical Layer Offered Chain Key in Wireless Communication'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/entropy/WangHXHYJ22> dblp:authoredBy <https://dblp.org/pid/88/3277> . <https://dblp.org/rec/journals/entropy/WangHXHYJ22> dblp:authoredBy <https://dblp.org/pid/62/5839> }","paraphrases":["Was the paper 'Unconditional Authentication Based on Physical Layer Offered Chain Key in Wireless Communication' co-authored by K. Huang and Jing Yang?"],"info":{}}
{"id":"train_1121","question":"Was the paper 'An Improved Safety Solver for Computer Go' published by Xiaozhen Niu in Computers and Games?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cg/NiuM04> dblp:authoredBy <https://dblp.org/pid/20/1674> . <https://dblp.org/rec/conf/cg/NiuM04> dblp:publishedIn 'Computers and Games' }","paraphrases":["Did Xiaozhen N. publish the paper 'An Improved Safety Solver for Computer Go' in Computers and Games?"],"info":{}}
{"id":"train_1122","question":"Has Li S. published in IEICE Trans. Inf. Syst. in the last 4 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/12/9063> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'IEICE Trans. Inf. Syst.' }","paraphrases":["Did Li S. publish in IEICE Trans. Inf. Syst. in the last 4 years?"],"info":{}}
{"id":"train_1124","question":"Was the paper 'Energy-efficient multicasting in wireless networks with fixed node transmission power' published by the person Christos A. Papageorgiou?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwcmc/PapageorgiouKV09> dblp:authoredBy <https://dblp.org/pid/58/7023> }","paraphrases":["Was the paper 'Energy-efficient multicasting in wireless networks with fixed node transmission power' published by the author Christos A. Papageorgiou?"],"info":{}}
{"id":"train_1126","question":"Has Paolo M. published in PNPM in the last nine years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/19/7095> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:publishedIn 'PNPM' }","paraphrases":["Did Paolo Marenzoni publish in PNPM in the last 9 years?"],"info":{}}
{"id":"train_1127","question":"Did Ralph Gerbig and Colin Atkinson co-author the paper 'Flexible Deep Modeling with Melanee'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/modellierung/AtkinsonG16> dblp:authoredBy <https://dblp.org/pid/57/11440> . <https://dblp.org/rec/conf/modellierung/AtkinsonG16> dblp:authoredBy <https://dblp.org/pid/a/ColinAtkinson> }","paraphrases":["Was the paper 'Flexible Deep Modeling with Melanee' co-authored by Gerbig, Ralph and Colin Atkinson?"],"info":{}}
{"id":"train_1128","question":"Was the paper 'Deciding Behavioural Properties in Brane Calculi' co-authored by Nadia Busi and Rodriguez-Ugarte, Marisol?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cmsb/Busi06> dblp:authoredBy <https://dblp.org/pid/b/NadiaBusi> . <https://dblp.org/rec/conf/cmsb/Busi06> dblp:authoredBy <https://dblp.org/pid/188/2910> }","paraphrases":["Did Nadia Busi and Marisol Rodriguez-Ugarte co-author the paper 'Deciding Behavioural Properties in Brane Calculi'?"],"info":{}}
{"id":"train_1129","question":"Did S. Menezes Sampaio publish in CEC in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/229/4114> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'CEC' }","paraphrases":["Has S\\u00E1vio Menezes Sampaio published in CEC in the last 3 years?"],"info":{}}
{"id":"train_1130","question":"Did Barbara Wiesner publish the paper 'Evolution\\u00E4re Expertensystementwicklung und Softwarequalit\\u00E4t' in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gesellschaft/Wiesner92> dblp:authoredBy <https://dblp.org/pid/02/357> . <https://dblp.org/rec/conf/gesellschaft/Wiesner92> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did Wiesner, B. publish the paper 'Evolution\\u00E4re Expertensystementwicklung und Softwarequalit\\u00E4t' in the last two years?"],"info":{}}
{"id":"train_1131","question":"Was the paper 'Honest Iteration Schemes of Randomizing Algorithms' co-authored by J. Wang and J. Belanger?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isaac/WangB92> dblp:authoredBy <https://dblp.org/pid/29/5259-2> . <https://dblp.org/rec/conf/isaac/WangB92> dblp:authoredBy <https://dblp.org/pid/14/5111> }","paraphrases":["Have J. Wang and J. Belanger co-authored the paper 'Honest Iteration Schemes of Randomizing Algorithms'?"],"info":{}}
{"id":"train_1132","question":"Did Yoshiki Shimomura publish the paper 'Development of a cellular manufacturing system based on movable cells'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cira/ShimomuraTOYNT03> dblp:authoredBy <https://dblp.org/pid/83/5566> }","paraphrases":["Was the paper 'Development of a cellular manufacturing system based on movable cells' published by the person named Shimomura, Yoshiki?"],"info":{}}
{"id":"train_1133","question":"Has Weidong W. published in Int. J. Commun. Syst. in the last 4 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/75/4159> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'Int. J. Commun. Syst.' }","paraphrases":["Did Weidong W. publish in Int. J. Commun. Syst. in the last 4 years?"],"info":{}}
{"id":"train_1134","question":"Was the paper 'Acquisition semi-automatique de collocations \\u00E0 partir de corpus monolingues et multilingues comparables' published by the person named Vincent Archer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/taln/Archer06> dblp:authoredBy <https://dblp.org/pid/183/0375> }","paraphrases":["Was the paper 'Acquisition semi-automatique de collocations \\u00E0 partir de corpus monolingues et multilingues comparables' published by the person Vincent Archer?"],"info":{}}
{"id":"train_1135","question":"Has H\\u00E4kkinen, Antti published in PLoS Comput. Biol. in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/17/8426> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'PLoS Comput. Biol.' }","paraphrases":["Did H\\u00E4kkinen, Antti publish in PLoS Comput. Biol. in the last 4 years?"],"info":{}}
{"id":"train_1136","question":"Was the paper 'Approximation algorithms for energy, reliability and makespan optimization problems' published by the author Benoit, A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1210-4673> dblp:authoredBy <https://dblp.org/pid/38/4452> }","paraphrases":["Did Benoit, A. publish the paper 'Approximation algorithms for energy, reliability and makespan optimization problems'?"],"info":{}}
{"id":"train_1137","question":"Was the paper 'Attention-guided chained context aggregation for semantic segmentation' published by the person Tang, Q.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ivc/TangLZJZ21> dblp:authoredBy <https://dblp.org/pid/150/5249-1> }","paraphrases":["Did Quan Tang publish the paper 'Attention-guided chained context aggregation for semantic segmentation'?"],"info":{}}
{"id":"train_1139","question":"Was the paper 'Low Cost On-Line Testing of RF Circuits' published by the author Susin, A. Amadeu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iolts/NegreirosCS04> dblp:authoredBy <https://dblp.org/pid/00/4529> }","paraphrases":["Was the paper 'Low Cost On-Line Testing of RF Circuits' published by the person Altamiro Amadeu Susin?"],"info":{}}
{"id":"train_1140","question":"Did M. L\\u00E1zaro-Gredilla publish in NIPS in the last 8 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/77/4660> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'NIPS' }","paraphrases":["Has Miguel L\\u00E1zaro-Gredilla published in NIPS in the last eight years?"],"info":{}}
{"id":"train_1141","question":"Did Seeling, P. publish the paper 'Lecture, narrated slides, or first person view? Impact of presentation on learning outcomes' in FIE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fie/McGarryS15> dblp:authoredBy <https://dblp.org/pid/50/1058> . <https://dblp.org/rec/conf/fie/McGarryS15> dblp:publishedIn 'FIE' }","paraphrases":["Was the paper 'Lecture, narrated slides, or first person view? Impact of presentation on learning outcomes' published by Patrick Seeling in FIE?"],"info":{}}
{"id":"train_1142","question":"Did H. Seo publish the paper 'Computational exploration of epidural cortical stimulation using a realistic head model' in Comput. Biol. Medicine?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cbm/SeoJ21> dblp:authoredBy <https://dblp.org/pid/188/2334> . <https://dblp.org/rec/journals/cbm/SeoJ21> dblp:publishedIn 'Comput. Biol. Medicine' }","paraphrases":["Was the paper 'Computational exploration of epidural cortical stimulation using a realistic head model' published by H. Seo in Comput. Biol. Medicine?"],"info":{}}
{"id":"train_1143","question":"Has A. Gang published in Interspeech in the last 4 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/191/0944> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'INTERSPEECH' }","paraphrases":["Did Arpita Gang publish in INTERSPEECH in the last four years?"],"info":{}}
{"id":"train_1144","question":"Did Dornheim, L. publish in Bildverarbeitung f\\u00FCr die Medizin in the last 7 years?","sparql":"ASK { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/65/2091> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y . FILTER(?y > YEAR(NOW())-7) . ?x <https://dblp.org/rdf/schema#publishedIn> 'Bildverarbeitung f\\u00FCr die Medizin' }","paraphrases":["Has Dornheim, L. published in Bildverarbeitung f\\u00FCr die Medizin in the last seven years?"],"info":{}}
{"id":"train_1146","question":"Did H. Quinti\\u00E1n and V. Vera co-author the paper 'Application of Soft Computing Technologies toward Assessment and Skills Development'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/softcomp/AliagaVLGQCKG12> dblp:authoredBy <https://dblp.org/pid/124/3893> . <https://dblp.org/rec/conf/softcomp/AliagaVLGQCKG12> dblp:authoredBy <https://dblp.org/pid/68/8980> }","paraphrases":["Was the paper 'Application of Soft Computing Technologies toward Assessment and Skills Development' co-authored by H. Quinti\\u00E1n and Vicente Vera?"],"info":{}}
{"id":"train_1147","question":"Did S. Guillemot publish the paper 'On the (Non-)existence of Polynomial Kernels for Pl-free Edge Modification Problems' in IPEC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwpec/GuillemotPP10> dblp:authoredBy <https://dblp.org/pid/42/5527> . <https://dblp.org/rec/conf/iwpec/GuillemotPP10> dblp:publishedIn 'IPEC' }","paraphrases":["Was the paper 'On the (Non-)existence of Polynomial Kernels for Pl-free Edge Modification Problems' published by Sylvain Guillemot in IPEC?"],"info":{}}
{"id":"train_1149","question":"Did Wigglesworth, N. publish in Winter Simulation Conference in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/77/6136> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn 'WSC' }","paraphrases":["Has Nancy Wigglesworth published in WSC in the last 5 years?"],"info":{}}
{"id":"train_1150","question":"Did Alessandro L. Koerich publish the paper 'Machine Learning Methods for Histopathological Image Analysis: A Review' in the last five years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2102-03889> dblp:authoredBy <https://dblp.org/pid/37/4335> . <https://dblp.org/rec/journals/corr/abs-2102-03889> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["Did Alessandro L. Koerich publish the paper 'Machine Learning Methods for Histopathological Image Analysis: A Review' in the last 5 years?"],"info":{}}
{"id":"train_1151","question":"Has Andrew L. Nelson published in Robotics Auton. Syst. in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/97/3827> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn 'Robotics Auton. Syst.' }","paraphrases":["Did Andrew L. Nelson publish in Robotics Auton. Syst. in the last six years?"],"info":{}}
{"id":"train_1153","question":"Did Richard A. Hendrickson and Tatsuya Shirai co-author the paper 'Array processing extensions to FORTRAN'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acm/Hendrickson79> dblp:authoredBy <https://dblp.org/pid/199/4458> . <https://dblp.org/rec/conf/acm/Hendrickson79> dblp:authoredBy <https://dblp.org/pid/37/6330> }","paraphrases":["Have Richard A. Hendrickson and Tatsuya Shirai co-authored the paper 'Array processing extensions to FORTRAN'?"],"info":{}}
{"id":"train_1154","question":"Did Xiao L. publish in INTERSPEECH in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/66/2069-6> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'INTERSPEECH' }","paraphrases":["Has Xiao Li published in INTERSPEECH in the last 2 years?"],"info":{}}
{"id":"train_1155","question":"Was the paper 'Infrastructure Supported Automated Driving in Transition Areas - a Prototypic Implementation' published by the author B\\u00F6ker, Clarissa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cavs/SchindlerMWCBK20> dblp:authoredBy <https://dblp.org/pid/254/6415> }","paraphrases":["Did Clarissa B\\u00F6ker publish the paper 'Infrastructure Supported Automated Driving in Transition Areas - a Prototypic Implementation'?"],"info":{}}
{"id":"train_1156","question":"Did P\\u00E1lfy, P\\u00E9ter P. and H. Machida co-author the paper 'Self-commuting Operations'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mvl/MachidaP21> dblp:authoredBy <https://dblp.org/pid/16/4010> . <https://dblp.org/rec/journals/mvl/MachidaP21> dblp:authoredBy <https://dblp.org/pid/65/6552> }","paraphrases":["Was the paper 'Self-commuting Operations' co-authored by P\\u00E1lfy, P\\u00E9ter P. and Hajime Machida?"],"info":{}}
{"id":"train_1157","question":"Did Chen, J. publish the paper 'MDT: A Multi-Description Topic Based Clustering Approach for Composite-Service Discovery' in the last 8 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hpcc/HuCLN19> dblp:authoredBy <https://dblp.org/pid/04/4498> . <https://dblp.org/rec/conf/hpcc/HuCLN19> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Did Chen, J. publish the paper 'MDT: A Multi-Description Topic Based Clustering Approach for Composite-Service Discovery' in the last eight years?"],"info":{}}
{"id":"train_1158","question":"Was the paper 'New LISP Techniques for a Paging Environment' published by Rochfeld, A. in Commun. ACM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacm/Rochfeld71> dblp:authoredBy <https://dblp.org/pid/04/289> . <https://dblp.org/rec/journals/cacm/Rochfeld71> dblp:publishedIn 'Commun. ACM' }","paraphrases":["Did Rochfeld, A. publish the paper 'New LISP Techniques for a Paging Environment' in Commun. ACM?"],"info":{}}
{"id":"train_1159","question":"Has Ming Jiang published in IEEE Signal Process. Lett. in the last 7 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/j/MingJiang1> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:publishedIn 'IEEE Signal Process. Lett.' }","paraphrases":["Did Ming Jiang publish in IEEE Signal Process. Lett. in the last 7 years?"],"info":{}}
{"id":"train_1161","question":"Did Wong, Yue-Bong publish the paper 'A timed Petri-net model for fine-grain loop scheduling' in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cascon/GaoWN91> dblp:authoredBy <https://dblp.org/pid/61/3759> . <https://dblp.org/rec/conf/cascon/GaoWN91> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Did Wong, Yue-Bong publish the paper 'A timed Petri-net model for fine-grain loop scheduling' in the last three years?"],"info":{}}
{"id":"train_1162","question":"Did Wei-Lin Xiao publish the paper 'On weighted lower and upper possibilistic means and variances of fuzzy numbers and its application in decision' in Knowl. Inf. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/kais/ZhangX09> dblp:authoredBy <https://dblp.org/pid/96/7058> . <https://dblp.org/rec/journals/kais/ZhangX09> dblp:publishedIn 'Knowl. Inf. Syst.' }","paraphrases":["Was the paper 'On weighted lower and upper possibilistic means and variances of fuzzy numbers and its application in decision' published by Wei-Lin Xiao in Knowl. Inf. Syst.?"],"info":{}}
{"id":"train_1163","question":"Was the paper 'Damage Mapping of Powdery Mildew in Winter Wheat with High-Resolution Satellite Image' published by the author Wei, Liguang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/remotesensing/YuanZSNWW14> dblp:authoredBy <https://dblp.org/pid/163/7986> }","paraphrases":["Was the paper 'Damage Mapping of Powdery Mildew in Winter Wheat with High-Resolution Satellite Image' published by the person named Liguang Wei?"],"info":{}}
{"id":"train_1164","question":"Did Schutzman, Howard B. publish the paper 'Virtual Information in Data-Base Systems' in FDT Bull. ACM SIGFIDET SIGMOD?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigmod/FolinusMS74> dblp:authoredBy <https://dblp.org/pid/45/3137> . <https://dblp.org/rec/journals/sigmod/FolinusMS74> dblp:publishedIn 'FDT Bull. ACM SIGFIDET SIGMOD' }","paraphrases":["Was the paper 'Virtual Information in Data-Base Systems' published by Howard B. Schutzman in FDT Bull. ACM SIGFIDET SIGMOD?"],"info":{}}
{"id":"train_1166","question":"Did Gon\\u00E7alves, Daniel publish the paper 'Contact Activity Visualization for Seniors' in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/AlmeidaCJ015> dblp:authoredBy <https://dblp.org/pid/40/693-2> . <https://dblp.org/rec/conf/hci/AlmeidaCJ015> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Did Daniel Gon\\u00E7alves publish the paper 'Contact Activity Visualization for Seniors' in the last three years?"],"info":{}}
{"id":"train_1167","question":"Was the paper 'Financially Backed Covert Security' published by the person named Carmit Hazay?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iacr/FaustHKS21a> dblp:authoredBy <https://dblp.org/pid/95/1548> }","paraphrases":["Did Hazay, Carmit publish the paper 'Financially Backed Covert Security'?"],"info":{}}
{"id":"train_1168","question":"Has John W. Lumley published in ACM Symposium on Document Engineering in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/134/3132> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:publishedIn 'ACM Symposium on Document Engineering' }","paraphrases":["Did Lumley, John W. publish in ACM Symposium on Document Engineering in the last nine years?"],"info":{}}
{"id":"train_1169","question":"Did Richard Peterson publish in HICSS in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/22/1015> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'HICSS' }","paraphrases":["Has Richard P. published in HICSS in the last 3 years?"],"info":{}}
{"id":"train_1170","question":"Did Marek Chrobak and S. Poljak co-author the paper 'On common edges in optimal solutions to traveling salesman and other optimization problems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dam/ChrobakP88> dblp:authoredBy <https://dblp.org/pid/c/MChrobak> . <https://dblp.org/rec/journals/dam/ChrobakP88> dblp:authoredBy <https://dblp.org/pid/78/3567> }","paraphrases":["Was the paper 'On common edges in optimal solutions to traveling salesman and other optimization problems' co-authored by Marek Chrobak and S. Poljak?"],"info":{}}
{"id":"train_1171","question":"Was the paper 'What did spot hide?: a question-answering game for preschool children' co-authored by John F. Canny and Tewari, Anuj?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/TewariC14> dblp:authoredBy <https://dblp.org/pid/c/JohnFCanny> . <https://dblp.org/rec/conf/chi/TewariC14> dblp:authoredBy <https://dblp.org/pid/37/5732> }","paraphrases":["Did John F. Canny and Tewari, Anuj co-author the paper 'What did spot hide?: a question-answering game for preschool children'?"],"info":{}}
{"id":"train_1172","question":"Has D. Makris published in IEEE International Joint Conference on Neural Networks in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/150/7401> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'IJCNN' }","paraphrases":["Did D. Makris publish in IEEE International Joint Conference on Neural Networks in the last 4 years?"],"info":{}}
{"id":"train_1173","question":"Did R. San-Miguel Carrasco publish in Comput. Secur. in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/177/6318> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'Comput. Secur.' }","paraphrases":["Has R. San-Miguel Carrasco published in Comput. Secur. in the last eight years?"],"info":{}}
{"id":"train_1174","question":"Did Wasserman, L. A. publish in AISTATS in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/89/1660> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'AISTATS' }","paraphrases":["Has Larry A. Wasserman published in AISTATS in the last eight years?"],"info":{}}
{"id":"train_1175","question":"Was the paper 'Employee-developed ways to enhance information ergonomics' published by Jussi O. in MindTrek?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mindtrek/BordiOMH17> dblp:authoredBy <https://dblp.org/pid/73/3041> . <https://dblp.org/rec/conf/mindtrek/BordiOMH17> dblp:publishedIn 'MindTrek' }","paraphrases":["Did Jussi Okkonen publish the paper 'Employee-developed ways to enhance information ergonomics' in MindTrek?"],"info":{}}
{"id":"train_1176","question":"Was the paper 'From plant and logistics control to multi-enterprise collaboration' published by F. G. Filip in Annu. Rev. Control.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/arc/NofMMMF06> dblp:authoredBy <https://dblp.org/pid/03/4465> . <https://dblp.org/rec/journals/arc/NofMMMF06> dblp:publishedIn 'Annu. Rev. Control.' }","paraphrases":["Did Florin G. Filip publish the paper 'From plant and logistics control to multi-enterprise collaboration' in Annu. Rev. Control.?"],"info":{}}
{"id":"train_1178","question":"Did X. Li publish the paper 'Internet Public Opinion Hotspot Detection Research Based on K-means Algorithm' in ICSI (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/swarm/LiuL10> dblp:authoredBy <https://dblp.org/pid/20/2197> . <https://dblp.org/rec/conf/swarm/LiuL10> dblp:publishedIn 'ICSI (2)' }","paraphrases":["Was the paper 'Internet Public Opinion Hotspot Detection Research Based on K-means Algorithm' published by X. Li in ICSI (2)?"],"info":{}}
{"id":"train_1179","question":"Did I. Brown and Chaouki A. co-author the paper 'Investigating the impact of the external environment on strategic information systems planning: a qualitative inquiry'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/saicsit/Brown08> dblp:authoredBy <https://dblp.org/pid/73/4065> . <https://dblp.org/rec/conf/saicsit/Brown08> dblp:authoredBy <https://dblp.org/pid/35/5426> }","paraphrases":["Was the paper 'Investigating the impact of the external environment on strategic information systems planning: a qualitative inquiry' co-authored by Irwin Brown and Chaouki A.?"],"info":{}}
{"id":"train_1180","question":"Did Song, Houbing publish the paper 'IEEE Access Special Section Editorial: Intelligent Systems for the Internet of Things'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/QiuTCRRSPH19> dblp:authoredBy <https://dblp.org/pid/49/594> }","paraphrases":["Was the paper 'IEEE Access Special Section Editorial: Intelligent Systems for the Internet of Things' published by the person named Song, Houbing?"],"info":{}}
{"id":"train_1182","question":"Did J. William Whikehart publish the paper 'Adaptive periodic IIR filters' in ICASSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/WhikehartD97> dblp:authoredBy <https://dblp.org/pid/147/6385> . <https://dblp.org/rec/conf/icassp/WhikehartD97> dblp:publishedIn 'ICASSP' }","paraphrases":["Was the paper 'Adaptive periodic IIR filters' published by J. William Whikehart in ICASSP?"],"info":{}}
{"id":"train_1183","question":"Did Wang, B. and Chen, C. L. Philip co-author the paper 'Illumination and Color Adjustment for Generating Professional Headshot'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/smc/WangC21> dblp:authoredBy <https://dblp.org/pid/50/301> . <https://dblp.org/rec/conf/smc/WangC21> dblp:authoredBy <https://dblp.org/pid/48/4856> }","paraphrases":["Was the paper 'Illumination and Color Adjustment for Generating Professional Headshot' co-authored by Wang, B. and Chen, C. L. Philip?"],"info":{}}
{"id":"train_1184","question":"Did Zhu, Hongsong publish in WASA in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/57/5368> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'WASA' }","paraphrases":["Has Hongsong Zhu published in WASA in the last 4 years?"],"info":{}}
{"id":"train_1185","question":"Was the paper 'Interdisciplinary and Professional Development Outside of the Classroom' published by the author Woodcock, Cassandra Sue Ellen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fie/Woodcock19> dblp:authoredBy <https://dblp.org/pid/286/2204> }","paraphrases":["Was the paper 'Interdisciplinary and Professional Development Outside of the Classroom' published by the person Woodcock, Cassandra Sue Ellen?"],"info":{}}
{"id":"train_1186","question":"Have Chen, Rui and Shuang Wang co-authored the paper 'Private Genome Data Dissemination'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/sp/15/MohammedWCJ15> dblp:authoredBy <https://dblp.org/pid/02/1003-12> . <https://dblp.org/rec/books/sp/15/MohammedWCJ15> dblp:authoredBy <https://dblp.org/pid/86/220-2> }","paraphrases":["Did Chen, Rui and S. Wang co-author the paper 'Private Genome Data Dissemination'?"],"info":{}}
{"id":"train_1188","question":"Was the paper 'Estimating two-dimensional angles of arrival in coherent source environment' published by Yih-Min Chen in ICASSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/YehLC88> dblp:authoredBy <https://dblp.org/pid/22/10845> . <https://dblp.org/rec/conf/icassp/YehLC88> dblp:publishedIn 'ICASSP' }","paraphrases":["Did Chen, Y. publish the paper 'Estimating two-dimensional angles of arrival in coherent source environment' in ICASSP?"],"info":{}}
{"id":"train_1191","question":"Did Juan Jos\\u00E9 Mart\\u00EDnez Castillo publish the paper 'The Acantelys Model for to Build Effective Partnerships Between Industry and Academy using Real Work Situations in the Designing of Virtual Labs and Simulations' in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fecs/Castillo10> dblp:authoredBy <https://dblp.org/pid/17/8815> . <https://dblp.org/rec/conf/fecs/Castillo10> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Did Juan J. Mart\\u00EDnez Castillo publish the paper 'The Acantelys Model for to Build Effective Partnerships Between Industry and Academy using Real Work Situations in the Designing of Virtual Labs and Simulations' in the last three years?"],"info":{}}
{"id":"train_1192","question":"Did Wang, Wei and Tao Lin co-author the paper 'Markovian approach to tackle competing pathogens in simplicial complex'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/NieLPLW22> dblp:authoredBy <https://dblp.org/pid/35/7092-70> . <https://dblp.org/rec/journals/amc/NieLPLW22> dblp:authoredBy <https://dblp.org/pid/64/4492> }","paraphrases":["Was the paper 'Markovian approach to tackle competing pathogens in simplicial complex' co-authored by Wang, Wei and T. Lin?"],"info":{}}
{"id":"train_1193","question":"Have Vozel, B. and Mikhail L. Uss co-authored the paper 'Efficient Rotation-Scaling-Translation Parameters Estimation in Multimodal Settings Based on Fractal Image Model'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/UssVLC15> dblp:authoredBy <https://dblp.org/pid/51/4966> . <https://dblp.org/rec/journals/corr/UssVLC15> dblp:authoredBy <https://dblp.org/pid/26/8063> }","paraphrases":["Was the paper 'Efficient Rotation-Scaling-Translation Parameters Estimation in Multimodal Settings Based on Fractal Image Model' co-authored by Vozel, B. and Mikhail L. Uss?"],"info":{}}
