{"id":"train_1510","question":"Was the paper 'Towards a Compact Representation of Temporal Rasters' not co-authored by Fernando Silva-Coira and Param\\u00E1, J. R.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/spire/Cerdeira-PenaBF18> dblp:authoredBy <https://dblp.org/pid/186/0925> . <https://dblp.org/rec/conf/spire/Cerdeira-PenaBF18> dblp:authoredBy <https://dblp.org/pid/22/5490> FILTER NOT EXISTS { <https://dblp.org/rec/conf/spire/Cerdeira-PenaBF18> dblp:authoredBy <https://dblp.org/pid/186/0925> . <https://dblp.org/rec/conf/spire/Cerdeira-PenaBF18> dblp:authoredBy <https://dblp.org/pid/22/5490> } }","paraphrases":["Did Fernando Silva-Coira and Param\\u00E1, J. R. not co-author the paper 'Towards a Compact Representation of Temporal Rasters'?"],"info":{}}
{"id":"train_1511","question":"Was the paper 'A node configuration algorithm with bandwidth bottleneck resolution for WDM ring networks' not co-authored by T. Nakanishi and Yosuke I.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pnc/IsogaiFNI09> dblp:authoredBy <https://dblp.org/pid/15/1353> . <https://dblp.org/rec/journals/pnc/IsogaiFNI09> dblp:authoredBy <https://dblp.org/pid/137/0296> FILTER NOT EXISTS { <https://dblp.org/rec/journals/pnc/IsogaiFNI09> dblp:authoredBy <https://dblp.org/pid/15/1353> . <https://dblp.org/rec/journals/pnc/IsogaiFNI09> dblp:authoredBy <https://dblp.org/pid/137/0296> } }","paraphrases":["Have Toru Nakanishi and Yosuke I. not co-authored the paper 'A node configuration algorithm with bandwidth bottleneck resolution for WDM ring networks'?"],"info":{}}
{"id":"train_1512","question":"Did K. Robert Lai not publish the paper 'Applying an Assessment Agent to Evaluate the Learning Effectiveness'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/its/LaiL06> dblp:authoredBy <https://dblp.org/pid/05/199> FILTER NOT EXISTS { <https://dblp.org/rec/conf/its/LaiL06> dblp:authoredBy <https://dblp.org/pid/05/199> } }","paraphrases":["Wasn't the paper 'Applying an Assessment Agent to Evaluate the Learning Effectiveness' not published by the author K. Robert Lai?"],"info":{}}
{"id":"train_1513","question":"Did Mindaugas Zilys and Andrius Laucka not co-author the paper 'Research of the Defects in PET preform'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mmar/LauckaAMZ16> dblp:authoredBy <https://dblp.org/pid/158/7733> . <https://dblp.org/rec/conf/mmar/LauckaAMZ16> dblp:authoredBy <https://dblp.org/pid/186/4596> FILTER NOT EXISTS { <https://dblp.org/rec/conf/mmar/LauckaAMZ16> dblp:authoredBy <https://dblp.org/pid/158/7733> . <https://dblp.org/rec/conf/mmar/LauckaAMZ16> dblp:authoredBy <https://dblp.org/pid/186/4596> } }","paraphrases":["Have M. Zilys and Laucka, A. not co-authored the paper 'Research of the Defects in PET preform'?"],"info":{}}
{"id":"train_1514","question":"Have Chin-Hui Lee and Xu, Ke not co-authored the paper 'Tweet Normalization with Syllables'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acl/XuXL15> dblp:authoredBy <https://dblp.org/pid/60/826> . <https://dblp.org/rec/conf/acl/XuXL15> dblp:authoredBy <https://dblp.org/pid/181/2626> FILTER NOT EXISTS { <https://dblp.org/rec/conf/acl/XuXL15> dblp:authoredBy <https://dblp.org/pid/60/826> . <https://dblp.org/rec/conf/acl/XuXL15> dblp:authoredBy <https://dblp.org/pid/181/2626> } }","paraphrases":["Did Chin-Hui Lee and Ke Xu not co-author the paper 'Tweet Normalization with Syllables'?"],"info":{}}
{"id":"train_1515","question":"Have Mehdi C. and J. Zafarani not co-authored the paper 'Image Space Analysis and Scalarization for \\u03B5-Optimization of Multifunctions'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jota/ChinaieZ13> dblp:authoredBy <https://dblp.org/pid/91/7153> . <https://dblp.org/rec/journals/jota/ChinaieZ13> dblp:authoredBy <https://dblp.org/pid/95/7208> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jota/ChinaieZ13> dblp:authoredBy <https://dblp.org/pid/91/7153> . <https://dblp.org/rec/journals/jota/ChinaieZ13> dblp:authoredBy <https://dblp.org/pid/95/7208> } }","paraphrases":["Was the paper 'Image Space Analysis and Scalarization for \\u03B5-Optimization of Multifunctions' not co-authored by Mehdi C. and Jafar Zafarani?"],"info":{}}
{"id":"train_1516","question":"Has the paper 'Der Iterierte Limes Rekursiver Funktionen und Die Arithmetische Hierarchie' not been published by Reinhard Klette in Math. Log. Q.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mlq/GoetzeKG77> dblp:authoredBy <https://dblp.org/pid/k/ReinhardKlette> . <https://dblp.org/rec/journals/mlq/GoetzeKG77> dblp:publishedIn 'Math. Log. Q.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/mlq/GoetzeKG77> dblp:authoredBy <https://dblp.org/pid/k/ReinhardKlette> . <https://dblp.org/rec/journals/mlq/GoetzeKG77> dblp:publishedIn 'Math. Log. Q.' } }","paraphrases":["Was the paper 'Der Iterierte Limes Rekursiver Funktionen und Die Arithmetische Hierarchie' not published by Reinhard Klette in Math. Log. Q.?"],"info":{}}
{"id":"train_1518","question":"Have Hermann H\\u00E4rtig and Krause, Thomas not co-authored the paper 'COPRA - Eine auf Concurrent Pascal basierende Rechner-Architektur'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gacm/HartigK80> dblp:authoredBy <https://dblp.org/pid/h/HHartig> . <https://dblp.org/rec/conf/gacm/HartigK80> dblp:authoredBy <https://dblp.org/pid/31/872-1> FILTER NOT EXISTS { <https://dblp.org/rec/conf/gacm/HartigK80> dblp:authoredBy <https://dblp.org/pid/h/HHartig> . <https://dblp.org/rec/conf/gacm/HartigK80> dblp:authoredBy <https://dblp.org/pid/31/872-1> } }","paraphrases":["Was the paper 'COPRA - Eine auf Concurrent Pascal basierende Rechner-Architektur' not co-authored by H. H\\u00E4rtig and Thomas Krause?"],"info":{}}
{"id":"train_1519","question":"Did M. Zhang not publish the paper 'Guest Editorial Special Issue on Multitask Evolutionary Computation' in IEEE Trans. Evol. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tec/GuptaOJZ22> dblp:authoredBy <https://dblp.org/pid/z/MengjieZhang> . <https://dblp.org/rec/journals/tec/GuptaOJZ22> dblp:publishedIn 'IEEE Trans. Evol. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tec/GuptaOJZ22> dblp:authoredBy <https://dblp.org/pid/z/MengjieZhang> . <https://dblp.org/rec/journals/tec/GuptaOJZ22> dblp:publishedIn 'IEEE Trans. Evol. Comput.' } }","paraphrases":["Was the paper 'Guest Editorial Special Issue on Multitask Evolutionary Computation' not published by Mengjie Zhang in IEEE Trans. Evol. Comput.?"],"info":{}}
{"id":"train_1521","question":"Have Mosavat-Jahromi, H. and Lin C. not co-authored the paper 'NC-MAC: Network Coding-based Distributed MAC Protocol for Reliable Beacon Broadcasting in V2X'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/Mosavat-Jahromi20> dblp:authoredBy <https://dblp.org/pid/199/7209> . <https://dblp.org/rec/conf/globecom/Mosavat-Jahromi20> dblp:authoredBy <https://dblp.org/pid/20/8688-1> FILTER NOT EXISTS { <https://dblp.org/rec/conf/globecom/Mosavat-Jahromi20> dblp:authoredBy <https://dblp.org/pid/199/7209> . <https://dblp.org/rec/conf/globecom/Mosavat-Jahromi20> dblp:authoredBy <https://dblp.org/pid/20/8688-1> } }","paraphrases":["Was the paper 'NC-MAC: Network Coding-based Distributed MAC Protocol for Reliable Beacon Broadcasting in V2X' not co-authored by Mosavat-Jahromi, H. and Lin C.?"],"info":{}}
{"id":"train_1522","question":"Has the paper 'Temporal Autoencoding Restricted Boltzmann Machine' not been published by Alex K. Susemihl in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1210-8353> dblp:authoredBy <https://dblp.org/pid/41/11107> . <https://dblp.org/rec/journals/corr/abs-1210-8353> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1210-8353> dblp:authoredBy <https://dblp.org/pid/41/11107> . <https://dblp.org/rec/journals/corr/abs-1210-8353> dblp:publishedIn 'CoRR' } }","paraphrases":["Wasn't the paper 'Temporal Autoencoding Restricted Boltzmann Machine' published by the author Alex K. Susemihl in CoRR?"],"info":{}}
{"id":"train_1523","question":"Wasn't the paper 'Greibach normal form for \\u03C9-algebraic systems and weighted simple \\u03C9-pushdown automata' published by the author Dziadek, S. in Inf. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iandc/DrosteDK22a> dblp:authoredBy <https://dblp.org/pid/157/0602> . <https://dblp.org/rec/journals/iandc/DrosteDK22a> dblp:publishedIn 'Inf. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/iandc/DrosteDK22a> dblp:authoredBy <https://dblp.org/pid/157/0602> . <https://dblp.org/rec/journals/iandc/DrosteDK22a> dblp:publishedIn 'Inf. Comput.' } }","paraphrases":["Did Sven Dziadek not publish the paper 'Greibach normal form for \\u03C9-algebraic systems and weighted simple \\u03C9-pushdown automata' in Inf. Comput.?"],"info":{}}
{"id":"train_1524","question":"Wasn't the paper 'Relationship between Asymmetries Measured on Different Levels in Elite Basketball Players' published by the author Nejc Sarabon in Symmetry?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/symmetry/UjakovicS21> dblp:authoredBy <https://dblp.org/pid/146/8160> . <https://dblp.org/rec/journals/symmetry/UjakovicS21> dblp:publishedIn 'Symmetry' FILTER NOT EXISTS { <https://dblp.org/rec/journals/symmetry/UjakovicS21> dblp:authoredBy <https://dblp.org/pid/146/8160> . <https://dblp.org/rec/journals/symmetry/UjakovicS21> dblp:publishedIn 'Symmetry' } }","paraphrases":["Has the paper 'Relationship between Asymmetries Measured on Different Levels in Elite Basketball Players' not been published by Nejc Sarabon in Symmetry?"],"info":{}}
{"id":"train_1525","question":"Have Yahya Y. Al-Salqan and Wu Wen not co-authored the paper 'Summary Report on Enterprise Security Workshop'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wetice/WenA00> dblp:authoredBy <https://dblp.org/pid/97/4764> . <https://dblp.org/rec/conf/wetice/WenA00> dblp:authoredBy <https://dblp.org/pid/70/5228> FILTER NOT EXISTS { <https://dblp.org/rec/conf/wetice/WenA00> dblp:authoredBy <https://dblp.org/pid/97/4764> . <https://dblp.org/rec/conf/wetice/WenA00> dblp:authoredBy <https://dblp.org/pid/70/5228> } }","paraphrases":["Was the paper 'Summary Report on Enterprise Security Workshop' not co-authored by Y. Y. Al-Salqan and Wu W.?"],"info":{}}
{"id":"train_1526","question":"Was the paper 'Beyond griefing: Virtual crime' not published by A. Adrian in Comput. Law Secur. Rev.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/clsr/Adrian10> dblp:authoredBy <https://dblp.org/pid/273/6771> . <https://dblp.org/rec/journals/clsr/Adrian10> dblp:publishedIn 'Comput. Law Secur. Rev.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/clsr/Adrian10> dblp:authoredBy <https://dblp.org/pid/273/6771> . <https://dblp.org/rec/journals/clsr/Adrian10> dblp:publishedIn 'Comput. Law Secur. Rev.' } }","paraphrases":["Wasn't the paper 'Beyond griefing: Virtual crime' published by the author Angela Adrian in Comput. Law Secur. Rev.?"],"info":{}}
{"id":"train_1527","question":"Wasn't the paper 'Smart Access to Historical Archives based on Rich Semantic Metadata' published by the author Anna G. in KMIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ic3k/CaserioGM17> dblp:authoredBy <https://dblp.org/pid/82/2990> . <https://dblp.org/rec/conf/ic3k/CaserioGM17> dblp:publishedIn 'KMIS' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ic3k/CaserioGM17> dblp:authoredBy <https://dblp.org/pid/82/2990> . <https://dblp.org/rec/conf/ic3k/CaserioGM17> dblp:publishedIn 'KMIS' } }","paraphrases":["Did Anna Goy not publish the paper 'Smart Access to Historical Archives based on Rich Semantic Metadata' in KMIS?"],"info":{}}
{"id":"train_1528","question":"Wasn't the paper 'Industrial Facility Modeling Using Procedural Methods' not published by the author Bishop, M. Scott?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ceig/BishopM15> dblp:authoredBy <https://dblp.org/pid/147/4633> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ceig/BishopM15> dblp:authoredBy <https://dblp.org/pid/147/4633> } }","paraphrases":["Was the paper 'Industrial Facility Modeling Using Procedural Methods' not published by Bishop, M. Scott?"],"info":{}}
{"id":"train_1530","question":"Did Ioanis Nikolaidis and David E. Wallace not co-author the paper 'Editor's Note - The Unbearable Simplicity of BeingNeutral'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/network/Nikolaidis07a> dblp:authoredBy <https://dblp.org/pid/90/1785> . <https://dblp.org/rec/journals/network/Nikolaidis07a> dblp:authoredBy <https://dblp.org/pid/68/986> FILTER NOT EXISTS { <https://dblp.org/rec/journals/network/Nikolaidis07a> dblp:authoredBy <https://dblp.org/pid/90/1785> . <https://dblp.org/rec/journals/network/Nikolaidis07a> dblp:authoredBy <https://dblp.org/pid/68/986> } }","paraphrases":["Have Ioanis Nikolaidis and David E. Wallace not co-authored the paper 'Editor's Note - The Unbearable Simplicity of BeingNeutral'?"],"info":{}}
{"id":"train_1531","question":"Was the paper 'Dynamic ring for seamless mobility in identity centric networks' not published by Wenpeng Sha in ISCC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscc/LiS15> dblp:authoredBy <https://dblp.org/pid/01/9081> . <https://dblp.org/rec/conf/iscc/LiS15> dblp:publishedIn 'ISCC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iscc/LiS15> dblp:authoredBy <https://dblp.org/pid/01/9081> . <https://dblp.org/rec/conf/iscc/LiS15> dblp:publishedIn 'ISCC' } }","paraphrases":["Wasn't the paper 'Dynamic ring for seamless mobility in identity centric networks' published by the author Wenpeng Sha in ISCC?"],"info":{}}
{"id":"train_1532","question":"Did Jonathan C. not publish the paper 'Neural Sequence Generation Using Spatiotemporal Patterns of Inhibition'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ploscb/CannonKGM15> dblp:authoredBy <https://dblp.org/pid/173/3619> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ploscb/CannonKGM15> dblp:authoredBy <https://dblp.org/pid/173/3619> } }","paraphrases":["Was the paper 'Neural Sequence Generation Using Spatiotemporal Patterns of Inhibition' not published by Jonathan C.?"],"info":{}}
{"id":"train_1533","question":"Did Chan, Kwong-fai not publish the paper 'An On-Line Algorithm for Navigating in Unknown Terrain'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isa/ChanL91> dblp:authoredBy <https://dblp.org/pid/09/1711> FILTER NOT EXISTS { <https://dblp.org/rec/conf/isa/ChanL91> dblp:authoredBy <https://dblp.org/pid/09/1711> } }","paraphrases":["Was the paper 'An On-Line Algorithm for Navigating in Unknown Terrain' not published by the person Chan, Kwong-fai?"],"info":{}}
{"id":"train_1534","question":"Wasn't the paper 'CHIC: a combination-based recommendation system' published by the author Samuel Madden in SIGMOD Conference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigmod/VartakM13> dblp:authoredBy <https://dblp.org/pid/m/SamuelMadden> . <https://dblp.org/rec/conf/sigmod/VartakM13> dblp:publishedIn 'SIGMOD Conference' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sigmod/VartakM13> dblp:authoredBy <https://dblp.org/pid/m/SamuelMadden> . <https://dblp.org/rec/conf/sigmod/VartakM13> dblp:publishedIn 'SIGMOD Conference' } }","paraphrases":["Was the paper 'CHIC: a combination-based recommendation system' not published by Samuel Madden in SIGMOD Conference?"],"info":{}}
{"id":"train_1535","question":"Did Dotoli, M. and Carli, Raffaele not co-author the paper 'A decentralized control strategy for energy retrofit planning of large-scale street lighting systems using dynamic programming'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/case/CarliD17a> dblp:authoredBy <https://dblp.org/pid/03/4162> . <https://dblp.org/rec/conf/case/CarliD17a> dblp:authoredBy <https://dblp.org/pid/141/7999> FILTER NOT EXISTS { <https://dblp.org/rec/conf/case/CarliD17a> dblp:authoredBy <https://dblp.org/pid/03/4162> . <https://dblp.org/rec/conf/case/CarliD17a> dblp:authoredBy <https://dblp.org/pid/141/7999> } }","paraphrases":["Was the paper 'A decentralized control strategy for energy retrofit planning of large-scale street lighting systems using dynamic programming' not co-authored by Dotoli, M. and Carli, Raffaele?"],"info":{}}
{"id":"train_1536","question":"Didn't D. In Kim publish the paper 'Sparse-Coded Ambient Backscatter Communication for Massive OFDM-Induced IoT Networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccoms/KimK18> dblp:authoredBy <https://dblp.org/pid/86/1369> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccoms/KimK18> dblp:authoredBy <https://dblp.org/pid/86/1369> } }","paraphrases":["Wasn't the paper 'Sparse-Coded Ambient Backscatter Communication for Massive OFDM-Induced IoT Networks' not published by the person named D. In Kim?"],"info":{}}
{"id":"train_1537","question":"Has Y. Zhao not published the paper 'Opportunities and Challenges in Running Scientific Workflows on the Cloud'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cyberc/ZhaoFRL11> dblp:authoredBy <https://dblp.org/pid/14/1356-9> FILTER NOT EXISTS { <https://dblp.org/rec/conf/cyberc/ZhaoFRL11> dblp:authoredBy <https://dblp.org/pid/14/1356-9> } }","paraphrases":["Was the paper 'Opportunities and Challenges in Running Scientific Workflows on the Cloud' not published by the person Yong Zhao?"],"info":{}}
{"id":"train_1538","question":"Wasn't the paper 'Towards a Universal Representation of DEVS: A Metamodel-Based Definition of DEVS Formal Specification' not published by the author Silvio Gonnet?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/annsim/BlasGZ21> dblp:authoredBy <https://dblp.org/pid/85/2254> FILTER NOT EXISTS { <https://dblp.org/rec/conf/annsim/BlasGZ21> dblp:authoredBy <https://dblp.org/pid/85/2254> } }","paraphrases":["Wasn't the paper 'Towards a Universal Representation of DEVS: A Metamodel-Based Definition of DEVS Formal Specification' not published by the person named Gonnet, Silvio?"],"info":{}}
{"id":"train_1539","question":"Was the paper 'Interference to digital broadband communications and spread spectrum communications' not published by the person Charles W. Rhodes?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccel/Rhodes12a> dblp:authoredBy <https://dblp.org/pid/120/9098> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccel/Rhodes12a> dblp:authoredBy <https://dblp.org/pid/120/9098> } }","paraphrases":["Wasn't the paper 'Interference to digital broadband communications and spread spectrum communications' not published by the person named Charles W. Rhodes?"],"info":{}}
{"id":"train_1540","question":"Was the paper 'Relativistic changes to particle trajectories are difficult to detect' not co-authored by Hassani, Farbod and Jean-Pierre Eckmann?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1909-04652> dblp:authoredBy <https://dblp.org/pid/248/8345> . <https://dblp.org/rec/journals/corr/abs-1909-04652> dblp:authoredBy <https://dblp.org/pid/25/9365> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1909-04652> dblp:authoredBy <https://dblp.org/pid/248/8345> . <https://dblp.org/rec/journals/corr/abs-1909-04652> dblp:authoredBy <https://dblp.org/pid/25/9365> } }","paraphrases":["Have Hassani, Farbod and J. Eckmann not co-authored the paper 'Relativistic changes to particle trajectories are difficult to detect'?"],"info":{}}
{"id":"train_1541","question":"Did Claudio E. Palazzi not publish the paper 'Would Current Ad-Hoc Routing Protocols be Adequate for the Internet of Vehicles? A Comparative Study'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iotj/BujariGPR18> dblp:authoredBy <https://dblp.org/pid/43/425> FILTER NOT EXISTS { <https://dblp.org/rec/journals/iotj/BujariGPR18> dblp:authoredBy <https://dblp.org/pid/43/425> } }","paraphrases":["Wasn't the paper 'Would Current Ad-Hoc Routing Protocols be Adequate for the Internet of Vehicles? A Comparative Study' not published by the author Claudio E. Palazzi?"],"info":{}}
{"id":"train_1542","question":"Did Shohfi, T. D. not publish the paper 'The Construction of Efficient Portfolios: A Verification of Risk Models for Investment Making' in Frontiers Appl. Math. Stat.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fams/GultekinSG20> dblp:authoredBy <https://dblp.org/pid/307/9734> . <https://dblp.org/rec/journals/fams/GultekinSG20> dblp:publishedIn 'Frontiers Appl. Math. Stat.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/fams/GultekinSG20> dblp:authoredBy <https://dblp.org/pid/307/9734> . <https://dblp.org/rec/journals/fams/GultekinSG20> dblp:publishedIn 'Frontiers Appl. Math. Stat.' } }","paraphrases":["Has the paper 'The Construction of Efficient Portfolios: A Verification of Risk Models for Investment Making' not been published by Shohfi, T. D. in Frontiers Appl. Math. Stat.?"],"info":{}}
{"id":"train_1543","question":"Has the paper 'A 10-Gb/s 5-Tap DFE/4-Tap FFE Transceiver in 90-nm CMOS Technology' not been published by Michael P. Beakes in IEEE J. Solid State Circuits?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jssc/BulzacchelliMRR06> dblp:authoredBy <https://dblp.org/pid/00/10282> . <https://dblp.org/rec/journals/jssc/BulzacchelliMRR06> dblp:publishedIn 'IEEE J. Solid State Circuits' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jssc/BulzacchelliMRR06> dblp:authoredBy <https://dblp.org/pid/00/10282> . <https://dblp.org/rec/journals/jssc/BulzacchelliMRR06> dblp:publishedIn 'IEEE J. Solid State Circuits' } }","paraphrases":["Was the paper 'A 10-Gb/s 5-Tap DFE/4-Tap FFE Transceiver in 90-nm CMOS Technology' not published by M. P. Beakes in IEEE J. Solid State Circuits?"],"info":{}}
{"id":"train_1544","question":"Wasn't the paper 'Learning to Cooperate in a Socially Optimal Way in Swarm Robotics' not published by the author Ecoffet, Paul?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isalalife/EcoffetAB20> dblp:authoredBy <https://dblp.org/pid/287/4841> FILTER NOT EXISTS { <https://dblp.org/rec/conf/isalalife/EcoffetAB20> dblp:authoredBy <https://dblp.org/pid/287/4841> } }","paraphrases":["Didn't Ecoffet, Paul publish the paper 'Learning to Cooperate in a Socially Optimal Way in Swarm Robotics'?"],"info":{}}
{"id":"train_1545","question":"Was the paper 'A trajectory algorithm based on the gradient method I The search on the quasioptimal trajectories' not co-authored by E. G. Sturua and S. K. Zavriev?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jgo/SturuaZ91> dblp:authoredBy <https://dblp.org/pid/187/6844> . <https://dblp.org/rec/journals/jgo/SturuaZ91> dblp:authoredBy <https://dblp.org/pid/187/5983> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jgo/SturuaZ91> dblp:authoredBy <https://dblp.org/pid/187/6844> . <https://dblp.org/rec/journals/jgo/SturuaZ91> dblp:authoredBy <https://dblp.org/pid/187/5983> } }","paraphrases":["Did E. G. Sturua and Zavriev, S. K. not co-author the paper 'A trajectory algorithm based on the gradient method I The search on the quasioptimal trajectories'?"],"info":{}}
{"id":"train_1546","question":"Has the paper 'Using Examples for Teaching Software Design: An Experiment Using a Repository of UML Class Diagrams' not been published by Bilal Karasneh in Asia-Pacific Software Engineering Conference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apsec/KarasnehJC15> dblp:authoredBy <https://dblp.org/pid/138/0574> . <https://dblp.org/rec/conf/apsec/KarasnehJC15> dblp:publishedIn 'APSEC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/apsec/KarasnehJC15> dblp:authoredBy <https://dblp.org/pid/138/0574> . <https://dblp.org/rec/conf/apsec/KarasnehJC15> dblp:publishedIn 'APSEC' } }","paraphrases":["Was the paper 'Using Examples for Teaching Software Design: An Experiment Using a Repository of UML Class Diagrams' not published by Bilal Karasneh in APSEC?"],"info":{}}
{"id":"train_1547","question":"Was the paper 'Heterogenous swarm with first and second order dynamics for function optimization' not co-authored by T. Hatanaka and Heng Xiao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cec/XiaoH16> dblp:authoredBy <https://dblp.org/pid/49/6419> . <https://dblp.org/rec/conf/cec/XiaoH16> dblp:authoredBy <https://dblp.org/pid/50/10753> FILTER NOT EXISTS { <https://dblp.org/rec/conf/cec/XiaoH16> dblp:authoredBy <https://dblp.org/pid/49/6419> . <https://dblp.org/rec/conf/cec/XiaoH16> dblp:authoredBy <https://dblp.org/pid/50/10753> } }","paraphrases":["Did T. Hatanaka and Xiao, H. not co-author the paper 'Heterogenous swarm with first and second order dynamics for function optimization'?"],"info":{}}
{"id":"train_1548","question":"Was the paper 'Inharmonious Region Localization' not published by Liqing Zhang in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2104-09453> dblp:authoredBy <https://dblp.org/pid/20/4627-1> . <https://dblp.org/rec/journals/corr/abs-2104-09453> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2104-09453> dblp:authoredBy <https://dblp.org/pid/20/4627-1> . <https://dblp.org/rec/journals/corr/abs-2104-09453> dblp:publishedIn 'CoRR' } }","paraphrases":["Has the paper 'Inharmonious Region Localization' not been published by Liqing Zhang in CoRR?"],"info":{}}
{"id":"train_1549","question":"Was the paper 'Volumetric 3D graphics on commodity displays using active gaze tracking' not co-authored by John P. Collomosse and C. Malleson?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccvw/MallesonC11> dblp:authoredBy <https://dblp.org/pid/72/4504> . <https://dblp.org/rec/conf/iccvw/MallesonC11> dblp:authoredBy <https://dblp.org/pid/36/10781> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccvw/MallesonC11> dblp:authoredBy <https://dblp.org/pid/72/4504> . <https://dblp.org/rec/conf/iccvw/MallesonC11> dblp:authoredBy <https://dblp.org/pid/36/10781> } }","paraphrases":["Have John P. Collomosse and C. Malleson not co-authored the paper 'Volumetric 3D graphics on commodity displays using active gaze tracking'?"],"info":{}}
{"id":"train_1550","question":"Was the paper 'Maximum Matching' not co-authored by M. Mucha and Pablo D. Godoy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/reference/algo/Mucha16> dblp:authoredBy <https://dblp.org/pid/m/MarcinMucha> . <https://dblp.org/rec/reference/algo/Mucha16> dblp:authoredBy <https://dblp.org/pid/234/9553> FILTER NOT EXISTS { <https://dblp.org/rec/reference/algo/Mucha16> dblp:authoredBy <https://dblp.org/pid/m/MarcinMucha> . <https://dblp.org/rec/reference/algo/Mucha16> dblp:authoredBy <https://dblp.org/pid/234/9553> } }","paraphrases":["Did Marcin Mucha and Pablo D. Godoy not co-author the paper 'Maximum Matching'?"],"info":{}}
{"id":"train_1551","question":"Has the paper 'Understanding the I/O Impact on the Performance of High-Throughput Molecular Docking' not been published by Stefano Markidis in PDSW@SC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pdsw/MarkidisGVP21> dblp:authoredBy <https://dblp.org/pid/25/2060> . <https://dblp.org/rec/conf/pdsw/MarkidisGVP21> dblp:publishedIn 'PDSW@SC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/pdsw/MarkidisGVP21> dblp:authoredBy <https://dblp.org/pid/25/2060> . <https://dblp.org/rec/conf/pdsw/MarkidisGVP21> dblp:publishedIn 'PDSW@SC' } }","paraphrases":["Wasn't the paper 'Understanding the I/O Impact on the Performance of High-Throughput Molecular Docking' published by the author Stefano Markidis in PDSW@SC?"],"info":{}}
{"id":"train_1552","question":"Didn't Harashima, J. publish the paper 'Japanese Word\\u2015Color Associations with and without Contexts'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/lrec/Harashima16> dblp:authoredBy <https://dblp.org/pid/127/0284> FILTER NOT EXISTS { <https://dblp.org/rec/conf/lrec/Harashima16> dblp:authoredBy <https://dblp.org/pid/127/0284> } }","paraphrases":["Was the paper 'Japanese Word\\u2015Color Associations with and without Contexts' not published by the person Jun Harashima?"],"info":{}}
{"id":"train_1553","question":"Wasn't the paper 'Learning Knowledge Rich User Models from the Semantic Web' not published by the person named Gunnar Aastrand Grimnes?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/um/Grimnes03> dblp:authoredBy <https://dblp.org/pid/g/GunnarAastrandGrimnes> FILTER NOT EXISTS { <https://dblp.org/rec/conf/um/Grimnes03> dblp:authoredBy <https://dblp.org/pid/g/GunnarAastrandGrimnes> } }","paraphrases":["Didn't Gunnar A. Grimnes publish the paper 'Learning Knowledge Rich User Models from the Semantic Web'?"],"info":{}}
{"id":"train_1555","question":"Was the paper 'An extended study of collaboration networks of Levantine biomedical researchers' not published by Yaser Jararweh in J. Ambient Intell. Humaniz. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jaihc/Al-AyyoubAJ18> dblp:authoredBy <https://dblp.org/pid/53/4234> . <https://dblp.org/rec/journals/jaihc/Al-AyyoubAJ18> dblp:publishedIn 'J. Ambient Intell. Humaniz. Comput.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jaihc/Al-AyyoubAJ18> dblp:authoredBy <https://dblp.org/pid/53/4234> . <https://dblp.org/rec/journals/jaihc/Al-AyyoubAJ18> dblp:publishedIn 'J. Ambient Intell. Humaniz. Comput.' } }","paraphrases":["Has the paper 'An extended study of collaboration networks of Levantine biomedical researchers' not been published by Yaser J. in J. Ambient Intell. Humaniz. Comput.?"],"info":{}}
{"id":"train_1556","question":"Was the paper 'Frequency-scalable SiGe bipolar RF front-end design' not published by the person Ivan Linscott?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jssc/ShanaaLT01> dblp:authoredBy <https://dblp.org/pid/220/6941> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jssc/ShanaaLT01> dblp:authoredBy <https://dblp.org/pid/220/6941> } }","paraphrases":["Did I. Linscott not publish the paper 'Frequency-scalable SiGe bipolar RF front-end design'?"],"info":{}}
