{"id":"train_6660","question":"Mention the author who has published the most papers among the authors of 'Process Recovery'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ijcai/Leyton87> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Process Recovery'?"],"info":{}}
{"id":"train_6661","question":"Between 'Quantum Distinguishing Complexity, Zero-Error Algorithms, and Statistical Zero Knowledge' and 'An implementation of CAD in Maple utilising problem formulation, equational constraints and truth-table invariance', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/tqc/Ben-DavidK19> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/corr/England13> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/tqc/Ben-DavidK19> , <https://dblp.org/rec/conf/sigmetrics/GastH18> ) AS ?answer ) }","paraphrases":["Between 'Quantum Distinguishing Complexity, Zero-Error Algorithms, and Statistical Zero Knowledge' and 'An implementation of CAD in Maple utilising problem formulation, equational constraints and truth-table invariance', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6662","question":"Between 'Instrumenting time-sensitive software for feature location' and 'Towards a complete binary key system for the speaker diarization task', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iwpc/EdwardsWSG09> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/interspeech/DelgadoFS14> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/iwpc/EdwardsWSG09> , <https://dblp.org/rec/conf/interspeech/DelgadoFS14> ) AS ?answer ) }","paraphrases":["Between 'Instrumenting time-sensitive software for feature location' and 'Towards a complete binary key system for the speaker diarization task', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6663","question":"Mention the author who has published the most papers among the authors of 'Beyond context: Exploring semantic similarity for small object detection in crowded scenes'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/prl/XiZHJLXFL20> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Beyond context: Exploring semantic similarity for small object detection in crowded scenes'?"],"info":{}}
{"id":"train_6664","question":"Which one was published first, 'Exploring the Relationship between Experience and Group Performance in Software Review' or 'A Time Efficient Threshold Based Ant Colony System for Cloud Load Balancing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/apsec/WongW03> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/cicba/BanerjeeRRSD18> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/apsec/WongW03> , <https://dblp.org/rec/conf/cicba/BanerjeeRRSD18> ) AS ?answer ) }","paraphrases":["Between 'Exploring the Relationship between Experience and Group Performance in Software Review' and 'A Time Efficient Threshold Based Ant Colony System for Cloud Load Balancing', which paper was published earlier?"],"info":{}}
{"id":"train_6665","question":"Between 'Fuzzy logic system for miniature climbing robots' and 'OR and systems - some comments on Checkland's reply to Eden and Ackerman', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icarcv/XiaoXX04> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/jors/Ormerod08a> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/icarcv/XiaoXX04> , <https://dblp.org/rec/journals/jors/Ormerod08a> ) AS ?answer ) }","paraphrases":["Between 'Fuzzy logic system for miniature climbing robots' and 'OR and systems - some comments on Checkland's reply to Eden and Ackerman', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6666","question":"Which one has more number of authors, 'Dense Shattering and Teaching Dimensions for Differentiable Families (Extended Abstract)' or 'New Bounds and Extended Relations Between Prefix Arrays, Border Arrays, Undirected Graphs, and Indeterminate Strings'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/colt/Kowalczyk97> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/stacs/Blanchet-SadriBW14> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/colt/Kowalczyk97> , <https://dblp.org/rec/conf/stacs/Blanchet-SadriBW14> ) AS ?answer ) }","paraphrases":["Between 'Dense Shattering and Teaching Dimensions for Differentiable Families (Extended Abstract)' and 'New Bounds and Extended Relations Between Prefix Arrays, Border Arrays, Undirected Graphs, and Indeterminate Strings', which paper has more authors?"],"info":{}}
{"id":"train_6667","question":"Between 'Constructing New Facets of the Consecutive Ones Polytope' and 'First Approaches on Spanish Medical Record Classification Using Diagnostic Term to Class Transduction', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aussois/OswaldR01> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/fsmnlp/CasillasIGOP12> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/aussois/OswaldR01> , <https://dblp.org/rec/conf/fsmnlp/CasillasIGOP12> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Constructing New Facets of the Consecutive Ones Polytope' or 'First Approaches on Spanish Medical Record Classification Using Diagnostic Term to Class Transduction'?"],"info":{}}
{"id":"train_6668","question":"Which one has more number of authors, 'Steering on SO(3) with sinusoidal inputs' or 'Optimal resource allocation for smart-grid powered MIMO broadcast channels'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amcc/WangHS17> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/wcsp/HuWZG15> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/amcc/WangHS17> , <https://dblp.org/rec/conf/wcsp/HuWZG15> ) AS ?answer ) }","paraphrases":["Between 'Steering on SO(3) with sinusoidal inputs' and 'Optimal resource allocation for smart-grid powered MIMO broadcast channels', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6670","question":"Mention the year in which the first papers of the authors of 'Secure XSEDE Information APIs' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/xsede/NavarroBL20> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Secure XSEDE Information APIs' published?"],"info":{}}
{"id":"train_6671","question":"Which one has more number of authors, 'Happiness or Addiction: An Example of Taiwanese College Students' Use of Facebook' or 'Distributed Sampling Rate Control for Rechargeable Sensor Nodes with Limited Battery Capacity'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijthi/Yu15> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/twc/ZhangHCSS13> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/ijthi/Yu15> , <https://dblp.org/rec/journals/twc/ZhangHCSS13> ) AS ?answer ) }","paraphrases":["Between 'Happiness or Addiction: An Example of Taiwanese College Students' Use of Facebook' and 'Distributed Sampling Rate Control for Rechargeable Sensor Nodes with Limited Battery Capacity', which paper has more authors?"],"info":{}}
{"id":"train_6672","question":"To which institution are the majority of the authors of 'Automatic Generation of German Translation Candidates for SNOMED CT Textual Descriptions' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/mie/Prunotto0B21> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Automatic Generation of German Translation Candidates for SNOMED CT Textual Descriptions' from?"],"info":{}}
{"id":"train_6673","question":"Mention the year in which the first papers of the authors of 'Sequential Performance: Raising Awareness of the Gory Details' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/iccS/RohouG15> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Sequential Performance: Raising Awareness of the Gory Details' published?"],"info":{}}
{"id":"train_6674","question":"Between 'Smoothing Methods and Cross-Language Document Re-ranking' and 'Questions and Answers Database Construction for Adaptive Online IRT Testing Systems: Analysis Course and Linear Algebra Course', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/clef/ZhouW09> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/iiaiaai/HiroseTYTHKIK16> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/clef/ZhouW09> , <https://dblp.org/rec/conf/iiaiaai/HiroseTYTHKIK16> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Smoothing Methods and Cross-Language Document Re-ranking' or 'Questions and Answers Database Construction for Adaptive Online IRT Testing Systems: Analysis Course and Linear Algebra Course'?"],"info":{}}
{"id":"train_6676","question":"Which one has more number of authors, 'Smart Education: A Review and Future Research Directions' or 'Lagrangian Relaxation Approach for Decentralized Decision Making in Engineering Design'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ucami/MartinAK19> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/jcise/Li10> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/ucami/MartinAK19> , <https://dblp.org/rec/journals/jcise/Li10> ) AS ?answer ) }","paraphrases":["Between 'Smart Education: A Review and Future Research Directions' and 'Lagrangian Relaxation Approach for Decentralized Decision Making in Engineering Design', which paper has more authors?"],"info":{}}
{"id":"train_6677","question":"Mention the year in which the first papers of the authors of 'A Fast Sub-Volume Search Method for Human Action Detection' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/ieicet/GuoMZW12> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["In which year were the first papers of the authors of 'A Fast Sub-Volume Search Method for Human Action Detection' published?"],"info":{}}
{"id":"train_6678","question":"Name the primary affiliation of most of the authors of 'Fast inter mode decision based on textural segmentation and correlations for multiview video coding'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tce/ZhuTZC10a> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Fast inter mode decision based on textural segmentation and correlations for multiview video coding' from?"],"info":{}}
{"id":"train_6679","question":"Mention the year in which the first papers of the authors of 'Flexible power-efficient Nyquist-OTDM transmitter, using a WSS and time-lens effect' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/ofc/CincottiSMKHOMH15> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Flexible power-efficient Nyquist-OTDM transmitter, using a WSS and time-lens effect' published?"],"info":{}}
{"id":"train_6680","question":"Between 'Modelling to determine the optimal porosity of shelterbelts for the capture of agricultural spray drift' and 'A TOPSIS-ELM framework for stock index price movement prediction', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/envsoft/Mercer09> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/idt/SamalD21> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/envsoft/Mercer09> , <https://dblp.org/rec/journals/idt/SamalD21> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Modelling to determine the optimal porosity of shelterbelts for the capture of agricultural spray drift' or 'A TOPSIS-ELM framework for stock index price movement prediction'?"],"info":{}}
{"id":"train_6681","question":"Which one has more number of authors, 'Jointly Improving Language Understanding and Generation with Quality-Weighted Weak Supervision of Automatic Labeling' or 'The unitary completion and QR iterations for a class of structured matrices'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2102-03551> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/moc/BiniEGG08> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/corr/abs-2102-03551> , <https://dblp.org/rec/journals/moc/BiniEGG08> ) AS ?answer ) }","paraphrases":["Between 'Jointly Improving Language Understanding and Generation with Quality-Weighted Weak Supervision of Automatic Labeling' and 'The unitary completion and QR iterations for a class of structured matrices', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6683","question":"Mention the author who has published the most papers among the authors of 'A Web-based Data Visualization and Analysis System for Watershed Management'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/agis/KouLGGP05> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'A Web-based Data Visualization and Analysis System for Watershed Management'?"],"info":{}}
{"id":"train_6684","question":"Mention the year in which the first papers of the authors of 'MEDADVIS: A Medical Advisory System' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/kes/Al-KabirLS05> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'MEDADVIS: A Medical Advisory System' published?"],"info":{}}
{"id":"train_6687","question":"Which one has more number of authors, 'Assessing Usability of the D2Refine Platform for Harmonization and Standardization of Clinical Study Data Dictionaries' or 'A robust DPG method for large domains'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amia/SharmaPJ17> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/corr/abs-2011-12098> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/amia/SharmaPJ17> , <https://dblp.org/rec/journals/corr/abs-2011-12098> ) AS ?answer ) }","paraphrases":["Between 'Assessing Usability of the D2Refine Platform for Harmonization and Standardization of Clinical Study Data Dictionaries' and 'A robust DPG method for large domains', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6688","question":"Mention the year in which the first papers of the authors of 'Scheduler for Distributed and Collaborative Container Clusters based on Multi-Resource Metric' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/racs/LeeAK20a> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["In which year were the first papers of the authors of 'Scheduler for Distributed and Collaborative Container Clusters based on Multi-Resource Metric' published?"],"info":{}}
{"id":"train_6689","question":"Mention the primary affiliation of most of the authors of 'Imitation Learning With Stability and Safety Guarantees'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/csysl/YinSJA22> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Name the primary affiliation of most of the authors of 'Imitation Learning With Stability and Safety Guarantees'."],"info":{}}
{"id":"train_6690","question":"Mention the primary affiliation of most of the authors of 'Software Tool Combining Fault Masking with User-Defined Recovery Strategies'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/FlorioDL14a> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Software Tool Combining Fault Masking with User-Defined Recovery Strategies' from?"],"info":{}}
{"id":"train_6691","question":"Mention the year in which the first papers of the authors of 'Fundamental Limits of Wireless Caching Under Mixed Cacheable and Uncacheable Traffic' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/corr/abs-2002-07691> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'Fundamental Limits of Wireless Caching Under Mixed Cacheable and Uncacheable Traffic' published?"],"info":{}}
{"id":"train_6692","question":"Mention the author who has published the most papers among the authors of 'On the Generative Power of Discontinuous Lambek Calculus'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/fg/Sorokin13> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'On the Generative Power of Discontinuous Lambek Calculus'?"],"info":{}}
{"id":"train_6694","question":"Which one has more number of authors, 'Stability analysis of random linear coding across multicast sessions' or 'Enhancing Consumer Privacy in the Liberty Alliance Identity Federation and Web Services Frameworks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isit/CogillSE08> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/pet/AlsalehA06> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/isit/CogillSE08> , <https://dblp.org/rec/conf/pet/AlsalehA06> ) AS ?answer ) }","paraphrases":["Between 'Stability analysis of random linear coding across multicast sessions' and 'Enhancing Consumer Privacy in the Liberty Alliance Identity Federation and Web Services Frameworks', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6695","question":"Between 'A Pixel-wise Robust Extended Kalman Filter for Restoration of Geometrically Warped Anisoplanatic Images' and 'QoS-driven jointly optimal subcarrier pairing and power allocation for OFDM amplify-and-forward relay systems', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/IEEEcca/KallapurTP10> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ijcomsys/HuangTLZZQ14> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/IEEEcca/KallapurTP10> , <https://dblp.org/rec/journals/ijcomsys/HuangTLZZQ14> ) AS ?answer ) }","paraphrases":["Between 'A Pixel-wise Robust Extended Kalman Filter for Restoration of Geometrically Warped Anisoplanatic Images' and 'QoS-driven jointly optimal subcarrier pairing and power allocation for OFDM amplify-and-forward relay systems', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6696","question":"Mention the primary affiliation of most of the authors of 'HARAM: A Hierarchical ARAM Neural Network for Large-Scale Text Classification'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icdm/BenitesS15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Name the primary affiliation of most of the authors of 'HARAM: A Hierarchical ARAM Neural Network for Large-Scale Text Classification'."],"info":{}}
{"id":"train_6697","question":"Which one has more number of authors, 'Investigating Root Causes of Authentication Failures Using a SAML and OIDC Observatory' or 'Blockchain Technology Adoption via Contractual Coordination Mechanisms'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dependsys/BasneyCF20> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/icbta/HayrutdinovST20> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/dependsys/BasneyCF20> , <https://dblp.org/rec/conf/icbta/HayrutdinovST20> ) AS ?answer ) }","paraphrases":["Between 'Investigating Root Causes of Authentication Failures Using a SAML and OIDC Observatory' and 'Blockchain Technology Adoption via Contractual Coordination Mechanisms', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6699","question":"Between 'Bandstop Filter Decoupling Technique for Miniaturized Reconfigurable MIMO Antenna' and 'Dynamic adaptation to available resources for parallel computing in an autonomous network of workstations', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/IslamDABKPK22> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/ppopp/RencuzogullariD01> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/access/IslamDABKPK22> , <https://dblp.org/rec/conf/ppopp/RencuzogullariD01> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Bandstop Filter Decoupling Technique for Miniaturized Reconfigurable MIMO Antenna' or 'Dynamic adaptation to available resources for parallel computing in an autonomous network of workstations'?"],"info":{}}
{"id":"train_6700","question":"Which one has more number of authors, 'An extensible network query unification system for biological databases' or 'A new universal method for solving all problems of operational research'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bioinformatics/JamisonMS96> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/kybernetes/MazzaCMKB07> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/bioinformatics/JamisonMS96> , <https://dblp.org/rec/journals/kybernetes/MazzaCMKB07> ) AS ?answer ) }","paraphrases":["Between 'An extensible network query unification system for biological databases' and 'A new universal method for solving all problems of operational research', which paper has more authors?"],"info":{}}
{"id":"train_6701","question":"Between 'Complementary image compression based on the theory of fuzzy information granulation' and 'On Sets Turing Reducible to p-Selective Sets', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/smc/XiuZLH05> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/mst/BurtschickL97> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/smc/XiuZLH05> , <https://dblp.org/rec/journals/mst/BurtschickL97> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Complementary image compression based on the theory of fuzzy information granulation' or 'On Sets Turing Reducible to p-Selective Sets'?"],"info":{}}
{"id":"train_6702","question":"Between 'Participation inequality in mobile location games' and 'Teaching with A Hierarchically Structured Digital Systems Laboratory', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ACMace/LundCW11> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/computer/GrasonS75> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/ACMace/LundCW11> , <https://dblp.org/rec/journals/computer/GrasonS75> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Participation inequality in mobile location games' or 'Teaching with A Hierarchically Structured Digital Systems Laboratory'?"],"info":{}}
{"id":"train_6703","question":"Name the primary affiliation of most of the authors of 'Stochastic Analysis of Qualitative Dynamics'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ijcai/DoyleS89> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the primary affiliation of most of the authors of 'Stochastic Analysis of Qualitative Dynamics'."],"info":{}}
{"id":"train_6704","question":"Between 'A Community of Practice among tutors enabling student participation in a seminar preparation' and 'Class-incremental Learning using a Sequence of Partial Implicitly Regularized Classifiers', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cscl/Nett08> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/corr/abs-2104-01577> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/cscl/Nett08> , <https://dblp.org/rec/journals/corr/abs-2104-01577> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'A Community of Practice among tutors enabling student participation in a seminar preparation' or 'Class-incremental Learning using a Sequence of Partial Implicitly Regularized Classifiers'?"],"info":{}}
{"id":"train_6708","question":"What is the primary affiliation of most of the authors of the paper 'A Unified Approach to Adaptive Neural Control for Nonlinear Discrete-Time Systems With Nonlinear Dead-Zone Input'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tnn/LiuGTC16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'A Unified Approach to Adaptive Neural Control for Nonlinear Discrete-Time Systems With Nonlinear Dead-Zone Input' affiliated?"],"info":{}}
{"id":"train_6709","question":"Between 'A wearable-glasses-based drowsiness-fatigue-detection system for improving road safety' and 'Prioritisation of an IT budget within a local authority', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gcce/ChenCSCCKL16> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/jors/Jessop02> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/gcce/ChenCSCCKL16> , <https://dblp.org/rec/journals/jors/Jessop02> ) AS ?answer ) }","paraphrases":["Which one was published first, 'A wearable-glasses-based drowsiness-fatigue-detection system for improving road safety' or 'Prioritisation of an IT budget within a local authority'?"],"info":{}}
{"id":"train_6710","question":"Between 'Multi-sensor fault recovery in the presence of known and unknown fault types' and 'Machine Learning Applications in Physical Design: Recent Results and Directions', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fusion/ReeceRCN09> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/ispd/Kahng18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/fusion/ReeceRCN09> , <https://dblp.org/rec/conf/ispd/Kahng18> ) AS ?answer ) }","paraphrases":["Between 'Multi-sensor fault recovery in the presence of known and unknown fault types' and 'Machine Learning Applications in Physical Design: Recent Results and Directions', which paper has more authors?"],"info":{}}
