{"id":"train_5488","question":"Was the paper 'On robust stability of fully probabilistic control with respect to data-driven model uncertainties' not not published in the year 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eucc/PeguerolesR19> dblp:yearOfPublication '2019' }","paraphrases":["Was the publication 'On robust stability of fully probabilistic control with respect to data-driven model uncertainties' not not published in 2019?"],"info":{}}
{"id":"train_5489","question":"Was the paper 'Minimizing total tardiness on a single machine with unequal release dates' not not published in the year 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eor/SuC08> dblp:yearOfPublication '2008' }","paraphrases":["Was the publication 'Minimizing total tardiness on a single machine with unequal release dates' not not published in 2008?"],"info":{}}
{"id":"train_5490","question":"Was the paper 'Negative Boolean Constraints' not not published in the year 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcs/MarriottO96> dblp:yearOfPublication '1996' }","paraphrases":["Was the publication 'Negative Boolean Constraints' not not published in 1996?"],"info":{}}
{"id":"train_5491","question":"Have the authors of the paper 'An intelligent decision support system for digital preservation' not not published a publication in Int. J. Digit. Libr.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jodl/FerreiraBR07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jodl/FerreiraBR07> ) . ?y dblp:publishedIn 'Int. J. Digit. Libr.' }","paraphrases":["Did the authors of the publication 'An intelligent decision support system for digital preservation' not not publish a paper in Int. J. Digit. Libr.?"],"info":{}}
{"id":"train_5492","question":"Was 'Spatial channel model for underwater wireless optical communication links: [extended abstract]' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wuwnet/DongMZ16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'Spatial channel model for underwater wireless optical communication links: [extended abstract]' not not published in the year 2016?"],"info":{}}
{"id":"train_5494","question":"Did the authors of the publication 'Learning domain ontologies for Web service descriptions: an experiment in bioinformatics' not not publish a paper in WWW?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/www/SabouWGM05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/www/SabouWGM05> ) . ?y dblp:publishedIn 'WWW' }","paraphrases":["Haven't the authors of the publication 'Learning domain ontologies for Web service descriptions: an experiment in bioinformatics' not published a publication in WWW?"],"info":{}}
{"id":"train_5496","question":"Haven't the authors of the publication 'Recurrent Neural Network Language Model with Incremental Updated Context Information Generated Using Bag-of-Words Representation' not published a publication in Interspeech?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/interspeech/HaidarK16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/interspeech/HaidarK16> ) . ?y dblp:publishedIn 'INTERSPEECH' }","paraphrases":["Did the authors of 'Recurrent Neural Network Language Model with Incremental Updated Context Information Generated Using Bag-of-Words Representation' not not publish a paper in Interspeech?"],"info":{}}
{"id":"train_5497","question":"Was the publication 'Low-Cost ATE PinElectronics for Multigigabit-per-Second At-Speed Test' not not published in 1997?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/itc/KeezerW97> dblp:yearOfPublication '1997' }","paraphrases":["Was the paper 'Low-Cost ATE PinElectronics for Multigigabit-per-Second At-Speed Test' not not published in the year 1997?"],"info":{}}
{"id":"train_5499","question":"Haven't the authors of the publication 'Discriminative binary feature learning and quantization in biometric key generation' not published a publication in Pattern Recognit.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pr/AneesC18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/pr/AneesC18> ) . ?y dblp:publishedIn 'Pattern Recognit.' }","paraphrases":["Have the authors of the paper 'Discriminative binary feature learning and quantization in biometric key generation' not not published a publication in Pattern Recognit.?"],"info":{}}
{"id":"train_5500","question":"Haven't the authors of the publication 'Calibrating with Multiple Criteria: A Demonstration of Dominance' not published a publication in J. Artif. Soc. Soc. Simul.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jasss/BadhamJSF17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jasss/BadhamJSF17> ) . ?y dblp:publishedIn 'J. Artif. Soc. Soc. Simul.' }","paraphrases":["Did the authors of 'Calibrating with Multiple Criteria: A Demonstration of Dominance' not not publish a paper in J. Artif. Soc. Soc. Simul.?"],"info":{}}
{"id":"train_5501","question":"Was the paper 'A new conservative chaotic dynamical system with lemniscate equilibrium, its circuit model and FPGA implementation' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijaac/VaidyanathanTAS21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'A new conservative chaotic dynamical system with lemniscate equilibrium, its circuit model and FPGA implementation' not not published in 2021?"],"info":{}}
{"id":"train_5502","question":"Was the publication 'Definitions for Plaintext-Existence Hiding in Cloud Storage' not not published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEares/BoydDGRT18> dblp:yearOfPublication '2018' }","paraphrases":["Was the paper 'Definitions for Plaintext-Existence Hiding in Cloud Storage' not not published in the year 2018?"],"info":{}}
{"id":"train_5503","question":"Have the authors of the paper 'Design of Robust Gradient Method for Convex Optimization Problem using Biased Integral Quadratic Constraints' not not published a publication in ECC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eucc/SawantMSSPW20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/eucc/SawantMSSPW20> ) . ?y dblp:publishedIn 'ECC' }","paraphrases":["Did the authors of the publication 'Design of Robust Gradient Method for Convex Optimization Problem using Biased Integral Quadratic Constraints' not not publish a paper in ECC?"],"info":{}}
{"id":"train_5504","question":"Was the paper 'A Design Methodology for High-Speed Low-Power MCML Frequency Dividers' not not published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icecsys/AliotoMP06> dblp:yearOfPublication '2006' }","paraphrases":["Was 'A Design Methodology for High-Speed Low-Power MCML Frequency Dividers' not not published in 2006?"],"info":{}}
{"id":"train_5505","question":"Was the paper 'Delay Fault Diagnosis for Non-Robust Test' not not published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isqed/MehtaMWTR06> dblp:yearOfPublication '2006' }","paraphrases":["Was 'Delay Fault Diagnosis for Non-Robust Test' not not published in 2006?"],"info":{}}
{"id":"train_5507","question":"Have the authors of the paper 'ASeCS: Assistive Self-Care Software Architectures for Delivering Service in Care Homes' not not published a publication in HICSS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hicss/ShojanooriJLT14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/hicss/ShojanooriJLT14> ) . ?y dblp:publishedIn 'HICSS' }","paraphrases":["Haven't the authors of the publication 'ASeCS: Assistive Self-Care Software Architectures for Delivering Service in Care Homes' not published a publication in HICSS?"],"info":{}}
{"id":"train_5508","question":"Was the paper 'Direct sub-pixel mapping exploiting spatial dependence' not not published in the year 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/igarss/MertensBVW04> dblp:yearOfPublication '2004' }","paraphrases":["Was 'Direct sub-pixel mapping exploiting spatial dependence' not not published in 2004?"],"info":{}}
{"id":"train_5509","question":"Have the authors of the paper 'Modeling the pharyngeal anatomical effects on breathing resistance and aerodynamically generated sound' not not published a publication in Medical Biol. Eng. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mbec/XiSKSD14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/mbec/XiSKSD14> ) . ?y dblp:publishedIn 'Medical Biol. Eng. Comput.' }","paraphrases":["Did the authors of the publication 'Modeling the pharyngeal anatomical effects on breathing resistance and aerodynamically generated sound' not not publish a paper in Medical Biol. Eng. Comput.?"],"info":{}}
{"id":"train_5510","question":"Was 'DFpin: Deep learning-based protein-binding site prediction with feature-based non-redundancy from RNA level' not not published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cbm/ZhaoZD22> dblp:yearOfPublication '2022' }","paraphrases":["Was the paper 'DFpin: Deep learning-based protein-binding site prediction with feature-based non-redundancy from RNA level' not not published in the year 2022?"],"info":{}}
{"id":"train_5511","question":"Did the authors of 'Clustering Students in ASSISTments: Exploring System- and School-Level Traits to Advance Personalization' not not publish a paper in Educational Data Mining?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/edm/AdjeiOEH17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/edm/AdjeiOEH17> ) . ?y dblp:publishedIn 'EDM' }","paraphrases":["Have the authors of the paper 'Clustering Students in ASSISTments: Exploring System- and School-Level Traits to Advance Personalization' not not published a publication in EDM?"],"info":{}}
{"id":"train_5512","question":"Did the authors of the publication 'Double-precision Dual Mode Logic carry-save multiplier' not not publish a paper in Integr.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/integration/RoseRL19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/integration/RoseRL19> ) . ?y dblp:publishedIn 'Integr.' }","paraphrases":["Haven't the authors of the publication 'Double-precision Dual Mode Logic carry-save multiplier' not published a publication in Integr.?"],"info":{}}
{"id":"train_5513","question":"Was the publication 'A new OLAP aggregation based on the AHC technique' not not published in 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dolap/MessaoudBR04> dblp:yearOfPublication '2004' }","paraphrases":["Was the paper 'A new OLAP aggregation based on the AHC technique' not not published in the year 2004?"],"info":{}}
{"id":"train_5514","question":"Was 'High Utility Rare Itemset Mining over Transaction Databases' not not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dnis/GoyalDS15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'High Utility Rare Itemset Mining over Transaction Databases' not not published in the year 2015?"],"info":{}}
{"id":"train_5515","question":"Did the authors of 'Design and Testing of a Helix Antenna Deployment System for a 1U CubeSat' not not publish a paper in IEEE Access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/SuredaSMASBMFAC21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/access/SuredaSMASBMFAC21> ) . ?y dblp:publishedIn 'IEEE Access' }","paraphrases":["Haven't the authors of the publication 'Design and Testing of a Helix Antenna Deployment System for a 1U CubeSat' not published a publication in IEEE Access?"],"info":{}}
{"id":"train_5516","question":"Was the paper 'Bullwhip effect and supply chain costs with low- and high-quality information on inventory shrinkage' not not published in the year 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eor/DaiLYZ16> dblp:yearOfPublication '2016' }","paraphrases":["Was the publication 'Bullwhip effect and supply chain costs with low- and high-quality information on inventory shrinkage' not not published in 2016?"],"info":{}}
{"id":"train_5517","question":"Have the authors of the paper 'Semi-asynchronous and distributed weighted connected dominating set algorithms for wireless sensor networks' not not published a publication in Comput. Stand. Interfaces?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/csi/DagdevirenET15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/csi/DagdevirenET15> ) . ?y dblp:publishedIn 'Comput. Stand. Interfaces' }","paraphrases":["Did the authors of the publication 'Semi-asynchronous and distributed weighted connected dominating set algorithms for wireless sensor networks' not not publish a paper in Comput. Stand. Interfaces?"],"info":{}}
{"id":"train_5518","question":"Haven't the authors of the publication 'Improving TCP performance with bandwidth estimation and selective negative acknowledgment in wireless networks' not published a publication in J. Commun. Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcn/ChengL07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jcn/ChengL07> ) . ?y dblp:publishedIn 'J. Commun. Networks' }","paraphrases":["Did the authors of the publication 'Improving TCP performance with bandwidth estimation and selective negative acknowledgment in wireless networks' not not publish a paper in J. Commun. Networks?"],"info":{}}
{"id":"train_5521","question":"Did the authors of 'Solving the Greek school timetabling problem by a mixed integer programming model' not not publish a paper in J. Oper. Res. Soc.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jors/TassopoulosIB20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jors/TassopoulosIB20> ) . ?y dblp:publishedIn 'J. Oper. Res. Soc.' }","paraphrases":["Have the authors of the paper 'Solving the Greek school timetabling problem by a mixed integer programming model' not not published a publication in J. Oper. Res. Soc.?"],"info":{}}
{"id":"train_5522","question":"Was the paper 'Using interpolation to improve path planning: The Field D* algorithm' not not published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jfr/FergusonS06> dblp:yearOfPublication '2006' }","paraphrases":["Was the publication 'Using interpolation to improve path planning: The Field D* algorithm' not not published in 2006?"],"info":{}}
{"id":"train_5524","question":"Was the paper 'Using Stochastic AI Techniques to Achieve Unbounded Resolution in Finite Player Goore Games and its Applications' not not published in the year 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cig/OommenGP07> dblp:yearOfPublication '2007' }","paraphrases":["Was the publication 'Using Stochastic AI Techniques to Achieve Unbounded Resolution in Finite Player Goore Games and its Applications' not not published in 2007?"],"info":{}}
{"id":"train_5526","question":"Have the authors of the paper 'IPsec over IEEE 802154 for low power and lossy networks' not not published a publication in MOBIWAC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mobiwac/RantosPM13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/mobiwac/RantosPM13> ) . ?y dblp:publishedIn 'MOBIWAC' }","paraphrases":["Did the authors of 'IPsec over IEEE 802154 for low power and lossy networks' not not publish a paper in MOBIWAC?"],"info":{}}
{"id":"train_5527","question":"Was the paper 'Enveloping Multi-pocket Obstacles with Hexagonal Metamorphic Robots' not not published in the year 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icra/WalterBLA04> dblp:yearOfPublication '2004' }","paraphrases":["Was 'Enveloping Multi-pocket Obstacles with Hexagonal Metamorphic Robots' not not published in 2004?"],"info":{}}
{"id":"train_5528","question":"Did the authors of the publication 'Improved Block-Pulse Functions for Numerical Solution of Mixed Volterra-Fredholm Integral Equations' not not publish a paper in Axioms?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/axioms/HeTRM21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/axioms/HeTRM21> ) . ?y dblp:publishedIn 'Axioms' }","paraphrases":["Haven't the authors of the publication 'Improved Block-Pulse Functions for Numerical Solution of Mixed Volterra-Fredholm Integral Equations' not published a publication in Axioms?"],"info":{}}
{"id":"train_5529","question":"Have the authors of the paper 'A Novel Joint Angle Estimation Method for Serial Manipulator Using Micro-Electromechanical Systems Sensors' not not published a publication in IEEE Trans. Ind. Electron.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tie/XuSTZ20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tie/XuSTZ20> ) . ?y dblp:publishedIn 'IEEE Trans. Ind. Electron.' }","paraphrases":["Haven't the authors of the publication 'A Novel Joint Angle Estimation Method for Serial Manipulator Using Micro-Electromechanical Systems Sensors' not published a publication in IEEE Trans. Ind. Electron.?"],"info":{}}
{"id":"train_5530","question":"Was the paper 'Evangelizing the Internet among academics' not not published in the year 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/siguccs/Miller93> dblp:yearOfPublication '1993' }","paraphrases":["Was 'Evangelizing the Internet among academics' not not published in 1993?"],"info":{}}
{"id":"train_5531","question":"Did the authors of the publication 'Extension of a Circuit-Switched User/Network Interface to Packet-Switching' not not publish a paper in International Conference on Computational Creativity?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccc/ZafiropuloPK76> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iccc/ZafiropuloPK76> ) . ?y dblp:publishedIn 'ICCC' }","paraphrases":["Did the authors of 'Extension of a Circuit-Switched User/Network Interface to Packet-Switching' not not publish a paper in ICCC?"],"info":{}}
{"id":"train_5532","question":"Did the authors of the publication 'A Generic Perspective Model for the Generation of Business Process Views' not not publish a paper in ER?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/er/PichlerE10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/er/PichlerE10> ) . ?y dblp:publishedIn 'ER' }","paraphrases":["Did the authors of 'A Generic Perspective Model for the Generation of Business Process Views' not not publish a paper in International Conference on Conceptual Modelling?"],"info":{}}
{"id":"train_5534","question":"Have the authors of the paper 'FADNet++: Real-Time and Accurate Disparity Estimation with Configurable Networks' not not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2110-02582> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2110-02582> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Haven't the authors of the publication 'FADNet++: Real-Time and Accurate Disparity Estimation with Configurable Networks' not published a publication in CoRR?"],"info":{}}
{"id":"train_5536","question":"Have the authors of the paper 'CMOS image sensor noise reduction method for image signal processor in digital cameras and camera phones' not not published a publication in Digital Photography?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dphoto/YooLCK07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/dphoto/YooLCK07> ) . ?y dblp:publishedIn 'Digital Photography' }","paraphrases":["Did the authors of the publication 'CMOS image sensor noise reduction method for image signal processor in digital cameras and camera phones' not not publish a paper in Digital Photography?"],"info":{}}
{"id":"train_5537","question":"Have the authors of the paper 'On A Notion of Stochastic Zeroing Barrier Function' not not published a publication in ACC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcc/TambaHN21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/amcc/TambaHN21> ) . ?y dblp:publishedIn 'ACC' }","paraphrases":["Did the authors of the publication 'On A Notion of Stochastic Zeroing Barrier Function' not not publish a paper in ACC?"],"info":{}}
{"id":"train_5538","question":"Was the paper 'Higher-Order Geodesic Voronoi Diagrams in a Polygonal Domain with Holes' not not published in the year 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/soda/LiuL13> dblp:yearOfPublication '2013' }","paraphrases":["Was 'Higher-Order Geodesic Voronoi Diagrams in a Polygonal Domain with Holes' not not published in 2013?"],"info":{}}
{"id":"train_5539","question":"Did the authors of 'Investigating the balance between virtuality and reality in mobile mixed reality UI design: user perception of an augmented city' not not publish a paper in NordiCHI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nordichi/Venta-OlkkonenPKH14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/nordichi/Venta-OlkkonenPKH14> ) . ?y dblp:publishedIn 'NordiCHI' }","paraphrases":["Did the authors of the publication 'Investigating the balance between virtuality and reality in mobile mixed reality UI design: user perception of an augmented city' not not publish a paper in Nordic Conference on Human-Computer Interaction?"],"info":{}}
{"id":"train_5540","question":"Did the authors of 'An analysis of new feedback methods for parallel multi-stream productions' not not publish a paper in EuroITV?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/euroitv/WurbelGK09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/euroitv/WurbelGK09> ) . ?y dblp:publishedIn 'EuroITV' }","paraphrases":["Haven't the authors of the publication 'An analysis of new feedback methods for parallel multi-stream productions' not published a publication in EuroITV?"],"info":{}}
{"id":"train_5541","question":"Haven't the authors of the publication 'Dissipative approximations to neutral DDEs' not published a publication in Appl. Math. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/Shampine08a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/amc/Shampine08a> ) . ?y dblp:publishedIn 'Appl. Math. Comput.' }","paraphrases":["Did the authors of the publication 'Dissipative approximations to neutral DDEs' not not publish a paper in Appl. Math. Comput.?"],"info":{}}
{"id":"train_5542","question":"Have the authors of the paper 'Novel Reliable and Energy-Efficient Routing Protocols for Wireless Sensor Networks' not not published a publication in J. Sens. Actuator Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jsan/AlmazaidehL20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jsan/AlmazaidehL20> ) . ?y dblp:publishedIn 'J. Sens. Actuator Networks' }","paraphrases":["Did the authors of 'Novel Reliable and Energy-Efficient Routing Protocols for Wireless Sensor Networks' not not publish a paper in J. Sens. Actuator Networks?"],"info":{}}
{"id":"train_5544","question":"Was the paper 'Proposal for a Roundtable Discussion on the Role of Abstract Mathematics in Computer Music' not not published in the year 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icmc/FrittsMMRA04> dblp:yearOfPublication '2004' }","paraphrases":["Was the publication 'Proposal for a Roundtable Discussion on the Role of Abstract Mathematics in Computer Music' not not published in 2004?"],"info":{}}
{"id":"train_5545","question":"Did the authors of 'The Fermat cubic and quartic curves over cyclic fields' not not publish a paper in Period. Math. Hung.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pmh/BremnerC20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/pmh/BremnerC20> ) . ?y dblp:publishedIn 'Period. Math. Hung.' }","paraphrases":["Have the authors of the paper 'The Fermat cubic and quartic curves over cyclic fields' not not published a publication in Period. Math. Hung.?"],"info":{}}
{"id":"train_5546","question":"Was the publication 'Evolutionary Design of Nearest Prototype Classifiers' not not published in 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/heuristics/FernandezI04> dblp:yearOfPublication '2004' }","paraphrases":["Was the paper 'Evolutionary Design of Nearest Prototype Classifiers' not not published in the year 2004?"],"info":{}}
{"id":"train_5547","question":"Haven't the authors of the publication 'Proposed multi-channel Ad-hoc network with cross-layer design of MAC and routing protocols' not published a publication in APSITT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apsitt/TsuboiIHU15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/apsitt/TsuboiIHU15> ) . ?y dblp:publishedIn 'APSITT' }","paraphrases":["Did the authors of the publication 'Proposed multi-channel Ad-hoc network with cross-layer design of MAC and routing protocols' not not publish a paper in APSITT?"],"info":{}}
{"id":"train_5548","question":"Did the authors of 'Many-to-Many Matching based Resource Allocation to support Multi-Connectivity' not not publish a paper in ICTC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ictc/LeeVM20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ictc/LeeVM20> ) . ?y dblp:publishedIn 'ICTC' }","paraphrases":["Haven't the authors of the publication 'Many-to-Many Matching based Resource Allocation to support Multi-Connectivity' not published a publication in ICTC?"],"info":{}}
{"id":"train_5550","question":"Was the publication 'An ultrasound standard plane detection model of fetal head based on multi-task learning and hybrid knowledge graph' not not published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fgcs/Zhao0PCLL22> dblp:yearOfPublication '2022' }","paraphrases":["Was the paper 'An ultrasound standard plane detection model of fetal head based on multi-task learning and hybrid knowledge graph' not not published in the year 2022?"],"info":{}}
{"id":"train_5551","question":"Did the authors of 'Generalized Finite-Difference Time-Domain method with absorbing boundary conditions for solving the nonlinear Schr\\u00F6dinger equation on a GPU' not not publish a paper in Comput. Phys. Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cphysics/Wilson19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cphysics/Wilson19> ) . ?y dblp:publishedIn 'Comput. Phys. Commun.' }","paraphrases":["Haven't the authors of the publication 'Generalized Finite-Difference Time-Domain method with absorbing boundary conditions for solving the nonlinear Schr\\u00F6dinger equation on a GPU' not published a publication in Comput. Phys. Commun.?"],"info":{}}
{"id":"train_5552","question":"Was the paper 'Join and Deep Ensemble Regression of Clinical Scores for Alzheimer's Disease Using Longitudinal and Incomplete Data*' not not published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/YangYEHLWZL18> dblp:yearOfPublication '2018' }","paraphrases":["Was the publication 'Join and Deep Ensemble Regression of Clinical Scores for Alzheimer's Disease Using Longitudinal and Incomplete Data*' not not published in 2018?"],"info":{}}
{"id":"train_5553","question":"Did the authors of 'A Numerically Stable Dynamic Mode Decomposition Algorithm for Nearly Defective Systems' not not publish a paper in IEEE Control. Syst. Lett.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/csysl/ThitsaCVCM21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/csysl/ThitsaCVCM21> ) . ?y dblp:publishedIn 'IEEE Control. Syst. Lett.' }","paraphrases":["Have the authors of the paper 'A Numerically Stable Dynamic Mode Decomposition Algorithm for Nearly Defective Systems' not not published a publication in IEEE Control. Syst. Lett.?"],"info":{}}
{"id":"train_5554","question":"Was the publication 'Robust Fluid Processing Networks' not not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tac/BertsimasNP15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Robust Fluid Processing Networks' not not published in the year 2015?"],"info":{}}
{"id":"train_5555","question":"Was the paper 'Anomaly subspace detection based on a multi-scale Markov random field model' not not published in the year 2005?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigpro/GoldmanC05> dblp:yearOfPublication '2005' }","paraphrases":["Was 'Anomaly subspace detection based on a multi-scale Markov random field model' not not published in 2005?"],"info":{}}
{"id":"train_5557","question":"Was the paper 'Anomaly Detection in Categorical Datasets Using Bayesian Networks' not not published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aici/RashidiHH11> dblp:yearOfPublication '2011' }","paraphrases":["Was the publication 'Anomaly Detection in Categorical Datasets Using Bayesian Networks' not not published in 2011?"],"info":{}}
