{"id":"train_3478","question":"In which year did Thomas N. publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/n/ThomasNeumann> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Thomas Neumann in which year?"],"info":{}}
{"id":"train_3480","question":"Least number of papers were published by Hamza Yous in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/202/5520> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Yous, H. publish the least publications?"],"info":{}}
{"id":"train_3481","question":"When was the first paper by Dacheng T. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/46/3391> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Dacheng Tao published their first paper."],"info":{}}
{"id":"train_3482","question":"In which year did the author J. J. Yi publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/286/9178> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by J. J. Yi in which year?"],"info":{}}
{"id":"train_3483","question":"With which author does Patrick Juola has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/47/1348> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/47/1348> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of P. Juola and how many papers do they have together?"],"info":{}}
{"id":"train_3484","question":"Mention the year in which Ali, Hamza published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/2248> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Hamza Ali publish the most research papers?"],"info":{}}
{"id":"train_3485","question":"Report the year in which Xu, B. published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/26/1194> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Xu, B. published?"],"info":{}}
{"id":"train_3486","question":"With which author does Shunan Guo has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/210/5384> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/210/5384> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Shunan Guo and how many papers do they have together?"],"info":{}}
{"id":"train_3487","question":"Find the year in which Shigeru K. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/31/4947> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Shigeru Kokaji published?"],"info":{}}
{"id":"train_3488","question":"In which year did the author Nan Cen publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/9805> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Nan Cen published the least papers."],"info":{}}
{"id":"train_3489","question":"Who is the most frequent co-author of H. Zhou and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/74/1765> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/74/1765> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Honggeng Zhou has the most papers and how many?"],"info":{}}
{"id":"train_3490","question":"In which year was the last paper by Chung, Kuo-Liang published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/62/3713> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Chung, Kuo-Liang published?"],"info":{}}
{"id":"train_3491","question":"In which year did Haopeng Chen publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/31/6907> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which Haopeng Chen published the most papers."],"info":{}}
{"id":"train_3492","question":"In which year was the first paper by Yang Ji published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/72/1056> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Ji, Yang published their first paper."],"info":{}}
{"id":"train_3493","question":"Mention the year in which Rapisarda, Paolo published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/56/5639> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Paolo Rapisarda publish the most research papers?"],"info":{}}
{"id":"train_3495","question":"Report the year in which C\\u00E9sar B. published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/26/1261> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by C\\u00E9sar Bustacara published?"],"info":{}}
{"id":"train_3496","question":"Report the most frequent co-author of Sae-Young Chung and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/10/3722> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/10/3722> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Sae-Young Chung has the most papers and how many?"],"info":{}}
{"id":"train_3497","question":"Who is the most frequent co-author of Hsi-Peng Lu and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/15/972> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/15/972> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Hsi-Peng L. and how many papers do they have together?"],"info":{}}
{"id":"train_3498","question":"In which year did the author Brummer, J. publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/243/3433> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Brummer, J. publish the least papers and how many?"],"info":{}}
{"id":"train_3501","question":"Who is the author of the paper 'Preface'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/fodm/Zadeh02> dblp:authoredBy ?answer }","paraphrases":["'Preface' was authored by which authors?"],"info":{}}
{"id":"train_3502","question":"What year was 'CLP-based protein fragment assembly' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tplp/PaluDFP10> dblp:yearOfPublication ?answer }","paraphrases":["When was 'CLP-based protein fragment assembly' published?"],"info":{}}
{"id":"train_3503","question":"The paper 'The normalized Bushmitch-Fikus-Hamrick (NBFH) metric' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/milcom/BushmitchFHKM12> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'The normalized Bushmitch-Fikus-Hamrick (NBFH) metric' published?"],"info":{}}
{"id":"train_3506","question":"Mention the year in which 'Probing Script Knowledge from Pre-Trained Models' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2204-10176> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Probing Script Knowledge from Pre-Trained Models' published?"],"info":{}}
{"id":"train_3508","question":"Find the venue in which the paper 'Privacy-Preserving Unsupervised Domain Adaptation in Federated Setting' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/SongMZZ20> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Privacy-Preserving Unsupervised Domain Adaptation in Federated Setting' published?"],"info":{}}
{"id":"train_3509","question":"When was 'Privacy Preserving Collaborative Machine Learning' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sesa/LiuZ21> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Privacy Preserving Collaborative Machine Learning' was published in which year?"],"info":{}}
{"id":"train_3510","question":"What year was 'Automaten in planaren Graphen' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/acta/Rollik80> dblp:yearOfPublication ?answer }","paraphrases":["Mention the year in which 'Automaten in planaren Graphen' was published."],"info":{}}
{"id":"train_3513","question":"List the authors of the paper 'MFMP: Max Flow Multipath Routing Algorithm'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ems/MahlousFC08> dblp:authoredBy ?answer }","paraphrases":["Name the authors of the paper 'MFMP: Max Flow Multipath Routing Algorithm'."],"info":{}}
{"id":"train_3514","question":"The paper 'Dynamic Linear Bellman Combination of Optimal Policies for Solving New Tasks' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/ieicet/MatsubaraAS15> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Dynamic Linear Bellman Combination of Optimal Policies for Solving New Tasks' have?"],"info":{}}
{"id":"train_3516","question":"Find the number of authors of the paper 'Toward Video Bookmarking Search: Search-Target Inference from TVWatching'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/semco/OkamotoU07> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Toward Video Bookmarking Search: Search-Target Inference from TVWatching' have?"],"info":{}}
{"id":"train_3521","question":"'Notung: dating gene duplications using gene family trees' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/recomb/ChenDF00> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Notung: dating gene duplications using gene family trees'?"],"info":{}}
{"id":"train_3522","question":"Name the authors of the paper 'FPGA Architecture for Multi-Style Asynchronous Logic'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-0710-4711> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'FPGA Architecture for Multi-Style Asynchronous Logic'?"],"info":{}}
{"id":"train_3524","question":"Find the number of authors of the paper 'Usage-Based Pricing and Competition in Congestible Network Service Markets'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/ton/Ma16a> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Usage-Based Pricing and Competition in Congestible Network Service Markets' have?"],"info":{}}
{"id":"train_3525","question":"Mention the venue in which 'Transitions in Digital Personhood: Online Activity in Early Retirement' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/chi/DurrantKTMOSECM17> dblp:publishedIn ?answer }","paraphrases":["The paper 'Transitions in Digital Personhood: Online Activity in Early Retirement' was published in which venue?"],"info":{}}
{"id":"train_3526","question":"Find the number of authors of the paper 'Semantic-audio retrieval'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icassp/Slaney02> dblp:numberOfCreators ?answer }","paraphrases":["Mention the number of authors of the paper 'Semantic-audio retrieval'."],"info":{}}
{"id":"train_3527","question":"'IETCR: An Information Entropy Based Test Case Reduction Strategy for Mutation-Based Fault Localization' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/WangDHLC20> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'IETCR: An Information Entropy Based Test Case Reduction Strategy for Mutation-Based Fault Localization'?"],"info":{}}
{"id":"train_3528","question":"What year was 'Pulse Jamming in Aperture-Averaged FSO Receiver Over Exponentiated Weibull Fading Channel' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/twc/PaulBN22> dblp:yearOfPublication ?answer }","paraphrases":["'Pulse Jamming in Aperture-Averaged FSO Receiver Over Exponentiated Weibull Fading Channel' was published in which year?"],"info":{}}
{"id":"train_3530","question":"Who wrote the paper 'Optimal node scheduling for the lifetime maximization of two-tier wireless sensor networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cec/LinHZLL10> dblp:authoredBy ?answer }","paraphrases":["'Optimal node scheduling for the lifetime maximization of two-tier wireless sensor networks' was authored by which authors?"],"info":{}}
{"id":"train_3533","question":"Name the authors of the paper 'Tutorials-based system to assist Qatari children with special needs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aiccsa/AljaamAAA08> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'Tutorials-based system to assist Qatari children with special needs'."],"info":{}}
{"id":"train_3535","question":"What year was 'Differentiable Top-k Operator with Optimal Transport' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2002-06504> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Differentiable Top-k Operator with Optimal Transport' published?"],"info":{}}
{"id":"train_3536","question":"What year was 'Timing and Localization of Movement-Related Spectral Changes in the Human Peri-Rolandic Cortex: Intracranial Recordings' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/neuroimage/KloppMCCNH01> dblp:yearOfPublication ?answer }","paraphrases":["'Timing and Localization of Movement-Related Spectral Changes in the Human Peri-Rolandic Cortex: Intracranial Recordings' was published in which year?"],"info":{}}
{"id":"train_3537","question":"Mention the venue in which 'Optimal register assignment with minimum-delay compensation for latch-based design' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/apccas/InoueK10> dblp:publishedIn ?answer }","paraphrases":["Find the venue in which the paper 'Optimal register assignment with minimum-delay compensation for latch-based design' was published."],"info":{}}
{"id":"train_3539","question":"Find the venue in which the paper 'Measurable Cardinals and a Combinatorial Principle of Jensen' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jsyml/Devlin73> dblp:publishedIn ?answer }","paraphrases":["The paper 'Measurable Cardinals and a Combinatorial Principle of Jensen' was published in which venue?"],"info":{}}
{"id":"train_3540","question":"When was 'Art and social displays in the branding of the city: Token screens or opportunities for difference?' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/firstmonday/Nevarez06> dblp:yearOfPublication ?answer }","paraphrases":["'Art and social displays in the branding of the city: Token screens or opportunities for difference?' was published in which year?"],"info":{}}
{"id":"train_3541","question":"Name the authors of the paper 'Coexisting Coverage and Throughput of Multi-RAT Wireless Networks with Unlicensed Band Access'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/DingLWZ15> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Coexisting Coverage and Throughput of Multi-RAT Wireless Networks with Unlicensed Band Access'?"],"info":{}}
{"id":"train_3544","question":"Mention the year in which 'An Efficient Locality-Aware Task Assignment Algorithm for Minimizing Shared Cache Contention' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pdcat/LiuXCW17> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'An Efficient Locality-Aware Task Assignment Algorithm for Minimizing Shared Cache Contention' was published in which year?"],"info":{}}
{"id":"train_3546","question":"Find the venue in which the paper 'WalkON Suit: A Medalist in the Powered Exoskeleton Race of Cybathlon 2016' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ram/ChoiNJRK17> dblp:publishedIn ?answer }","paraphrases":["Where was 'WalkON Suit: A Medalist in the Powered Exoskeleton Race of Cybathlon 2016' published?"],"info":{}}
{"id":"train_3548","question":"The paper 'Weighted LCS' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/jda/AmirGS10> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Weighted LCS' have?"],"info":{}}
{"id":"train_3550","question":"When was 'Speculative Software Modification and its Use in Securing SOUP' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/edcc/RodesK14> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Speculative Software Modification and its Use in Securing SOUP' was published in which year?"],"info":{}}
{"id":"train_3551","question":"Mention the number of authors of the paper 'Social-Based Web Services Discovery and Composition for Step-by-Step Mashup Completion'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icws/MaaradjiHSLDC11> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Social-Based Web Services Discovery and Composition for Step-by-Step Mashup Completion' have?"],"info":{}}
{"id":"train_3552","question":"Find the number of authors of the paper 'An Image Enhancement Method Based on Genetic Algorithm'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icdip/HashemiKNM09> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'An Image Enhancement Method Based on Genetic Algorithm' have?"],"info":{}}
{"id":"train_3553","question":"How many authors does 'Computational Approaches to Image Understanding' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/csur/Brady82> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Computational Approaches to Image Understanding' have?"],"info":{}}
{"id":"train_3554","question":"Mention the number of authors of the paper 'New Directions for NewHope: Improving Performance of Post-Quantum Cryptography through Algorithm-level Pipelining'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icfpt/BeckwithD20> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'New Directions for NewHope: Improving Performance of Post-Quantum Cryptography through Algorithm-level Pipelining' have?"],"info":{}}
{"id":"train_3555","question":"Find the venue in which the paper 'The Use of Diagrams in Science - An Examination of Trends in Articles Published in Science between 1880 and 2010' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/diagrams/FanjoyMB12> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'The Use of Diagrams in Science - An Examination of Trends in Articles Published in Science between 1880 and 2010' published?"],"info":{}}
{"id":"train_3556","question":"'Automated formal verification of visual modeling languages by model checking' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sosym/Varro04> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Automated formal verification of visual modeling languages by model checking' published?"],"info":{}}
{"id":"train_3557","question":"Find the venue in which the paper 'Minkowski Length of 3D Lattice Polytopes' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dcg/BeckwithGSW12> dblp:publishedIn ?answer }","paraphrases":["Where was 'Minkowski Length of 3D Lattice Polytopes' published?"],"info":{}}
{"id":"train_3560","question":"Mention the number of authors of the paper 'Supervised and semi-supervised infant-directed speech classification for parent-infant interaction analysis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/speech/MahdhaouiC11> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Supervised and semi-supervised infant-directed speech classification for parent-infant interaction analysis' have?"],"info":{}}
{"id":"train_3563","question":"Who is the author of the paper 'Parallel Parsing on the Connection Machine'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ipl/SkillicornB89> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Parallel Parsing on the Connection Machine'?"],"info":{}}
{"id":"train_3565","question":"What year was 'Concurrent Error Detection and Correction in Gaussian Normal Basis Multiplier over GF(2^m)' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tc/ChiouCLHL09> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Concurrent Error Detection and Correction in Gaussian Normal Basis Multiplier over GF(2^m)' was published in which year?"],"info":{}}
{"id":"train_3566","question":"List the authors of the paper 'A quantum cryptographic protocol with detection of compromised server'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/qic/Kuhn05> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'A quantum cryptographic protocol with detection of compromised server'?"],"info":{}}
{"id":"train_3567","question":"Mention the number of authors of the paper 'Model based landing control for a bistable electromagnetic actuator with discontinuous dynamics'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/IEEEcca/GillWCLR15> dblp:numberOfCreators ?answer }","paraphrases":["Find the number of authors of the paper 'Model based landing control for a bistable electromagnetic actuator with discontinuous dynamics'."],"info":{}}
{"id":"train_3568","question":"'Bounds and Approximations for the Transportation Problem of Linear Programming and Other Scalable Network Problems' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/transci/DaganzoS04> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Bounds and Approximations for the Transportation Problem of Linear Programming and Other Scalable Network Problems' published?"],"info":{}}
{"id":"train_3569","question":"In which venue was the paper 'Endomicroscopic video retrieval using mosaicing and visual words' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isbi/AndreVBWA10> dblp:publishedIn ?answer }","paraphrases":["The paper 'Endomicroscopic video retrieval using mosaicing and visual words' was published in which venue?"],"info":{}}
{"id":"train_3571","question":"Name the authors of the paper 'Software fault prediction using data mining, machine learning and deep learning techniques: A systematic literature review'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cee/BatoolK22> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Software fault prediction using data mining, machine learning and deep learning techniques: A systematic literature review'?"],"info":{}}
{"id":"train_3573","question":"List the authors of the paper 'Simplified multiuser code design for MIMO-NOMA'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iet-com/ChiLSS17> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Simplified multiuser code design for MIMO-NOMA'?"],"info":{}}
{"id":"train_3574","question":"Mention the number of authors of the paper 'EyeDAS: Securing Perception of Autonomous Cars Against the Stereoblindness Syndrome'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2205-06765> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'EyeDAS: Securing Perception of Autonomous Cars Against the Stereoblindness Syndrome' have?"],"info":{}}
{"id":"train_3575","question":"Mention the venue in which 'Spontaneous contractions of isolated rat portal vein under temperature perturbations' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mbec/VuksanovicGPG10> dblp:publishedIn ?answer }","paraphrases":["Where was 'Spontaneous contractions of isolated rat portal vein under temperature perturbations' published?"],"info":{}}
{"id":"train_3577","question":"When was 'Calibration of a multicomponent MEMS sensor for vibration monitoring of rolling bearings: broad-band and amplitude traceability up to 20 kHz' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/metroi/SchiaviFLMVPMM22> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Calibration of a multicomponent MEMS sensor for vibration monitoring of rolling bearings: broad-band and amplitude traceability up to 20 kHz' was published in which year?"],"info":{}}
{"id":"train_3581","question":"Mention the number of authors of the paper 'Attribute reduction for multi-label classification based on labels of positive region'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/soco/FanCQWT20> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Attribute reduction for multi-label classification based on labels of positive region' have?"],"info":{}}
{"id":"train_3582","question":"The paper 'A multiresolution framework to MEG/EEG source imaging' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tbe/GavitBMPG01> dblp:yearOfPublication ?answer }","paraphrases":["When was 'A multiresolution framework to MEG/EEG source imaging' published?"],"info":{}}
