{"id":"train_4424","question":"Who are the authors of the publication 'Realtime Quality Assessment of Iris Biometrics Under Visible Light' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cvpr/JenadelehPS18> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Realtime Quality Assessment of Iris Biometrics Under Visible Light' and where are they from?"],"info":{}}
{"id":"train_4425","question":"Who are the authors of the publication 'Asymptotic connectivity in wireless ad hoc networks using directional antennas' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ton/LiZF09> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/ton/LiZF09> ) }","paraphrases":["Who are the authors of 'Asymptotic connectivity in wireless ad hoc networks using directional antennas' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4426","question":"Find the authors of 'Canonical Numbering and Constitutional Symmetry' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jcisd/JochumG77> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jcisd/JochumG77> ) }","paraphrases":["List the authors of 'Canonical Numbering and Constitutional Symmetry' and the other papers they published."],"info":{}}
{"id":"train_4427","question":"List the authors of 'Risk identification and conduction model for financial institution IT outsourcing in China' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/itm/QinWZL12> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/itm/QinWZL12> ) }","paraphrases":["Find the authors of 'Risk identification and conduction model for financial institution IT outsourcing in China' and the venues of the other papers they published."],"info":{}}
{"id":"train_4431","question":"Find the authors of 'Nonsmooth adaptive stabilization of cascade systems with nonlinear parameterization via partial-state feedback' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tac/LinP03a> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/tac/LinP03a> ) }","paraphrases":["List the authors of 'Nonsmooth adaptive stabilization of cascade systems with nonlinear parameterization via partial-state feedback' and the other papers they published."],"info":{}}
{"id":"train_4434","question":"Who are the authors of the publication 'Fire Recognition Using Spatio-Temporal Two-Stream Convolutional Neural Network with Fully Connected Layer-Fusion' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icce-berlin/ShinPP18> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/icce-berlin/ShinPP18> ) }","paraphrases":["Who are the authors of 'Fire Recognition Using Spatio-Temporal Two-Stream Convolutional Neural Network with Fully Connected Layer-Fusion' and which other papers did they publish?"],"info":{}}
{"id":"train_4436","question":"Who are the authors of 'Constraint Programming Approach to Reconfigurable Processor Extension Generation and Application Compilation' and where are they from?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/trets/MartinWKFC12> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Constraint Programming Approach to Reconfigurable Processor Extension Generation and Application Compilation' and what are their affiliations?"],"info":{}}
{"id":"train_4437","question":"Who are the authors of the publication 'Keyboard acoustic emanations revisited' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ccs/ZhuangZT05> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/ccs/ZhuangZT05> ) }","paraphrases":["Who are the authors of 'Keyboard acoustic emanations revisited' and which other papers did they publish?"],"info":{}}
{"id":"train_4438","question":"Find the authors of 'Standards-compliant LTE and LTE-A uplink power control' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icc/ZhangPRMSA12> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/icc/ZhangPRMSA12> ) }","paraphrases":["Who are the authors of 'Standards-compliant LTE and LTE-A uplink power control' and which other papers did they publish?"],"info":{}}
{"id":"train_4439","question":"Who are the authors of the publication 'Medical savings accounts: opportunities for cost savings?' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/itor/ZaricH06> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/itor/ZaricH06> ) }","paraphrases":["Who are the authors of the publication 'Medical savings accounts: opportunities for cost savings?' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4440","question":"Find the authors of 'Two-Beam Multiplexing with Inter-Subarray Coding for Arbitrary Directions Based on Interleaved Subarray Architectures' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/pimrc/ZhangLGGL19> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/pimrc/ZhangLGGL19> ) }","paraphrases":["List the authors of 'Two-Beam Multiplexing with Inter-Subarray Coding for Arbitrary Directions Based on Interleaved Subarray Architectures' and the venues of the other papers they published."],"info":{}}
{"id":"train_4441","question":"Find the authors of 'A Transparent home Sensors/Actuators layer for Health &Well-being services' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/phat/TanguySLK17> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/phat/TanguySLK17> ) }","paraphrases":["List the authors of 'A Transparent home Sensors/Actuators layer for Health &Well-being services' and the venues of the other papers they published."],"info":{}}
{"id":"train_4443","question":"Find the authors of 'A well-ordering proof for Feferman's theoryT0' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/aml/Jager83> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/aml/Jager83> ) }","paraphrases":["List the authors of 'A well-ordering proof for Feferman's theoryT0' and the other papers they published."],"info":{}}
{"id":"train_4444","question":"Find the authors of 'Robustness via Retrying: Closed-Loop Robotic Manipulation with Self-Supervised Learning' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1810-03043> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1810-03043> ) }","paraphrases":["Who are the authors of the publication 'Robustness via Retrying: Closed-Loop Robotic Manipulation with Self-Supervised Learning' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4445","question":"List the authors of 'The process of ISD methodology selection and use: a case study' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ecis/Carroll03> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/ecis/Carroll03> ) }","paraphrases":["Find the authors of 'The process of ISD methodology selection and use: a case study' and the venues of the other papers they published."],"info":{}}
{"id":"train_4446","question":"Find the authors of 'PAMUC II for multicriteria optimization of mechanical designs with expert rules' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cec/CoelhoB04> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/cec/CoelhoB04> ) }","paraphrases":["Who are the authors of 'PAMUC II for multicriteria optimization of mechanical designs with expert rules' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4447","question":"List the authors of 'Corrigendum to \\A Bayesian network interpretation of the Cox's proportional hazard model\\ [Int J Approx Reason 103 (2018) 195-211]' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ijar/KraisangkaD19> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/ijar/KraisangkaD19> ) }","paraphrases":["Who are the authors of the publication 'Corrigendum to \\A Bayesian network interpretation of the Cox's proportional hazard model\\ [Int J Approx Reason 103 (2018) 195-211]' and where did they publish other papers?"],"info":{}}
{"id":"train_4448","question":"Find the authors of 'Technological Approach for Behavior Change Detection toward Better Adaptation of Services for Elderly People' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/biostec/KaddachiAABEMF17> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/biostec/KaddachiAABEMF17> ) }","paraphrases":["Who are the authors of the publication 'Technological Approach for Behavior Change Detection toward Better Adaptation of Services for Elderly People' and where did they publish other papers?"],"info":{}}
{"id":"train_4449","question":"List the authors of 'Predicting Solution Summaries to Integer Linear Programs under Imperfect Information with Machine Learning' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1807-11876> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Find the authors of 'Predicting Solution Summaries to Integer Linear Programs under Imperfect Information with Machine Learning' and their affiliations."],"info":{}}
{"id":"train_4450","question":"Find the authors of 'A Self-Adaptive Routing Protocol in Wireless LANs Based on Attractor Selection' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ieicet/NishikawaIOKM09> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/ieicet/NishikawaIOKM09> ) }","paraphrases":["Who are the authors of the publication 'A Self-Adaptive Routing Protocol in Wireless LANs Based on Attractor Selection' and where did they publish other papers?"],"info":{}}
{"id":"train_4451","question":"Who are the authors of 'Active Multitask Learning Using Both Latent and Supervised Shared Topics' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/sdm/AcharyaMG14> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/sdm/AcharyaMG14> ) }","paraphrases":["Who are the authors of the publication 'Active Multitask Learning Using Both Latent and Supervised Shared Topics' and where did they publish other papers?"],"info":{}}
{"id":"train_4452","question":"Who are the authors of the publication 'Robust motion control of MR-fluid actuator based on disturbance observer' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icmech/MiuraK13> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icmech/MiuraK13> ) }","paraphrases":["Who are the authors of the publication 'Robust motion control of MR-fluid actuator based on disturbance observer' and where did they publish other papers?"],"info":{}}
{"id":"train_4453","question":"Find the authors of 'Hierarchical Multi-view Fisher Discriminant Analysis' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/iconip/ChenS09> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/iconip/ChenS09> ) }","paraphrases":["Who are the authors of 'Hierarchical Multi-view Fisher Discriminant Analysis' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4456","question":"Find the authors of 'A Structured Paging System' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/cj/Hoare73> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/cj/Hoare73> ) }","paraphrases":["Who are the authors of 'A Structured Paging System' and which other papers did they publish?"],"info":{}}
{"id":"train_4457","question":"List the authors of 'Guest Editors' Introduction: Why are Small Software Organizations Different?' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/software/RichardsonW07> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/software/RichardsonW07> ) }","paraphrases":["Who are the authors of the publication 'Guest Editors' Introduction: Why are Small Software Organizations Different?' and where did they publish other papers?"],"info":{}}
{"id":"train_4459","question":"List the authors of 'Evaluating the Quality in the Use of Domain-Specific Languages in an Agile Way' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/models/Barisic13> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/models/Barisic13> ) }","paraphrases":["Who are the authors of the publication 'Evaluating the Quality in the Use of Domain-Specific Languages in an Agile Way' and where did they publish other papers?"],"info":{}}
{"id":"train_4460","question":"Find the authors of 'Learning a Multi-class Discriminative Dictionary with Nonredundancy Constraints for Visual Classification' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/mm/LiuWYT16> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/mm/LiuWYT16> ) }","paraphrases":["Who are the authors of the publication 'Learning a Multi-class Discriminative Dictionary with Nonredundancy Constraints for Visual Classification' and what other papers did they publish?"],"info":{}}
{"id":"train_4463","question":"Who are the authors of the publication 'Natural Language Video Localization: A Revisit in Span-Based Question Answering Framework' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/pami/ZhangSJZZG22> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/pami/ZhangSJZZG22> ) }","paraphrases":["Who are the authors of the publication 'Natural Language Video Localization: A Revisit in Span-Based Question Answering Framework' and what other papers did they publish?"],"info":{}}
{"id":"train_4466","question":"List the authors of 'Teaching user documentation by modular decomposition: SIGDOC'91 workshop' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/sigdoc/TalburtA91> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Find the authors of 'Teaching user documentation by modular decomposition: SIGDOC'91 workshop' and their affiliations."],"info":{}}
{"id":"train_4468","question":"List the authors of 'Combining point context and dynamic time warping for online gesture recognition' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jei/MaoL17> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/jei/MaoL17> ) }","paraphrases":["Who are the authors of the publication 'Combining point context and dynamic time warping for online gesture recognition' and where did they publish other papers?"],"info":{}}
{"id":"train_4469","question":"Find the authors of 'Fusionner pour mieux analyser : Conception et \\u00E9valuation de la plate-forme de combinaison' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/taln/Brunet-Manquat04> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/taln/Brunet-Manquat04> ) }","paraphrases":["List the authors of 'Fusionner pour mieux analyser : Conception et \\u00E9valuation de la plate-forme de combinaison' and the venues of the other papers they published."],"info":{}}
{"id":"train_4470","question":"List the authors of 'Moteurs de personnalit\\u00E9 pour agents dialogiques : \\u00E9tude d'un mod\\u00E8le pour les traits interpersonnels' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/jfsma/SansonnetBS13> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/jfsma/SansonnetBS13> ) }","paraphrases":["Find the authors of 'Moteurs de personnalit\\u00E9 pour agents dialogiques : \\u00E9tude d'un mod\\u00E8le pour les traits interpersonnels' and the other papers they published."],"info":{}}
{"id":"train_4474","question":"Find the authors of 'Automatic sleep stage scoring based on waveform recognition method and decision-tree learning' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/scjapan/HanaokaKY02> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/scjapan/HanaokaKY02> ) }","paraphrases":["Who are the authors of the publication 'Automatic sleep stage scoring based on waveform recognition method and decision-tree learning' and which other papers did they publish?"],"info":{}}
{"id":"train_4476","question":"Find the authors of 'Toward a Holistic and Standardized Automotive Architecture Description' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/computer/BroyGMWKK09> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/computer/BroyGMWKK09> ) }","paraphrases":["Who are the authors of the publication 'Toward a Holistic and Standardized Automotive Architecture Description' and which other papers did they publish?"],"info":{}}
{"id":"train_4483","question":"List the authors of 'Searchable encryption for geo-referenced data' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/medhocnet/FarrasR16> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/medhocnet/FarrasR16> ) }","paraphrases":["Find the authors of 'Searchable encryption for geo-referenced data' and the other papers they published."],"info":{}}
{"id":"train_4486","question":"Who are the authors of the publication 'Behavior in Strategic Settings: Evidence from a Million Rock-Paper-Scissors Games' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/games/BatzilisJLLP19> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/games/BatzilisJLLP19> ) }","paraphrases":["Who are the authors of the publication 'Behavior in Strategic Settings: Evidence from a Million Rock-Paper-Scissors Games' and which other papers did they publish?"],"info":{}}
{"id":"train_4487","question":"List the authors of 'SAR study on inhibitors of Hsp90\\u03B1 using machine learning methods' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ccfthpc/ZhangTY21> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/ccfthpc/ZhangTY21> ) }","paraphrases":["Who are the authors of the publication 'SAR study on inhibitors of Hsp90\\u03B1 using machine learning methods' and which other papers did they publish?"],"info":{}}
{"id":"train_4488","question":"Who are the authors of 'Efficient image retrieval using a network with complex neurons' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icnn/SwetsW95> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icnn/SwetsW95> ) }","paraphrases":["Who are the authors of the publication 'Efficient image retrieval using a network with complex neurons' and where did they publish other papers?"],"info":{}}
{"id":"train_4490","question":"Who are the authors of the publication 'A generic FPGA prototype for on-chip systems with network-on-chip communication infrastructure' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/cee/ArjomandBS14> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/cee/ArjomandBS14> ) }","paraphrases":["Who are the authors of the publication 'A generic FPGA prototype for on-chip systems with network-on-chip communication infrastructure' and what other papers did they publish?"],"info":{}}
{"id":"train_4492","question":"Find the authors of 'A Novel Stochastic Channel Modeling Approach for mmWave Systems with Beamforming' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/vtc/PyattaevJ0K16> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/vtc/PyattaevJ0K16> ) }","paraphrases":["List the authors of 'A Novel Stochastic Channel Modeling Approach for mmWave Systems with Beamforming' and the venues of the other papers they published."],"info":{}}
{"id":"train_4494","question":"Find the authors of 'Minimum multiple originator broadcast graphs' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/dam/LiestmanR17> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/dam/LiestmanR17> ) }","paraphrases":["Who are the authors of the publication 'Minimum multiple originator broadcast graphs' and where did they publish other papers?"],"info":{}}
{"id":"train_4497","question":"List the authors of 'Complete This Puzzle: A Connectionist Approach to Accurate Web Recommendations Based on a Committee of Predictors' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/kdd/NasraouiP04> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/kdd/NasraouiP04> ) }","paraphrases":["Who are the authors of the publication 'Complete This Puzzle: A Connectionist Approach to Accurate Web Recommendations Based on a Committee of Predictors' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4498","question":"List the authors of 'A dialogue system with contextually appropriate spoken output intonation' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/eacl/Kruijff-KorbayovaRKE03> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'A dialogue system with contextually appropriate spoken output intonation' and where are they from?"],"info":{}}
{"id":"train_4500","question":"List the authors of 'PiCode: 2D barcode with embedded picture and ViCode: 3D barcode with embedded video' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/mobicom/HuangM13> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/mobicom/HuangM13> ) }","paraphrases":["Who are the authors of the publication 'PiCode: 2D barcode with embedded picture and ViCode: 3D barcode with embedded video' and what other papers did they publish?"],"info":{}}
{"id":"train_4503","question":"List the authors of 'States of matter, information organization and dimensions of expressiveness' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cf/Ceruti04> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/cf/Ceruti04> ) }","paraphrases":["Find the authors of 'States of matter, information organization and dimensions of expressiveness' and the other papers they published."],"info":{}}
{"id":"train_4504","question":"List the authors of 'New bounds for Morse clusters' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jgo/VinkoN07> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jgo/VinkoN07> ) }","paraphrases":["Who are the authors of the publication 'New bounds for Morse clusters' and what other papers did they publish?"],"info":{}}
{"id":"train_4505","question":"Who are the authors of the publication 'Models Without Indiscernibles' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jsyml/AbramsonH78> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/jsyml/AbramsonH78> ) }","paraphrases":["Who are the authors of the publication 'Models Without Indiscernibles' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4508","question":"Who are the authors of the publication 'Set Membership approximation of discontinuous NMPC laws' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cdc/FagianoCM09> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/cdc/FagianoCM09> ) }","paraphrases":["Who are the authors of 'Set Membership approximation of discontinuous NMPC laws' and which other papers did they publish?"],"info":{}}
