{"id":"train_2827","question":"What is the average number of research papers published by the author Ramayah, T. per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/09/9051> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Thurasamy Ramayah per year?"],"info":{}}
{"id":"train_2828","question":"How many research papers has Lei Zhou published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/72/5749> }","paraphrases":["Mention the number of papers that Lei Z. has published."],"info":{}}
{"id":"train_2829","question":"How many papers has D. Fischer published in Int. J. Intell. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/145/1566> . ?answer dblp:publishedIn 'Int. J. Intell. Syst.' }","paraphrases":["Report the count of papers that D. Fischer has published in Int. J. Intell. Syst.."],"info":{}}
{"id":"train_2830","question":"Count the number of co-authors that Patel, Dhaval has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/28/1282-2> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/28/1282-2> ) }","paraphrases":["How many co-authors does Patel, Dhaval have?"],"info":{}}
{"id":"train_2831","question":"How many research papers has Bolian Liu published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/99/4881> }","paraphrases":["How many papers has Bolian Liu published?"],"info":{}}
{"id":"train_2833","question":"What is the average number of co-authors for papers published by M. Goebel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/96/859> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Michael Goebel?"],"info":{}}
{"id":"train_2836","question":"Count the number of papers that Lin Guo has published in Comput. Electr. Eng..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/49/2335> . ?answer dblp:publishedIn 'Comput. Electr. Eng.' }","paraphrases":["In Comput. Electr. Eng., how many papers has Lin Guo published?"],"info":{}}
{"id":"train_2837","question":"How many co-authors does B. Li have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/13/2692-1> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/13/2692-1> ) }","paraphrases":["Count the number of co-authors that Bing Li has."],"info":{}}
{"id":"train_2838","question":"How many papers has Z. Wen published in INFOCOM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/323/0030> . ?answer dblp:publishedIn 'INFOCOM' }","paraphrases":["In INFOCOM, how many papers has Z. Wen published?"],"info":{}}
{"id":"train_2839","question":"Report the count of papers that Kesong Z. has published in KSII Trans. Internet Inf. Syst..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/216/3500> . ?answer dblp:publishedIn 'KSII Trans. Internet Inf. Syst.' }","paraphrases":["Count the number of papers that Kesong Z. has published in KSII Trans. Internet Inf. Syst.."],"info":{}}
{"id":"train_2840","question":"What is the average number of papers published by T. Bryksin per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/136/0260> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Timofey Bryksin per year?"],"info":{}}
{"id":"train_2841","question":"How many co-authors does Manish S. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/87/4147> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/87/4147> ) }","paraphrases":["Count the number of co-authors that Manish Sarkar has."],"info":{}}
{"id":"train_2842","question":"How many co-authors does Yan-Song Cui have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/221/8670> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/221/8670> ) }","paraphrases":["Count the number of co-authors that Yan-Song Cui has."],"info":{}}
{"id":"train_2843","question":"Report the average number of co-authors for publications published by Ching-Wei Cheng.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/34/5287> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Cheng, C.?"],"info":{}}
{"id":"train_2844","question":"How many research papers has Gregory M. Provan published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/81/2894> }","paraphrases":["Mention the number of papers that Gregory M. Provan has published."],"info":{}}
{"id":"train_2845","question":"How many co-authors does Denis S. Krotov have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/46/6457> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/46/6457> ) }","paraphrases":["Count the number of co-authors that Denis S. Krotov has."],"info":{}}
{"id":"train_2846","question":"What is the average number of papers published by Fu, Qiang per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/17/1352-11> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Fu, Qiang per year?"],"info":{}}
{"id":"train_2847","question":"Report the count of papers that Stepanyan, V. has published in Infotech@Aerospace.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/1759> . ?answer dblp:publishedIn 'Infotech@Aerospace' }","paraphrases":["In Infotech@Aerospace, how many papers has Vahram Stepanyan published?"],"info":{}}
{"id":"train_2848","question":"How many papers has Javed Arshed Mirza published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/98/3456> }","paraphrases":["How many research papers has Mirza, Javed Arshed published?"],"info":{}}
{"id":"train_2849","question":"Count the number of papers that Kathleen Jacquerie has published in PLoS Comput. Biol..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/311/8069> . ?answer dblp:publishedIn 'PLoS Comput. Biol.' }","paraphrases":["How many papers has Kathleen J. published in PLoS Comput. Biol.?"],"info":{}}
{"id":"train_2850","question":"Count the number of co-authors that Kifer, M. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/k/MichaelKifer> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/k/MichaelKifer> ) }","paraphrases":["How many co-authors does Kifer, M. have?"],"info":{}}
{"id":"train_2851","question":"Count the number of papers that F. Yang has published in CONFENIS (1).","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/3081> . ?answer dblp:publishedIn 'CONFENIS (1)' }","paraphrases":["Report the count of papers that Fan Yang has published in CONFENIS (1)."],"info":{}}
{"id":"train_2852","question":"What is the average number of co-authors for research papers published by Yuewei Z.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/229/1171> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Yuewei Z.?"],"info":{}}
{"id":"train_2853","question":"Report the average number of publications by Juan Karsten per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/208/3668> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by J. Karsten per year?"],"info":{}}
{"id":"train_2855","question":"Report the average number of co-authors for publications published by Menc\\u00EDa, E. Loza.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/87/1869> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Menc\\u00EDa, E. Loza?"],"info":{}}
{"id":"train_2857","question":"How many research papers has Dong-Hyun S. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/141/6557> }","paraphrases":["Mention the number of papers that Dong-Hyun Seo has published."],"info":{}}
{"id":"train_2859","question":"Count the number of papers that Marshall Burke has published in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/169/9753> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["How many papers has Marshall Burke published in CoRR?"],"info":{}}
{"id":"train_2861","question":"Report the average number of publications by D. Fulton per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/58/2968> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author David Fulton per year?"],"info":{}}
{"id":"train_2862","question":"What is the average number of co-authors for research papers published by Yang, Mengmeng?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/121/1326> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Yang, Mengmeng?"],"info":{}}
{"id":"train_2863","question":"Count the number of papers that Mangalaraj, George has published in J. Inf. Syst. Educ..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/5220> . ?answer dblp:publishedIn 'J. Inf. Syst. Educ.' }","paraphrases":["Report the count of papers that Mangalaraj, George has published in J. Inf. Syst. Educ.."],"info":{}}
{"id":"train_2864","question":"What is the average number of research papers published by the author Stefan S. per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/13/2404> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Stefan S. per year?"],"info":{}}
{"id":"train_2866","question":"Mention the number of papers that Zhang, Meihui has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/08/7259> }","paraphrases":["How many papers has Meihui Zhang published?"],"info":{}}
{"id":"train_2867","question":"How many research papers has Xiao, Qimei published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/33/10937> }","paraphrases":["How many papers has Qimei Xiao published?"],"info":{}}
{"id":"train_2868","question":"How many co-authors does Kunqing Xie have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/06/1913> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/06/1913> ) }","paraphrases":["Count the number of co-authors that Xie, K. has."],"info":{}}
{"id":"train_2871","question":"Report the average number of co-authors for publications published by Thomas, Trevor.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/22/7171> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Trevor Thomas?"],"info":{}}
{"id":"train_2872","question":"Report the average number of publications by A. Viet Do per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/263/3148> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by A. Viet Do per year?"],"info":{}}
{"id":"train_2873","question":"Report the average number of co-authors for publications published by Youichi S..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/198/5691> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Youichi Sakakibara?"],"info":{}}
{"id":"train_2874","question":"Count the number of papers that Saria S. Awadalla has published in J. Biomed. Informatics.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/171/9906> . ?answer dblp:publishedIn 'J. Biomed. Informatics' }","paraphrases":["How many papers has Saria S. Awadalla published in J. Biomed. Informatics?"],"info":{}}
{"id":"train_2875","question":"How many co-authors does Philippe C. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/126/3130> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/126/3130> ) }","paraphrases":["Count the number of co-authors that Philippe C. has."],"info":{}}
{"id":"train_2876","question":"How many papers has Moni Naor published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/n/MoniNaor> }","paraphrases":["Mention the number of papers that Moni Naor has published."],"info":{}}
{"id":"train_2877","question":"Report the average number of publications by Alexandra Branzan Albu per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/02/3941> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Alexandra Branzan Albu per year?"],"info":{}}
{"id":"train_2878","question":"Report the count of papers that Mirco Musolesi has published in Advances in Neural Information Processing Systems.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/54/5541> . ?answer dblp:publishedIn 'NeurIPS' }","paraphrases":["Count the number of papers that Musolesi, M. has published in NeurIPS."],"info":{}}
{"id":"train_2879","question":"How many research papers has Zhang, Daqing published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/83/1359-1> }","paraphrases":["How many papers has Daqing Zhang published?"],"info":{}}
{"id":"train_2880","question":"What is the average number of research papers published by the author Claudio Schepke per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/79/5559> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Schepke, C. per year?"],"info":{}}
{"id":"train_2882","question":"Count the number of co-authors that Antti Puhakka has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/50/1338> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/50/1338> ) }","paraphrases":["How many co-authors does Antti Puhakka have?"],"info":{}}
{"id":"train_2884","question":"What is the average number of co-authors for research papers published by Xuesong Yan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/54/1896> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by X. Yan?"],"info":{}}
{"id":"train_2885","question":"What is the average number of papers published by K. Xiao per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/49/1946> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author K. Xiao per year?"],"info":{}}
{"id":"train_2887","question":"Report the average number of publications by Kian Hsiang Low per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/4877> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Kian H. Low per year?"],"info":{}}
{"id":"train_2888","question":"What is the average number of co-authors for research papers published by Xiao-yu J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/49/4349> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Xiao-yu J.?"],"info":{}}
{"id":"train_2890","question":"Count the number of co-authors that Trung Nguyen-Thoi has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/164/9253> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/164/9253> ) }","paraphrases":["How many co-authors does Trung N. have?"],"info":{}}
{"id":"train_2893","question":"How many papers has Qing Wang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/97/6505-6> }","paraphrases":["Mention the number of papers that Qing Wang has published."],"info":{}}
{"id":"train_2894","question":"How many papers has Chunyuan Liu published in Entropy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/7625> . ?answer dblp:publishedIn 'Entropy' }","paraphrases":["In Entropy, how many papers has C. Liu published?"],"info":{}}
{"id":"train_2896","question":"What is the average number of co-authors for research papers published by Ramscar, Michael?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/12/2261> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Ramscar, Michael?"],"info":{}}
{"id":"train_2898","question":"Mention the number of papers that Lowe, E. J. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/01/4540> }","paraphrases":["How many research papers has Lowe, E. J. published?"],"info":{}}
{"id":"train_2899","question":"Mention the number of papers that Bakos, Karoly Livius has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/87/8960> }","paraphrases":["How many papers has Bakos, Karoly Livius published?"],"info":{}}
{"id":"train_2900","question":"How many co-authors does Yusu Wang have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/28/5745> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/28/5745> ) }","paraphrases":["Count the number of co-authors that Yusu Wang has."],"info":{}}
{"id":"train_2902","question":"Count the number of co-authors that Sungryul Lee has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/70/5760> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/70/5760> ) }","paraphrases":["How many co-authors does Sungryul L. have?"],"info":{}}
{"id":"train_2903","question":"Report the average number of publications by L. Li per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/78/7942> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Liangyou Li per year?"],"info":{}}
{"id":"train_2906","question":"Mention the number of papers that Xinran Zhao has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/155/0562> }","paraphrases":["How many papers has Xinran Zhao published?"],"info":{}}
{"id":"train_2907","question":"Mention the number of papers that Arne D. Ekstrom has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/70/8259> }","paraphrases":["How many research papers has Arne D. Ekstrom published?"],"info":{}}
{"id":"train_2908","question":"Count the number of papers that Jarrett Booz has published in SNPD.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/225/7607> . ?answer dblp:publishedIn 'SNPD' }","paraphrases":["Report the count of papers that Jarrett Booz has published in SNPD."],"info":{}}
{"id":"train_2910","question":"In Int. J. Syst. Sci., how many papers has Lin, Yu-Jen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/97/1819> . ?answer dblp:publishedIn 'Int. J. Syst. Sci.' }","paraphrases":["How many papers has Lin, Yu-Jen published in Int. J. Syst. Sci.?"],"info":{}}
{"id":"train_2911","question":"Mention the number of papers that Toum, E. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/300/9778> }","paraphrases":["How many papers has Ezequiel Toum published?"],"info":{}}
{"id":"train_2912","question":"Report the count of papers that S. Wang has published in MUE.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/46/781> . ?answer dblp:publishedIn 'MUE' }","paraphrases":["Count the number of papers that Shuozhong Wang has published in MUE."],"info":{}}
{"id":"train_2913","question":"How many papers has Heather Weston published in Interspeech?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/315/6368> . ?answer dblp:publishedIn 'Interspeech' }","paraphrases":["Report the count of papers that Heather Weston has published in Interspeech."],"info":{}}
{"id":"train_2914","question":"How many co-authors does Trent W. Lewis have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/75/6974> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/75/6974> ) }","paraphrases":["Count the number of co-authors that Trent W. Lewis has."],"info":{}}
{"id":"train_2915","question":"How many research papers has Maria C. Pettenati published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/57/864> }","paraphrases":["Mention the number of papers that Maria C. Pettenati has published."],"info":{}}
{"id":"train_2916","question":"Report the average number of co-authors for publications published by Wang, Z..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/91/8099> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Wang, Z.?"],"info":{}}
{"id":"train_2917","question":"How many co-authors does G. D. Nguyen have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/23/1577> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/23/1577> ) }","paraphrases":["Count the number of co-authors that Gam D. Nguyen has."],"info":{}}
{"id":"train_2918","question":"What is the average number of papers published by C. Ciliberto per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/10332> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author C. Ciliberto per year?"],"info":{}}
{"id":"train_2919","question":"How many co-authors does R\\u00E1cz, S. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/07/6609> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/07/6609> ) }","paraphrases":["Count the number of co-authors that R\\u00E1cz, S. has."],"info":{}}
{"id":"train_2920","question":"Report the count of papers that Costa, P. C. G. has published in J. Netw. Comput. Appl..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/44/6502> . ?answer dblp:publishedIn 'J. Netw. Comput. Appl.' }","paraphrases":["How many papers has Paulo C. G. Costa published in J. Netw. Comput. Appl.?"],"info":{}}
{"id":"train_2923","question":"Report the average number of publications by Bottino, R. Maria per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/922> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Bottino, R. Maria per year?"],"info":{}}
{"id":"train_2924","question":"Report the average number of co-authors for publications published by Song, H..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/168/0857> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Hangke Song?"],"info":{}}
{"id":"train_2925","question":"Count the number of co-authors that Tsakalidis, A. K. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/5175> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/19/5175> ) }","paraphrases":["How many co-authors does Athanasios K. Tsakalidis have?"],"info":{}}
{"id":"train_2926","question":"What is the average number of papers published by I. Tyukin per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/87/1262> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Ivan Tyukin per year?"],"info":{}}
{"id":"train_2927","question":"How many papers has Yingzhen Li published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/117/9230> }","paraphrases":["How many research papers has Yingzhen Li published?"],"info":{}}
