{"id":"train_1772","question":"Was a paper not not co-authored by Kaoutar Ben Ahmed and Goel, Bharti?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/115/6278> . ?x dblp:authoredBy <https://dblp.org/pid/171/4540> }","paraphrases":["Didn't Kaoutar Ben Ahmed and Goel, Bharti not co-author a paper?"],"info":{}}
{"id":"train_1773","question":"Didn't Dongdong Yang and Ye, B. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/69/7227> . ?x dblp:authoredBy <https://dblp.org/pid/309/4360> }","paraphrases":["Was a paper not not co-authored by D. Yang and Baopeng Ye?"],"info":{}}
{"id":"train_1774","question":"Doesn't Jin W. not work at Aeroflex Cambridge Ltd., UK?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/92/1375-13> dblp:primaryAffiliation 'Aeroflex Cambridge Ltd., UK' }","paraphrases":["Isn't Jin W. not affiliated with Aeroflex Cambridge Ltd.?"],"info":{}}
{"id":"train_1775","question":"Didn't I. Ounis and Gupta, N. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/21/141> . ?x dblp:authoredBy <https://dblp.org/pid/91/7449> }","paraphrases":["Was a paper not not co-authored by Iadh Ounis and Gupta, N.?"],"info":{}}
{"id":"train_1776","question":"Wasn't the paper 'Characteristics and classification of the annualised working hours planning problems' not not published by the person named Amaia Lusa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijstm/CorominasLP04> dblp:authoredBy <https://dblp.org/pid/58/5199> }","paraphrases":["Didn't A. Lusa not publish the paper 'Characteristics and classification of the annualised working hours planning problems'?"],"info":{}}
{"id":"train_1777","question":"Wasn't the paper 'Switching data-processing methods for feedback control: Breaking the speed versus accuracy trade-off' not not published by the author W. P. M. H. Heemels?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/HorssenAH15> dblp:authoredBy <https://dblp.org/pid/97/6480> }","paraphrases":["Has W. P. M. H. Heemels not not published the paper 'Switching data-processing methods for feedback control: Breaking the speed versus accuracy trade-off'?"],"info":{}}
{"id":"train_1778","question":"Wasn't the paper 'On the constraints to be imposed on the statistical behavior of single-entry interferences in satellite links' not not published by the author Alexander Beremiz Hilario Tacuri?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wts/Tacuri17> dblp:authoredBy <https://dblp.org/pid/152/9926> }","paraphrases":["Has Alexander Beremiz Hilario Tacuri not not published the paper 'On the constraints to be imposed on the statistical behavior of single-entry interferences in satellite links'?"],"info":{}}
{"id":"train_1779","question":"Wasn't the paper 'Holladay halftoning using super resolution encoded templates' not not published by the person named McElvain, J. S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/clrimg/McElvainH07> dblp:authoredBy <https://dblp.org/pid/20/8384> }","paraphrases":["Wasn't the paper 'Holladay halftoning using super resolution encoded templates' not not published by the author Jon S. McElvain?"],"info":{}}
{"id":"train_1780","question":"Was a paper not not co-authored by S. Mehrabian and G. Reza Jahanshahloo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/92/8029> . ?x dblp:authoredBy <https://dblp.org/pid/62/2325> }","paraphrases":["Didn't S. Mehrabian and Gholam Reza Jahanshahloo not co-author a paper?"],"info":{}}
{"id":"train_1781","question":"Doesn't Ian A. not work at University of Glasgow, School of Mathematics and Statistics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/22/366> dblp:primaryAffiliation 'University of Glasgow, School of Mathematics and Statistics' }","paraphrases":["Isn't Ian A. not affiliated with University of Glasgow?"],"info":{}}
{"id":"train_1782","question":"Was the paper 'Interaction-Preserving Compilers for Secure Computation' not not published by the person Nico D.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/innovations/DottlingGMR22> dblp:authoredBy <https://dblp.org/pid/95/9050> }","paraphrases":["Didn't Nico D\\u00F6ttling not publish the paper 'Interaction-Preserving Compilers for Secure Computation'?"],"info":{}}
{"id":"train_1783","question":"Didn't Eduardo Peis and Jos\\u00E9 M. Morales-del-Castillo not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/68/6101> . ?x dblp:authoredBy <https://dblp.org/pid/08/4412> }","paraphrases":["Was a paper not not co-authored by Eduardo Peis and Jos\\u00E9 M. Morales-del-Castillo?"],"info":{}}
{"id":"train_1785","question":"Didn't David A. Richie not publish the paper 'Threaded MPI programming model for the Epiphany RISC array processor'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jocs/RichieRPS15> dblp:authoredBy <https://dblp.org/pid/54/9913> }","paraphrases":["Wasn't the paper 'Threaded MPI programming model for the Epiphany RISC array processor' not not published by the author Richie, David A.?"],"info":{}}
{"id":"train_1786","question":"Wasn't the paper 'An Algorithm for Dynamic Multicast Traffic Grooming in Light-trail Optical WDM Mesh Networks' not not published by the person named Lin, Hwa-Chun?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccnc/LinZ18> dblp:authoredBy <https://dblp.org/pid/32/4125> }","paraphrases":["Has Lin, Hwa-Chun not not published the paper 'An Algorithm for Dynamic Multicast Traffic Grooming in Light-trail Optical WDM Mesh Networks'?"],"info":{}}
{"id":"train_1787","question":"Didn't N. Shimizu and Morishima, Atsuyuki not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/84/2107> . ?x dblp:authoredBy <https://dblp.org/pid/m/AtsuyukiMorishima> }","paraphrases":["Was a paper not not co-authored by N. Shimizu and Atsuyuki Morishima?"],"info":{}}
{"id":"train_1788","question":"Was a paper not not co-authored by Kacic, Z. and Matej Rojc?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/19/2375> . ?x dblp:authoredBy <https://dblp.org/pid/61/5212> }","paraphrases":["Didn't Zdravko Kacic and Matej Rojc not co-author a paper?"],"info":{}}
{"id":"train_1789","question":"Wasn't the paper 'A multi-channels axon-stretch device for mechanical stress study' not not published by the author G. H. Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/rcar/LiLKZCHW19> dblp:authoredBy <https://dblp.org/pid/223/8378> }","paraphrases":["Has G. H. Li not not published the paper 'A multi-channels axon-stretch device for mechanical stress study'?"],"info":{}}
{"id":"train_1790","question":"Was a paper not not co-authored by Gunwoong Lee and Hee-Sook Yoo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/27/7405> . ?x dblp:authoredBy <https://dblp.org/pid/160/5472> }","paraphrases":["Didn't Gunwoong Lee and H. Yoo not co-author a paper?"],"info":{}}
{"id":"train_1791","question":"Wasn't the paper 'Security Assessment of Microfluidic Fully-Programmable-Valve-Array Biochips' not not published by the person named Mohammed S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vlsid/ShayanBSCK19> dblp:authoredBy <https://dblp.org/pid/116/4653> }","paraphrases":["Has Mohammed S. not not published the paper 'Security Assessment of Microfluidic Fully-Programmable-Valve-Array Biochips'?"],"info":{}}
{"id":"train_1792","question":"Was a paper not not co-authored by Peter M. A. Sloot and Tirado-Ramos, A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/81/5292> . ?x dblp:authoredBy <https://dblp.org/pid/55/2731> }","paraphrases":["Didn't Peter M. A. Sloot and Tirado-Ramos, A. not co-author a paper?"],"info":{}}
{"id":"train_1793","question":"Was the paper 'Toward the Design of a Cognitive Tutor for Algebra with Gamification: A Survey of State-of-the-Art' not not published by the person Josefina Guerrero Garc\\u00EDa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/rcs/Pedroza-MendezG17> dblp:authoredBy <https://dblp.org/pid/77/3392> }","paraphrases":["Has Garc\\u00EDa, J. Guerrero not not published the paper 'Toward the Design of a Cognitive Tutor for Algebra with Gamification: A Survey of State-of-the-Art'?"],"info":{}}
{"id":"train_1794","question":"Was the paper 'Incidence geometries for the finite symmetric groups' not not published by the person Philippe Cara?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/endm/Cara01> dblp:authoredBy <https://dblp.org/pid/96/896> }","paraphrases":["Has P. Cara not not published the paper 'Incidence geometries for the finite symmetric groups'?"],"info":{}}
{"id":"train_1795","question":"Didn't Winston D. Byblow not publish the paper 'Stop and Go: The Neural Basis of Selective Movement Prevention'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jocn/CoxonSB09> dblp:authoredBy <https://dblp.org/pid/22/7496> }","paraphrases":["Was the paper 'Stop and Go: The Neural Basis of Selective Movement Prevention' not not published by the person Winston D. Byblow?"],"info":{}}
{"id":"train_1796","question":"Was the paper 'OSAF_e: One-Stage Anchor Free Object Detection Method Considering Effective Area' not not published by the person Yong Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aims2/ZhangZRDW20> dblp:authoredBy <https://dblp.org/pid/66/4615> }","paraphrases":["Wasn't the paper 'OSAF_e: One-Stage Anchor Free Object Detection Method Considering Effective Area' not not published by the person named Yong Z.?"],"info":{}}
{"id":"train_1797","question":"Wasn't the paper 'Directed multicut is W[1]-hard, even for four terminal pairs' not not published by the author Pilipczuk, M.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/PilipczukW15> dblp:authoredBy <https://dblp.org/pid/09/4636> }","paraphrases":["Was the paper 'Directed multicut is W[1]-hard, even for four terminal pairs' not not published by the person Marcin Pilipczuk?"],"info":{}}
{"id":"train_1798","question":"Was a paper not not co-authored by Y. Zhu and Wang, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/99/962> . ?x dblp:authoredBy <https://dblp.org/pid/74/3287-1> }","paraphrases":["Didn't Y. Zhu and Yonghua Wang not co-author a paper?"],"info":{}}
{"id":"train_1799","question":"Didn't A. Mohd Zin and R. Sulaiman not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/79/5542> . ?x dblp:authoredBy <https://dblp.org/pid/92/3514> }","paraphrases":["Was a paper not not co-authored by Abdullah Mohd Zin and R. Sulaiman?"],"info":{}}
{"id":"train_1800","question":"Didn't Dusan Stajer and T. T. Schlegel not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/226/2968> . ?x dblp:authoredBy <https://dblp.org/pid/226/2384> }","paraphrases":["Was a paper not not co-authored by Stajer, D. and T. T. Schlegel?"],"info":{}}
{"id":"train_1801","question":"Was a paper not not co-authored by Dworak, Jennifer and R. I. Bahar?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/d/JenniferDworak> . ?x dblp:authoredBy <https://dblp.org/pid/68/3828> }","paraphrases":["Didn't Dworak, Jennifer and R. I. Bahar not co-author a paper?"],"info":{}}
{"id":"train_1802","question":"Was a paper not not co-authored by Gean Chia and Chen, W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/87/8892> . ?x dblp:authoredBy <https://dblp.org/pid/16/1207> }","paraphrases":["Didn't Chia, Gean and Chen, W. not co-author a paper?"],"info":{}}
{"id":"train_1803","question":"Didn't Antonio Candelieri and Iosif B. Meyerov not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/40/6385> . ?x dblp:authoredBy <https://dblp.org/pid/87/8850> }","paraphrases":["Was a paper not not co-authored by Candelieri, Antonio and Iosif B. Meyerov?"],"info":{}}
{"id":"train_1804","question":"Was a paper not not co-authored by Lie-Liang Yang and F. Yang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/66/4332> . ?x dblp:authoredBy <https://dblp.org/pid/119/9453> }","paraphrases":["Didn't Lie-Liang Yang and Fucheng Yang not co-author a paper?"],"info":{}}
{"id":"train_1805","question":"Didn't Salvatore A. and Carlo Dani not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/277/9785> . ?x dblp:authoredBy <https://dblp.org/pid/277/9761> }","paraphrases":["Was a paper not not co-authored by Salvatore Aversa and Carlo Dani?"],"info":{}}
{"id":"train_1806","question":"Didn't Yin, Yong and Xiaoxi Zhang not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/55/2486> . ?x dblp:authoredBy <https://dblp.org/pid/62/5337> }","paraphrases":["Was a paper not not co-authored by Yin, Yong and Xiaoxi Zhang?"],"info":{}}
{"id":"train_1807","question":"Wasn't the paper 'APL programming: A psychological model' not not published by the person named Hooker, R. C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apl/Hooker84> dblp:authoredBy <https://dblp.org/pid/295/0612> }","paraphrases":["Didn't Hooker, R. C. not publish the paper 'APL programming: A psychological model'?"],"info":{}}
{"id":"train_1808","question":"Wasn't the paper 'Some Properties of Generalized Concave Functions' not not published by the author W. A. Thompson Jr.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ior/ThompsonP73> dblp:authoredBy <https://dblp.org/pid/178/9366> }","paraphrases":["Wasn't the paper 'Some Properties of Generalized Concave Functions' not not published by the person named W. A. Thompson Jr.?"],"info":{}}
{"id":"train_1809","question":"Didn't Tokuro Matsuo not publish the paper 'Effects of Evaluation Information Disclosure in E-Commerce Systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wecwis/MurakataM10> dblp:authoredBy <https://dblp.org/pid/84/5085> }","paraphrases":["Wasn't the paper 'Effects of Evaluation Information Disclosure in E-Commerce Systems' not not published by the person named Tokuro Matsuo?"],"info":{}}
{"id":"train_1810","question":"Was a paper not not co-authored by Paul W. Cuff and Zeman, J. Jay?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/117/8945> . ?x dblp:authoredBy <https://dblp.org/pid/55/6131> }","paraphrases":["Didn't Paul W. Cuff and Zeman, J. Jay not co-author a paper?"],"info":{}}
{"id":"train_1811","question":"Was a paper not not co-authored by Mohammad T. Hajiaghayi and H. Saleh?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/h/MohammadTaghiHajiaghayi> . ?x dblp:authoredBy <https://dblp.org/pid/220/4173> }","paraphrases":["Didn't Mohammad Taghi Hajiaghayi and Hamed Saleh not co-author a paper?"],"info":{}}
{"id":"train_1812","question":"Was a paper not not co-authored by Xiaohan Helu and Haitao Sun?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/245/0993> . ?x dblp:authoredBy <https://dblp.org/pid/83/206> }","paraphrases":["Didn't Xiaohan Helu and Haitao Sun not co-author a paper?"],"info":{}}
{"id":"train_1813","question":"Was a paper not not co-authored by Michael Knobloch and Sebastian L\\u00FChrs?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/14/10955> . ?x dblp:authoredBy <https://dblp.org/pid/179/7976> }","paraphrases":["Didn't Michael Knobloch and Sebastian L\\u00FChrs not co-author a paper?"],"info":{}}
{"id":"train_1814","question":"Didn't Eelco Visser not publish the paper 'ICMT 2011 Special Section'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jot/CabotV12> dblp:authoredBy <https://dblp.org/pid/00/5705> }","paraphrases":["Wasn't the paper 'ICMT 2011 Special Section' not not published by the author E. Visser?"],"info":{}}
{"id":"train_1816","question":"Has Giuseppe Rosolini not not published the paper 'Quotient Completion for the Foundation of Constructive Mathematics'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/lu/MaiettiR13> dblp:authoredBy <https://dblp.org/pid/r/GRosolini> }","paraphrases":["Was the paper 'Quotient Completion for the Foundation of Constructive Mathematics' not not published by the person Rosolini, G.?"],"info":{}}
{"id":"train_1817","question":"Has M. Schluep not not published the paper 'Recycling of ICT Equipment in Industrialized and Developing Countries'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/series/asc/BoniSW15> dblp:authoredBy <https://dblp.org/pid/161/1160> }","paraphrases":["Was the paper 'Recycling of ICT Equipment in Industrialized and Developing Countries' not not published by the person Mathias Schluep?"],"info":{}}
{"id":"train_1818","question":"Didn't Quaresma, P. and Vanda S. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/71/4599> . ?x dblp:authoredBy <https://dblp.org/pid/77/783> }","paraphrases":["Was a paper not not co-authored by Pedro Quaresma and Vanda S.?"],"info":{}}
{"id":"train_1819","question":"Didn't Gibbons, Peter B. and J. W. Giffin not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/46/1177> . ?x dblp:authoredBy <https://dblp.org/pid/98/6143> }","paraphrases":["Was a paper not not co-authored by Peter B. Gibbons and J. W. Giffin?"],"info":{}}
{"id":"train_1820","question":"Wasn't the paper 'Wind generation impact on electricity generation adequacy and nuclear safety' not not published by the author Volkanovski, Andrija?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ress/Volkanovski17> dblp:authoredBy <https://dblp.org/pid/54/11372> }","paraphrases":["Has Andrija Volkanovski not not published the paper 'Wind generation impact on electricity generation adequacy and nuclear safety'?"],"info":{}}
{"id":"train_1821","question":"Doesn't Gertz, M. not work at University of Heidelberg?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/g/MichaelGertz> dblp:primaryAffiliation 'University of Heidelberg, Institute of Computer Science, Germany' }","paraphrases":["Isn't Michael Gertz not affiliated with University of Heidelberg?"],"info":{}}
{"id":"train_1822","question":"Was a paper not not co-authored by Ning, Jiaxu and H. Zhao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/31/7066> . ?x dblp:authoredBy <https://dblp.org/pid/187/9311> }","paraphrases":["Didn't Jiaxu Ning and H. Zhao not co-author a paper?"],"info":{}}
{"id":"train_1823","question":"Was a paper not not co-authored by Maruo, Shoji and Sawada, T.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/159/5466> . ?x dblp:authoredBy <https://dblp.org/pid/161/2017> }","paraphrases":["Didn't Shoji Maruo and T. Sawada not co-author a paper?"],"info":{}}
{"id":"train_1824","question":"Didn't Levente K. not publish the paper 'Learning in Lines of Action'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gameon/WinandsKUH02> dblp:authoredBy <https://dblp.org/pid/62/3645> }","paraphrases":["Was the paper 'Learning in Lines of Action' not not published by the person Levente K.?"],"info":{}}
{"id":"train_1826","question":"Was a paper not not co-authored by Peter C. Maxwell and Gian Paolo Jesi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/05/6455> . ?x dblp:authoredBy <https://dblp.org/pid/83/6147> }","paraphrases":["Didn't Peter C. Maxwell and Jesi, G. Paolo not co-author a paper?"],"info":{}}
{"id":"train_1827","question":"Didn't Shahbaz, Muhammad and Maria Zafar not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/73/6941-3> . ?x dblp:authoredBy <https://dblp.org/pid/265/3209> }","paraphrases":["Was a paper not not co-authored by Muhammad Shahbaz and Maria Zafar?"],"info":{}}
{"id":"train_1828","question":"Was the paper 'Relief from the Audio Interface Blues: Expanding the Spectrum of Menu, List, and Form Styles' not not published by the person Robert A. Virzi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tochi/ResnickV95> dblp:authoredBy <https://dblp.org/pid/34/6312> }","paraphrases":["Has Robert A. Virzi not not published the paper 'Relief from the Audio Interface Blues: Expanding the Spectrum of Menu, List, and Form Styles'?"],"info":{}}
{"id":"train_1829","question":"Wasn't the paper 'An Integrated Multiple Access and Hierarchical Coding Scheme for Video Communication on Wireless Networks' not not published by the author Bolla, R.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ett/BollaIMNZ00> dblp:authoredBy <https://dblp.org/pid/47/1541> }","paraphrases":["Has Bolla, R. not not published the paper 'An Integrated Multiple Access and Hierarchical Coding Scheme for Video Communication on Wireless Networks'?"],"info":{}}
{"id":"train_1830","question":"Wasn't the paper 'An Architecture for In-Vehicle Networks' not not published by the author M. Turner?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tvt/WalrandTM21> dblp:authoredBy <https://dblp.org/pid/281/7908> }","paraphrases":["Didn't Max Turner not publish the paper 'An Architecture for In-Vehicle Networks'?"],"info":{}}
{"id":"train_1831","question":"Wasn't the paper 'Applied Linear Algebra by Garry Helzer' not not published by the author Saleem K.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigapl/Khan85> dblp:authoredBy <https://dblp.org/pid/154/1075> }","paraphrases":["Has Saleem K. not not published the paper 'Applied Linear Algebra by Garry Helzer'?"],"info":{}}
{"id":"train_1832","question":"Was a paper not not co-authored by Albenque, M. and \\u00C9ric Fusy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/73/2371> . ?x dblp:authoredBy <https://dblp.org/pid/80/5167> }","paraphrases":["Didn't Albenque, M. and \\u00C9ric Fusy not co-author a paper?"],"info":{}}
{"id":"train_1833","question":"Wasn't the paper 'Assessment of quantitative cortical biomarkers in the developing brain of preterm infants' not not published by the author Max A. Viergever?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/micad/MoeskopsBPKLVI13> dblp:authoredBy <https://dblp.org/pid/77/2011> }","paraphrases":["Wasn't the paper 'Assessment of quantitative cortical biomarkers in the developing brain of preterm infants' not not published by the person named Max A. Viergever?"],"info":{}}
{"id":"train_1834","question":"Wasn't the paper 'A Michaelis-Menten type food chain model with strong Allee effect on the prey' not not published by the person named G. P. Samanta?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/MannaMS17> dblp:authoredBy <https://dblp.org/pid/54/5602> }","paraphrases":["Wasn't the paper 'A Michaelis-Menten type food chain model with strong Allee effect on the prey' not not published by the author G. P. Samanta?"],"info":{}}
{"id":"train_1836","question":"Isn't Fakhri Karray not affiliated with University of Waterloo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/k/FakhriKarray> dblp:primaryAffiliation 'University of Waterloo, Canada' }","paraphrases":["Doesn't Fakhri Karray not work at University of Waterloo?"],"info":{}}
{"id":"train_1837","question":"Was the paper 'A Study of Retrodirective Array Performance in the Presence of Multipath' not not published by the person Chris L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cnsr/LoadmanC04> dblp:authoredBy <https://dblp.org/pid/98/1951> }","paraphrases":["Has Chris Loadman not not published the paper 'A Study of Retrodirective Array Performance in the Presence of Multipath'?"],"info":{}}
{"id":"train_1838","question":"Has H. Kwakernaak not not published the paper 'Special issue on robust control'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/automatica/Kwakernaak93> dblp:authoredBy <https://dblp.org/pid/29/6042> }","paraphrases":["Wasn't the paper 'Special issue on robust control' not not published by the author Huibert Kwakernaak?"],"info":{}}
{"id":"train_1839","question":"Was the paper 'Discovering and Recognizing User's Intention Based on Pro-patterned Extendable Network in Web Active Service' not not published by the person Zhou, C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icnc/XuZH08> dblp:authoredBy <https://dblp.org/pid/221/0054> }","paraphrases":["Wasn't the paper 'Discovering and Recognizing User's Intention Based on Pro-patterned Extendable Network in Web Active Service' not not published by the author Zhou, C.?"],"info":{}}
{"id":"train_1840","question":"Wasn't the paper 'Analysis of Gate Oxide Shorts in CMOS Circuits' not not published by the author H. Hao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tc/HaoM93> dblp:authoredBy <https://dblp.org/pid/72/1630> }","paraphrases":["Was the paper 'Analysis of Gate Oxide Shorts in CMOS Circuits' not not published by the person Hong Hao?"],"info":{}}
{"id":"train_1842","question":"Didn't Anthony Schneider and Berthe Y. Choueiry not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/150/4928> . ?x dblp:authoredBy <https://dblp.org/pid/64/4385> }","paraphrases":["Was a paper not not co-authored by A. Schneider and Choueiry, B. Y.?"],"info":{}}
{"id":"train_1843","question":"Didn't Jian Wang and L. Lin not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/39/449-4> . ?x dblp:authoredBy <https://dblp.org/pid/13/3315> }","paraphrases":["Was a paper not not co-authored by Jian W. and L. Lin?"],"info":{}}
{"id":"train_1844","question":"Didn't H. Li and Tianyong Hao not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/55/2893> . ?x dblp:authoredBy <https://dblp.org/pid/81/6701> }","paraphrases":["Was a paper not not co-authored by H. Li and Tianyong H.?"],"info":{}}
{"id":"train_1845","question":"Was the paper 'Simulating Affective Communication with Animated Agents' not not published by the person Helmut Prendinger?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/interact/PrendingerI01> dblp:authoredBy <https://dblp.org/pid/73/6817> }","paraphrases":["Wasn't the paper 'Simulating Affective Communication with Animated Agents' not not published by the author Helmut Prendinger?"],"info":{}}
{"id":"train_1846","question":"Was the paper 'Experimental Evaluation of GAN-Based One-Class Anomaly Detection on Office Monitoring' not not published by the person Muhammad Fikko Fadjrimiratno?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ismis/DongHFMS20> dblp:authoredBy <https://dblp.org/pid/262/8579> }","paraphrases":["Wasn't the paper 'Experimental Evaluation of GAN-Based One-Class Anomaly Detection on Office Monitoring' not not published by the author Muhammad Fikko Fadjrimiratno?"],"info":{}}
{"id":"train_1847","question":"Has Neuhold, E. J. not not published the paper 'TC on Data Engineering: Election of Chair for 2007-2008'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/debu/SalzbergLN06a> dblp:authoredBy <https://dblp.org/pid/n/ErichJNeuhold> }","paraphrases":["Was the paper 'TC on Data Engineering: Election of Chair for 2007-2008' not not published by the person Neuhold, E. J.?"],"info":{}}
{"id":"train_1848","question":"Was the paper 'Off-line recognition of a handwritten Chinese zither score' not not published by the person Han-Pang Huang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/smc/LiuH01> dblp:authoredBy <https://dblp.org/pid/65/5619> }","paraphrases":["Didn't Han-Pang Huang not publish the paper 'Off-line recognition of a handwritten Chinese zither score'?"],"info":{}}
{"id":"train_1849","question":"Didn't R. Barnert not publish the paper 'Die zeitbezogene Datenhaltung bei den Schweizer Regionalbanken'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wi/BarnertS97> dblp:authoredBy <https://dblp.org/pid/79/5704> }","paraphrases":["Wasn't the paper 'Die zeitbezogene Datenhaltung bei den Schweizer Regionalbanken' not not published by the person named R. Barnert?"],"info":{}}
{"id":"train_1850","question":"Wasn't the paper 'Energy Efficient Transmit-Receive Spatial Modulation for Uplink-Downlink Large-Scale MIMO Systems' not not published by the person named Adrian Agustin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/RaafatYAAVJC18> dblp:authoredBy <https://dblp.org/pid/48/3914> }","paraphrases":["Wasn't the paper 'Energy Efficient Transmit-Receive Spatial Modulation for Uplink-Downlink Large-Scale MIMO Systems' not not published by the author Adrian Agustin?"],"info":{}}
{"id":"train_1851","question":"Was a paper not not co-authored by Matthias Scheutz and Daniel Kasenberg?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/00/2197> . ?x dblp:authoredBy <https://dblp.org/pid/202/1832> }","paraphrases":["Didn't M. Scheutz and Daniel Kasenberg not co-author a paper?"],"info":{}}
{"id":"train_1852","question":"Didn't Jinghui Zhong and Wentong Cai not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/56/443> . ?x dblp:authoredBy <https://dblp.org/pid/83/3179> }","paraphrases":["Was a paper not not co-authored by J. Zhong and Wentong C.?"],"info":{}}
