{"id":"train_1934","question":"Isn't Nitin H. Vaidya not affiliated with University of Illinois?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/v/NitinHVaidya> dblp:primaryAffiliation 'University of Illinois, USA' }","paraphrases":["Doesn't Vaidya, Nitin H. not work at University of Illinois, USA?"],"info":{}}
{"id":"train_1935","question":"Was a paper not not co-authored by Megson, Graham M. and Khaled J. Hammad?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/m/GrahamMMegson> . ?x dblp:authoredBy <https://dblp.org/pid/131/1870> }","paraphrases":["Didn't Megson, Graham M. and Khaled J. Hammad not co-author a paper?"],"info":{}}
{"id":"train_1936","question":"Didn't Linh Paul Phan and K. Liu not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/222/6072> . ?x dblp:authoredBy <https://dblp.org/pid/82/10612> }","paraphrases":["Was a paper not not co-authored by Linh Paul Phan and Kaikai Liu?"],"info":{}}
{"id":"train_1937","question":"Didn't Izabela Z\\u00F3ltowska and Eugeniusz T. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/53/3065> . ?x dblp:authoredBy <https://dblp.org/pid/08/2019> }","paraphrases":["Was a paper not not co-authored by Izabela Z\\u00F3ltowska and Eugeniusz T.?"],"info":{}}
{"id":"train_1938","question":"Wasn't the paper 'Determining the Position and Orientation of Multi-Tagged Objects Using RFID Technology' not not published by the person named Steve Hinske?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/percom/Hinske07> dblp:authoredBy <https://dblp.org/pid/96/3012> }","paraphrases":["Has Hinske, S. not not published the paper 'Determining the Position and Orientation of Multi-Tagged Objects Using RFID Technology'?"],"info":{}}
{"id":"train_1939","question":"Isn't Rui Zhao not affiliated with Huaqiao University?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/26/2578-2> dblp:primaryAffiliation 'Huaqiao University, College of Information Science and Engineering, Quanzhou, China' }","paraphrases":["Doesn't Rui Zhao not work at Huaqiao University?"],"info":{}}
{"id":"train_1940","question":"Has Sriram V. Pemmaraju not not published the paper 'Topology Control and Geographic Routing in Realistic Wireless Networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ahswn/LillisPP08> dblp:authoredBy <https://dblp.org/pid/p/SVPemmaraju> }","paraphrases":["Wasn't the paper 'Topology Control and Geographic Routing in Realistic Wireless Networks' not not published by the person named Sriram V. Pemmaraju?"],"info":{}}
{"id":"train_1941","question":"Was the paper 'Eye Tracking: A New Interface for Visual Exploration' not not published by the person Oyewole Oyekoya?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/daglib/p/OyekoyaS08> dblp:authoredBy <https://dblp.org/pid/91/4355> }","paraphrases":["Has Oyewole Oyekoya not not published the paper 'Eye Tracking: A New Interface for Visual Exploration'?"],"info":{}}
{"id":"train_1942","question":"Doesn't David Wettergreen not work at Carnegie Mellon University, Pittsburgh, USA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/w/DavidWettergreen> dblp:primaryAffiliation 'Carnegie Mellon University, Pittsburgh, USA' }","paraphrases":["Isn't David Wettergreen not affiliated with Carnegie Mellon University?"],"info":{}}
{"id":"train_1943","question":"Wasn't the paper 'Statistical Design of Reverse Dye Microarrays' not not published by the person named Richard Simon?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bioinformatics/DobbinSS03> dblp:authoredBy <https://dblp.org/pid/47/6736> }","paraphrases":["Wasn't the paper 'Statistical Design of Reverse Dye Microarrays' not not published by the author Richard Simon?"],"info":{}}
{"id":"train_1944","question":"Didn't Markus Wacker and Jonas Bruschke not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/41/2761> . ?x dblp:authoredBy <https://dblp.org/pid/187/9160> }","paraphrases":["Was a paper not not co-authored by Markus Wacker and Jonas Bruschke?"],"info":{}}
{"id":"train_1945","question":"Doesn't Tan, T. Seng not work at National University of Singapore (NUS)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/t/TiowSengTan> dblp:primaryAffiliation 'National University of Singapore (NUS)' }","paraphrases":["Isn't Tan, T. Seng not affiliated with National University of Singapore (NUS)?"],"info":{}}
{"id":"train_1946","question":"Has Satoru Ochiiwa not not published the paper 'Two Enhanced Heuristic Algorithms for the Minimum Initial Marking Problem of Petri Nets'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ieicet/OchiiwaTYW09> dblp:authoredBy <https://dblp.org/pid/07/8785> }","paraphrases":["Wasn't the paper 'Two Enhanced Heuristic Algorithms for the Minimum Initial Marking Problem of Petri Nets' not not published by the author Satoru O.?"],"info":{}}
{"id":"train_1947","question":"Didn't Anis Rojbi and S. Rojbi not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/152/8945> . ?x dblp:authoredBy <https://dblp.org/pid/218/3859> }","paraphrases":["Was a paper not not co-authored by Anis Rojbi and Sami Rojbi?"],"info":{}}
{"id":"train_1948","question":"Wasn't the paper 'Wavelet transform-based methods for removal of ground clutter and denoising the radar wind profiler data' not not published by the author Reddy, S. Venkatramana?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iet-spr/AllabakashYRS15> dblp:authoredBy <https://dblp.org/pid/227/7032> }","paraphrases":["Wasn't the paper 'Wavelet transform-based methods for removal of ground clutter and denoising the radar wind profiler data' not not published by the person named Sakirevupalli Venkatramana Reddy?"],"info":{}}
{"id":"train_1949","question":"Wasn't the paper 'Replication Based on Group Communication' not not published by the person named Pedone, Fernando?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/reference/db/Pedone09> dblp:authoredBy <https://dblp.org/pid/90/2612> }","paraphrases":["Was the paper 'Replication Based on Group Communication' not not published by the person Fernando Pedone?"],"info":{}}
{"id":"train_1951","question":"Was the paper '3D visualization to aid engineering education: A case study to visualize the impact of wireless signals on human brain' not not published by the person Khalid A. Qaraqe?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/educon/NasirSSQB14> dblp:authoredBy <https://dblp.org/pid/11/6615> }","paraphrases":["Has Khalid A. Qaraqe not not published the paper '3D visualization to aid engineering education: A case study to visualize the impact of wireless signals on human brain'?"],"info":{}}
{"id":"train_1952","question":"Was the paper 'Optimize the QoS Metrics in Smart Mobile Communication using Multi-Objective Function' not not published by the person Souidi, Mohammed?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/commnet/BerradiHSMM20> dblp:authoredBy <https://dblp.org/pid/205/6564> }","paraphrases":["Wasn't the paper 'Optimize the QoS Metrics in Smart Mobile Communication using Multi-Objective Function' not not published by the person named Mohammed Souidi?"],"info":{}}
{"id":"train_1953","question":"Isn't Markus Aleksy not affiliated with University of Mannheim?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/a/MAleksy> dblp:primaryAffiliation 'University of Mannheim, Germany' }","paraphrases":["Doesn't Markus Aleksy not work at University of Mannheim, Germany?"],"info":{}}
{"id":"train_1954","question":"Wasn't the paper 'A Distributed Architecture for HVAC Sensor Fault Detection and Isolation' not not published by the author Vasso Reppa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcst/ReppaPPP15> dblp:authoredBy <https://dblp.org/pid/13/4285> }","paraphrases":["Was the paper 'A Distributed Architecture for HVAC Sensor Fault Detection and Isolation' not not published by the person Reppa, V.?"],"info":{}}
{"id":"train_1955","question":"Was the paper 'MOBIX: System for managing mobility using information exchange' not not published by the person Jhoanna Rhodette Pedrasa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mobiquitous/PedrasaS09> dblp:authoredBy <https://dblp.org/pid/63/8332> }","paraphrases":["Wasn't the paper 'MOBIX: System for managing mobility using information exchange' not not published by the author Pedrasa, Jhoanna Rhodette?"],"info":{}}
{"id":"train_1956","question":"Was the paper 'A variable selection method for a hierarchical interval type-2 TSK fuzzy inference system' not not published by the person D. Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fss/WeiZH22> dblp:authoredBy <https://dblp.org/pid/215/5891-1> }","paraphrases":["Wasn't the paper 'A variable selection method for a hierarchical interval type-2 TSK fuzzy inference system' not not published by the person named D. Zhang?"],"info":{}}
{"id":"train_1957","question":"Didn't Zhiyang Li and H. Lin not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/37/9761> . ?x dblp:authoredBy <https://dblp.org/pid/37/3545-7> }","paraphrases":["Was a paper not not co-authored by Zhiyang Li and H. Lin?"],"info":{}}
{"id":"train_1958","question":"Was a paper not not co-authored by Thomas Ullmann and J\\u00F6rg Sauer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/87/3472> . ?x dblp:authoredBy <https://dblp.org/pid/51/5036> }","paraphrases":["Didn't Ullmann, Thomas and J\\u00F6rg Sauer not co-author a paper?"],"info":{}}
{"id":"train_1959","question":"Was a paper not not co-authored by R. Van den Broeck and F. V.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/06/1297> . ?x dblp:authoredBy <https://dblp.org/pid/02/1295> }","paraphrases":["Didn't R. Van den Broeck and F. V. not co-author a paper?"],"info":{}}
{"id":"train_1960","question":"Didn't Beldjilali, Bouziane and Baghdad Atmani not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/97/2516> . ?x dblp:authoredBy <https://dblp.org/pid/36/1682> }","paraphrases":["Was a paper not not co-authored by Beldjilali, Bouziane and Baghdad Atmani?"],"info":{}}
{"id":"train_1961","question":"Wasn't the paper 'Existence problems in philosophy and science' not not published by the author Peter W. Ross?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/synthese/RossT13> dblp:authoredBy <https://dblp.org/pid/137/4484> }","paraphrases":["Has Peter W. Ross not not published the paper 'Existence problems in philosophy and science'?"],"info":{}}
{"id":"train_1962","question":"Doesn't Devavrat Shah not work at MIT, Cambridge, USA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/73/3881> dblp:primaryAffiliation 'MIT, Cambridge, USA' }","paraphrases":["Isn't Shah, D. not affiliated with MIT?"],"info":{}}
{"id":"train_1963","question":"Didn't Kung Yao not publish the paper 'Lower bounds of localization uncertainty in sensor networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/WangYYE04> dblp:authoredBy <https://dblp.org/pid/82/4707> }","paraphrases":["Was the paper 'Lower bounds of localization uncertainty in sensor networks' not not published by the person Kung Yao?"],"info":{}}
{"id":"train_1964","question":"Has Ivar Jacobson not not published the paper 'Agile and SEMAT: perfect partners'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacm/JacobsonSN13> dblp:authoredBy <https://dblp.org/pid/62/383> }","paraphrases":["Wasn't the paper 'Agile and SEMAT: perfect partners' not not published by the author Ivar J.?"],"info":{}}
{"id":"train_1965","question":"Was the paper 'Review of 'Vector Quantization and Signal Compression' (Gersho, A, and Gray, RM; 1992)' not not published by the person Nariman Farvardin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tit/Farvardin94> dblp:authoredBy <https://dblp.org/pid/81/5963> }","paraphrases":["Wasn't the paper 'Review of 'Vector Quantization and Signal Compression' (Gersho, A, and Gray, RM; 1992)' not not published by the author Nariman Farvardin?"],"info":{}}
{"id":"train_1966","question":"Has Kennedy-Metz, Lauren R. not not published the paper 'Biofeedback as a stress management tool: a systematic review'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ctw/KennedyP19> dblp:authoredBy <https://dblp.org/pid/277/2253> }","paraphrases":["Was the paper 'Biofeedback as a stress management tool: a systematic review' not not published by the person Lauren R. Kennedy-Metz?"],"info":{}}
{"id":"train_1967","question":"Didn't Y. Liu and Robert T. Collins not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/l/YanxiLiu> . ?x dblp:authoredBy <https://dblp.org/pid/76/2806> }","paraphrases":["Was a paper not not co-authored by Y. Liu and Robert T. Collins?"],"info":{}}
{"id":"train_1968","question":"Doesn't Syed Ali Hassan not work at National University of Sciences and Technology, School of Electrical Engineering and Computer Science, Islamabad, Pakistan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/29/7910> dblp:primaryAffiliation 'National University of Sciences and Technology, School of Electrical Engineering and Computer Science, Islamabad, Pakistan' }","paraphrases":["Isn't Syed Ali Hassan not affiliated with National University of Sciences and Technology?"],"info":{}}
{"id":"train_1969","question":"Wasn't the paper 'Simulating wind effects on cloth and hair in Disney's Frozen' not not published by the author Hubert Leo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/siggraph/WilsonMLS14> dblp:authoredBy <https://dblp.org/pid/36/10543> }","paraphrases":["Wasn't the paper 'Simulating wind effects on cloth and hair in Disney's Frozen' not not published by the person named Hubert L.?"],"info":{}}
{"id":"train_1970","question":"Was the paper 'The stability of Schr\\u00F6dinger equation with boundary control matched disturbance' not not published by the person Zhang, Xiaoying?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jossac/ZhangC17> dblp:authoredBy <https://dblp.org/pid/46/7725> }","paraphrases":["Didn't Zhang, Xiaoying not publish the paper 'The stability of Schr\\u00F6dinger equation with boundary control matched disturbance'?"],"info":{}}
{"id":"train_1971","question":"Has Srdjan Capkun not not published the paper 'Distance Hijacking Attacks on Distance Bounding Protocols'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sp/CremersRSC12> dblp:authoredBy <https://dblp.org/pid/51/1639> }","paraphrases":["Wasn't the paper 'Distance Hijacking Attacks on Distance Bounding Protocols' not not published by the author Srdjan C.?"],"info":{}}
{"id":"train_1972","question":"Didn't Huadong Sun and D. Huang not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/88/10176> . ?x dblp:authoredBy <https://dblp.org/pid/41/3836> }","paraphrases":["Was a paper not not co-authored by H. Sun and Dan Huang?"],"info":{}}
{"id":"train_1973","question":"Was a paper not not co-authored by Benjam\\u00EDn R. C. Bedregal and Ant\\u00F4nio Carlos da Rocha Costa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/32/3731> . ?x dblp:authoredBy <https://dblp.org/pid/36/5618> }","paraphrases":["Didn't B. R. C. Bedregal and Ant\\u00F4nio Carlos da Rocha Costa not co-author a paper?"],"info":{}}
{"id":"train_1974","question":"Wasn't the paper 'Planning Validation & Verification Steps According to the Dependency of Requirements and Product Architecture' not not published by the author Kristin Paetzold?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ice-itmc/ChahinP18> dblp:authoredBy <https://dblp.org/pid/138/0633> }","paraphrases":["Didn't Kristin Paetzold not publish the paper 'Planning Validation & Verification Steps According to the Dependency of Requirements and Product Architecture'?"],"info":{}}
{"id":"train_1975","question":"Didn't Elbattah, M. and Anthony G. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/166/4976> . ?x dblp:authoredBy <https://dblp.org/pid/94/10045> }","paraphrases":["Was a paper not not co-authored by Mahmoud Elbattah and Anthony Gitter?"],"info":{}}
{"id":"train_1976","question":"Isn't Badreddin, E. not affiliated with University of Mannheim, Germany?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/b/EssameddinBadreddin> dblp:primaryAffiliation 'University of Mannheim, Germany' }","paraphrases":["Doesn't Badreddin, E. not work at University of Mannheim?"],"info":{}}
{"id":"train_1977","question":"Didn't Samuel Sch\\u00FCppen and P. Herrmann not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/197/8073> . ?x dblp:authoredBy <https://dblp.org/pid/133/5020> }","paraphrases":["Was a paper not not co-authored by Sch\\u00FCppen, Samuel and P. Herrmann?"],"info":{}}
{"id":"train_1978","question":"Was the paper 'LLL aided MIMO detection algorithm based on BP neural network optimization' not not published by the person Yujie Peng?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icaiis/Peng21> dblp:authoredBy <https://dblp.org/pid/261/9875> }","paraphrases":["Wasn't the paper 'LLL aided MIMO detection algorithm based on BP neural network optimization' not not published by the author Peng, Yujie?"],"info":{}}
{"id":"train_1979","question":"Was a paper not not co-authored by Hans Eberle and Nils Gura?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/46/4152> . ?x dblp:authoredBy <https://dblp.org/pid/49/2203> }","paraphrases":["Didn't Hans Eberle and Gura, Nils not co-author a paper?"],"info":{}}
{"id":"train_1980","question":"Didn't Ahmed E. Ismail and Paolo Bientinesi not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/42/7147> . ?x dblp:authoredBy <https://dblp.org/pid/b/PaoloBientinesi> }","paraphrases":["Was a paper not not co-authored by Ahmed E. Ismail and Bientinesi, P.?"],"info":{}}
{"id":"train_1981","question":"Didn't Alex Pappachen James and Mostafa Rahimi Azghadi not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/03/8462> . ?x dblp:authoredBy <https://dblp.org/pid/76/2964> }","paraphrases":["Was a paper not not co-authored by Alex Pappachen James and Mostafa Rahimi Azghadi?"],"info":{}}
{"id":"train_1982","question":"Didn't William L. Kocay and Emiliano Dall'Anese not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/k/WilliamKocay> . ?x dblp:authoredBy <https://dblp.org/pid/45/7883> }","paraphrases":["Was a paper not not co-authored by William L. Kocay and Emiliano Dall'Anese?"],"info":{}}
{"id":"train_1983","question":"Has Janice C. Sipior not not published the paper 'The Internet Jurisdiction Risk of Cloud Computing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ism/WardS10> dblp:authoredBy <https://dblp.org/pid/60/6165> }","paraphrases":["Wasn't the paper 'The Internet Jurisdiction Risk of Cloud Computing' not not published by the author Janice C. Sipior?"],"info":{}}
{"id":"train_1984","question":"Was a paper not not co-authored by Huber, M. and Alexander Gruner?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/36/3234-2> . ?x dblp:authoredBy <https://dblp.org/pid/98/11140> }","paraphrases":["Didn't Huber, M. and Alexander Gruner not co-author a paper?"],"info":{}}
{"id":"train_1986","question":"Didn't Wojciechowski, Konrad W. and Adam S. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/38/6909> . ?x dblp:authoredBy <https://dblp.org/pid/52/6075> }","paraphrases":["Was a paper not not co-authored by Wojciechowski, Konrad W. and Adam Switonski?"],"info":{}}
{"id":"train_1987","question":"Didn't Takeo Igarashi not publish the paper '25D cartoon models'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tog/RiversID10> dblp:authoredBy <https://dblp.org/pid/03/6674> }","paraphrases":["Has Takeo Igarashi not not published the paper '25D cartoon models'?"],"info":{}}
{"id":"train_1988","question":"Was a paper not not co-authored by Luigi Chisci and N. Forti?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/68/5289> . ?x dblp:authoredBy <https://dblp.org/pid/152/4133> }","paraphrases":["Didn't Chisci, Luigi and N. Forti not co-author a paper?"],"info":{}}
{"id":"train_1989","question":"Has Kuijpers, M. M. not not published the paper 'Bibliotherapy in the age of digitization'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/firstmonday/Kuijpers18> dblp:authoredBy <https://dblp.org/pid/227/3765> }","paraphrases":["Was the paper 'Bibliotherapy in the age of digitization' not not published by the person Moniek M. Kuijpers?"],"info":{}}
{"id":"train_1990","question":"Wasn't the paper 'A Distributed Approach to Solving Overlay Mismatching Problem' not not published by the person named Ni, Lionel M.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icdcs/LiuZXN04> dblp:authoredBy <https://dblp.org/pid/n/LionelMNi> }","paraphrases":["Wasn't the paper 'A Distributed Approach to Solving Overlay Mismatching Problem' not not published by the author Lionel M. Ni?"],"info":{}}
{"id":"train_1991","question":"Was a paper not not co-authored by Janke, Maximilian and Susanne Albers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/259/4993> . ?x dblp:authoredBy <https://dblp.org/pid/a/SusanneAlbers> }","paraphrases":["Didn't Janke, Maximilian and Susanne A. not co-author a paper?"],"info":{}}
{"id":"train_1992","question":"Was a paper not not co-authored by Gransden, I. R. and Steve W. Beet?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/72/4421> . ?x dblp:authoredBy <https://dblp.org/pid/91/9335> }","paraphrases":["Didn't I. R. Gransden and Steve W. Beet not co-author a paper?"],"info":{}}
{"id":"train_1993","question":"Didn't Pinelopi Atsikpasi and Fokides, E. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/206/0287> . ?x dblp:authoredBy <https://dblp.org/pid/81/8225> }","paraphrases":["Was a paper not not co-authored by Pinelopi Atsikpasi and Fokides, E.?"],"info":{}}
{"id":"train_1994","question":"Didn't Kay Kender and Katta Spiel not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/277/3079> . ?x dblp:authoredBy <https://dblp.org/pid/151/3248> }","paraphrases":["Was a paper not not co-authored by Kay Kender and Katta Spiel?"],"info":{}}
{"id":"train_1995","question":"Wasn't the paper 'An Architecture to Support Dynamic Service Composition in Distributed Real-Time Systems' not not published by the author Marisol Garc\\u00EDa-Valls?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isorc/Estevez-AyresAGB07> dblp:authoredBy <https://dblp.org/pid/91/2218> }","paraphrases":["Was the paper 'An Architecture to Support Dynamic Service Composition in Distributed Real-Time Systems' not not published by the person Marisol Garc\\u00EDa-Valls?"],"info":{}}
{"id":"train_1996","question":"Wasn't the paper 'H \\u221E filtering for nonlinear singular Markovian jumping systems with interval time-varying delays' not not published by the author L. Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijsysc/XiaLMY12> dblp:authoredBy <https://dblp.org/pid/53/2189-50> }","paraphrases":["Wasn't the paper 'H \\u221E filtering for nonlinear singular Markovian jumping systems with interval time-varying delays' not not published by the person named L. Li?"],"info":{}}
{"id":"train_1997","question":"Was a paper not not co-authored by Hancock, E. R. and Simone Ceolin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/h/EdwinRHancock> . ?x dblp:authoredBy <https://dblp.org/pid/c/CeolinSimone> }","paraphrases":["Didn't Hancock, E. R. and Ceolin, S. not co-author a paper?"],"info":{}}
{"id":"train_1998","question":"Was a paper not not co-authored by Wood, Aaron and C. Harding?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/83/5316> . ?x dblp:authoredBy <https://dblp.org/pid/h/ChrisHarding> }","paraphrases":["Didn't Aaron Wood and Chris Harding not co-author a paper?"],"info":{}}
{"id":"train_1999","question":"Was a paper not not co-authored by E. Ann Patitsas and Alex M. Andrew?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/52/10988> . ?x dblp:authoredBy <https://dblp.org/pid/24/1735> }","paraphrases":["Didn't E. Ann Patitsas and Alex M. Andrew not co-author a paper?"],"info":{}}
{"id":"train_2000","question":"Was a paper not not co-authored by Larry S. Jackson and Huy-Vo Van?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/03/326> . ?x dblp:authoredBy <https://dblp.org/pid/25/10708> }","paraphrases":["Didn't Jackson, L. S. and Huy-Vo Van not co-author a paper?"],"info":{}}
{"id":"train_2001","question":"Wasn't the paper 'Application of the Data from Landsat8 OLI - The New Generation of Landsat Series in the Cultivated Land Information Extraction' not not published by the person named Jiabo Sun?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ifip12/NiuCSZ16> dblp:authoredBy <https://dblp.org/pid/126/2350> }","paraphrases":["Was the paper 'Application of the Data from Landsat8 OLI - The New Generation of Landsat Series in the Cultivated Land Information Extraction' not not published by the person Jiabo Sun?"],"info":{}}
{"id":"train_2002","question":"Didn't Yan Zheng not publish the paper 'A Comparative Study on Text Clustering Methods'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/adma/ZhengCHM06> dblp:authoredBy <https://dblp.org/pid/10/2381> }","paraphrases":["Has Zheng, Y. not not published the paper 'A Comparative Study on Text Clustering Methods'?"],"info":{}}
{"id":"train_2003","question":"Has Richard H. Y. So not not published the paper 'The Search For A Cybersickness Dose Value'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/So99> dblp:authoredBy <https://dblp.org/pid/13/498> }","paraphrases":["Was the paper 'The Search For A Cybersickness Dose Value' not not published by the person Richard H. Y. So?"],"info":{}}
{"id":"train_2004","question":"Was a paper not not co-authored by Hentenryck, Pascal Van and J. Yip?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/h/PVHentenryck> . ?x dblp:authoredBy <https://dblp.org/pid/y/JustinYip> }","paraphrases":["Didn't Hentenryck, Pascal Van and J. Yip not co-author a paper?"],"info":{}}
{"id":"train_2005","question":"Was a paper not not co-authored by Michael W. Mahoney and Michal Derezinski?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/10/6978> . ?x dblp:authoredBy <https://dblp.org/pid/155/1906> }","paraphrases":["Didn't Michael W. Mahoney and Michal Derezinski not co-author a paper?"],"info":{}}
{"id":"train_2006","question":"Didn't Saleh A. Al-Jufout and Zhilong Chen not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/34/6133> . ?x dblp:authoredBy <https://dblp.org/pid/130/9796> }","paraphrases":["Was a paper not not co-authored by Saleh A. Al-Jufout and Chen, Zhilong?"],"info":{}}
{"id":"train_2007","question":"Was a paper not not co-authored by Xiaoyan Sun and Haifeng L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/13/1574-1> . ?x dblp:authoredBy <https://dblp.org/pid/84/33> }","paraphrases":["Didn't X. Sun and Haifeng L. not co-author a paper?"],"info":{}}
{"id":"train_2008","question":"Wasn't the paper 'Global-Local Mutual Attention Model for Text Classification' not not published by the author Ng, W. W. Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/taslp/MaYTCN19> dblp:authoredBy <https://dblp.org/pid/67/6060> }","paraphrases":["Wasn't the paper 'Global-Local Mutual Attention Model for Text Classification' not not published by the person named Ng, W. W. Y.?"],"info":{}}
{"id":"train_2009","question":"Didn't Sotiris Batsakis and Ilias Tachmazidis not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/70/7127> . ?x dblp:authoredBy <https://dblp.org/pid/116/9321> }","paraphrases":["Was a paper not not co-authored by Batsakis, S. and Tachmazidis, I.?"],"info":{}}
{"id":"train_2010","question":"Was the paper 'Polarimetric L-band PALSAR2 for Discontinuous Permafrost Mapping In Peatland Regions' not not published by the person M. Hosseini?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/igarss/TouziPHJ19> dblp:authoredBy <https://dblp.org/pid/69/3700> }","paraphrases":["Has Hosseini, M. not not published the paper 'Polarimetric L-band PALSAR2 for Discontinuous Permafrost Mapping In Peatland Regions'?"],"info":{}}
{"id":"train_2011","question":"Isn't Mu'alem, A. not affiliated with Hebrew University of Jerusalem, Israel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/m/AhuvaMualem> dblp:primaryAffiliation 'Hebrew University of Jerusalem, Israel' }","paraphrases":["Doesn't Mu'alem, A. not work at Hebrew University of Jerusalem?"],"info":{}}
