{"id":"train_4336","question":"Who are the authors of 'SAR calibration: an overview' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tgrs/Freeman92> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/tgrs/Freeman92> ) }","paraphrases":["Who are the authors of the publication 'SAR calibration: an overview' and what other papers did they publish?"],"info":{}}
{"id":"train_4337","question":"Who are the authors of the publication 'Hypothetical in-vehicle telematics interface comparisons' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ictc/JeonKCKP10> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/ictc/JeonKCKP10> ) }","paraphrases":["Who are the authors of the publication 'Hypothetical in-vehicle telematics interface comparisons' and which other papers did they publish?"],"info":{}}
{"id":"train_4338","question":"Who are the authors of the publication 'Parallel Scheduled Sampling' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1906-04331> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1906-04331> ) }","paraphrases":["Who are the authors of 'Parallel Scheduled Sampling' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4339","question":"Find the authors of 'Simultaneous Semantic and Collision Learning for 6-DoF Grasp Pose Estimation' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-2108-02425> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-2108-02425> ) }","paraphrases":["Who are the authors of the publication 'Simultaneous Semantic and Collision Learning for 6-DoF Grasp Pose Estimation' and where did they publish other papers?"],"info":{}}
{"id":"train_4340","question":"Find the authors of 'Maximum and k-th maximal spanning trees of a weighted graph' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/combinatorica/Kano87> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/combinatorica/Kano87> ) }","paraphrases":["List the authors of 'Maximum and k-th maximal spanning trees of a weighted graph' and the venues of the other papers they published."],"info":{}}
{"id":"train_4343","question":"Find the authors of 'Jasmine: A Pure Java Based DSM' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/pdpta/ZhuW99> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Jasmine: A Pure Java Based DSM' and where are they from?"],"info":{}}
{"id":"train_4344","question":"List the authors of 'PERE: Evaluation and Improvement of Dependable Processes' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/safecomp/BloomfieldBEV96> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/safecomp/BloomfieldBEV96> ) }","paraphrases":["Who are the authors of the publication 'PERE: Evaluation and Improvement of Dependable Processes' and which other papers did they publish?"],"info":{}}
{"id":"train_4346","question":"Who are the authors of 'Computation of three stochastic modifications of Stokes's formula for regional geoid determination' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/gandc/Ellmann05> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/gandc/Ellmann05> ) }","paraphrases":["Who are the authors of the publication 'Computation of three stochastic modifications of Stokes's formula for regional geoid determination' and where did they publish other papers?"],"info":{}}
{"id":"train_4349","question":"Find the authors of 'Simulation of Power Efficient Region Based Approach for Query Processing in Wireless Sensor Networks' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icetet/GuptaDP09> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["List the authors of 'Simulation of Power Efficient Region Based Approach for Query Processing in Wireless Sensor Networks' and their affiliations."],"info":{}}
{"id":"train_4350","question":"List the authors of 'Generative modeling for renal microanatomy' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/midp/MuraliLGTS20> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/midp/MuraliLGTS20> ) }","paraphrases":["Who are the authors of the publication 'Generative modeling for renal microanatomy' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4351","question":"Who are the authors of 'Skeleton Split Strategies for Spatial Temporal Graph Convolution Networks' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-2108-01309> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-2108-01309> ) }","paraphrases":["Who are the authors of the publication 'Skeleton Split Strategies for Spatial Temporal Graph Convolution Networks' and where did they publish other papers?"],"info":{}}
{"id":"train_4353","question":"List the authors of 'Recursive estimation of structure and motion using relative orientation constraints' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cvpr/AzarbayejaniHP93> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/cvpr/AzarbayejaniHP93> ) }","paraphrases":["Who are the authors of the publication 'Recursive estimation of structure and motion using relative orientation constraints' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4354","question":"List the authors of 'Impact of Cognitive Radio on Future Management of Spectrum' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/crowncom/Nekovee08> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/crowncom/Nekovee08> ) }","paraphrases":["Who are the authors of the publication 'Impact of Cognitive Radio on Future Management of Spectrum' and which other papers did they publish?"],"info":{}}
{"id":"train_4355","question":"Who are the authors of the publication 'Efficient Adversarial Attacks for Visual Object Tracking' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/eccv/LiangWYC20> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/eccv/LiangWYC20> ) }","paraphrases":["Who are the authors of 'Efficient Adversarial Attacks for Visual Object Tracking' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4358","question":"Find the authors of 'Interactive Decision Making for Fuzzy Random Multiobjective Linear Programming Problems with Variance Covariance Matrices Through Fractile Optimization' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jaciii/Yano14> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jaciii/Yano14> ) }","paraphrases":["Who are the authors of the publication 'Interactive Decision Making for Fuzzy Random Multiobjective Linear Programming Problems with Variance Covariance Matrices Through Fractile Optimization' and which other papers did they publish?"],"info":{}}
{"id":"train_4362","question":"Find the authors of 'A novel VLSI architecture for multidimensional discrete wavelet transform' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icmcs/ChenD03> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'A novel VLSI architecture for multidimensional discrete wavelet transform' and what are their affiliations?"],"info":{}}
{"id":"train_4363","question":"List the authors of 'Convergence analysis of penalty based numerical methods for constrained inequality problems' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/nm/HanS19> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/nm/HanS19> ) }","paraphrases":["Who are the authors of 'Convergence analysis of penalty based numerical methods for constrained inequality problems' and which other papers did they publish?"],"info":{}}
{"id":"train_4364","question":"Find the authors of 'An Intelligent Information System for Detecting Web Commerce Transactions' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/awic/AnagnostopoulosKA05> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'An Intelligent Information System for Detecting Web Commerce Transactions' and where are they from?"],"info":{}}
{"id":"train_4366","question":"Find the authors of 'Personalizing information retrieval for multi-session tasks: the roles of task stage and task type' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/sigir/LiuB10> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/sigir/LiuB10> ) }","paraphrases":["Who are the authors of 'Personalizing information retrieval for multi-session tasks: the roles of task stage and task type' and which other papers did they publish?"],"info":{}}
{"id":"train_4367","question":"Find the authors of 'Accelerated Algorithms for Convex and Non-Convex Optimization on Manifolds' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-2010-08908> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-2010-08908> ) }","paraphrases":["List the authors of 'Accelerated Algorithms for Convex and Non-Convex Optimization on Manifolds' and the venues of the other papers they published."],"info":{}}
{"id":"train_4370","question":"List the authors of 'Battery-aware Routing in Personal Networks' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/wpc/VazifehdanPN13> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/wpc/VazifehdanPN13> ) }","paraphrases":["Find the authors of 'Battery-aware Routing in Personal Networks' and the other papers they published."],"info":{}}
{"id":"train_4373","question":"Who are the authors of 'Better Mini-Batch Algorithms via Accelerated Gradient Methods' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1106-4574> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1106-4574> ) }","paraphrases":["Who are the authors of the publication 'Better Mini-Batch Algorithms via Accelerated Gradient Methods' and where did they publish other papers?"],"info":{}}
{"id":"train_4374","question":"Find the authors of 'Experimental Demonstration of RoFSO Transmission Combining WLAN Standard and WDM-FSO over 100m Distance' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/infocom/KimLLCPSKK22> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/infocom/KimLLCPSKK22> ) }","paraphrases":["List the authors of 'Experimental Demonstration of RoFSO Transmission Combining WLAN Standard and WDM-FSO over 100m Distance' and the venues of the other papers they published."],"info":{}}
{"id":"train_4376","question":"Find the authors of 'Design and Development of Autonomous Delivery Robot' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-2103-09229> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/corr/abs-2103-09229> ) }","paraphrases":["Who are the authors of the publication 'Design and Development of Autonomous Delivery Robot' and which other papers did they publish?"],"info":{}}
{"id":"train_4377","question":"List the authors of 'Events Algebra of Triggers' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/cj/ZhouYF17> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/cj/ZhouYF17> ) }","paraphrases":["Find the authors of 'Events Algebra of Triggers' and the other papers they published."],"info":{}}
{"id":"train_4378","question":"Find the authors of 'Sliding Mode Control Based Dynamic Positioning System under Some Actuator Faults' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icsengt/SubarkahSHA19> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icsengt/SubarkahSHA19> ) }","paraphrases":["Who are the authors of the publication 'Sliding Mode Control Based Dynamic Positioning System under Some Actuator Faults' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4379","question":"Find the authors of 'On a variation of the two-component Hunter-Saxton system' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/amc/GuoLW15> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/amc/GuoLW15> ) }","paraphrases":["Who are the authors of the publication 'On a variation of the two-component Hunter-Saxton system' and which other papers did they publish?"],"info":{}}
{"id":"train_4383","question":"Find the authors of 'Posterior Cram\\u00E9r-Rao Lower Bound for Angle-Only Filtering in 3D' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/iccais/MallickAY18> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/iccais/MallickAY18> ) }","paraphrases":["List the authors of 'Posterior Cram\\u00E9r-Rao Lower Bound for Angle-Only Filtering in 3D' and the other papers they published."],"info":{}}
{"id":"train_4384","question":"List the authors of 'Flexible SAT-based framework for incremental bounded upgrade checking' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/sttt/FedyukovichSS17> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Flexible SAT-based framework for incremental bounded upgrade checking' and where are they from?"],"info":{}}
{"id":"train_4385","question":"Find the authors of 'A Greedy Algorithm for Optimally Pipelining a Reduction' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/LoweryL13> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'A Greedy Algorithm for Optimally Pipelining a Reduction' and where are they from?"],"info":{}}
{"id":"train_4386","question":"Find the authors of 'Distributed Multi-User Secret Sharing' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1801-04384> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1801-04384> ) }","paraphrases":["Who are the authors of the publication 'Distributed Multi-User Secret Sharing' and where did they publish other papers?"],"info":{}}
{"id":"train_4387","question":"List the authors of 'MPEG-4: Ein neuer Standard f\\u00FCr mehr Funktionalit\\u00E4t in Multimedia-Anwendungen' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/insk/Rautenberg99> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/insk/Rautenberg99> ) }","paraphrases":["Who are the authors of the publication 'MPEG-4: Ein neuer Standard f\\u00FCr mehr Funktionalit\\u00E4t in Multimedia-Anwendungen' and where did they publish other papers?"],"info":{}}
{"id":"train_4389","question":"Who are the authors of the publication 'The decay number and the maximum genus of diameter 2 graphs' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/dm/FuTX01> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/dm/FuTX01> ) }","paraphrases":["Who are the authors of the publication 'The decay number and the maximum genus of diameter 2 graphs' and what other papers did they publish?"],"info":{}}
{"id":"train_4390","question":"List the authors of 'OMG Agent Standardization' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/atal/Odell10> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/atal/Odell10> ) }","paraphrases":["Who are the authors of the publication 'OMG Agent Standardization' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4391","question":"Who are the authors of the publication 'The dimension of sums of graphs' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/dm/Alles85> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/dm/Alles85> ) }","paraphrases":["Who are the authors of the publication 'The dimension of sums of graphs' and where did they publish other papers?"],"info":{}}
{"id":"train_4392","question":"Find the authors of 'Application of Empirical Mode Decomposition to Remove the Wall Components in Doppler Ultrasound Signals: A Simulation Study' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/embc/ZhangGWCS06> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Application of Empirical Mode Decomposition to Remove the Wall Components in Doppler Ultrasound Signals: A Simulation Study' and where are they from?"],"info":{}}
{"id":"train_4396","question":"Who are the authors of the publication 'Architectural Frameworks: Defining the Contents of Architectural Descriptions' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/adaEurope/Emery99> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/adaEurope/Emery99> ) }","paraphrases":["Who are the authors of 'Architectural Frameworks: Defining the Contents of Architectural Descriptions' and which other papers did they publish?"],"info":{}}
{"id":"train_4397","question":"Find the authors of 'Dynamic Source Routing versus Greedy Routing in a Testbed Sensor Network Deployment' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ewsn/FreyP09> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/ewsn/FreyP09> ) }","paraphrases":["Who are the authors of 'Dynamic Source Routing versus Greedy Routing in a Testbed Sensor Network Deployment' and which other papers did they publish?"],"info":{}}
{"id":"train_4399","question":"List the authors of 'Secret key agreement from correlated source outputs using LDPC matrices' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/isit/Muramatsu04> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/isit/Muramatsu04> ) }","paraphrases":["Who are the authors of the publication 'Secret key agreement from correlated source outputs using LDPC matrices' and what other papers did they publish?"],"info":{}}
{"id":"train_4403","question":"Find the authors of 'Bias Correction in Reinforcement Learning via the Deterministic Policy Gradient Method for MPC-Based Policies' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/amcc/GrosZ21a> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Bias Correction in Reinforcement Learning via the Deterministic Policy Gradient Method for MPC-Based Policies' and where are they from?"],"info":{}}
{"id":"train_4406","question":"List the authors of 'An Enhanced Random Access With Inter-Frame Successive Interference Cancellation for Stationary Cellular IoT Networks' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/wcl/KimJ20> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'An Enhanced Random Access With Inter-Frame Successive Interference Cancellation for Stationary Cellular IoT Networks' and what are their affiliations?"],"info":{}}
{"id":"train_4408","question":"Find the authors of 'Few-Shot One-Class Domain Adaptation Based On Frequency For Iris Presentation Attack Detection' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icassp/LiLWCWP22> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icassp/LiLWCWP22> ) }","paraphrases":["List the authors of 'Few-Shot One-Class Domain Adaptation Based On Frequency For Iris Presentation Attack Detection' and the venues of the other papers they published."],"info":{}}
{"id":"train_4409","question":"Who are the authors of the publication 'Internet of things: a multiprotocol gateway as solution of the interoperability problem' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-2108-00098> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Internet of things: a multiprotocol gateway as solution of the interoperability problem' and where are they from?"],"info":{}}
{"id":"train_4410","question":"Find the authors of 'A resting-state fMRI study of patients with HIV infection based on regional homogeneity method' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icnc/QiuYLTWS11> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/icnc/QiuYLTWS11> ) }","paraphrases":["List the authors of 'A resting-state fMRI study of patients with HIV infection based on regional homogeneity method' and the other papers they published."],"info":{}}
{"id":"train_4411","question":"Find the authors of 'WOWA operators in fuzzy context sequences' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/eusflat/AlcaldeB15> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/eusflat/AlcaldeB15> ) }","paraphrases":["Who are the authors of the publication 'WOWA operators in fuzzy context sequences' and which other papers did they publish?"],"info":{}}
{"id":"train_4412","question":"Find the authors of 'Nearness of Objects Approximation Space Model Revisited' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/csp/PetersSS12> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/csp/PetersSS12> ) }","paraphrases":["Who are the authors of the publication 'Nearness of Objects Approximation Space Model Revisited' and what other papers did they publish?"],"info":{}}
{"id":"train_4413","question":"List the authors of 'Art school or trade school?' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/siggraph/LeckmanBBHMWW06> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/siggraph/LeckmanBBHMWW06> ) }","paraphrases":["Who are the authors of 'Art school or trade school?' and which other papers did they publish?"],"info":{}}
{"id":"train_4414","question":"Who are the authors of the publication 'Joint time delay and frequency offset estimation based on Fractional Fourier Transform' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ictc/NingGS12> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Joint time delay and frequency offset estimation based on Fractional Fourier Transform' and where are they from?"],"info":{}}
{"id":"train_4415","question":"List the authors of 'A High-Speed Camera-Based Approach to Massive Sound Sensing With Optical Wireless Acoustic Sensors' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tci/NavaNKSSHM15> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/tci/NavaNKSSHM15> ) }","paraphrases":["Who are the authors of the publication 'A High-Speed Camera-Based Approach to Massive Sound Sensing With Optical Wireless Acoustic Sensors' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4423","question":"List the authors of 'Complexity of Propositional Logics in Team Semantic' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tocl/HannulaKVV18> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/tocl/HannulaKVV18> ) }","paraphrases":["Find the authors of 'Complexity of Propositional Logics in Team Semantic' and the other papers they published."],"info":{}}
