{"id":"train_2928","question":"How many co-authors does Aria Nosratinia have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/25/2206> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/25/2206> ) }","paraphrases":["Count the number of co-authors that Aria N. has."],"info":{}}
{"id":"train_2929","question":"Report the average number of co-authors for publications published by Rolf-Detlef T..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/116/4016> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Rolf-Detlef Treede?"],"info":{}}
{"id":"train_2932","question":"Report the average number of co-authors for publications published by Zong-Shu Zou.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/234/6656> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Zong-Shu Zou?"],"info":{}}
{"id":"train_2933","question":"What is the average number of co-authors for papers published by P. R. S. Mendon\\u00E7a?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/99/1560> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Paulo R. S. Mendon\\u00E7a?"],"info":{}}
{"id":"train_2934","question":"How many research papers has Haluza, D. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/156/9068> }","paraphrases":["How many papers has Daniela Haluza published?"],"info":{}}
{"id":"train_2935","question":"How many co-authors does Michael B. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/73/4232> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/73/4232> ) }","paraphrases":["Count the number of co-authors that Michael Bourlakis has."],"info":{}}
{"id":"train_2937","question":"Report the average number of publications by Walter Kr\\u00E4mer per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/41/1169> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Kr\\u00E4mer, Walter per year?"],"info":{}}
{"id":"train_2938","question":"Report the average number of co-authors for publications published by R. B. France.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/f/RBFrance> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Robert B. France?"],"info":{}}
{"id":"train_2939","question":"What is the average number of co-authors for research papers published by Oscar P\\u00E9rez-Hern\\u00E1ndez?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/214/3719> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["Report the average number of co-authors for publications published by Oscar P\\u00E9rez-Hern\\u00E1ndez."],"info":{}}
{"id":"train_2940","question":"Report the average number of co-authors for publications published by Bengi Kara\\u00E7ali.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/93/4136> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Kara\\u00E7ali, B.?"],"info":{}}
{"id":"train_2942","question":"Report the average number of publications by S. Yun per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/23/8862> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Se-Young Yun per year?"],"info":{}}
{"id":"train_2943","question":"Count the number of papers that Pangfeng Liu has published in VEE.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/07/5712> . ?answer dblp:publishedIn 'VEE' }","paraphrases":["In International Conference on Virtual Execution Environments, how many papers has Pangfeng Liu published?"],"info":{}}
{"id":"train_2944","question":"Count the number of co-authors that Xiao F. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/60/4601-1> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/60/4601-1> ) }","paraphrases":["How many co-authors does Xiao Fu have?"],"info":{}}
{"id":"train_2946","question":"Count the number of co-authors that Xuanhua Shi has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/85/5317> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/85/5317> ) }","paraphrases":["How many co-authors does Xuanhua Shi have?"],"info":{}}
{"id":"train_2947","question":"Report the average number of publications by Cai, S. per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/156/6654> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Cai, S. per year?"],"info":{}}
{"id":"train_2948","question":"How many papers has L. Najman published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/4192> }","paraphrases":["How many research papers has L. Najman published?"],"info":{}}
{"id":"train_2949","question":"Mention the number of papers that Candy Schwartz has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/62/1343> }","paraphrases":["How many research papers has Candy Schwartz published?"],"info":{}}
{"id":"train_2950","question":"What is the average number of co-authors for papers published by E. G. Omodeo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/o/EugenioGOmodeo> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by E. G. Omodeo?"],"info":{}}
{"id":"train_2951","question":"Count the number of papers that Andries van Dam has published in IEEE Ann. Hist. Comput..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/d/AvDam> . ?answer dblp:publishedIn 'IEEE Ann. Hist. Comput.' }","paraphrases":["How many papers has Andries v. Dam published in IEEE Ann. Hist. Comput.?"],"info":{}}
{"id":"train_2952","question":"Count the number of co-authors that Vinay Sharma has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/43> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/95/43> ) }","paraphrases":["How many co-authors does Sharma, Vinay have?"],"info":{}}
{"id":"train_2953","question":"How many papers has Zhe T. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/24/5105> }","paraphrases":["Mention the number of papers that Zhe Tang has published."],"info":{}}
{"id":"train_2956","question":"How many co-authors does Randika Upathilake have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/168/6460> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/168/6460> ) }","paraphrases":["Count the number of co-authors that R. Upathilake has."],"info":{}}
{"id":"train_2958","question":"Count the number of papers that Amine Ettaieb has published in Open Syst. Inf. Dyn..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/286/2773> . ?answer dblp:publishedIn 'Open Syst. Inf. Dyn.' }","paraphrases":["Report the count of papers that Amine E. has published in Open Syst. Inf. Dyn.."],"info":{}}
{"id":"train_2959","question":"What is the average number of co-authors for papers published by Gowers, Timothy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/161/4074> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Gowers, Timothy?"],"info":{}}
{"id":"train_2960","question":"What is the average number of papers published by Francesco Borrelli per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/292> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Borrelli, Francesco per year?"],"info":{}}
{"id":"train_2961","question":"What is the average number of papers published by M. Fitter per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/3241> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author M. Fitter per year?"],"info":{}}
{"id":"train_2962","question":"Count the number of co-authors that Haifa Takruri has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/264/2073> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/264/2073> ) }","paraphrases":["How many co-authors does Haifa Takruri have?"],"info":{}}
{"id":"train_2963","question":"Count the number of co-authors that Prior, S. D. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/6341> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/67/6341> ) }","paraphrases":["How many co-authors does Stephen D. Prior have?"],"info":{}}
{"id":"train_2964","question":"What is the average number of co-authors for papers published by Wenyao Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/66/7894> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Wenyao Li?"],"info":{}}
{"id":"train_2966","question":"How many co-authors does Dai-Yon C. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/57/4944> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/57/4944> ) }","paraphrases":["Count the number of co-authors that Dai-Yon C. has."],"info":{}}
{"id":"train_2968","question":"How many research papers has Yu, P. S. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/y/PhilipSYu> }","paraphrases":["How many papers has Yu, P. S. published?"],"info":{}}
{"id":"train_2969","question":"Report the average number of publications by Carlo Reverberi per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/25/10746> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Carlo Reverberi per year?"],"info":{}}
{"id":"train_2971","question":"Report the count of papers that Huowang Chen has published in APWeb.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/40/5536> . ?answer dblp:publishedIn 'APWeb' }","paraphrases":["Count the number of papers that Chen, H. has published in APWeb."],"info":{}}
{"id":"train_2972","question":"Report the average number of publications by Syed V. Ahamed per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/99/1312> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Syed V. Ahamed per year?"],"info":{}}
{"id":"train_2974","question":"How many papers has Fiske, Stuart published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/55/1975> }","paraphrases":["How many research papers has Stuart Fiske published?"],"info":{}}
{"id":"train_2975","question":"Count the number of co-authors that Teresa Olwick Grose has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/85/446> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/85/446> ) }","paraphrases":["How many co-authors does T. Olwick Grose have?"],"info":{}}
{"id":"train_2976","question":"How many co-authors does Juan Gabriel Pedroza Bernal have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/138/6625> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/138/6625> ) }","paraphrases":["Count the number of co-authors that Juan Gabriel Pedroza Bernal has."],"info":{}}
{"id":"train_2977","question":"Report the average number of co-authors for publications published by Gokul B. Nair.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/258/3087> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Gokul B. Nair?"],"info":{}}
{"id":"train_2978","question":"Report the count of papers that Ed Fronczak has published in International Symposium on Software Reliability Engineering.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/161/8907> . ?answer dblp:publishedIn 'ISSRE' }","paraphrases":["Count the number of papers that Fronczak, E. has published in ISSRE."],"info":{}}
{"id":"train_2979","question":"How many papers has Noor Shamsiah Othman published in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/200/8431> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["In CoRR, how many papers has N. Shamsiah Othman published?"],"info":{}}
{"id":"train_2980","question":"Mention the number of papers that Gang X. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/11/2966> }","paraphrases":["How many papers has Gang Xiao published?"],"info":{}}
{"id":"train_2982","question":"Report the count of papers that Ijaz A. has published in IEEE Workshop on Applications of Computer Vision.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/78/4347> . ?answer dblp:publishedIn 'WACV' }","paraphrases":["How many papers has Ijaz A. published in WACV?"],"info":{}}
{"id":"train_2983","question":"Mention the number of papers that Zbynek Falt has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/57/10154> }","paraphrases":["How many papers has Zbynek F. published?"],"info":{}}
{"id":"train_2984","question":"How many co-authors does Gabriele Borocci have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/219/3385> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/219/3385> ) }","paraphrases":["Count the number of co-authors that Gabriele Borocci has."],"info":{}}
{"id":"train_2985","question":"Mention the number of papers that C. Edward Chow has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/c/CEChow> }","paraphrases":["How many research papers has C. Edward Chow published?"],"info":{}}
{"id":"train_2986","question":"What is the average number of papers published by Utpal Garain per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/81/4230> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Garain, U. per year?"],"info":{}}
{"id":"train_2987","question":"How many papers has Koushik Sen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/04/418> }","paraphrases":["Mention the number of papers that Koushik Sen has published."],"info":{}}
{"id":"train_2988","question":"Count the number of co-authors that Yier Jin has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/34/756> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/34/756> ) }","paraphrases":["How many co-authors does Yier Jin have?"],"info":{}}
{"id":"train_2989","question":"How many papers has Michele Apuzzo published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/2843> }","paraphrases":["How many research papers has M. Apuzzo published?"],"info":{}}
{"id":"train_2990","question":"How many papers has M. Balagia published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/220/2206> }","paraphrases":["Mention the number of papers that M. Balagia has published."],"info":{}}
{"id":"train_2991","question":"Mention the number of papers that Zhang, Jianzhong has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/78/6091-2> }","paraphrases":["How many research papers has Jianzhong Zhang published?"],"info":{}}
{"id":"train_2992","question":"Report the average number of publications by P. Melin per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/44/1632> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by P. Melin per year?"],"info":{}}
{"id":"train_2993","question":"How many papers has Chung, Wen-Ching published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/86/5687> }","paraphrases":["How many research papers has Wen-Ching Chung published?"],"info":{}}
{"id":"train_2995","question":"Report the count of papers that Lu, Qing has published in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/62/4337> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["How many papers has Lu, Qing published in CoRR?"],"info":{}}
{"id":"train_2996","question":"Count the number of co-authors that Bin Chen has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/22/5523> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/22/5523> ) }","paraphrases":["How many co-authors does Bin Chen have?"],"info":{}}
{"id":"train_2998","question":"What is the average number of papers published by R. Gorrieri per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/g/RobertoGorrieri> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Roberto Gorrieri per year."],"info":{}}
{"id":"train_2999","question":"How many research papers has Benedikt Wiestler published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/165/7294> }","paraphrases":["How many papers has Benedikt Wiestler published?"],"info":{}}
{"id":"train_3000","question":"What is the average number of co-authors for papers published by Ren, J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/r/JieRen-13> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Ren, J.?"],"info":{}}
{"id":"train_3003","question":"What is the average number of papers published by T. Uemoto per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/155/4683> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Takuya Uemoto per year."],"info":{}}
{"id":"train_3004","question":"How many co-authors does Margot, Fran\\u00E7ois have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/73/412> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/73/412> ) }","paraphrases":["Count the number of co-authors that Margot, Fran\\u00E7ois has."],"info":{}}
{"id":"train_3007","question":"Report the average number of co-authors for publications published by T. Okazaki.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/2749> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by T. Okazaki?"],"info":{}}
{"id":"train_3008","question":"Report the average number of co-authors for publications published by Mona Mehrandish.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/3263> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Mehrandish, M.?"],"info":{}}
{"id":"train_3009","question":"Report the average number of publications by Valeriy Hlukhov per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/235/6445> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Valeriy H. per year?"],"info":{}}
{"id":"train_3010","question":"Report the average number of co-authors for publications published by Ghatee, Mehdi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/18/331> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Ghatee, Mehdi?"],"info":{}}
{"id":"train_3011","question":"What is the average number of research papers published by the author Tobias Eggendorfer per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/71/3785> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Tobias Eggendorfer per year?"],"info":{}}
{"id":"train_3012","question":"How many research papers has Thomas, J. C. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/50/2929> }","paraphrases":["How many papers has Thomas, J. C. published?"],"info":{}}
{"id":"train_3014","question":"Mention the number of papers that Herzog, R. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/23/2253> }","paraphrases":["How many papers has Rupert Herzog published?"],"info":{}}
{"id":"train_3016","question":"How many papers has J. Lim published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/97/4360> }","paraphrases":["Mention the number of papers that Johan Lim has published."],"info":{}}
{"id":"train_3017","question":"How many co-authors does Jes\\u00FAs Manuel Almendros-Jim\\u00E9nez have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/a/JesusManuelAlmendrosJimenez> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/a/JesusManuelAlmendrosJimenez> ) }","paraphrases":["Count the number of co-authors that Jes\\u00FAs Manuel Almendros-Jim\\u00E9nez has."],"info":{}}
{"id":"train_3019","question":"What is the average number of papers published by Hyunjun Lim per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/235/4467> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Lim, H. per year?"],"info":{}}
{"id":"train_3021","question":"Mention the number of papers that Chen, R. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/69/8073-1> }","paraphrases":["How many papers has Chen, R. published?"],"info":{}}
{"id":"train_3023","question":"Report the average number of publications by Ratna Babu Chinnam per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/3814> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Ratna Babu Chinnam per year?"],"info":{}}
{"id":"train_3024","question":"Mention the number of papers that K. Sch\\u00FCtzer has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/178/8251> }","paraphrases":["How many research papers has K. Sch\\u00FCtzer published?"],"info":{}}
{"id":"train_3025","question":"How many research papers has Vinicius M. Silva published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/211/9809> }","paraphrases":["Mention the number of papers that Vinicius M. Silva has published."],"info":{}}
{"id":"train_3026","question":"How many papers has Sergei V. Chekanov published in Advanced Information and Knowledge Processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/21/6272> . ?answer dblp:publishedIn 'Advanced Information and Knowledge Processing' }","paraphrases":["In Advanced Information and Knowledge Processing, how many papers has Chekanov, S. V. published?"],"info":{}}
{"id":"train_3027","question":"What is the average number of research papers published by the author Fillipe D. M. de Souza per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/151/8862> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Souza, F. D. M. de per year?"],"info":{}}
{"id":"train_3028","question":"How many papers has Alexandru G. Floares published in CIBB?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/77/8343> . ?answer dblp:publishedIn 'CIBB' }","paraphrases":["In CIBB, how many papers has Alexandru G. Floares published?"],"info":{}}
