{"id":"train_4839","question":"Did the authors of 'Improving statistical word alignment with various clues' also publish a paper in the venue NEMS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mtsummit/Ren0007> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/mtsummit/Ren0007> ) . ?y dblp:publishedIn 'NEMS' }","paraphrases":["Did the authors of the publication 'Improving statistical word alignment with various clues' also publish a publication in NEMS?"],"info":{}}
{"id":"train_4844","question":"Did the authors of the publication 'Modeling the Evolution of Regulatory Elements by Simultaneous Detection and Alignment with Phylogenetic Pair HMMs' also publish a publication in Int. J. Comput. Intell. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ploscb/MajorosO10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ploscb/MajorosO10> ) . ?y dblp:publishedIn 'Int. J. Comput. Intell. Syst.' }","paraphrases":["Did the authors of 'Modeling the Evolution of Regulatory Elements by Simultaneous Detection and Alignment with Phylogenetic Pair HMMs' also publish a paper in the venue Int. J. Comput. Intell. Syst.?"],"info":{}}
{"id":"train_4846","question":"Did the authors of the publication 'Fiscal policy in a Lucasian general equilibrium modelwith productive government spending' also publish a publication in IEEE Trans. Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/anor/Wohrmann99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/anor/Wohrmann99> ) . ?y dblp:publishedIn 'IEEE Trans. Commun.' }","paraphrases":["Did the authors of 'Fiscal policy in a Lucasian general equilibrium modelwith productive government spending' also publish a paper in the venue IEEE Trans. Commun.?"],"info":{}}
{"id":"train_4848","question":"Did the authors of 'Design of Autonomic SLA Manager for Service Applications' also publish a paper in GMAG?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icebe/ChoiCK07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icebe/ChoiCK07> ) . ?y dblp:publishedIn 'GMAG' }","paraphrases":["Did the authors of the paper 'Design of Autonomic SLA Manager for Service Applications' also publish a publication in GMAG?"],"info":{}}
{"id":"train_4851","question":"Did the authors of 'Simple and efficient algorithms for computing exact cumulative discrete probabilities and its inverses' also publish a paper in the venue Sensors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cstat/Krzensk04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cstat/Krzensk04> ) . ?y dblp:publishedIn 'Sensors' }","paraphrases":["Did the authors of the paper 'Simple and efficient algorithms for computing exact cumulative discrete probabilities and its inverses' also publish a publication in Sensors?"],"info":{}}
{"id":"train_4855","question":"Was the publication 'Learning Robust Agents for Visual Navigation in Dynamic Environments: The Winning Entry of iGibson Challenge 2021' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2109-10493> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Learning Robust Agents for Visual Navigation in Dynamic Environments: The Winning Entry of iGibson Challenge 2021' published in 2021?"],"info":{}}
{"id":"train_4857","question":"Was 'Blockchain technology and smart contract for civil structural health monitoring system' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacie/XuLH21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Blockchain technology and smart contract for civil structural health monitoring system' published in the year 2021?"],"info":{}}
{"id":"train_4858","question":"Did the authors of the publication 'Improved intra prediction for high definition video using localized horizontal spatial prediction' also publish 'On Mean Field Games for Agents With Langevin Dynamics'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icip/WuTXWL10> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tcns/BakshiGT19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/tcns/BakshiGT19> != <https://dblp.org/rec/conf/icip/WuTXWL10> ) }","paraphrases":["Did the authors of the publication 'Improved intra prediction for high definition video using localized horizontal spatial prediction' also publish the paper 'On Mean Field Games for Agents With Langevin Dynamics'?"],"info":{}}
{"id":"train_4859","question":"Was the publication 'Parallel Multilevel Algorithms for Multi-constraint Graph Partitioning (Distinguished Paper)' published in 2000?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/europar/SchloegelKK00> dblp:yearOfPublication '2000' }","paraphrases":["Was the publication 'Parallel Multilevel Algorithms for Multi-constraint Graph Partitioning (Distinguished Paper)' published in the year 2000?"],"info":{}}
{"id":"train_4860","question":"Did the authors of the publication 'Data formats for high efficiency coding of Lytro-Illum light fields' also publish a publication in KR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ipta/VieiraDPTA15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ipta/VieiraDPTA15> ) . ?y dblp:publishedIn 'KR' }","paraphrases":["Did the authors of the publication 'Data formats for high efficiency coding of Lytro-Illum light fields' publish other papers in KR?"],"info":{}}
{"id":"train_4861","question":"Was 'CSCW research @ Latin America' published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/interactions/LopezSGG19> dblp:yearOfPublication '2019' }","paraphrases":["Was the paper 'CSCW research @ Latin America' published in the year 2019?"],"info":{}}
{"id":"train_4864","question":"Did the authors of the paper 'Digital signal processing for data converters in mixed-signal systems' also publish a publication in Conference on Learning Theory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ei/VogelMSD09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ei/VogelMSD09> ) . ?y dblp:publishedIn 'COLT' }","paraphrases":["Did the authors of the publication 'Digital signal processing for data converters in mixed-signal systems' also publish a publication in COLT?"],"info":{}}
{"id":"train_4867","question":"Did the authors of the publication 'Metric Reconstruction with Missing Data under Weak Perspective' also publish 'Multiple Gaussian Mixture Models for Image Registration'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bmvc/PernekHK08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ieicet/YeLZ14> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/ieicet/YeLZ14> != <https://dblp.org/rec/conf/bmvc/PernekHK08> ) }","paraphrases":["Did the authors of the publication 'Metric Reconstruction with Missing Data under Weak Perspective' also publish the paper 'Multiple Gaussian Mixture Models for Image Registration'?"],"info":{}}
{"id":"train_4868","question":"Did the authors of the publication 'Simulation Method of SAR Raw Echo for Urban Scene' publish other papers in Selected Areas in Cryptography?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icisp/ZhengZZL08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icisp/ZhengZZL08> ) . ?y dblp:publishedIn 'SAC' }","paraphrases":["Did the authors of the paper 'Simulation Method of SAR Raw Echo for Urban Scene' also publish a publication in SAC?"],"info":{}}
{"id":"train_4870","question":"Was the publication 'Experiments on Personal Opinion Expression and Consensus Building using ' published in 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iucs/ItayaKTDY08> dblp:yearOfPublication '2008' }","paraphrases":["Was the paper 'Experiments on Personal Opinion Expression and Consensus Building using ' published in the year 2008?"],"info":{}}
{"id":"train_4873","question":"Did the authors of 'Strongly Secure Authenticated Key Exchange without NAXOS' Approach under Computational Diffie-Hellman Assumption' also publish a paper in Visual Information Processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ieicet/KimFU12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ieicet/KimFU12> ) . ?y dblp:publishedIn 'Visual Information Processing' }","paraphrases":["Did the authors of the publication 'Strongly Secure Authenticated Key Exchange without NAXOS' Approach under Computational Diffie-Hellman Assumption' publish other papers in Visual Information Processing?"],"info":{}}
{"id":"train_4874","question":"Do the authors of 'Visual and Affective Multimodal Models of Word Meaning in Language and Mind' have University of New South Wales, School of Psychology, Australia as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cogsci/DeyneNCP21> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of New South Wales, School of Psychology, Australia' }","paraphrases":["Is University of New South Wales the primary affiliation of the authors of 'Visual and Affective Multimodal Models of Word Meaning in Language and Mind'?"],"info":{}}
{"id":"train_4876","question":"Was the paper 'Zoom on the Keystrokes: Exploiting Video Calls for Keystroke Inference Attacks' published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2010-12078> dblp:yearOfPublication '2020' }","paraphrases":["Was 'Zoom on the Keystrokes: Exploiting Video Calls for Keystroke Inference Attacks' published in 2020?"],"info":{}}
{"id":"train_4877","question":"Was the publication 'A Hybrid Continuous Time Incremental and SAR Two-Step ADC with 905dB DR over 1MHz BW' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/asscc/WangDHSZKZSHTT21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'A Hybrid Continuous Time Incremental and SAR Two-Step ADC with 905dB DR over 1MHz BW' published in 2021?"],"info":{}}
{"id":"train_4879","question":"Did the authors of the publication 'Cost optimal scheduling in IaaS for dependent workload with particle swarm optimization' also publish the paper 'Efficient Transaction Nesting in Hardware Transactional Memory'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tjs/NetjindaSA14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/arcs/LiuSZWZLQ10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/arcs/LiuSZWZLQ10> != <https://dblp.org/rec/journals/tjs/NetjindaSA14> ) }","paraphrases":["Did the authors of the paper 'Cost optimal scheduling in IaaS for dependent workload with particle swarm optimization' also publish the publication 'Efficient Transaction Nesting in Hardware Transactional Memory'?"],"info":{}}
{"id":"train_4880","question":"Is University of Groningen the primary affiliation of the authors of 'Henry Prakken (1997) Logical Tools for Modelling Legal Argument A Study of Defeasible Reasoning in Law'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ail/Verheij00> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Groningen, The Netherlands' }","paraphrases":["Do the authors of 'Henry Prakken (1997) Logical Tools for Modelling Legal Argument A Study of Defeasible Reasoning in Law' have University of Groningen as their primary affiliation?"],"info":{}}
{"id":"train_4881","question":"Did the authors of the paper 'Accelerating multi-user large vocabulary continuous speech recognition on heterogeneous CPU-GPU platforms' also publish the publication 'On the minimum length of linear codes over F5'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/KimL16> dblp:authoredBy ?x . <https://dblp.org/rec/journals/dm/BouyuklievKM15> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/dm/BouyuklievKM15> != <https://dblp.org/rec/conf/icassp/KimL16> ) }","paraphrases":["Did the authors of 'Accelerating multi-user large vocabulary continuous speech recognition on heterogeneous CPU-GPU platforms' also publish 'On the minimum length of linear codes over F5'?"],"info":{}}
{"id":"train_4882","question":"Did the authors of 'Automated Benchmarking of Functional Data Structures' also publish a paper in the venue IGARSS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/padl/MossR99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/padl/MossR99> ) . ?y dblp:publishedIn 'IGARSS' }","paraphrases":["Did the authors of the publication 'Automated Benchmarking of Functional Data Structures' publish other papers in IEEE International Geoscience and Remote Sensing Symposium?"],"info":{}}
{"id":"train_4884","question":"Did the authors of 'Scaling of back-propagation training time to large dimensions' also publish the publication 'SPEX: A Generic Framework for Enhancing Neural Social Recommendation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcnn/WilenskyN90> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tois/0057LX0LJ22> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/tois/0057LX0LJ22> != <https://dblp.org/rec/conf/ijcnn/WilenskyN90> ) }","paraphrases":["Did the authors of the paper 'Scaling of back-propagation training time to large dimensions' also publish the paper 'SPEX: A Generic Framework for Enhancing Neural Social Recommendation'?"],"info":{}}
{"id":"train_4885","question":"Did the authors of 'Relational Learning Between Multiple Pulmonary Nodules via Deep Set Attention Transformers' also publish a paper in the venue Comput. Intell.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isbi/YangDHNX20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/isbi/YangDHNX20> ) . ?y dblp:publishedIn 'Comput. Intell.' }","paraphrases":["Did the authors of the publication 'Relational Learning Between Multiple Pulmonary Nodules via Deep Set Attention Transformers' also publish a publication in Comput. Intell.?"],"info":{}}
{"id":"train_4886","question":"Was the publication 'On the efficiency of classical RASTA filtering for continuous speech recognition: Keeping the balance between acoustic pre-processing and acoustic modelling' published in the year 2003?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/speech/VethB03> dblp:yearOfPublication '2003' }","paraphrases":["Was the publication 'On the efficiency of classical RASTA filtering for continuous speech recognition: Keeping the balance between acoustic pre-processing and acoustic modelling' published in 2003?"],"info":{}}
{"id":"train_4887","question":"Was the paper 'Integral Approximations for Coverage Probability' published in the year 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/GuruacharyaTH15> dblp:yearOfPublication '2015' }","paraphrases":["Was the publication 'Integral Approximations for Coverage Probability' published in 2015?"],"info":{}}
{"id":"train_4888","question":"Was the publication 'ES2: Data centers to support tomorrow's cloud' published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isscc/ChangAHC14> dblp:yearOfPublication '2014' }","paraphrases":["Was the paper 'ES2: Data centers to support tomorrow's cloud' published in the year 2014?"],"info":{}}
{"id":"train_4889","question":"Was the publication 'Optimized fuzzy clustering in wireless sensor networks using improved squirrel search algorithm' published in the year 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fss/Le-NgocTBRH22> dblp:yearOfPublication '2022' }","paraphrases":["Was 'Optimized fuzzy clustering in wireless sensor networks using improved squirrel search algorithm' published in 2022?"],"info":{}}
{"id":"train_4890","question":"Did the authors of the paper 'Reliable Data Fusion of Hierarchical Wireless Sensor Networks With Asynchronous Measurement for Greenhouse Monitoring' also publish the publication 'Journal of Real-Time Image Processing: second issue of volume 15'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcst/BaiWSW19> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jrtip/KehtarnavazC18a> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/jrtip/KehtarnavazC18a> != <https://dblp.org/rec/journals/tcst/BaiWSW19> ) }","paraphrases":["Did the authors of 'Reliable Data Fusion of Hierarchical Wireless Sensor Networks With Asynchronous Measurement for Greenhouse Monitoring' also publish 'Journal of Real-Time Image Processing: second issue of volume 15'?"],"info":{}}
{"id":"train_4892","question":"Is University of Duisburg-Essen the primary affiliation of the authors of 'Online Self-Presentation: Balancing Privacy Concerns and Impression Construction on Social Networking Sites'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/daglib/p/KramerH11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Duisburg-Essen, Germany' }","paraphrases":["Do the authors of 'Online Self-Presentation: Balancing Privacy Concerns and Impression Construction on Social Networking Sites' have University of Duisburg-Essen, Germany as their primary affiliation?"],"info":{}}
{"id":"train_4894","question":"Did the authors of the publication 'Variational Autoencoders for Deforming 3D Mesh Models' publish other papers in HMD Prax. Wirtsch.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cvpr/Tan0LX18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cvpr/Tan0LX18> ) . ?y dblp:publishedIn 'HMD Prax. Wirtsch.' }","paraphrases":["Did the authors of 'Variational Autoencoders for Deforming 3D Mesh Models' also publish a paper in HMD Prax. Wirtsch.?"],"info":{}}
{"id":"train_4895","question":"Was the publication 'Dynamic programming approach to discrete time dynamic feedback Stackelberg games with independent and dependent followers' published in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eor/NieCF06> dblp:yearOfPublication '2006' }","paraphrases":["Was the publication 'Dynamic programming approach to discrete time dynamic feedback Stackelberg games with independent and dependent followers' published in the year 2006?"],"info":{}}
{"id":"train_4896","question":"Did the authors of the publication 'Cloud of Line Distribution and Random Forest Based Text Detection from Natural/Video Scene Images' also publish a publication in ECOC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mmm/WangWSL18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/mmm/WangWSL18> ) . ?y dblp:publishedIn 'ECOC' }","paraphrases":["Did the authors of 'Cloud of Line Distribution and Random Forest Based Text Detection from Natural/Video Scene Images' also publish a paper in the venue ECOC?"],"info":{}}
{"id":"train_4899","question":"Did the authors of 'Achieving transparency for teleoperator systems under position and rate control' also publish the publication 'Quadratic Integer Programming: Complexity and Equivalent Forms'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iros/ZhuS95> dblp:authoredBy ?x . <https://dblp.org/rec/reference/opt/ChaovalitwongseAP09> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/reference/opt/ChaovalitwongseAP09> != <https://dblp.org/rec/conf/iros/ZhuS95> ) }","paraphrases":["Did the authors of the publication 'Achieving transparency for teleoperator systems under position and rate control' also publish the paper 'Quadratic Integer Programming: Complexity and Equivalent Forms'?"],"info":{}}
{"id":"train_4901","question":"Wasn't the paper 'Controlling passage through resonances in vibratory actuators' published in the year 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eucc/TomchinaN99> dblp:yearOfPublication '1999' FILTER NOT EXISTS { <https://dblp.org/rec/conf/eucc/TomchinaN99> dblp:yearOfPublication '1999' } }","paraphrases":["Wasn't the publication 'Controlling passage through resonances in vibratory actuators' published in 1999?"],"info":{}}
{"id":"train_4903","question":"Was 'WebCanal: A Multicast Web Application' not published in 1997?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cn/Liao97> dblp:yearOfPublication '1997' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cn/Liao97> dblp:yearOfPublication '1997' } }","paraphrases":["Wasn't the paper 'WebCanal: A Multicast Web Application' published in the year 1997?"],"info":{}}
{"id":"train_4906","question":"Did the authors of 'Semantic Segmentation of the Growth Stages of Plasmodium Parasites using Convolutional Neural Networks' not publish a paper in AFRICON?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/africon/AladagoTR19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/africon/AladagoTR19> ) . ?y dblp:publishedIn 'AFRICON' FILTER NOT EXISTS { <https://dblp.org/rec/conf/africon/AladagoTR19> dblp:publishedIn 'AFRICON' } }","paraphrases":["Have the authors of the paper 'Semantic Segmentation of the Growth Stages of Plasmodium Parasites using Convolutional Neural Networks' not published a publication in AFRICON?"],"info":{}}
{"id":"train_4907","question":"Wasn't the publication 'Stochastic cyclic flow lines: non-blocking, Markovian models' published in 1998?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jors/LeeS98> dblp:yearOfPublication '1998' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jors/LeeS98> dblp:yearOfPublication '1998' } }","paraphrases":["Was 'Stochastic cyclic flow lines: non-blocking, Markovian models' not published in 1998?"],"info":{}}
{"id":"train_4908","question":"Wasn't the publication 'Reducing audio membership inference attack accuracy to chance: 4 defenses' published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1911-01888> dblp:yearOfPublication '2019' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1911-01888> dblp:yearOfPublication '2019' } }","paraphrases":["Wasn't the paper 'Reducing audio membership inference attack accuracy to chance: 4 defenses' published in the year 2019?"],"info":{}}
{"id":"train_4909","question":"Wasn't the paper 'Analysis of conditional resource sharing using a guard-based control representation' published in the year 1995?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccd/RadivojevicB95> dblp:yearOfPublication '1995' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccd/RadivojevicB95> dblp:yearOfPublication '1995' } }","paraphrases":["Was 'Analysis of conditional resource sharing using a guard-based control representation' not published in 1995?"],"info":{}}
{"id":"train_4910","question":"Was 'Domain ontologies and wordnets in OWL: Modelling options' not published in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ldvf/LungenS07> dblp:yearOfPublication '2007' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ldvf/LungenS07> dblp:yearOfPublication '2007' } }","paraphrases":["Wasn't the paper 'Domain ontologies and wordnets in OWL: Modelling options' published in the year 2007?"],"info":{}}
{"id":"train_4911","question":"Wasn't the paper 'A converged network architecture for ICT and IoT combined applications' published in the year 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apnoms/TangCTJT16> dblp:yearOfPublication '2016' FILTER NOT EXISTS { <https://dblp.org/rec/conf/apnoms/TangCTJT16> dblp:yearOfPublication '2016' } }","paraphrases":["Was 'A converged network architecture for ICT and IoT combined applications' not published in 2016?"],"info":{}}
{"id":"train_4912","question":"Was 'A Device-to-Device Communication-Based Disaster Response Network' not published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tccn/MoghaddamUG18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tccn/MoghaddamUG18> dblp:yearOfPublication '2018' } }","paraphrases":["Wasn't the publication 'A Device-to-Device Communication-Based Disaster Response Network' published in 2018?"],"info":{}}
{"id":"train_4913","question":"Did the authors of the publication 'Deadzone compensation of an XY-positioning table using fuzzy logic' not publish a paper in IEEE Trans. Ind. Electron.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tie/Jang05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tie/Jang05> ) . ?y dblp:publishedIn 'IEEE Trans. Ind. Electron.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tie/Jang05> dblp:publishedIn 'IEEE Trans. Ind. Electron.' } }","paraphrases":["Haven't the authors of the publication 'Deadzone compensation of an XY-positioning table using fuzzy logic' published a publication in IEEE Trans. Ind. Electron.?"],"info":{}}
{"id":"train_4914","question":"Wasn't the paper 'Security Policy Management for Handheld Devices' published in the year 2003?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/csreaSAM/JansenKIGK03> dblp:yearOfPublication '2003' FILTER NOT EXISTS { <https://dblp.org/rec/conf/csreaSAM/JansenKIGK03> dblp:yearOfPublication '2003' } }","paraphrases":["Was 'Security Policy Management for Handheld Devices' not published in 2003?"],"info":{}}
{"id":"train_4916","question":"Wasn't the publication 'Towards a Model for Hardware and Software Functional Partitioning' published in 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/codes/VahidL96> dblp:yearOfPublication '1996' FILTER NOT EXISTS { <https://dblp.org/rec/conf/codes/VahidL96> dblp:yearOfPublication '1996' } }","paraphrases":["Was 'Towards a Model for Hardware and Software Functional Partitioning' not published in 1996?"],"info":{}}
{"id":"train_4917","question":"Wasn't the publication 'A hypertext software package to help document system designs' published in 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsmc/ChapmanB93> dblp:yearOfPublication '1993' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tsmc/ChapmanB93> dblp:yearOfPublication '1993' } }","paraphrases":["Was 'A hypertext software package to help document system designs' not published in 1993?"],"info":{}}
{"id":"train_4918","question":"Have the authors of the paper 'DSES: A Blockchain-Powered Decentralized Service Eco-System' not published the paper 'A Verifiable E-Lottery Scheme'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEcloud/GaoFWZC18> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ml4cs/ZhangAZY20> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ml4cs/ZhangAZY20> != <https://dblp.org/rec/conf/IEEEcloud/GaoFWZC18> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/IEEEcloud/GaoFWZC18> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ml4cs/ZhangAZY20> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ml4cs/ZhangAZY20> != <https://dblp.org/rec/conf/IEEEcloud/GaoFWZC18> ) } }","paraphrases":["Haven't the authors of the publication 'DSES: A Blockchain-Powered Decentralized Service Eco-System' published the paper 'A Verifiable E-Lottery Scheme'?"],"info":{}}
{"id":"train_4920","question":"Wasn't the publication 'Queen bee generation method in hive and its application in sensor networks' published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cts/Mahata12> dblp:yearOfPublication '2012' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cts/Mahata12> dblp:yearOfPublication '2012' } }","paraphrases":["Wasn't the paper 'Queen bee generation method in hive and its application in sensor networks' published in the year 2012?"],"info":{}}
{"id":"train_4921","question":"Haven't the authors of the publication 'The design and recording of icy, a corpus for the study of intraspeaker variability and the characterisation of speaking styles' published a publication in EUROSPEECH?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/interspeech/PeanWE93> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/interspeech/PeanWE93> ) . ?y dblp:publishedIn 'EUROSPEECH' FILTER NOT EXISTS { <https://dblp.org/rec/conf/interspeech/PeanWE93> dblp:publishedIn 'EUROSPEECH' } }","paraphrases":["Did the authors of 'The design and recording of icy, a corpus for the study of intraspeaker variability and the characterisation of speaking styles' not publish a paper in EUROSPEECH?"],"info":{}}
{"id":"train_4922","question":"Did the authors of the publication 'A Distributed Neural Filter for Finding Depth- k Skyline Friends in Social Networks' not publish a paper in J. Inf. Sci. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jise/ChenS18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jise/ChenS18> ) . ?y dblp:publishedIn 'J. Inf. Sci. Eng.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jise/ChenS18> dblp:publishedIn 'J. Inf. Sci. Eng.' } }","paraphrases":["Haven't the authors of the publication 'A Distributed Neural Filter for Finding Depth- k Skyline Friends in Social Networks' published a publication in J. Inf. Sci. Eng.?"],"info":{}}
{"id":"train_4923","question":"Wasn't the paper 'Robust non-fragile guaranteed cost control of uncertain large-scale systems with time-delays in subsystem interconnections' published in the year 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijsysc/Park04> dblp:yearOfPublication '2004' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijsysc/Park04> dblp:yearOfPublication '2004' } }","paraphrases":["Wasn't the publication 'Robust non-fragile guaranteed cost control of uncertain large-scale systems with time-delays in subsystem interconnections' published in 2004?"],"info":{}}
{"id":"train_4924","question":"Was 'Adaptive Metric Learning for Saliency Detection' not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tip/LiLLSP15a> dblp:yearOfPublication '2015' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tip/LiLLSP15a> dblp:yearOfPublication '2015' } }","paraphrases":["Wasn't the publication 'Adaptive Metric Learning for Saliency Detection' published in 2015?"],"info":{}}
