{"id":"train_2728","question":"Which author named V. published the paper on Sar stereo processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tgrs/YockyJ07> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Sar stereo processing and has the name Charles."],"info":{}}
{"id":"train_2730","question":"Mention the publication on Document images that was published by Nibaran in ACSS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/84/4930> . ?answer dblp:publishedIn 'ACSS (1)' }","paraphrases":["Which paper on Document images was published by Das in ACSS?"],"info":{}}
{"id":"train_2731","question":"Which author named Mitchell published the paper on Disease biomarker database?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/nar/YangRCKOMKOK08> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Disease biomarker database and has the name P.?"],"info":{}}
{"id":"train_2734","question":"Which research paper on Vector flow was published by Mandal in ICPR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/m/MrinalKMandal> . ?answer dblp:publishedIn 'ICPR' }","paraphrases":["Which paper on Vector flow was published by Mandal in ICPR?"],"info":{}}
{"id":"train_2735","question":"Name the venue in which Mikhail published the paper about Hausdorff distance.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dasfaa/ZhuravskiiKPM21> dblp:authoredBy <https://dblp.org/pid/00/2851> . <https://dblp.org/rec/conf/dasfaa/ZhuravskiiKPM21> dblp:publishedIn ?answer }","paraphrases":["Mikhail published the paper on Hausdorff distance in which venue?"],"info":{}}
{"id":"train_2738","question":"Which author named Vahidpour published the paper on Performance analysis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2001-08981> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Performance analysis and has the name Vahidpour?"],"info":{}}
{"id":"train_2739","question":"Mention the publication on Recommender systems that was published by Farzad in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/186/0056> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which research paper on Recommender systems was published by Eskandanian in CoRR?"],"info":{}}
{"id":"train_2740","question":"Name the author who published the paper on Error propagation and has the name William.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/bmvc/ChristmasKP96> dblp:authoredBy ?answer }","paraphrases":["Which author named Christmas published the paper on Error propagation?"],"info":{}}
{"id":"train_2741","question":"Which paper on Piv technique was published by Xizheng in ICAIT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/6150> . ?answer dblp:publishedIn 'ICAIT' }","paraphrases":["Which research paper on Piv technique was published by Ke in ICAIT?"],"info":{}}
{"id":"train_2742","question":"In which venue did Masuhara publish the paper about Safety mechanism?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/scp/KaminaAMI18> dblp:authoredBy <https://dblp.org/pid/89/3070> . <https://dblp.org/rec/journals/scp/KaminaAMI18> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Masuhara published the paper about Safety mechanism."],"info":{}}
{"id":"train_2743","question":"In which venue did Chen publish the paper about Capabilities perspective?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijinfoman/ChenSHJ08> dblp:authoredBy <https://dblp.org/pid/89/4376> . <https://dblp.org/rec/journals/ijinfoman/ChenSHJ08> dblp:publishedIn ?answer }","paraphrases":["Ruey-Shun published the paper on Capabilities perspective in which venue?"],"info":{}}
{"id":"train_2744","question":"Mention the publication on Fault diagnosis that was published by Chen in Int. J. Pattern Recognit. Artif. Intell..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/7627> . ?answer dblp:publishedIn 'Int. J. Pattern Recognit. Artif. Intell.' }","paraphrases":["Which research paper on Fault diagnosis was published by Chen in Int. J. Pattern Recognit. Artif. Intell.?"],"info":{}}
{"id":"train_2746","question":"Which paper on Vibration compensation was published by Csiszar in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/172/6798> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which research paper on Vibration compensation was published by Csiszar in CoRR?"],"info":{}}
{"id":"train_2747","question":"Name the venue in which Peter published the paper about Cam technology.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ifip5-7/Winkler91> dblp:authoredBy <https://dblp.org/pid/w/PeterWinkler> . <https://dblp.org/rec/conf/ifip5-7/Winkler91> dblp:publishedIn ?answer }","paraphrases":["In which venue did Winkler publish the paper about Cam technology?"],"info":{}}
{"id":"train_2748","question":"Mention the publication on Network model that was published by Baldassarre in Cogn. Syst. Res..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/3851> . ?answer dblp:publishedIn 'Cogn. Syst. Res.' }","paraphrases":["Which research paper on Network model was published by Baldassarre in Cogn. Syst. Res.?"],"info":{}}
{"id":"train_2749","question":"Which paper on Management richmond was published by D. in Inf. Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/w/TDWilson> . ?answer dblp:publishedIn 'Inf. Res.' }","paraphrases":["Which research paper on Management richmond was published by Wilson in Inf. Res.?"],"info":{}}
{"id":"train_2750","question":"Name the venue in which D. published the paper about Computing system.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tc/Crane61> dblp:authoredBy <https://dblp.org/pid/05/1048> . <https://dblp.org/rec/journals/tc/Crane61> dblp:publishedIn ?answer }","paraphrases":["Hewitt published the paper on Computing system in which venue?"],"info":{}}
{"id":"train_2751","question":"Mention the publication on Pqc candidates that was published by Dale in International Computer Software and Applications Conference.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/302/2062> . ?answer dblp:publishedIn 'COMPSAC' }","paraphrases":["Which research paper on Pqc candidates was published by Dale in COMPSAC?"],"info":{}}
{"id":"train_2752","question":"Name the author who published the paper on Ai systems and has the name Haya.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2109-07239> dblp:authoredBy ?answer }","paraphrases":["Which author named Elayan published the paper on Ai systems?"],"info":{}}
{"id":"train_2754","question":"Mention the publication on Risk analysis that was published by Michael in International Encyclopedia of Statistical Science.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/36/3135> . ?answer dblp:publishedIn 'International Encyclopedia of Statistical Science' }","paraphrases":["Which research paper on Risk analysis was published by Michael in International Encyclopedia of Statistical Science?"],"info":{}}
{"id":"train_2756","question":"Name the author who published the paper on Vehicle networks and has the name Jamal.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/wpc/Raiyn20> dblp:authoredBy ?answer }","paraphrases":["Which author named Raiyn published the paper on Vehicle networks?"],"info":{}}
{"id":"train_2758","question":"Which paper on Discovery rate was published by E. in BMC Bioinform.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/88/5434> . ?answer dblp:publishedIn 'BMC Bioinform.' }","paraphrases":["Mention the publication on Discovery rate that was published by Ronald in BMC Bioinform.."],"info":{}}
{"id":"train_2759","question":"Which research paper on Output feedback was published by Ming-Chang in Control. Intell. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/87/8679> . ?answer dblp:publishedIn 'Control. Intell. Syst.' }","paraphrases":["Which paper on Output feedback was published by Pai in Control. Intell. Syst.?"],"info":{}}
{"id":"train_2761","question":"Name the author who published the paper on Diffusion equations and has the name Nadezhda.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/naa/AfanasyevaVV12> dblp:authoredBy ?answer }","paraphrases":["Which author named Nadezhda published the paper on Diffusion equations?"],"info":{}}
{"id":"train_2763","question":"In which venue did Sun publish the paper about Order penalty function?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcam/XuMSS11> dblp:authoredBy <https://dblp.org/pid/32/9654> . <https://dblp.org/rec/journals/jcam/XuMSS11> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Sun published the paper about Order penalty function."],"info":{}}
{"id":"train_2764","question":"Which paper on Problem decomposition was published by Zhang in Neurocomputing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/z/MengjieZhang> . ?answer dblp:publishedIn 'Neurocomputing' }","paraphrases":["Which research paper on Problem decomposition was published by Mengjie in Neurocomputing?"],"info":{}}
{"id":"train_2765","question":"In which venue did Bernard publish the paper about Parameter design?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hsc/LoeffelholzB09> dblp:authoredBy <https://dblp.org/pid/64/8765> . <https://dblp.org/rec/conf/hsc/LoeffelholzB09> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Loeffelholz published the paper about Parameter design."],"info":{}}
{"id":"train_2766","question":"Name the venue in which Su-Wei published the paper about Minimum interference.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/comcom/TanLV02> dblp:authoredBy <https://dblp.org/pid/59/1940> . <https://dblp.org/rec/journals/comcom/TanLV02> dblp:publishedIn ?answer }","paraphrases":["Tan published the paper on Minimum interference in which venue?"],"info":{}}
{"id":"train_2767","question":"Richard published the paper on Case study in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/gis/Wadsworth04> dblp:authoredBy <https://dblp.org/pid/58/2754> . <https://dblp.org/rec/journals/gis/Wadsworth04> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which A. published the paper about Case study."],"info":{}}
{"id":"train_2768","question":"Which paper on Signal classification was published by Chen in Inf.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/6904> . ?answer dblp:publishedIn 'Inf.' }","paraphrases":["Mention the publication on Signal classification that was published by Rong in Inf.."],"info":{}}
{"id":"train_2770","question":"Which author named Evans published the paper on Loop parallelization?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pc/Mohd-SamanE93> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Loop parallelization and has the name David?"],"info":{}}
{"id":"train_2771","question":"In which venue did John publish the paper about Space qualification?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/irps/Scarpulla21> dblp:authoredBy <https://dblp.org/pid/291/6045> . <https://dblp.org/rec/conf/irps/Scarpulla21> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Scarpulla published the paper about Space qualification."],"info":{}}
{"id":"train_2772","question":"Name the author who published the paper on Business process modeling and has the name Nima.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cbms/HashemianA12> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Business process modeling and has the name Nima?"],"info":{}}
{"id":"train_2773","question":"Name the author who published the paper on Induction experiment and has the name Giovanni.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jet/BinmoreMPSS02> dblp:authoredBy ?answer }","paraphrases":["Which author named Giovanni published the paper on Induction experiment?"],"info":{}}
{"id":"train_2774","question":"Which author named Pawel published the paper on Permutation graphs?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dm/AcanH16> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Permutation graphs and has the name Pawel."],"info":{}}
{"id":"train_2776","question":"In which venue did Vin\\u00EDcius publish the paper about Speechless intervals?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/webmedia/WanderleyVCAG19> dblp:authoredBy <https://dblp.org/pid/250/3421> . <https://dblp.org/rec/conf/webmedia/WanderleyVCAG19> dblp:publishedIn ?answer }","paraphrases":["Vin\\u00EDcius published the paper on Speechless intervals in which venue?"],"info":{}}
{"id":"train_2777","question":"Name the author who published the paper on Network partition and has the name Leandro.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icc/VillasBALU13> dblp:authoredBy ?answer }","paraphrases":["Which author named A. published the paper on Network partition?"],"info":{}}
{"id":"train_2778","question":"Lin published the paper on Interference mitigation in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/qshine/LinCW15> dblp:authoredBy <https://dblp.org/pid/14/5581> . <https://dblp.org/rec/conf/qshine/LinCW15> dblp:publishedIn ?answer }","paraphrases":["In which venue did Lin publish the paper about Interference mitigation?"],"info":{}}
{"id":"train_2779","question":"In which venue did Matthias publish the paper about Axes manipulator?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/robotica/NeubauerGB15> dblp:authoredBy <https://dblp.org/pid/n/MatthiasNeubauer> . <https://dblp.org/rec/journals/robotica/NeubauerGB15> dblp:publishedIn ?answer }","paraphrases":["Matthias published the paper on Axes manipulator in which venue?"],"info":{}}
{"id":"train_2780","question":"Umesh published the paper on Vehicle routing in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gis/Bellur13> dblp:authoredBy <https://dblp.org/pid/54/4697> . <https://dblp.org/rec/conf/gis/Bellur13> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Bellur published the paper about Vehicle routing."],"info":{}}
{"id":"train_2781","question":"Mention the publication on Transmission control method that was published by Cho in ICUIMC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/33/3630> . ?answer dblp:publishedIn 'ICUIMC' }","paraphrases":["Which research paper on Transmission control method was published by Cho in ICUIMC?"],"info":{}}
{"id":"train_2782","question":"Name the author who published the paper on Achieving capacity and has the name Aaron.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isit/GaoW13> dblp:authoredBy ?answer }","paraphrases":["Which author named B. published the paper on Achieving capacity?"],"info":{}}
{"id":"train_2784","question":"Name the venue in which Atal published the paper about Block codes.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icassp/SchroederA82> dblp:authoredBy <https://dblp.org/pid/10/7154> . <https://dblp.org/rec/conf/icassp/SchroederA82> dblp:publishedIn ?answer }","paraphrases":["In which venue did S. publish the paper about Block codes?"],"info":{}}
{"id":"train_2785","question":"Which paper on Edge performance was published by Gelenbe in SOFSEM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/g/ErolGelenbe> . ?answer dblp:publishedIn 'SOFSEM' }","paraphrases":["Which research paper on Edge performance was published by Erol in Current Trends in Theory and Practice of Computer Science?"],"info":{}}
{"id":"train_2786","question":"Which author named Kasif published the paper on Knowledge gaps?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/nar/ChangHRAKRS16> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Knowledge gaps and has the name Kasif."],"info":{}}
{"id":"train_2788","question":"Name the author who published the paper on Uplink system and has the name Yangyi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spl/LiuWZXS16> dblp:authoredBy ?answer }","paraphrases":["Which author named Liu published the paper on Uplink system?"],"info":{}}
{"id":"train_2790","question":"Park published the paper on Motion correction in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/miccai/ParkMK04> dblp:authoredBy <https://dblp.org/pid/41/4978> . <https://dblp.org/rec/conf/miccai/ParkMK04> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Park published the paper about Motion correction."],"info":{}}
{"id":"train_2791","question":"Mention the publication on -government that was published by Wang in Web Intelligence/IAT Workshops.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/589> . ?answer dblp:publishedIn 'Web Intelligence/IAT Workshops' }","paraphrases":["Which paper on -government was published by Dong in Web Intelligence/IAT Workshops?"],"info":{}}
{"id":"train_2792","question":"Which paper on Owa operators was published by Gu in Int. J. Intell. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/51/1474> . ?answer dblp:publishedIn 'Int. J. Intell. Syst.' }","paraphrases":["Which research paper on Owa operators was published by Yundong in Int. J. Intell. Syst.?"],"info":{}}
{"id":"train_2794","question":"Liu published the paper on Similarity measure in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcisys/LiuZD12> dblp:authoredBy <https://dblp.org/pid/42/8978> . <https://dblp.org/rec/journals/ijcisys/LiuZD12> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Liu published the paper about Similarity measure."],"info":{}}
{"id":"train_2795","question":"Which author published the paper on Subgraph density and has the name Sidiropoulos?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wsdm/KonarS21> dblp:authoredBy ?answer }","paraphrases":["Which author named Nicholas published the paper on Subgraph density?"],"info":{}}
{"id":"train_2797","question":"Which paper on Jtag architecture was published by Lihn in International Teletraffic Congress?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/10864> . ?answer dblp:publishedIn 'ITC' }","paraphrases":["Which research paper on Jtag architecture was published by Hung-chi in ITC?"],"info":{}}
{"id":"train_2799","question":"Tenno published the paper on Ale models in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ewc/PohjorantaT11> dblp:authoredBy <https://dblp.org/pid/25/9462> . <https://dblp.org/rec/journals/ewc/PohjorantaT11> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Robert published the paper about Ale models."],"info":{}}
{"id":"train_2801","question":"Count the number of co-authors that Ragab, M. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/205/4727> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/205/4727> ) }","paraphrases":["How many co-authors does Mohamed Ragab have?"],"info":{}}
{"id":"train_2802","question":"Report the count of papers that Fanggang Wang has published in IEEE Wirel. Commun..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/84/2752> . ?answer dblp:publishedIn 'IEEE Wirel. Commun.' }","paraphrases":["In IEEE Wirel. Commun., how many papers has Fanggang Wang published?"],"info":{}}
{"id":"train_2803","question":"Report the average number of publications by Benarab, C. Eddine per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/295/9170> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Benarab, C. Eddine per year?"],"info":{}}
{"id":"train_2804","question":"Count the number of papers that Neander Silva has published in SCSS (1).","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/20/5427> . ?answer dblp:publishedIn 'SCSS (1)' }","paraphrases":["How many papers has Neander Silva published in SCSS (1)?"],"info":{}}
{"id":"train_2805","question":"How many co-authors does Steven G. Parker have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/5869> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/76/5869> ) }","paraphrases":["Count the number of co-authors that S. G. Parker has."],"info":{}}
{"id":"train_2806","question":"Count the number of co-authors that Stefano B. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/63/3800> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/63/3800> ) }","paraphrases":["How many co-authors does Stefano B. have?"],"info":{}}
{"id":"train_2807","question":"What is the average number of research papers published by the author Kapralov, Michael per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/6407> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Kapralov, Michael per year?"],"info":{}}
{"id":"train_2808","question":"What is the average number of papers published by Yannan Qian per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/183/8796> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Yannan Qian per year."],"info":{}}
{"id":"train_2809","question":"Report the average number of publications by Yun Yang per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/90/3406-1> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Y. Yang per year?"],"info":{}}
{"id":"train_2810","question":"How many research papers has Ishimatsu, Jun published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/74/7568> }","paraphrases":["How many papers has Jun Ishimatsu published?"],"info":{}}
{"id":"train_2811","question":"What is the average number of papers published by Azoulay-Schwartz, Rina per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/10/6019> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Azoulay-Schwartz, Rina per year?"],"info":{}}
{"id":"train_2812","question":"Count the number of co-authors that T. Preu\\u00DFer has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/36/1304> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/36/1304> ) }","paraphrases":["How many co-authors does Tobias Preu\\u00DFer have?"],"info":{}}
{"id":"train_2813","question":"Count the number of co-authors that Giuseppe Cocorullo has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/36/1851> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/36/1851> ) }","paraphrases":["How many co-authors does G. Cocorullo have?"],"info":{}}
{"id":"train_2814","question":"Mention the number of papers that Favier, Marc has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/87/4170> }","paraphrases":["How many research papers has Marc Favier published?"],"info":{}}
{"id":"train_2815","question":"Count the number of papers that Chung Gu Kang has published in IEEE Commun. Lett..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/96/6745> . ?answer dblp:publishedIn 'IEEE Commun. Lett.' }","paraphrases":["Report the count of papers that Kang, Chung Gu has published in IEEE Commun. Lett.."],"info":{}}
{"id":"train_2818","question":"What is the average number of papers published by Rajesh J. S. per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/167/8019> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Rajesh J. S. per year?"],"info":{}}
{"id":"train_2819","question":"Count the number of co-authors that Abdalla, A. N. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/131/1105> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/131/1105> ) }","paraphrases":["How many co-authors does Ahmed N. Abdalla have?"],"info":{}}
{"id":"train_2821","question":"Mention the number of papers that Tom B. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/159/6350> }","paraphrases":["How many papers has Tom B. published?"],"info":{}}
{"id":"train_2822","question":"Report the average number of publications by Beig, A. Rahiman per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/122/7235> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Abdul Rahiman Beig per year?"],"info":{}}
{"id":"train_2823","question":"Count the number of co-authors that Cyril Concolato has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/51/117> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/51/117> ) }","paraphrases":["How many co-authors does Cyril Concolato have?"],"info":{}}
{"id":"train_2824","question":"What is the average number of papers published by Ridha T. per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/8949> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Ridha Touzi per year."],"info":{}}
{"id":"train_2825","question":"Report the average number of co-authors for publications published by Thouvenot, Eric.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/14/9913> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Thouvenot, Eric?"],"info":{}}
{"id":"train_2826","question":"How many research papers has Yin, C. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/4887> }","paraphrases":["How many papers has Yin, C. published?"],"info":{}}
