{"id":"train_6121","question":"What are the titles of the papers on Der definitionsphase that were published in IWBS Report in 1990?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/tr/ibm/IWBS145> dblp:publishedIn 'IWBS Report' . <https://dblp.org/rec/tr/ibm/IWBS145> dblp:yearOfPublication '1990' . <https://dblp.org/rec/tr/ibm/IWBS145> dblp:title ?answer }","paraphrases":["In the year 1990 in IWBS Report, what are the titles of the research papers on Der definitionsphase?"],"info":{}}
{"id":"train_6122","question":"In 2018 in Phys. Commun., who are the authors that published papers about City users?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/phycomm/LimbasiyaGS18> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/phycomm/LimbasiyaGS18> dblp:publishedIn 'Phys. Commun.' . <https://dblp.org/rec/journals/phycomm/LimbasiyaGS18> dblp:yearOfPublication '2018' }","paraphrases":["In Phys. Commun. in 2018, who are the authors that published papers about City users?"],"info":{}}
{"id":"train_6123","question":"In the year 2022 in IET Image Process., who are the authors that published research papers about Image super?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iet-ipr/HouHDZGF22> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/iet-ipr/HouHDZGF22> dblp:publishedIn 'IET Image Process.' . <https://dblp.org/rec/journals/iet-ipr/HouHDZGF22> dblp:yearOfPublication '2022' }","paraphrases":["In 2022 in IET Image Process., who are the authors that published papers about Image super?"],"info":{}}
{"id":"train_6124","question":"In the year 2019 in KSEM (1), what are the titles of the research papers on Interest preferences?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ksem/ChenPQCZ19> dblp:publishedIn 'KSEM (1)' . <https://dblp.org/rec/conf/ksem/ChenPQCZ19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/conf/ksem/ChenPQCZ19> dblp:title ?answer }","paraphrases":["In International Conference on Knowledge Science, Engineering and Management in 2019, what are the titles of the papers on Interest preferences?"],"info":{}}
{"id":"train_6125","question":"In 2017 in Appl. Soft Comput., who are the authors that published papers about Stock investment?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/asc/LinHT17> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/asc/LinHT17> dblp:publishedIn 'Appl. Soft Comput.' . <https://dblp.org/rec/journals/asc/LinHT17> dblp:yearOfPublication '2017' }","paraphrases":["In Appl. Soft Comput. in 2017, who are the authors that published papers about Stock investment?"],"info":{}}
{"id":"train_6126","question":"In the year 2001 in CoRR, what are the titles of the research papers on Number portability?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/cs-CY-0110045> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/cs-CY-0110045> dblp:yearOfPublication '2001' . <https://dblp.org/rec/journals/corr/cs-CY-0110045> dblp:title ?answer }","paraphrases":["In CoRR in 2001, what are the titles of the papers on Number portability?"],"info":{}}
{"id":"train_6127","question":"In IWEI in 2011, who are the authors that published papers about Enterprise systems management?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ifip5-8/Friesen11> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ifip5-8/Friesen11> dblp:publishedIn 'IWEI' . <https://dblp.org/rec/conf/ifip5-8/Friesen11> dblp:yearOfPublication '2011' }","paraphrases":["In the year 2011 in IWEI, who are the authors that published research papers about Enterprise systems management?"],"info":{}}
{"id":"train_6129","question":"What are the titles of the papers on Q channel that were published in APCCAS in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/apccas/HaNY06> dblp:publishedIn 'APCCAS' . <https://dblp.org/rec/conf/apccas/HaNY06> dblp:yearOfPublication '2006' . <https://dblp.org/rec/conf/apccas/HaNY06> dblp:title ?answer }","paraphrases":["In APCCAS in 2006, what are the titles of the papers on Q channel?"],"info":{}}
{"id":"train_6130","question":"In the year 2004 in WSCG (Short Papers), what are the titles of the research papers on Butterfly wings?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wscg/GonzatoP04> dblp:publishedIn 'WSCG (Short Papers)' . <https://dblp.org/rec/conf/wscg/GonzatoP04> dblp:yearOfPublication '2004' . <https://dblp.org/rec/conf/wscg/GonzatoP04> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Butterfly wings that were published in International Conferences in Central Europe on Computer Graphics, Visualization and Computer Vision in 2004?"],"info":{}}
{"id":"train_6131","question":"When was the paper on Coconut project by University of Vienna, Austria published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dagstuhl/Schichl03> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Vienna, Austria' . <https://dblp.org/rec/conf/dagstuhl/Schichl03> dblp:yearOfPublication ?answer }","paraphrases":["University of Vienna published a paper on Coconut project in what year?"],"info":{}}
{"id":"train_6132","question":"In 2022 in British Computer Society Conference on Human-Computer Interaction, who are the authors that published papers about Emotion recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/SeniarayGPS22> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/hci/SeniarayGPS22> dblp:publishedIn 'HCI (2)' . <https://dblp.org/rec/conf/hci/SeniarayGPS22> dblp:yearOfPublication '2022' }","paraphrases":["In HCI (2) in 2022, who are the authors that published papers about Emotion recognition?"],"info":{}}
{"id":"train_6133","question":"In BMC Bioinform. in 2020, who are the authors that published papers about Analysis results?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bmcbi/EwingPJG20> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/bmcbi/EwingPJG20> dblp:publishedIn 'BMC Bioinform.' . <https://dblp.org/rec/journals/bmcbi/EwingPJG20> dblp:yearOfPublication '2020' }","paraphrases":["Who are the authors that published papers about Analysis results in BMC Bioinform. in 2020?"],"info":{}}
{"id":"train_6134","question":"In the year 2019 in Interspeech, who are the authors that published research papers about Speech processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/interspeech/ParhammerETSOHR19> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/interspeech/ParhammerETSOHR19> dblp:publishedIn 'INTERSPEECH' . <https://dblp.org/rec/conf/interspeech/ParhammerETSOHR19> dblp:yearOfPublication '2019' }","paraphrases":["Who are the authors that published papers about Speech processing in Interspeech in 2019?"],"info":{}}
{"id":"train_6135","question":"In the year 2002 in CEEMAS, who are the authors that published research papers about Robot disassembly?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ceemas/PavliskaS01> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ceemas/PavliskaS01> dblp:publishedIn 'CEEMAS' . <https://dblp.org/rec/conf/ceemas/PavliskaS01> dblp:yearOfPublication '2002' }","paraphrases":["In 2002 in CEEMAS, who are the authors that published papers about Robot disassembly?"],"info":{}}
{"id":"train_6136","question":"In the year 2022 in CoRR, what are the titles of the research papers on Cost overruns?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2203-00430> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2203-00430> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2203-00430> dblp:title ?answer }","paraphrases":["In 2022 in CoRR, what are the titles of the papers on Cost overruns?"],"info":{}}
{"id":"train_6137","question":"Who are the authors that published papers about Multiplexer approach in ICGEC in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icgec/ChiouLCLWY12> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icgec/ChiouLCLWY12> dblp:publishedIn 'ICGEC' . <https://dblp.org/rec/conf/icgec/ChiouLCLWY12> dblp:yearOfPublication '2012' }","paraphrases":["In 2012 in ICGEC, who are the authors that published papers about Multiplexer approach?"],"info":{}}
{"id":"train_6138","question":"In 2014 in Sensors, who are the authors that published papers about Laser reflectivity?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/PyoHTKM14> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/sensors/PyoHTKM14> dblp:publishedIn 'Sensors' . <https://dblp.org/rec/journals/sensors/PyoHTKM14> dblp:yearOfPublication '2014' }","paraphrases":["In Sensors in 2014, who are the authors that published papers about Laser reflectivity?"],"info":{}}
{"id":"train_6139","question":"Huawei Technologies published a paper on Throughput tradeoffs in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvt/ChenSD14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Huawei Technologies, Beijing, China' . <https://dblp.org/rec/journals/tvt/ChenSD14> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Throughput tradeoffs by Huawei Technologies published?"],"info":{}}
{"id":"train_6140","question":"In the year 1995 in INFOVIS, what are the titles of the research papers on Web access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/infovis/AngusS95> dblp:publishedIn 'INFOVIS' . <https://dblp.org/rec/conf/infovis/AngusS95> dblp:yearOfPublication '1995' . <https://dblp.org/rec/conf/infovis/AngusS95> dblp:title ?answer }","paraphrases":["In INFOVIS in 1995, what are the titles of the papers on Web access?"],"info":{}}
{"id":"train_6141","question":"What are the titles of the papers on Re- that were published in CoRR in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2007-04644> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2007-04644> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/corr/abs-2007-04644> dblp:title ?answer }","paraphrases":["In the year 2020 in CoRR, what are the titles of the research papers on Re-?"],"info":{}}
{"id":"train_6142","question":"Who are the authors that published papers about Law distribution in CoRR in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2104-06714> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-2104-06714> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2104-06714> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in CoRR, who are the authors that published papers about Law distribution?"],"info":{}}
{"id":"train_6143","question":"In IEEE Trans. Image Process. in 2013, what are the titles of the papers on Core models?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tip/KimKK13> dblp:publishedIn 'IEEE Trans. Image Process.' . <https://dblp.org/rec/journals/tip/KimKK13> dblp:yearOfPublication '2013' . <https://dblp.org/rec/journals/tip/KimKK13> dblp:title ?answer }","paraphrases":["In the year 2013 in IEEE Trans. Image Process., what are the titles of the research papers on Core models?"],"info":{}}
{"id":"train_6144","question":"In Selected Areas in Cryptography in 2017, what are the titles of the papers on Clock synchronization?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sac/EchtleM17> dblp:publishedIn 'SAC' . <https://dblp.org/rec/conf/sac/EchtleM17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/conf/sac/EchtleM17> dblp:title ?answer }","paraphrases":["In 2017 in Selected Areas in Cryptography, what are the titles of the papers on Clock synchronization?"],"info":{}}
{"id":"train_6145","question":"In Comput. J. in 1965, what are the titles of the papers on Book review?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cj/Maguire65> dblp:publishedIn 'Comput. J.' . <https://dblp.org/rec/journals/cj/Maguire65> dblp:yearOfPublication '1965' . <https://dblp.org/rec/journals/cj/Maguire65> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Book review that were published in Comput. J. in 1965?"],"info":{}}
{"id":"train_6146","question":"In 2019 in CoRR, what are the titles of the papers on Attention network?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1901-03788> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-1901-03788> dblp:yearOfPublication '2019' . <https://dblp.org/rec/journals/corr/abs-1901-03788> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Attention network that were published in CoRR in 2019?"],"info":{}}
{"id":"train_6147","question":"In the year 2021 in ISCID, what are the titles of the research papers on Matching measurement?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscid/WangLW21> dblp:publishedIn 'ISCID' . <https://dblp.org/rec/conf/iscid/WangLW21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/conf/iscid/WangLW21> dblp:title ?answer }","paraphrases":["In ISCID in 2021, what are the titles of the papers on Matching measurement?"],"info":{}}
{"id":"train_6148","question":"In 2022 in CoRR, what are the titles of the papers on Model narratives?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2204-09557> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2204-09557> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2204-09557> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Model narratives that were published in CoRR in 2022?"],"info":{}}
{"id":"train_6149","question":"In Softwaretechnik-Trends in 2019, what are the titles of the papers on Verbesserung durch?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/stt/ScherrME19> dblp:publishedIn 'Softwaretechnik-Trends' . <https://dblp.org/rec/journals/stt/ScherrME19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/journals/stt/ScherrME19> dblp:title ?answer }","paraphrases":["In 2019 in Softwaretechnik-Trends, what are the titles of the papers on Verbesserung durch?"],"info":{}}
{"id":"train_6150","question":"What are the titles of the papers on Quantum cournot that were published in Quantum Inf. Process. in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/qip/ShiX21> dblp:publishedIn 'Quantum Inf. Process.' . <https://dblp.org/rec/journals/qip/ShiX21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/qip/ShiX21> dblp:title ?answer }","paraphrases":["In 2021 in Quantum Inf. Process., what are the titles of the papers on Quantum cournot?"],"info":{}}
{"id":"train_6151","question":"In the year 2021 in Verification, Model Checking and Abstract Interpretation, what are the titles of the research papers on Network models?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vmcai/ZhangZAAFJ21> dblp:publishedIn 'VMCAI' . <https://dblp.org/rec/conf/vmcai/ZhangZAAFJ21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/conf/vmcai/ZhangZAAFJ21> dblp:title ?answer }","paraphrases":["In Verification, Model Checking and Abstract Interpretation in 2021, what are the titles of the papers on Network models?"],"info":{}}
{"id":"train_6152","question":"In the year 2015 in Sensors, what are the titles of the research papers on Transport protocol?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/ZikriaNIK15> dblp:publishedIn 'Sensors' . <https://dblp.org/rec/journals/sensors/ZikriaNIK15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/journals/sensors/ZikriaNIK15> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Transport protocol that were published in Sensors in 2015?"],"info":{}}
{"id":"train_6153","question":"In 2005 in Mobile and Ubiquitous Multimedia (ACM), who are the authors that published papers about Object recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mum/FocklerZBBB05> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/mum/FocklerZBBB05> dblp:publishedIn 'MUM' . <https://dblp.org/rec/conf/mum/FocklerZBBB05> dblp:yearOfPublication '2005' }","paraphrases":["Who are the authors that published papers about Object recognition in Mobile and Ubiquitous Multimedia (ACM) in 2005?"],"info":{}}
{"id":"train_6154","question":"In CoRR in 2019, who are the authors that published papers about Image analysis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1908-10661> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-1908-10661> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-1908-10661> dblp:yearOfPublication '2019' }","paraphrases":["In the year 2019 in CoRR, who are the authors that published research papers about Image analysis?"],"info":{}}
{"id":"train_6155","question":"When was the research paper on Parseval wavelet frames by St. Petersburg State University, Russia published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/amc/Skopina17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'St. Petersburg State University, Russia' . <https://dblp.org/rec/journals/amc/Skopina17> dblp:yearOfPublication ?answer }","paraphrases":["St. Petersburg State University published a paper on Parseval wavelet frames in what year?"],"info":{}}
{"id":"train_6156","question":"In IBM J. Res. Dev. in 1989, who are the authors that published papers about Area fault?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ibmrd/Stapper89> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ibmrd/Stapper89> dblp:publishedIn 'IBM J. Res. Dev.' . <https://dblp.org/rec/journals/ibmrd/Stapper89> dblp:yearOfPublication '1989' }","paraphrases":["In the year 1989 in IBM J. Res. Dev., who are the authors that published research papers about Area fault?"],"info":{}}
{"id":"train_6157","question":"Who are the authors that published papers about Surveillance sensor in Comput. Commun. in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/comcom/DengLZZ21> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/comcom/DengLZZ21> dblp:publishedIn 'Comput. Commun.' . <https://dblp.org/rec/journals/comcom/DengLZZ21> dblp:yearOfPublication '2021' }","paraphrases":["In the year 2021 in Comput. Commun., who are the authors that published research papers about Surveillance sensor?"],"info":{}}
{"id":"train_6158","question":"In ICT Innovations in 2015, who are the authors that published papers about Cache separation impact?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ictinnovations/Cano14> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ictinnovations/Cano14> dblp:publishedIn 'ICT Innovations' . <https://dblp.org/rec/conf/ictinnovations/Cano14> dblp:yearOfPublication '2015' }","paraphrases":["Who are the authors that published papers about Cache separation impact in ICT Innovations in 2015?"],"info":{}}
{"id":"train_6159","question":"In the year 2003 in ISCAS, what are the titles of the research papers on Phase quantization?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscas/SamadianHA03> dblp:publishedIn 'ISCAS (1)' . <https://dblp.org/rec/conf/iscas/SamadianHA03> dblp:yearOfPublication '2003' . <https://dblp.org/rec/conf/iscas/SamadianHA03> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Phase quantization that were published in ISCAS in 2003?"],"info":{}}
{"id":"train_6160","question":"Who are the authors that published papers about Identity verification in IJCB in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icb/MessermanMCA11> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icb/MessermanMCA11> dblp:publishedIn 'IJCB' . <https://dblp.org/rec/conf/icb/MessermanMCA11> dblp:yearOfPublication '2011' }","paraphrases":["In the year 2011 in IJCB, who are the authors that published research papers about Identity verification?"],"info":{}}
{"id":"train_6161","question":"What are the titles of the papers on Multi- that were published in Digit. Signal Process. in 2010?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dsp/GujrathiHCW10> dblp:publishedIn 'Digit. Signal Process.' . <https://dblp.org/rec/journals/dsp/GujrathiHCW10> dblp:yearOfPublication '2010' . <https://dblp.org/rec/journals/dsp/GujrathiHCW10> dblp:title ?answer }","paraphrases":["In the year 2010 in Digit. Signal Process., what are the titles of the research papers on Multi-?"],"info":{}}
{"id":"train_6162","question":"In the year 2013 in ICIS, who are the authors that published research papers about Information systems security management?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icis/PoloniaS13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icis/PoloniaS13> dblp:publishedIn 'ICIS' . <https://dblp.org/rec/conf/icis/PoloniaS13> dblp:yearOfPublication '2013' }","paraphrases":["Who are the authors that published papers about Information systems security management in ICIS in 2013?"],"info":{}}
{"id":"train_6163","question":"What are the titles of the papers on Scale application that were published in KES-IDT in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/kesidt/HassenZK19> dblp:publishedIn 'KES-IDT (2)' . <https://dblp.org/rec/conf/kesidt/HassenZK19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/conf/kesidt/HassenZK19> dblp:title ?answer }","paraphrases":["In KES-IDT in 2019, what are the titles of the papers on Scale application?"],"info":{}}
{"id":"train_6164","question":"Who are the authors that published papers about Mechanics education in Int. J. Emerg. Technol. Learn. in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijet/Thaller06> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ijet/Thaller06> dblp:publishedIn 'Int. J. Emerg. Technol. Learn.' . <https://dblp.org/rec/journals/ijet/Thaller06> dblp:yearOfPublication '2006' }","paraphrases":["In Int. J. Emerg. Technol. Learn. in 2006, who are the authors that published papers about Mechanics education?"],"info":{}}
{"id":"train_6165","question":"Who are the authors that published papers about Pattern mining in International Conference on Advanced Data Mining and Applications in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/adma/JinZ06> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/adma/JinZ06> dblp:publishedIn 'ADMA' . <https://dblp.org/rec/conf/adma/JinZ06> dblp:yearOfPublication '2006' }","paraphrases":["In 2006 in International Conference on Advanced Data Mining and Applications, who are the authors that published papers about Pattern mining?"],"info":{}}
{"id":"train_6166","question":"In 2017 in IEEE Trans. Cybern., what are the titles of the papers on Tracking control?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcyb/WangSLZ17> dblp:publishedIn 'IEEE Trans. Cybern.' . <https://dblp.org/rec/journals/tcyb/WangSLZ17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/journals/tcyb/WangSLZ17> dblp:title ?answer }","paraphrases":["In the year 2017 in IEEE Trans. Cybern., what are the titles of the research papers on Tracking control?"],"info":{}}
{"id":"train_6167","question":"In 2016 in Intell. Data Anal., what are the titles of the papers on Graph matching?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ida/HuF16> dblp:publishedIn 'Intell. Data Anal.' . <https://dblp.org/rec/journals/ida/HuF16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/journals/ida/HuF16> dblp:title ?answer }","paraphrases":["In the year 2016 in Intell. Data Anal., what are the titles of the research papers on Graph matching?"],"info":{}}
{"id":"train_6168","question":"What are the titles of the papers on Robot interaction that were published in HRI in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hri/BischofHKR22> dblp:publishedIn 'HRI' . <https://dblp.org/rec/conf/hri/BischofHKR22> dblp:yearOfPublication '2022' . <https://dblp.org/rec/conf/hri/BischofHKR22> dblp:title ?answer }","paraphrases":["In HRI in 2022, what are the titles of the papers on Robot interaction?"],"info":{}}
{"id":"train_6169","question":"In 2022 in Trans. GIS, what are the titles of the papers on Media activities?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tgis/WeiY22> dblp:publishedIn 'Trans. GIS' . <https://dblp.org/rec/journals/tgis/WeiY22> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/tgis/WeiY22> dblp:title ?answer }","paraphrases":["In Trans. GIS in 2022, what are the titles of the papers on Media activities?"],"info":{}}
{"id":"train_6170","question":"In the year 2018 in IT Prof., what are the titles of the research papers on Exchange rate?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/itpro/TsaihKLH18> dblp:publishedIn 'IT Prof.' . <https://dblp.org/rec/journals/itpro/TsaihKLH18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/itpro/TsaihKLH18> dblp:title ?answer }","paraphrases":["In 2018 in IT Prof., what are the titles of the papers on Exchange rate?"],"info":{}}
{"id":"train_6171","question":"What are the titles of the papers on Streams clustering that were published in Inf. Sci. in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/isci/BezerraCGA20> dblp:publishedIn 'Inf. Sci.' . <https://dblp.org/rec/journals/isci/BezerraCGA20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/isci/BezerraCGA20> dblp:title ?answer }","paraphrases":["In 2020 in Inf. Sci., what are the titles of the papers on Streams clustering?"],"info":{}}
{"id":"train_6172","question":"In 2022 in IEEE Trans. Instrum. Meas., what are the titles of the papers on Gas sensor?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tim/JiangTCJW22> dblp:publishedIn 'IEEE Trans. Instrum. Meas.' . <https://dblp.org/rec/journals/tim/JiangTCJW22> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/tim/JiangTCJW22> dblp:title ?answer }","paraphrases":["In the year 2022 in IEEE Trans. Instrum. Meas., what are the titles of the research papers on Gas sensor?"],"info":{}}
{"id":"train_6173","question":"In 2022 in CoRR, what are the titles of the papers on Object discovery?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2204-02075> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2204-02075> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2204-02075> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Object discovery that were published in CoRR in 2022?"],"info":{}}
{"id":"train_6174","question":"In the year 2019 in ICCSA (6), who are the authors that published research papers about Sporting attractiveness?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccsa/LaduBB19> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/iccsa/LaduBB19> dblp:publishedIn 'ICCSA (6)' . <https://dblp.org/rec/conf/iccsa/LaduBB19> dblp:yearOfPublication '2019' }","paraphrases":["In 2019 in International Conference on Computational Science and its Applications, who are the authors that published papers about Sporting attractiveness?"],"info":{}}
{"id":"train_6175","question":"What are the titles of the papers on Panorama vr imaging that were published in Clust. Comput. in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cluster/LeeL18> dblp:publishedIn 'Clust. Comput.' . <https://dblp.org/rec/journals/cluster/LeeL18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/cluster/LeeL18> dblp:title ?answer }","paraphrases":["In the year 2018 in Clust. Comput., what are the titles of the research papers on Panorama vr imaging?"],"info":{}}
{"id":"train_6176","question":"University of Iowa, Iowa City, IA, USA published a paper on Generation system in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccd/PatilR89> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Iowa, Iowa City, IA, USA' . <https://dblp.org/rec/conf/iccd/PatilR89> dblp:yearOfPublication ?answer }","paraphrases":["When was the paper on Generation system by University of Iowa, Iowa City, IA, USA published?"],"info":{}}
{"id":"train_6177","question":"In the year 2007 in MICAI, who are the authors that published research papers about Feature selection?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/micai/Mejia-LavalleMA07> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/micai/Mejia-LavalleMA07> dblp:publishedIn 'MICAI' . <https://dblp.org/rec/conf/micai/Mejia-LavalleMA07> dblp:yearOfPublication '2007' }","paraphrases":["In MICAI in 2007, who are the authors that published papers about Feature selection?"],"info":{}}
