{"id":"train_5558","question":"Did the authors of 'A Planar linear arboricity conjecture' not not publish a paper in J. Graph Theory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jgt/CyganHKLW12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jgt/CyganHKLW12> ) . ?y dblp:publishedIn 'J. Graph Theory' }","paraphrases":["Haven't the authors of the publication 'A Planar linear arboricity conjecture' not published a publication in J. Graph Theory?"],"info":{}}
{"id":"train_5559","question":"Did the authors of 'Properties of the Liapunov Stability Zones of the Lagrange Triangle' not not publish a paper in CASC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/casc/GrebenikovKZ07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/casc/GrebenikovKZ07> ) . ?y dblp:publishedIn 'CASC' }","paraphrases":["Haven't the authors of the publication 'Properties of the Liapunov Stability Zones of the Lagrange Triangle' not published a publication in CASC?"],"info":{}}
{"id":"train_5561","question":"Was the paper 'Slicing Real-Time Programs for Enhanced Schedulability' not not published in the year 1997?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/toplas/GerberH97> dblp:yearOfPublication '1997' }","paraphrases":["Was 'Slicing Real-Time Programs for Enhanced Schedulability' not not published in 1997?"],"info":{}}
{"id":"train_5563","question":"Have the authors of the paper 'Low-power 32-bit dual-MAC 120 \\u03BCW/MHz 10 V icyflex DSP/MCU core' not not published a publication in ESSCIRC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esscirc/ArmGMMNPRV08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/esscirc/ArmGMMNPRV08> ) . ?y dblp:publishedIn 'ESSCIRC' }","paraphrases":["Did the authors of the publication 'Low-power 32-bit dual-MAC 120 \\u03BCW/MHz 10 V icyflex DSP/MCU core' not not publish a paper in ESSCIRC?"],"info":{}}
{"id":"train_5564","question":"Was 'Interview with Stefan Schrade from Team VariLeg, Swiss Federal Institute of Technology in Zurich, Ranked Fifth at Cybathlon 2016 [Student's Corner]' not not published in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ram/Wolf17a> dblp:yearOfPublication '2017' }","paraphrases":["Was the paper 'Interview with Stefan Schrade from Team VariLeg, Swiss Federal Institute of Technology in Zurich, Ranked Fifth at Cybathlon 2016 [Student's Corner]' not not published in the year 2017?"],"info":{}}
{"id":"train_5565","question":"Was 'Elementary Amalgamation and Joint Embedding Property for Intermediate Logics' not not published in 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/igpl/BagheriP08> dblp:yearOfPublication '2008' }","paraphrases":["Was the paper 'Elementary Amalgamation and Joint Embedding Property for Intermediate Logics' not not published in the year 2008?"],"info":{}}
{"id":"train_5566","question":"Was 'Recent Advances in Reliability and Quality Engineering' not not published in 2001?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/series/sqres/Pham01> dblp:yearOfPublication '2001' }","paraphrases":["Was the paper 'Recent Advances in Reliability and Quality Engineering' not not published in the year 2001?"],"info":{}}
{"id":"train_5567","question":"Was 'Distance Networks for Morphological Profiling and Characterization of DICCCOL Landmarks' not not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/miccai/YuanCLZL15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Distance Networks for Morphological Profiling and Characterization of DICCCOL Landmarks' not not published in the year 2015?"],"info":{}}
{"id":"train_5568","question":"Have the authors of the paper 'Improving Cache Locality for Ray Casting with CUDA' not not published a publication in ARCS Workshops?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/arcs/SugimotoIH11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/arcs/SugimotoIH11> ) . ?y dblp:publishedIn 'ARCS Workshops' }","paraphrases":["Did the authors of the publication 'Improving Cache Locality for Ray Casting with CUDA' not not publish a paper in ARCS Workshops?"],"info":{}}
{"id":"train_5569","question":"Did the authors of the publication 'Compositional Verification of Randomized Distributed Algorithms' not not publish a paper in COMPOS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/compos/Segala97> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/compos/Segala97> ) . ?y dblp:publishedIn 'COMPOS' }","paraphrases":["Have the authors of the paper 'Compositional Verification of Randomized Distributed Algorithms' not not published a publication in COMPOS?"],"info":{}}
{"id":"train_5571","question":"Haven't the authors of the publication 'MDA: Multimodal Data Augmentation Framework for Boosting Performance on Sentiment/Emotion Classification Tasks' not published a publication in IEEE Intell. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/expert/XuMWZ21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/expert/XuMWZ21> ) . ?y dblp:publishedIn 'IEEE Intell. Syst.' }","paraphrases":["Did the authors of 'MDA: Multimodal Data Augmentation Framework for Boosting Performance on Sentiment/Emotion Classification Tasks' not not publish a paper in IEEE Intell. Syst.?"],"info":{}}
{"id":"train_5573","question":"Was the paper 'Conception of an Automatic Decision Support Platform Based on Cross-Sorting Methods and the Fuzzy Logic for General Use' not not published in the year 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bdiot2/TamirCOR21> dblp:yearOfPublication '2022' }","paraphrases":["Was 'Conception of an Automatic Decision Support Platform Based on Cross-Sorting Methods and the Fuzzy Logic for General Use' not not published in 2022?"],"info":{}}
{"id":"train_5576","question":"Have the authors of the paper 'The maximum tensor complementarity eigenvalues' not not published a publication in Optim. Methods Softw.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/oms/FanNZ20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/oms/FanNZ20> ) . ?y dblp:publishedIn 'Optim. Methods Softw.' }","paraphrases":["Did the authors of the publication 'The maximum tensor complementarity eigenvalues' not not publish a paper in Optim. Methods Softw.?"],"info":{}}
{"id":"train_5577","question":"Did the authors of 'DeepSqueezeNet-CRF: A Lightweight Deep Model for Semantic Image Segmentation' not not publish a paper in IEEE International Joint Conference on Neural Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcnn/LaiD019> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ijcnn/LaiD019> ) . ?y dblp:publishedIn 'IJCNN' }","paraphrases":["Haven't the authors of the publication 'DeepSqueezeNet-CRF: A Lightweight Deep Model for Semantic Image Segmentation' not published a publication in IEEE International Joint Conference on Neural Networks?"],"info":{}}
{"id":"train_5578","question":"Was the paper 'Marble: high-throughput phenotyping from electronic health records via sparse nonnegative tensor factorization' not not published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kdd/HoGS14> dblp:yearOfPublication '2014' }","paraphrases":["Was 'Marble: high-throughput phenotyping from electronic health records via sparse nonnegative tensor factorization' not not published in 2014?"],"info":{}}
{"id":"train_5579","question":"Haven't the authors of the publication 'Homogenization of hexagonal lattices' not published a publication in Networks Heterog. Media?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/nhm/DretR13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/nhm/DretR13> ) . ?y dblp:publishedIn 'Networks Heterog. Media' }","paraphrases":["Did the authors of 'Homogenization of hexagonal lattices' not not publish a paper in Networks Heterog. Media?"],"info":{}}
{"id":"train_5580","question":"Haven't the authors of the publication 'A spectrum of TCP-friendly window-based congestion control algorithms' not published a publication in IEEE/ACM Trans. Netw.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ton/JinGMB03> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ton/JinGMB03> ) . ?y dblp:publishedIn 'IEEE/ACM Trans. Netw.' }","paraphrases":["Have the authors of the paper 'A spectrum of TCP-friendly window-based congestion control algorithms' not not published a publication in IEEE/ACM Trans. Netw.?"],"info":{}}
{"id":"train_5581","question":"Haven't the authors of the publication 'Load Balanced Parallel Simulation of Particle-Fluid DEM-SPH Systems with Moving Boundaries' not published a publication in Parallel Computing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/parco/FleissnerE07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/parco/FleissnerE07> ) . ?y dblp:publishedIn 'PARCO' }","paraphrases":["Have the authors of the paper 'Load Balanced Parallel Simulation of Particle-Fluid DEM-SPH Systems with Moving Boundaries' not not published a publication in PARCO?"],"info":{}}
{"id":"train_5582","question":"Haven't the authors of the publication 'Input Devices' not published a publication in Wiley Encyclopedia of Computer Science and Engineering?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/reference/wiley/LaViola08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/reference/wiley/LaViola08> ) . ?y dblp:publishedIn 'Wiley Encyclopedia of Computer Science and Engineering' }","paraphrases":["Did the authors of the publication 'Input Devices' not not publish a paper in Wiley Encyclopedia of Computer Science and Engineering?"],"info":{}}
{"id":"train_5583","question":"Was 'Deep evolution of image representations for handwritten digit recognition' not not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cec/AgapitosONFKBC15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Deep evolution of image representations for handwritten digit recognition' not not published in the year 2015?"],"info":{}}
{"id":"train_5584","question":"Have the authors of the paper 'Vibrational Stabilization Using Lifting and the Root Locus' not not published a publication in CDC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/ChikmagalurB21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cdc/ChikmagalurB21> ) . ?y dblp:publishedIn 'CDC' }","paraphrases":["Did the authors of the publication 'Vibrational Stabilization Using Lifting and the Root Locus' not not publish a paper in CDC?"],"info":{}}
{"id":"train_5585","question":"Have the authors of the paper 'On the Road to Speed-Reading and Fast Learning with CONCEPTUM' not not published a publication in INCoS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/incos/TotiR16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/incos/TotiR16> ) . ?y dblp:publishedIn 'INCoS' }","paraphrases":["Haven't the authors of the publication 'On the Road to Speed-Reading and Fast Learning with CONCEPTUM' not published a publication in INCoS?"],"info":{}}
{"id":"train_5587","question":"Was 'Security Usability of Petname Systems' not not published in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nordsec/FerdousJSB09> dblp:yearOfPublication '2009' }","paraphrases":["Was the publication 'Security Usability of Petname Systems' not not published in 2009?"],"info":{}}
{"id":"train_5590","question":"Haven't the authors of the publication 'Common Nursing Terminology for Clinical Information Systems' not published a publication in MIE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mie/KolZS05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/mie/KolZS05> ) . ?y dblp:publishedIn 'MIE' }","paraphrases":["Did the authors of the publication 'Common Nursing Terminology for Clinical Information Systems' not not publish a paper in MIE?"],"info":{}}
{"id":"train_5591","question":"Was the paper 'Evaluation of message passing synchronization algorithms in embedded systems' not not published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/samos/PapadopoulosWTSB14> dblp:yearOfPublication '2014' }","paraphrases":["Was 'Evaluation of message passing synchronization algorithms in embedded systems' not not published in 2014?"],"info":{}}
{"id":"train_5594","question":"Did the authors of 'Predicting cortical ROIs via joint modeling of anatomical and connectional profiles' not not publish a paper in Medical Image Anal.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mia/ZhangZJGHHGL13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/mia/ZhangZJGHHGL13> ) . ?y dblp:publishedIn 'Medical Image Anal.' }","paraphrases":["Haven't the authors of the publication 'Predicting cortical ROIs via joint modeling of anatomical and connectional profiles' not published a publication in Medical Image Anal.?"],"info":{}}
{"id":"train_5595","question":"Did the authors of the publication 'DCT-RAM: A Driver-Free Process-In-Memory 8T SRAM Macro with Multi-Bit Charge-Domain Computation and Time-Domain Quantization' not not publish a paper in CICC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cicc/ChenJYWY22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cicc/ChenJYWY22> ) . ?y dblp:publishedIn 'CICC' }","paraphrases":["Have the authors of the paper 'DCT-RAM: A Driver-Free Process-In-Memory 8T SRAM Macro with Multi-Bit Charge-Domain Computation and Time-Domain Quantization' not not published a publication in CICC?"],"info":{}}
{"id":"train_5596","question":"Was the paper 'The TV Turtle a Logo graphics system for raster displays' not not published in the year 1976?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acmsgl/Lieberman76> dblp:yearOfPublication '1976' }","paraphrases":["Was 'The TV Turtle a Logo graphics system for raster displays' not not published in 1976?"],"info":{}}
{"id":"train_5597","question":"Was 'Some Remarks on Multiple-Entry Finite Automata' not not published in 1979?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcss/VelosoG79> dblp:yearOfPublication '1979' }","paraphrases":["Was the paper 'Some Remarks on Multiple-Entry Finite Automata' not not published in the year 1979?"],"info":{}}
{"id":"train_5598","question":"Was the paper 'Defocal Lens Assembly for Multi-Element Full-Duplex Free Space Optical Transceiver' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/milcom/HaqY21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Defocal Lens Assembly for Multi-Element Full-Duplex Free Space Optical Transceiver' not not published in 2021?"],"info":{}}
{"id":"train_5600","question":"Mention the years in which 'MobileAid: A Fast and Effective Cognitive Aid System on Mobile Devices' and 'A Novel Approach of Neural Topic Modelling for Document Clustering' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/access/LiuLLCX20> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/ssci/SubramaniSS18> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'MobileAid: A Fast and Effective Cognitive Aid System on Mobile Devices' and 'A Novel Approach of Neural Topic Modelling for Document Clustering' published?"],"info":{}}
{"id":"train_5601","question":"Name the authors of 'Cluster Contrast for Unsupervised Person Re-Identification' and 'Measuring and Disrupting Anti-Adblockers Using Differential Execution Analysis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-2103-11568> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-2103-11568> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Cluster Contrast for Unsupervised Person Re-Identification' and 'Measuring and Disrupting Anti-Adblockers Using Differential Execution Analysis'?"],"info":{}}
{"id":"train_5602","question":"Mention the venues in which 'On Parallelizing Matrix Multiplication by the Column-Row Method' and 'Rectified Factor Networks' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-1210-0461> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/corr/ClevertUMRH15> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'On Parallelizing Matrix Multiplication by the Column-Row Method' and 'Rectified Factor Networks' were published."],"info":{}}
{"id":"train_5603","question":"Mention the years in which 'Why Teenagers Hack: A Personal Memoir' and 'Data compression with low distortion and finite blocklength' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/usenix-login/Alexander05> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/corr/Kostina15> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Why Teenagers Hack: A Personal Memoir' and 'Data compression with low distortion and finite blocklength' published?"],"info":{}}
{"id":"train_5604","question":"Who are the authors of the paper 'Risk of tin whiskers in the nuclear industry' and the publication 'Embedding torus in hexagonal honeycomb torus'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/mr/HuangNCP18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/mr/HuangNCP18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Risk of tin whiskers in the nuclear industry' and 'Embedding torus in hexagonal honeycomb torus'?"],"info":{}}
{"id":"train_5606","question":"Mention the years in which 'Visual Servoing Controller for Robot Manipulators' and 'Detecting people carrying objects based on an optical flow motion model' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/conielecomp/CidR09> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/wacv/SenstES11> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Visual Servoing Controller for Robot Manipulators' and 'Detecting people carrying objects based on an optical flow motion model' published?"],"info":{}}
{"id":"train_5609","question":"Who are the authors of 'A Nonintrusive Load Monitoring Based on Multi-Target Regression Approach' and 'A Shotest Linear Organization for Some Uniform Multiattribute Files'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/access/BuddhahaiM21> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/access/BuddhahaiM21> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'A Nonintrusive Load Monitoring Based on Multi-Target Regression Approach' and the publication 'A Shotest Linear Organization for Some Uniform Multiattribute Files'?"],"info":{}}
{"id":"train_5611","question":"Name the authors of '\\I Will Not Drink With You Today\\: A Topic-Guided Thematic Analysis of Addiction Recovery on Reddit' and '(M+1)st-Price Auction Protocol'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/chi/GauthierCW22> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/chi/GauthierCW22> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of '\\I Will Not Drink With You Today\\: A Topic-Guided Thematic Analysis of Addiction Recovery on Reddit' and '(M+1)st-Price Auction Protocol'?"],"info":{}}
{"id":"train_5617","question":"Mention the venues in which 'Keynote: Language Adaptation' and 'A Lattice Boltzmann Method for Image Denoising' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/sigdial/Lee14> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/tip/ChangY09> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Keynote: Language Adaptation' and 'A Lattice Boltzmann Method for Image Denoising' published?"],"info":{}}
{"id":"train_5619","question":"Mention the years in which 'New bounds on the probability of a finite union of events' and 'ADTreesLogit model for customer churn prediction' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/isit/YangAT14> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/anor/QiZLLZSLL09> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'New bounds on the probability of a finite union of events' and 'ADTreesLogit model for customer churn prediction' published?"],"info":{}}
{"id":"train_5620","question":"Name the authors of 'A simulation of attempts to influence crowd dynamics' and 'Analysis of the Schemes of Some Reservoir on Its Dam Foundation Seepage Prevention and Slope Protection against Waves in the Northwest Arid Area'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/smc/KirklandM03> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/smc/KirklandM03> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'A simulation of attempts to influence crowd dynamics' and the publication 'Analysis of the Schemes of Some Reservoir on Its Dam Foundation Seepage Prevention and Slope Protection against Waves in the Northwest Arid Area'?"],"info":{}}
{"id":"train_5621","question":"Name the authors of 'Poster: Comparing GPU and Increment-Based Checkpoint Compression' and 'A combined group decision making based IFCM and SERVQUAL approach for strategic analysis of airline service quality'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/sc/IbteshamAFB12a> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/sc/IbteshamAFB12a> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Poster: Comparing GPU and Increment-Based Checkpoint Compression' and 'A combined group decision making based IFCM and SERVQUAL approach for strategic analysis of airline service quality'?"],"info":{}}
{"id":"train_5623","question":"List the venues in which 'Acceptance of Technology by Texas Museums: An Application of Learning Curve' and 'Combining Evidence for Automatic Extraction of Terms' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jitt/VarCD01> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/premi/DobrovL11> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'Acceptance of Technology by Texas Museums: An Application of Learning Curve' and 'Combining Evidence for Automatic Extraction of Terms' were published."],"info":{}}
{"id":"train_5624","question":"Name the authors of 'Making best systems best for us' and 'Representing Knowledge in Learning Systems by Pseudo Boolean Functions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/synthese/JaagL20> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/synthese/JaagL20> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Making best systems best for us' and 'Representing Knowledge in Learning Systems by Pseudo Boolean Functions'?"],"info":{}}
{"id":"train_5626","question":"Mention the years in which 'Newton-type methods for non-convex optimization under inexact Hessian information' and 'Non-data-aided distorted constellation estimation and demodulation for mmWave communications' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/mp/XuRM20> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/icc/ZhangXPJZ12> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Newton-type methods for non-convex optimization under inexact Hessian information' and 'Non-data-aided distorted constellation estimation and demodulation for mmWave communications' published?"],"info":{}}
{"id":"train_5628","question":"Who are the authors of the paper 'The impact and spatial difference of agricultural producer services industry on agricultural development: an empirical analysis based on provincial panel data' and the publication 'Gaze Behaviour, Motivational Factors, and Knowledge Sharing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ijstm/DuL18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/ijstm/DuL18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'The impact and spatial difference of agricultural producer services industry on agricultural development: an empirical analysis based on provincial panel data' and 'Gaze Behaviour, Motivational Factors, and Knowledge Sharing'?"],"info":{}}
{"id":"train_5630","question":"Mention the years in which 'Succinct Circuit Representations and Leaf Language Classes are Basically the same Concept' and 'Exploration of technical debt in start-ups' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/eccc/ECCC-TR96-006> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/icse/KlotinsUCGPTP18> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Succinct Circuit Representations and Leaf Language Classes are Basically the same Concept' and 'Exploration of technical debt in start-ups' published?"],"info":{}}
{"id":"train_5631","question":"Name the authors of 'Multi-object tracking using binary masks' and 'Using Knowledge Acquisition to Build Spoken Language Systems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icip/HuttunenH08> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/icip/HuttunenH08> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Multi-object tracking using binary masks' and the publication 'Using Knowledge Acquisition to Build Spoken Language Systems'?"],"info":{}}
{"id":"train_5632","question":"List the venues in which 'Inferring 3D layout of building facades from a single image' and 'Spatial stochastic models for analysis of heterogeneous cellular networks with repulsively deployed base stations' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/cvpr/PanHK15> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/pe/NakataM14> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Inferring 3D layout of building facades from a single image' and 'Spatial stochastic models for analysis of heterogeneous cellular networks with repulsively deployed base stations' published?"],"info":{}}
{"id":"train_5637","question":"Mention the years in which 'Online DR-Submodular Maximization: Minimizing Regret and Constraint Violation' and 'Color Segmentation and Figure-Ground Segregation of Natural Images' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/aaai/RautSF21> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/icip/WongL00> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Online DR-Submodular Maximization: Minimizing Regret and Constraint Violation' and 'Color Segmentation and Figure-Ground Segregation of Natural Images' published?"],"info":{}}
{"id":"train_5640","question":"List the venues in which 'Boredom-driven curious learning by Homeo-Heterostatic Value Gradients' and 'All in good time' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-1806-01502> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/ijgt/HeifetzP07> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Boredom-driven curious learning by Homeo-Heterostatic Value Gradients' and 'All in good time' published?"],"info":{}}
{"id":"train_5642","question":"Mention the venues in which 'Distributed Receding Horizon Control of Vehicle Platoons: Stability and String Stability' and 'Resiliency versus energy sustainability in optical inter-datacenter networks' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tac/DunbarC12> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/osn/RauenKM17> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Distributed Receding Horizon Control of Vehicle Platoons: Stability and String Stability' and 'Resiliency versus energy sustainability in optical inter-datacenter networks' were published."],"info":{}}
{"id":"train_5643","question":"Name the authors of 'Reactive User Behavior and Mobility Models' and 'BSP2OMP: A compiler for translating BSP programs to OpenMP'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-1709-06395> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-1709-06395> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Reactive User Behavior and Mobility Models' and 'BSP2OMP: A compiler for translating BSP programs to OpenMP'?"],"info":{}}
