{"id":"train_1338","question":"Did Andrea Tagliasacchi publish in CoRR in the last 8 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/46/5514> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'CoRR' }","paraphrases":["Has Andrea Tagliasacchi published in CoRR in the last eight years?"],"info":{}}
{"id":"train_1339","question":"Did Schmidt, Markus publish the paper 'Gesamtwirtschaftliche Analyse der automatischen Wiedereinschaltung (AWE) unter Ber\\u00FCcksichtigung von Kundenausfallskosten' in Elektrotech. Informationstechnik?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ei/SchmidtRF07> dblp:authoredBy <https://dblp.org/pid/45/1347-7> . <https://dblp.org/rec/journals/ei/SchmidtRF07> dblp:publishedIn 'Elektrotech. Informationstechnik' }","paraphrases":["Was the paper 'Gesamtwirtschaftliche Analyse der automatischen Wiedereinschaltung (AWE) unter Ber\\u00FCcksichtigung von Kundenausfallskosten' published by Markus Schmidt in Elektrotech. Informationstechnik?"],"info":{}}
{"id":"train_1340","question":"Did M. Rezvani publish in Soft Comput. in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/51/492> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn 'Soft Comput.' }","paraphrases":["Has Mohsen Rezvani published in Soft Comput. in the last 6 years?"],"info":{}}
{"id":"train_1341","question":"Was the paper 'Reliability Modelling of Time-Critical Distributed Systems' published by the person Punnekkat, S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ftrtft/HanssonNP00> dblp:authoredBy <https://dblp.org/pid/67/907> }","paraphrases":["Did Sasikumar Punnekkat publish the paper 'Reliability Modelling of Time-Critical Distributed Systems'?"],"info":{}}
{"id":"train_1342","question":"Did Jos\\u00E9 S. publish the paper 'Providing Adapted Contextual Information in an Overlay Vehicular Network' in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijdmbc/SantaMG10> dblp:authoredBy <https://dblp.org/pid/28/4769> . <https://dblp.org/rec/journals/ijdmbc/SantaMG10> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did Jos\\u00E9 S. publish the paper 'Providing Adapted Contextual Information in an Overlay Vehicular Network' in the last two years?"],"info":{}}
{"id":"train_1343","question":"Was the paper 'Process capability indices and product reliability' published by Bharatwaj Ramakrishnan in Microelectron. Reliab.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mr/RamakrishnanSP01> dblp:authoredBy <https://dblp.org/pid/23/102> . <https://dblp.org/rec/journals/mr/RamakrishnanSP01> dblp:publishedIn 'Microelectron. Reliab.' }","paraphrases":["Did Bharatwaj Ramakrishnan publish the paper 'Process capability indices and product reliability' in Microelectron. Reliab.?"],"info":{}}
{"id":"train_1344","question":"Did Xiaoyang Mou publish in iCAST in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/84/9077> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'iCAST' }","paraphrases":["Has Mou, Xiaoyang published in iCAST in the last 2 years?"],"info":{}}
{"id":"train_1345","question":"Was the paper 'Deterministic global optimization in isothermal reactor network synthesis' co-authored by William R. Esposito and C. A. Floudas?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jgo/EspositoF02> dblp:authoredBy <https://dblp.org/pid/04/6211> . <https://dblp.org/rec/journals/jgo/EspositoF02> dblp:authoredBy <https://dblp.org/pid/85/5741> }","paraphrases":["Did W. R. Esposito and Christodoulos A. Floudas co-author the paper 'Deterministic global optimization in isothermal reactor network synthesis'?"],"info":{}}
{"id":"train_1346","question":"Has Paolino D. Felice published in SIGSMALL/PC Symposium in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/62/2291> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'SIGSMALL/PC Symposium' }","paraphrases":["Did Paolino D. Felice publish in SIGSMALL/PC Symposium in the last 2 years?"],"info":{}}
{"id":"train_1347","question":"Have Edelman, S. and Nathan I. co-authored the paper 'Better limited systematicity in hand than structural descriptions in the bush: A reply to Hummel'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cogsci/EdelmanI03a> dblp:authoredBy <https://dblp.org/pid/e/ShimonEdelman> . <https://dblp.org/rec/journals/cogsci/EdelmanI03a> dblp:authoredBy <https://dblp.org/pid/87/4330> }","paraphrases":["Was the paper 'Better limited systematicity in hand than structural descriptions in the bush: A reply to Hummel' co-authored by Edelman, S. and Nathan I.?"],"info":{}}
{"id":"train_1349","question":"Was the paper 'General Composition of Software Artifacts' published by the person W. H. Harrison?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/soco/HarrisonOT06> dblp:authoredBy <https://dblp.org/pid/53/5572> }","paraphrases":["Did William H. Harrison publish the paper 'General Composition of Software Artifacts'?"],"info":{}}
{"id":"train_1350","question":"Did Mahdi Nabil and Alexander S. Rattner co-author the paper 'interThermalPhaseChangeFoam - A framework for two-phase flow simulations with thermally driven phase change'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/softx/NabilR16> dblp:authoredBy <https://dblp.org/pid/282/0812> . <https://dblp.org/rec/journals/softx/NabilR16> dblp:authoredBy <https://dblp.org/pid/180/6035> }","paraphrases":["Was the paper 'interThermalPhaseChangeFoam - A framework for two-phase flow simulations with thermally driven phase change' co-authored by Mahdi Nabil and Alexander S. Rattner?"],"info":{}}
{"id":"train_1353","question":"Did Guo, Wu publish the paper 'Parallel Phone Recognizer based MLLR Speaker Recognition'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscslp/WangGD08> dblp:authoredBy <https://dblp.org/pid/20/4480> }","paraphrases":["Was the paper 'Parallel Phone Recognizer based MLLR Speaker Recognition' published by the person Wu Guo?"],"info":{}}
{"id":"train_1357","question":"Was the paper 'Predicting Preference Judgments of Individual Normal and Hearing-Impaired Listeners With Gaussian Processes' co-authored by Heskes, Tom and Groot, P.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/taslp/GrootHDK11> dblp:authoredBy <https://dblp.org/pid/03/1145> . <https://dblp.org/rec/journals/taslp/GrootHDK11> dblp:authoredBy <https://dblp.org/pid/31/3145> }","paraphrases":["Have Tom Heskes and Perry Groot co-authored the paper 'Predicting Preference Judgments of Individual Normal and Hearing-Impaired Listeners With Gaussian Processes'?"],"info":{}}
{"id":"train_1358","question":"Was the paper 'A Study About Searching Behavior of Scientific Data User Based on Educational Background and Retrieval Capability' published by the author Guilan Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ifip12/ZhangWZLGW17> dblp:authoredBy <https://dblp.org/pid/124/5672> }","paraphrases":["Did Guilan Zhang publish the paper 'A Study About Searching Behavior of Scientific Data User Based on Educational Background and Retrieval Capability'?"],"info":{}}
{"id":"train_1359","question":"Did Sahasrabudhe, Shrirang P. publish the paper 'Understanding Blind User's Accessibility and Usability Problems in the Context of myITlab Simulated Environment'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcis/SahasrabudheL14> dblp:authoredBy <https://dblp.org/pid/224/9718> }","paraphrases":["Was the paper 'Understanding Blind User's Accessibility and Usability Problems in the Context of myITlab Simulated Environment' published by the author Sahasrabudhe, Shrirang P.?"],"info":{}}
{"id":"train_1360","question":"Did E. P. Simoncelli publish the paper 'Design of Multi-Dimensional Derivative Filters' in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icip/Simoncelli94> dblp:authoredBy <https://dblp.org/pid/30/5604> . <https://dblp.org/rec/conf/icip/Simoncelli94> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Did E. P. Simoncelli publish the paper 'Design of Multi-Dimensional Derivative Filters' in the last 6 years?"],"info":{}}
{"id":"train_1361","question":"Did Zhipeng Zhang publish the paper 'The maximum number of maximum dissociation sets in trees' in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jgt/TuZS21> dblp:authoredBy <https://dblp.org/pid/49/4941> . <https://dblp.org/rec/journals/jgt/TuZS21> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Did Zhipeng Zhang publish the paper 'The maximum number of maximum dissociation sets in trees' in the last 6 years?"],"info":{}}
{"id":"train_1362","question":"Did N. M. Marafih publish the paper 'Modeling and queueing analysis of variable-bit-rate coded video sources in ATM networks' in IEEE Trans. Circuits Syst. Video Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcsv/MarafihZP94> dblp:authoredBy <https://dblp.org/pid/87/10916> . <https://dblp.org/rec/journals/tcsv/MarafihZP94> dblp:publishedIn 'IEEE Trans. Circuits Syst. Video Technol.' }","paraphrases":["Was the paper 'Modeling and queueing analysis of variable-bit-rate coded video sources in ATM networks' published by N. M. Marafih in IEEE Trans. Circuits Syst. Video Technol.?"],"info":{}}
{"id":"train_1363","question":"Did Jun Chen publish in CoRR in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/85/5901> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'CoRR' }","paraphrases":["Has Jun Chen published in CoRR in the last 8 years?"],"info":{}}
{"id":"train_1365","question":"Has Ying Chen published in IEEE Trans. Circuits Syst. I Regul. Pap. in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/21/5521> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:publishedIn 'IEEE Trans. Circuits Syst. I Regul. Pap.' }","paraphrases":["Did Chen, Ying publish in IEEE Trans. Circuits Syst. I Regul. Pap. in the last 9 years?"],"info":{}}
{"id":"train_1366","question":"Did Yang Xiang publish the paper 'BHDA - A Blockchain-Based Hierarchical Data Access Model for Financial Services' in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/trustcom/XuYWWH0020> dblp:authoredBy <https://dblp.org/pid/50/2192-1> . <https://dblp.org/rec/conf/trustcom/XuYWWH0020> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did Yang X. publish the paper 'BHDA - A Blockchain-Based Hierarchical Data Access Model for Financial Services' in the last 2 years?"],"info":{}}
{"id":"train_1367","question":"Did Satish K. publish the paper 'Scattering center modelling of electrically large zigzag-grooved structures' in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icc/SzeK12> dblp:authoredBy <https://dblp.org/pid/122/5112> . <https://dblp.org/rec/conf/icc/SzeK12> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Did Satish Kashyap publish the paper 'Scattering center modelling of electrically large zigzag-grooved structures' in the last 8 years?"],"info":{}}
{"id":"train_1368","question":"Was the paper 'How good are slicing floorplans?' co-authored by Evangeline F. Y. Young and Martin D. F. Wong?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/integration/YoungW97> dblp:authoredBy <https://dblp.org/pid/y/EFYYoung> . <https://dblp.org/rec/journals/integration/YoungW97> dblp:authoredBy <https://dblp.org/pid/w/MartinDFWong> }","paraphrases":["Did Young, E. F. Y. and Martin D. F. Wong co-author the paper 'How good are slicing floorplans?'?"],"info":{}}
{"id":"train_1369","question":"Have Jadud, Matthew C. and Christian L. Jacobsen co-authored the paper 'Concurrency, Robotics, and RoboDeb'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaaiss/JacobsenJ07> dblp:authoredBy <https://dblp.org/pid/68/3618> . <https://dblp.org/rec/conf/aaaiss/JacobsenJ07> dblp:authoredBy <https://dblp.org/pid/60/2343> }","paraphrases":["Was the paper 'Concurrency, Robotics, and RoboDeb' co-authored by Jadud, Matthew C. and Christian L. Jacobsen?"],"info":{}}
{"id":"train_1370","question":"Did F. Blain publish in COLING in the last seven years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/97/11423> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:publishedIn 'COLING' }","paraphrases":["Has F. Blain published in COLING in the last 7 years?"],"info":{}}
{"id":"train_1372","question":"Did Imine, A. publish the paper 'Analyse d'activit\\u00E9 et exposition de la vie priv\\u00E9e sur les m\\u00E9dias sociaux'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/f-egc/AbidINRRR16> dblp:authoredBy <https://dblp.org/pid/55/2451> }","paraphrases":["Was the paper 'Analyse d'activit\\u00E9 et exposition de la vie priv\\u00E9e sur les m\\u00E9dias sociaux' published by the person Abdessamad Imine?"],"info":{}}
{"id":"train_1373","question":"Did Shinohara, Yusuke publish the paper 'Tying rotations of covariance matrices via riemannian subspace clustering' in ICASSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/Shinohara13> dblp:authoredBy <https://dblp.org/pid/49/407> . <https://dblp.org/rec/conf/icassp/Shinohara13> dblp:publishedIn 'ICASSP' }","paraphrases":["Was the paper 'Tying rotations of covariance matrices via riemannian subspace clustering' published by Shinohara, Yusuke in ICASSP?"],"info":{}}
{"id":"train_1374","question":"Did Martin Schall publish in ICDAR in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/181/5022> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'ICDAR' }","paraphrases":["Has Martin S. published in ICDAR in the last three years?"],"info":{}}
{"id":"train_1375","question":"Did M. T. Rahman and Olivia P. Paradis co-author the paper 'Is Backside the New Backdoor in Modern SoCs?: Invited Paper'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/itc/VashisthaRPA19> dblp:authoredBy <https://dblp.org/pid/228/3411> . <https://dblp.org/rec/conf/itc/VashisthaRPA19> dblp:authoredBy <https://dblp.org/pid/258/8756> }","paraphrases":["Was the paper 'Is Backside the New Backdoor in Modern SoCs?: Invited Paper' co-authored by M. T. Rahman and Olivia P. Paradis?"],"info":{}}
{"id":"train_1377","question":"Did P. Mahey publish the paper 'Bounds for global optimization of capacity expansion and flow assignment problems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/orl/LunaM00> dblp:authoredBy <https://dblp.org/pid/10/5991> }","paraphrases":["Was the paper 'Bounds for global optimization of capacity expansion and flow assignment problems' published by the person Mahey, P.?"],"info":{}}
{"id":"train_1379","question":"Was the paper 'An introduction to issues in higher order uncertainty' co-authored by Didier Dubois and Paul E. Lehner?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsmc/LehnerLD96> dblp:authoredBy <https://dblp.org/pid/d/DidierDubois> . <https://dblp.org/rec/journals/tsmc/LehnerLD96> dblp:authoredBy <https://dblp.org/pid/43/3269> }","paraphrases":["Did D. Dubois and Paul E. Lehner co-author the paper 'An introduction to issues in higher order uncertainty'?"],"info":{}}
{"id":"train_1380","question":"Have Pag\\u00E8s, O. and Hajjaji, A. El co-authored the paper 'H\\u221E-based fault diagnosis for diesel engines'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEcca/BoulkrounePAZH14> dblp:authoredBy <https://dblp.org/pid/03/3074> . <https://dblp.org/rec/conf/IEEEcca/BoulkrounePAZH14> dblp:authoredBy <https://dblp.org/pid/85/2977> }","paraphrases":["Was the paper 'H\\u221E-based fault diagnosis for diesel engines' co-authored by Pag\\u00E8s, O. and Hajjaji, A. El?"],"info":{}}
{"id":"train_1381","question":"Was the paper 'Real-Time Volume Caustics with Image-Based Photon Tracing' published by the author Bin Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cadgraphics/WangWC11> dblp:authoredBy <https://dblp.org/pid/13/1898> }","paraphrases":["Was the paper 'Real-Time Volume Caustics with Image-Based Photon Tracing' published by the person named Bin Wang?"],"info":{}}
{"id":"train_1382","question":"Have Roc\\u00EDo-Erandi Barrientos-Mart\\u00EDnez and Humberto Carrillo-Calvet co-authored the paper 'On the Possibility of Reliably Constructing a Decision Support System for the Cytodiagnosis of Breast Cancer'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/series/asc/Cruz-RamirezACB07a> dblp:authoredBy <https://dblp.org/pid/18/1257> . <https://dblp.org/rec/series/asc/Cruz-RamirezACB07a> dblp:authoredBy <https://dblp.org/pid/94/196> }","paraphrases":["Was the paper 'On the Possibility of Reliably Constructing a Decision Support System for the Cytodiagnosis of Breast Cancer' co-authored by Roc\\u00EDo-Erandi Barrientos-Mart\\u00EDnez and Humberto Carrillo-Calvet?"],"info":{}}
{"id":"train_1383","question":"Was the paper 'A version-aware tool for design rationale' published by S. Gill in WebMedia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/webmedia/GillM06> dblp:authoredBy <https://dblp.org/pid/99/1734> . <https://dblp.org/rec/conf/webmedia/GillM06> dblp:publishedIn 'WebMedia' }","paraphrases":["Did S. Gill publish the paper 'A version-aware tool for design rationale' in WebMedia?"],"info":{}}
{"id":"train_1385","question":"Was the paper 'On existence of FIR principal component filter banks' published by the person Ahmet K.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/KiracV98> dblp:authoredBy <https://dblp.org/pid/96/2902> }","paraphrases":["Did Ahmet K. publish the paper 'On existence of FIR principal component filter banks'?"],"info":{}}
{"id":"train_1386","question":"Was the paper 'Energy-Based Models for Text' published by the person Arthur Szlam?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2004-10188> dblp:authoredBy <https://dblp.org/pid/22/6733> }","paraphrases":["Did Arthur Szlam publish the paper 'Energy-Based Models for Text'?"],"info":{}}
{"id":"train_1387","question":"Did Glanville, Ranulph publish the paper 'Obituary: Ernst von Glasersfeld 1917-2010' in the last 7 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chk/Glanville11a> dblp:authoredBy <https://dblp.org/pid/09/3323> . <https://dblp.org/rec/journals/chk/Glanville11a> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Did Ranulph Glanville publish the paper 'Obituary: Ernst von Glasersfeld 1917-2010' in the last seven years?"],"info":{}}
{"id":"train_1389","question":"Has Hsing-Yu Chen published in Computing in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/115/6237> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'Computing' }","paraphrases":["Did Hsing-Yu Chen publish in Computing in the last three years?"],"info":{}}
{"id":"train_1390","question":"Did Woldemar F. Fuhrmann publish in INC in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/65/3918> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'INC' }","paraphrases":["Has Woldemar F. Fuhrmann published in INC in the last 3 years?"],"info":{}}
{"id":"train_1391","question":"Was the paper 'The hierarchical flow of eye movements' published by the person named A. Kumar?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/etra/BurchKM18> dblp:authoredBy <https://dblp.org/pid/195/7525-4> }","paraphrases":["Did Ayush Kumar publish the paper 'The hierarchical flow of eye movements'?"],"info":{}}
{"id":"train_1392","question":"Did M. C. V. Suresh and Edward, J. Belwin co-author the paper 'A hybrid algorithm based optimal placement of DG units for loss reduction in the distribution system'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/asc/SureshE20> dblp:authoredBy <https://dblp.org/pid/267/1505> . <https://dblp.org/rec/journals/asc/SureshE20> dblp:authoredBy <https://dblp.org/pid/195/3287> }","paraphrases":["Was the paper 'A hybrid algorithm based optimal placement of DG units for loss reduction in the distribution system' co-authored by Suresh, M. C. V. and J. Belwin Edward?"],"info":{}}
{"id":"train_1393","question":"Has Philip M. Arnold published in Cryptologia in the last nine years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/166/8443> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:publishedIn 'Cryptologia' }","paraphrases":["Did Philip M. Arnold publish in Cryptologia in the last 9 years?"],"info":{}}
{"id":"train_1394","question":"Has Ying-Jun Angela Zhang published in CoRR in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/80/3143> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn 'CoRR' }","paraphrases":["Did Zhang, Y. Angela publish in CoRR in the last five years?"],"info":{}}
{"id":"train_1395","question":"Did Daemen, Joan publish the paper 'Sufficient conditions for sound tree and sequential hashing modes' in IACR Cryptol. ePrint Arch.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iacr/BertoniDPA09> dblp:authoredBy <https://dblp.org/pid/93/3962> . <https://dblp.org/rec/journals/iacr/BertoniDPA09> dblp:publishedIn 'IACR Cryptol. ePrint Arch.' }","paraphrases":["Was the paper 'Sufficient conditions for sound tree and sequential hashing modes' published by Daemen, Joan in IACR Cryptol. ePrint Arch.?"],"info":{}}
{"id":"train_1396","question":"Have Christian Kroos and Hogan, Katherine co-authored the paper 'Visual influence on auditory perception: is speech special?'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/avsp/KroosH09> dblp:authoredBy <https://dblp.org/pid/74/7939> . <https://dblp.org/rec/conf/avsp/KroosH09> dblp:authoredBy <https://dblp.org/pid/142/7260> }","paraphrases":["Was the paper 'Visual influence on auditory perception: is speech special?' co-authored by Christian Kroos and Hogan, Katherine?"],"info":{}}
{"id":"train_1397","question":"Was the paper 'The Average-Case Complexity of Counting Cliques in Erd\\u0151s-R\\u00E9nyi Hypergraphs' published by Brennan, M. S. in FOCS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/focs/Boix-AdseraBB19> dblp:authoredBy <https://dblp.org/pid/299/5790> . <https://dblp.org/rec/conf/focs/Boix-AdseraBB19> dblp:publishedIn 'FOCS' }","paraphrases":["Did Matthew S. Brennan publish the paper 'The Average-Case Complexity of Counting Cliques in Erd\\u0151s-R\\u00E9nyi Hypergraphs' in IEEE Symposium on Foundations of Computer Science?"],"info":{}}
{"id":"train_1398","question":"Was the paper 'Coevolutive planning in markov decision processes' published by Fran\\u00E7ois Charpillet in AAMAS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/atal/ScherrerC02> dblp:authoredBy <https://dblp.org/pid/08/5348> . <https://dblp.org/rec/conf/atal/ScherrerC02> dblp:publishedIn 'AAMAS' }","paraphrases":["Did Charpillet, F. publish the paper 'Coevolutive planning in markov decision processes' in International Joint Conference on Autonomous Agents and Multiagent Systems?"],"info":{}}
{"id":"train_1399","question":"Was the paper 'Parallel Computing of Spatio-Temporal Model Based on Deep Reinforcement Learning' published by Li, J. in WASA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wasa/LvLXWL21> dblp:authoredBy <https://dblp.org/pid/19/1228> . <https://dblp.org/rec/conf/wasa/LvLXWL21> dblp:publishedIn 'WASA (1)' }","paraphrases":["Did Li, J. publish the paper 'Parallel Computing of Spatio-Temporal Model Based on Deep Reinforcement Learning' in WASA (1)?"],"info":{}}
{"id":"train_1400","question":"Wasn't the paper 'Compressed-Domain Classification of Texture Images' published by the author Bayoumi, M. A. in CAMP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/camp/WilsonB00> dblp:authoredBy <https://dblp.org/pid/b/MagdyABayoumi> . <https://dblp.org/rec/conf/camp/WilsonB00> dblp:publishedIn 'CAMP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/camp/WilsonB00> dblp:authoredBy <https://dblp.org/pid/b/MagdyABayoumi> . <https://dblp.org/rec/conf/camp/WilsonB00> dblp:publishedIn 'CAMP' } }","paraphrases":["Was the paper 'Compressed-Domain Classification of Texture Images' not published by Bayoumi, M. A. in CAMP?"],"info":{}}
{"id":"train_1401","question":"Wasn't the paper 'Combinatorial operators and their quasi-inverses' published by the author Vladeta Vuckovic in Notre Dame J. Formal Log.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ndjfl/Vuckovic71> dblp:authoredBy <https://dblp.org/pid/149/6694> . <https://dblp.org/rec/journals/ndjfl/Vuckovic71> dblp:publishedIn 'Notre Dame J. Formal Log.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ndjfl/Vuckovic71> dblp:authoredBy <https://dblp.org/pid/149/6694> . <https://dblp.org/rec/journals/ndjfl/Vuckovic71> dblp:publishedIn 'Notre Dame J. Formal Log.' } }","paraphrases":["Has the paper 'Combinatorial operators and their quasi-inverses' not been published by Vladeta Vuckovic in Notre Dame J. Formal Log.?"],"info":{}}
{"id":"train_1402","question":"Was the paper 'A Priority Queue Transform' not published by the person Michael L. Fredman?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wae/Fredman99> dblp:authoredBy <https://dblp.org/pid/15/454> FILTER NOT EXISTS { <https://dblp.org/rec/conf/wae/Fredman99> dblp:authoredBy <https://dblp.org/pid/15/454> } }","paraphrases":["Was the paper 'A Priority Queue Transform' not published by Michael L. Fredman?"],"info":{}}
{"id":"train_1404","question":"Did K. Michael not publish the paper 'Emerging Forms of Covert Surveillance Using GPS-Enabled Devices' in J. Cases Inf. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcit-igi/AbbasMMA11> dblp:authoredBy <https://dblp.org/pid/75/1359> . <https://dblp.org/rec/journals/jcit-igi/AbbasMMA11> dblp:publishedIn 'J. Cases Inf. Technol.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jcit-igi/AbbasMMA11> dblp:authoredBy <https://dblp.org/pid/75/1359> . <https://dblp.org/rec/journals/jcit-igi/AbbasMMA11> dblp:publishedIn 'J. Cases Inf. Technol.' } }","paraphrases":["Was the paper 'Emerging Forms of Covert Surveillance Using GPS-Enabled Devices' not published by K. Michael in J. Cases Inf. Technol.?"],"info":{}}
{"id":"train_1405","question":"Was the paper 'A decision support framework for a zoonosis prediction system: case study of Salmonellosis' not published by Adhistya Erna Permanasari?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijmei/PermanasariRD11> dblp:authoredBy <https://dblp.org/pid/29/7481> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijmei/PermanasariRD11> dblp:authoredBy <https://dblp.org/pid/29/7481> } }","paraphrases":["Wasn't the paper 'A decision support framework for a zoonosis prediction system: case study of Salmonellosis' not published by the person named Adhistya Erna Permanasari?"],"info":{}}
{"id":"train_1406","question":"Was the paper 'SoundFactory: a framework for generating datasets for deep learning SELD algorithms' not published by Alberto Scionti in CF?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cf/SciontiCT20> dblp:authoredBy <https://dblp.org/pid/45/7691> . <https://dblp.org/rec/conf/cf/SciontiCT20> dblp:publishedIn 'CF' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cf/SciontiCT20> dblp:authoredBy <https://dblp.org/pid/45/7691> . <https://dblp.org/rec/conf/cf/SciontiCT20> dblp:publishedIn 'CF' } }","paraphrases":["Wasn't the paper 'SoundFactory: a framework for generating datasets for deep learning SELD algorithms' published by the author Scionti, A. in CF?"],"info":{}}
{"id":"train_1407","question":"Was the paper 'A mechanism for replicated data consistency in mobile computing environments' not co-authored by Lifschitz, S\\u00E9rgio and A. Brayner?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sac/MonteiroBL07> dblp:authoredBy <https://dblp.org/pid/l/SLifschitz> . <https://dblp.org/rec/conf/sac/MonteiroBL07> dblp:authoredBy <https://dblp.org/pid/b/AngeloBrayner> FILTER NOT EXISTS { <https://dblp.org/rec/conf/sac/MonteiroBL07> dblp:authoredBy <https://dblp.org/pid/l/SLifschitz> . <https://dblp.org/rec/conf/sac/MonteiroBL07> dblp:authoredBy <https://dblp.org/pid/b/AngeloBrayner> } }","paraphrases":["Have S\\u00E9rgio Lifschitz and Angelo Brayner not co-authored the paper 'A mechanism for replicated data consistency in mobile computing environments'?"],"info":{}}
{"id":"train_1408","question":"Wasn't the paper 'Bayesian user modeling: evaluation metrics of an adaptive user interface' published by the author Abid, Mohamed in International Conference on Machine Vision?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icmv/RimAMA16> dblp:authoredBy <https://dblp.org/pid/71/1639> . <https://dblp.org/rec/conf/icmv/RimAMA16> dblp:publishedIn 'ICMV' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icmv/RimAMA16> dblp:authoredBy <https://dblp.org/pid/71/1639> . <https://dblp.org/rec/conf/icmv/RimAMA16> dblp:publishedIn 'ICMV' } }","paraphrases":["Was the paper 'Bayesian user modeling: evaluation metrics of an adaptive user interface' not published by Mohamed Abid in ICMV?"],"info":{}}
