{"id":"train_3692","question":"The paper 'Theoretical Foundations of Deep Learning via Sparse Representations: A Multilayer Sparse Model and Its Connection to Convolutional Neural Networks' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spm/PapyanRSE18> dblp:publishedIn ?answer }","paraphrases":["Where was 'Theoretical Foundations of Deep Learning via Sparse Representations: A Multilayer Sparse Model and Its Connection to Convolutional Neural Networks' published?"],"info":{}}
{"id":"train_3693","question":"Mention the year in which 'Modeling Functional Allocation in AltaRica to Support MBSE/MBSA Consistency' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/imbsa/MachinSVB19> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Modeling Functional Allocation in AltaRica to Support MBSE/MBSA Consistency' was published in which year?"],"info":{}}
{"id":"train_3694","question":"Mention the venue in which 'Cryptographic Foundations' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/books/crc/99/Desmedt99> dblp:publishedIn ?answer }","paraphrases":["Where was 'Cryptographic Foundations' published?"],"info":{}}
{"id":"train_3696","question":"Find the number of authors of the paper 'Guidance Vector Field Encoding based on Contraction Analysis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/eucc/WuCJD18> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Guidance Vector Field Encoding based on Contraction Analysis' have?"],"info":{}}
{"id":"train_3697","question":"The paper 'Distributed Leader Following of an Active Leader in Formation for Heterogeneous Multi-Agent Systems' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1909-08008> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Distributed Leader Following of an Active Leader in Formation for Heterogeneous Multi-Agent Systems' have?"],"info":{}}
{"id":"train_3698","question":"Mention the year in which 'Challenges in Data Production for AI with Human-in-the-Loop' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wsdm/Ustalov22> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Challenges in Data Production for AI with Human-in-the-Loop' published?"],"info":{}}
{"id":"train_3699","question":"The paper 'Study of Rotary-Linear Ultrasonic Motor Output Shafts' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijat/KanadaMT16> dblp:publishedIn ?answer }","paraphrases":["Where was 'Study of Rotary-Linear Ultrasonic Motor Output Shafts' published?"],"info":{}}
{"id":"train_3700","question":"List the authors of the paper 'Online Bipartite Matching with Reusable Resources'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigecom/DelongFNS22> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Online Bipartite Matching with Reusable Resources'?"],"info":{}}
{"id":"train_3701","question":"Mention the number of authors of the paper 'The Importance of Statistical Evidence for Focussed Bayesian Fusion'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/ki/SanderKB10> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'The Importance of Statistical Evidence for Focussed Bayesian Fusion' has how many authors?"],"info":{}}
{"id":"train_3702","question":"What year was 'Conception physique d'un entrep\\u00F4t de donn\\u00E9es distribu\\u00E9es bas\\u00E9e sur K-means \\u00E9quilibr\\u00E9' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/f-egc/RamdaneBKB19> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Conception physique d'un entrep\\u00F4t de donn\\u00E9es distribu\\u00E9es bas\\u00E9e sur K-means \\u00E9quilibr\\u00E9' was published in which year?"],"info":{}}
{"id":"train_3703","question":"Mention the year in which 'A Mining Algorithm Using Property Items Extracted from Sampled Examples' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ilp/MotoyamaUNI06> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'A Mining Algorithm Using Property Items Extracted from Sampled Examples' was published in which year?"],"info":{}}
{"id":"train_3705","question":"Find the number of authors of the paper 'Developments in Practice VIII: Enterprise Content Management'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/cais/SmithM03a> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Developments in Practice VIII: Enterprise Content Management' have?"],"info":{}}
{"id":"train_3706","question":"Name the authors of the paper 'Performance of Distributed Memory Methods in Multiprocessing Clusters'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hicss/CrandallL98> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'Performance of Distributed Memory Methods in Multiprocessing Clusters'."],"info":{}}
{"id":"train_3707","question":"When was '\\It's in love with you\\: communicating status and preference with simple product movements' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/chi/MortensenHBP12> dblp:yearOfPublication ?answer }","paraphrases":["'\\It's in love with you\\: communicating status and preference with simple product movements' was published in which year?"],"info":{}}
{"id":"train_3708","question":"Find the venue in which the paper 'Rebirth-20 - Relive After the COVID-19 and Keep Preventing Against it' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vr/MinderSCM21> dblp:publishedIn ?answer }","paraphrases":["Mention the venue in which 'Rebirth-20 - Relive After the COVID-19 and Keep Preventing Against it' was published."],"info":{}}
{"id":"train_3709","question":"Find the venue in which the paper 'Learning memory management with C-Sim: A C-based visual tool' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/caee/Perez-Schofield19> dblp:publishedIn ?answer }","paraphrases":["Mention the venue in which 'Learning memory management with C-Sim: A C-based visual tool' was published."],"info":{}}
{"id":"train_3710","question":"The paper 'Software Development Environments for Scientific and Engineering Software: A Series of Case Studies' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icse/CarverKSP07> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Software Development Environments for Scientific and Engineering Software: A Series of Case Studies' published?"],"info":{}}
{"id":"train_3711","question":"Mention the year in which 'Code-Division OFDM Joint Communication and Sensing System for 6G Machine-Type Communication' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iotj/ChenFWZY21> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Code-Division OFDM Joint Communication and Sensing System for 6G Machine-Type Communication' published?"],"info":{}}
{"id":"train_3712","question":"Find the number of authors of the paper 'Resting-State fMRI Functional Connectivity: Big Data Preprocessing Pipelines and Topological Data Analysis'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/tbd/PhinyomarkIP17> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Resting-State fMRI Functional Connectivity: Big Data Preprocessing Pipelines and Topological Data Analysis' has how many authors?"],"info":{}}
{"id":"train_3714","question":"The paper 'The Fixpoint-Iteration Algorithm for Parity Games' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/BruseFL14> dblp:yearOfPublication ?answer }","paraphrases":["When was 'The Fixpoint-Iteration Algorithm for Parity Games' published?"],"info":{}}
{"id":"train_3715","question":"Mention the number of authors of the paper 'Meta-Pose: Environment-adaptive Human Skeleton Tracking with RFID'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/globecom/0025WWM21> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Meta-Pose: Environment-adaptive Human Skeleton Tracking with RFID' have?"],"info":{}}
{"id":"train_3716","question":"The paper 'Unrooted unordered homeomorphic subtree alignment of RNA trees' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/almob/MiloZKBDZ13> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Unrooted unordered homeomorphic subtree alignment of RNA trees' published?"],"info":{}}
{"id":"train_3718","question":"How many authors does 'Run-Time Checking in Lisp by Integrating Memory Addressing and Range Checking' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/isca/SatoIG89> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Run-Time Checking in Lisp by Integrating Memory Addressing and Range Checking' has how many authors?"],"info":{}}
{"id":"train_3719","question":"'Convergence theorems for equilibrium problem, variational inequality problem and countably infinite relatively quasi-nonexpansive mappings' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/amc/ZegeyeOS10> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Convergence theorems for equilibrium problem, variational inequality problem and countably infinite relatively quasi-nonexpansive mappings'?"],"info":{}}
{"id":"train_3720","question":"Who wrote the paper 'f-SWRL: A Fuzzy Extension of SWRL'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jods/PanSSTH06> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'f-SWRL: A Fuzzy Extension of SWRL'?"],"info":{}}
{"id":"train_3721","question":"'Cross-vendor evaluation of key user-defined clinical decision support capabilities: a scenario-based assessment of certified electronic health records with guidelines for future development' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jamia/McCoyWS15> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Cross-vendor evaluation of key user-defined clinical decision support capabilities: a scenario-based assessment of certified electronic health records with guidelines for future development'?"],"info":{}}
{"id":"train_3722","question":"Mention the venue in which 'AI in the News' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/aim/Glick04> dblp:publishedIn ?answer }","paraphrases":["The paper 'AI in the News' was published in which venue?"],"info":{}}
{"id":"train_3723","question":"The paper 'Statistical shape analysis of neuroanatomical structures based on medial models' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mia/StynerGLJW03> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Statistical shape analysis of neuroanatomical structures based on medial models' published?"],"info":{}}
{"id":"train_3724","question":"List the authors of the paper 'Real-time gravitational-wave science with neural posterior estimation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2106-12594> dblp:authoredBy ?answer }","paraphrases":["Name the authors of the paper 'Real-time gravitational-wave science with neural posterior estimation'."],"info":{}}
{"id":"train_3726","question":"In which venue was the paper 'Assessing store performance models' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/eor/PaulerTG09> dblp:publishedIn ?answer }","paraphrases":["The paper 'Assessing store performance models' was published in which venue?"],"info":{}}
{"id":"train_3727","question":"Find the venue in which the paper 'An Effective Neural Learning Algorithm for Extracting Cross-Correlation Feature Between Two High-Dimensional Data Streams' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/npl/KongMAZ15> dblp:publishedIn ?answer }","paraphrases":["Mention the venue in which 'An Effective Neural Learning Algorithm for Extracting Cross-Correlation Feature Between Two High-Dimensional Data Streams' was published."],"info":{}}
{"id":"train_3728","question":"The paper 'Design and Implementation of Virtual Museum Based on Web3D' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tedu/ZhangY09> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Design and Implementation of Virtual Museum Based on Web3D' published?"],"info":{}}
{"id":"train_3729","question":"Name the authors of the paper 'Measurement and modeling of an ultra-wide bandwidth indoor channel'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcom/GhassemzadehJRTT04> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'Measurement and modeling of an ultra-wide bandwidth indoor channel'."],"info":{}}
{"id":"train_3730","question":"Who is the author of the paper 'Directional source grouping for multi-agent itinerary planning in wireless sensor networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ictc/0003GL10> dblp:authoredBy ?answer }","paraphrases":["'Directional source grouping for multi-agent itinerary planning in wireless sensor networks' was authored by which authors?"],"info":{}}
{"id":"train_3731","question":"Mention the venue in which 'Shuffled languages - Representation and recognition' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcs/BerglundBB13> dblp:publishedIn ?answer }","paraphrases":["Find the venue in which the paper 'Shuffled languages - Representation and recognition' was published."],"info":{}}
{"id":"train_3733","question":"Mention the number of authors of the paper 'Air Quality Based Informational Intervention Framework To Promote Healthy And Active School Travel'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/euspn/AhmedAJYW18> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Air Quality Based Informational Intervention Framework To Promote Healthy And Active School Travel' has how many authors?"],"info":{}}
{"id":"train_3735","question":"Find the number of authors of the paper 'Introduction'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/lalc/Walter13> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Introduction' have?"],"info":{}}
{"id":"train_3737","question":"Who wrote the paper 'Writing Collaboratively in the Continuation Task via Shared Docs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sete/JinLGC21> dblp:authoredBy ?answer }","paraphrases":["'Writing Collaboratively in the Continuation Task via Shared Docs' was authored by which authors?"],"info":{}}
{"id":"train_3738","question":"Mention the year in which 'Generalized Change and the Meaning of Rationality Postulates' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sLogica/Wassermann03> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Generalized Change and the Meaning of Rationality Postulates' published?"],"info":{}}
{"id":"train_3740","question":"Find the number of authors of the paper 'Using Wireless Sensor Networks for Vehicles and Pedestrian Movement Tracking'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/tst/LogaRS19> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Using Wireless Sensor Networks for Vehicles and Pedestrian Movement Tracking' have?"],"info":{}}
{"id":"train_3742","question":"Find the number of authors of the paper 'Review: Book Review'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/cj/Needham61a> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Review: Book Review' have?"],"info":{}}
{"id":"train_3744","question":"The paper 'Ensemble of Convolutional Neural Networks for P300 Speller in Brain Computer Interface' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icann/ShanLS19> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Ensemble of Convolutional Neural Networks for P300 Speller in Brain Computer Interface' have?"],"info":{}}
{"id":"train_3745","question":"The paper 'A multiscale representation method for nonrigid shapes with a single closed contour' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcsv/AdamekO04> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'A multiscale representation method for nonrigid shapes with a single closed contour' published?"],"info":{}}
{"id":"train_3746","question":"Mention the venue in which 'Effective Abstract Reasoning with Dual-Contrast Network' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2205-13720> dblp:publishedIn ?answer }","paraphrases":["The paper 'Effective Abstract Reasoning with Dual-Contrast Network' was published in which venue?"],"info":{}}
{"id":"train_3747","question":"The paper 'Fast Domain Decomposition Type Solver for Stiffness Matrices of Reference p-Elements' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cmam/Korneev13> dblp:publishedIn ?answer }","paraphrases":["Where was 'Fast Domain Decomposition Type Solver for Stiffness Matrices of Reference p-Elements' published?"],"info":{}}
{"id":"train_3749","question":"'Dynamic Role and Context-Based Access Control for Grid Applications' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pdcat/YaoHHL05> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Dynamic Role and Context-Based Access Control for Grid Applications'?"],"info":{}}
{"id":"train_3751","question":"Find the number of authors of the paper 'The Elastic Contact and Stability Analysis of an Inertial Micro-Switch with a Spring Stationary Electrode'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/sensors/ChenWKS18> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'The Elastic Contact and Stability Analysis of an Inertial Micro-Switch with a Spring Stationary Electrode' have?"],"info":{}}
{"id":"train_3752","question":"What year was 'Privacy via Subsumption' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iandc/RieckeS02> dblp:yearOfPublication ?answer }","paraphrases":["'Privacy via Subsumption' was published in which year?"],"info":{}}
{"id":"train_3753","question":"'Quantization based wavelet transformation technique for digital image compression with removal of multiple artifacts and noises' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cluster/KumarM19> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Quantization based wavelet transformation technique for digital image compression with removal of multiple artifacts and noises'?"],"info":{}}
{"id":"train_3754","question":"Name the authors of the paper '07431 Abstracts Collection - Computational Issues in Social Choice'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dagstuhl/EndrissLRS07a> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper '07431 Abstracts Collection - Computational Issues in Social Choice'?"],"info":{}}
{"id":"train_3755","question":"Who wrote the paper 'Access to information on websites of brazilian superior courts of justice: comparative analysis between data from 2013 and 2017'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dgo/KurtzSR18> dblp:authoredBy ?answer }","paraphrases":["'Access to information on websites of brazilian superior courts of justice: comparative analysis between data from 2013 and 2017' was authored by which authors?"],"info":{}}
{"id":"train_3757","question":"Mention the year in which 'Heavy Tails: The Effect of the Service Discipline' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cpe/BorstBQ02> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Heavy Tails: The Effect of the Service Discipline' was published in which year?"],"info":{}}
{"id":"train_3758","question":"How many authors does the publication 'Algorithms for Almost Block Diagonal Linear Systems' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/siamrev/FairweatherG04> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Algorithms for Almost Block Diagonal Linear Systems' have?"],"info":{}}
{"id":"train_3760","question":"When was 'Relationship between psychological traits and automated classification of pain intensity' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/companion/MaGT015> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Relationship between psychological traits and automated classification of pain intensity' was published in which year?"],"info":{}}
{"id":"train_3761","question":"Mention the year in which 'A Novel Method for the Automatic Generation of JOP Chain Exploits' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ncs/BrizendineB21> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'A Novel Method for the Automatic Generation of JOP Chain Exploits' was published in which year?"],"info":{}}
{"id":"train_3763","question":"Who is the author of the paper 'Health-Focused Optimal Power Flow'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isgt/KumarPNDGN21> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'Health-Focused Optimal Power Flow'."],"info":{}}
{"id":"train_3764","question":"The paper 'Content-Based Peer-to-Peer Network Overlay for Full-Text Federated Search' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/riao/LuC07> dblp:publishedIn ?answer }","paraphrases":["Where was 'Content-Based Peer-to-Peer Network Overlay for Full-Text Federated Search' published?"],"info":{}}
{"id":"train_3765","question":"Mention the year in which 'The firing statistics of Poisson neuron models driven by slow stimuli' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bc/UrdapilletaS09> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'The firing statistics of Poisson neuron models driven by slow stimuli' published?"],"info":{}}
{"id":"train_3767","question":"How many authors does the publication 'Climebot: An argumentative agent for climate change' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/iccp2/ToniucG17> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Climebot: An argumentative agent for climate change' has how many authors?"],"info":{}}
{"id":"train_3768","question":"Find the number of authors of the paper 'Predicting query reformulation during web searching'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/chi/JansenBS09> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Predicting query reformulation during web searching' have?"],"info":{}}
{"id":"train_3769","question":"In which venue was the paper 'Unsupervised deep domain adaptation for hyperspectral image classification' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/igarss/Li000Z19> dblp:publishedIn ?answer }","paraphrases":["The paper 'Unsupervised deep domain adaptation for hyperspectral image classification' was published in which venue?"],"info":{}}
{"id":"train_3770","question":"Mention the venue in which 'Contrast image correction method' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jei/SchettiniGCMCC10> dblp:publishedIn ?answer }","paraphrases":["Where was 'Contrast image correction method' published?"],"info":{}}
{"id":"train_3772","question":"Who is the author of the paper 'On the dual minimum distance and minimum weight of codes from a quotient of the Hermitian curve'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/aaecc/BallicoR13> dblp:authoredBy ?answer }","paraphrases":["'On the dual minimum distance and minimum weight of codes from a quotient of the Hermitian curve' was authored by which authors?"],"info":{}}
{"id":"train_3773","question":"The paper 'How good are MatLab, Octave and Scilab for Computational Modelling?' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1207-1916> dblp:publishedIn ?answer }","paraphrases":["Where was 'How good are MatLab, Octave and Scilab for Computational Modelling?' published?"],"info":{}}
{"id":"train_3776","question":"How many authors does 'Batch-Augmented Multi-Agent Reinforcement Learning for Efficient Traffic Signal Optimization' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2005-09624> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Batch-Augmented Multi-Agent Reinforcement Learning for Efficient Traffic Signal Optimization' has how many authors?"],"info":{}}
{"id":"train_3777","question":"How many authors does the publication 'The Use of Blogs as Knowledge Sharing in MBA' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/kmo/Lau13> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'The Use of Blogs as Knowledge Sharing in MBA' has how many authors?"],"info":{}}
{"id":"train_3778","question":"Find the venue in which the paper 'Design Study of Adaptive Fuzzy PID Controller for LOS Stabilized System' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isda/JiLX06> dblp:publishedIn ?answer }","paraphrases":["Where was 'Design Study of Adaptive Fuzzy PID Controller for LOS Stabilized System' published?"],"info":{}}
{"id":"train_3779","question":"List the authors of the paper 'The Gr\\u00F6bner fan and Gr\\u00F6bner walk for modules'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jsc/Auerbach05> dblp:authoredBy ?answer }","paraphrases":["'The Gr\\u00F6bner fan and Gr\\u00F6bner walk for modules' was authored by which authors?"],"info":{}}
{"id":"train_3780","question":"Name the authors of the paper 'A Unifying Approach to Goal-directed Evaluation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ngc/DanvyGR01> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'A Unifying Approach to Goal-directed Evaluation'."],"info":{}}
{"id":"train_3781","question":"How many authors does 'Natural Language Descriptions of Deep Visual Features' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2201-11114> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Natural Language Descriptions of Deep Visual Features' has how many authors?"],"info":{}}
{"id":"train_3782","question":"'Refined bounds on the empirical distribution of good channel codes via concentration inequalities' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isit/RaginskyS13> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Refined bounds on the empirical distribution of good channel codes via concentration inequalities' published?"],"info":{}}
{"id":"train_3783","question":"What year was 'Review: Book Review' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cj/Churchhouse69> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Review: Book Review' was published in which year?"],"info":{}}
{"id":"train_3785","question":"List the authors of the paper 'Location-Aware Security Services for Wireless Sensor Networks Using Network Coding'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/infocom/AydayDF07> dblp:authoredBy ?answer }","paraphrases":["'Location-Aware Security Services for Wireless Sensor Networks Using Network Coding' was authored by which authors?"],"info":{}}
