{"id":"train_1463","question":"Wasn't the paper 'Study on Production Possibility Frontier Under Different Production Function Assumptions' not published by the author Jin Fan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icdsci/JiangF19> dblp:authoredBy <https://dblp.org/pid/47/1484> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icdsci/JiangF19> dblp:authoredBy <https://dblp.org/pid/47/1484> } }","paraphrases":["Did Jin Fan not publish the paper 'Study on Production Possibility Frontier Under Different Production Function Assumptions'?"],"info":{}}
{"id":"train_1465","question":"Did Habtom W. Resson and Huizhong Zhou not co-author the paper 'Multi-omic approaches for liver cancer biomarker discovery'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bibm/Resson16> dblp:authoredBy <https://dblp.org/pid/193/8017> . <https://dblp.org/rec/conf/bibm/Resson16> dblp:authoredBy <https://dblp.org/pid/91/6850> FILTER NOT EXISTS { <https://dblp.org/rec/conf/bibm/Resson16> dblp:authoredBy <https://dblp.org/pid/193/8017> . <https://dblp.org/rec/conf/bibm/Resson16> dblp:authoredBy <https://dblp.org/pid/91/6850> } }","paraphrases":["Was the paper 'Multi-omic approaches for liver cancer biomarker discovery' not co-authored by Habtom W. Resson and Huizhong Zhou?"],"info":{}}
{"id":"train_1466","question":"Wasn't the paper 'Merge Network for a Non-Von Neumann Accumulate Accelerator in a 3D Chip' published by the author Krishna, Tushar in ICRC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icrc/JainSDK18> dblp:authoredBy <https://dblp.org/pid/50/2421> . <https://dblp.org/rec/conf/icrc/JainSDK18> dblp:publishedIn 'ICRC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icrc/JainSDK18> dblp:authoredBy <https://dblp.org/pid/50/2421> . <https://dblp.org/rec/conf/icrc/JainSDK18> dblp:publishedIn 'ICRC' } }","paraphrases":["Did Tushar Krishna not publish the paper 'Merge Network for a Non-Von Neumann Accumulate Accelerator in a 3D Chip' in ICRC?"],"info":{}}
{"id":"train_1467","question":"Was the paper 'Is This Is Not an Atlas an Atlas? On the Pitfalls of Editing a Global Collection of Counter-Cartographies' not co-authored by Boris Michel and Halder, S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cartographica/HalderMS20> dblp:authoredBy <https://dblp.org/pid/278/1419> . <https://dblp.org/rec/journals/cartographica/HalderMS20> dblp:authoredBy <https://dblp.org/pid/278/2003> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cartographica/HalderMS20> dblp:authoredBy <https://dblp.org/pid/278/1419> . <https://dblp.org/rec/journals/cartographica/HalderMS20> dblp:authoredBy <https://dblp.org/pid/278/2003> } }","paraphrases":["Did Boris Michel and Severin Halder not co-author the paper 'Is This Is Not an Atlas an Atlas? On the Pitfalls of Editing a Global Collection of Counter-Cartographies'?"],"info":{}}
{"id":"train_1468","question":"Was the paper 'Pitch Angle Control of Wind Turbine Using Adaptive Fuzzy-PID Controller' not published by Hamoodi, A. N.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ew/HamoodiHH20> dblp:authoredBy <https://dblp.org/pid/269/9822> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ew/HamoodiHH20> dblp:authoredBy <https://dblp.org/pid/269/9822> } }","paraphrases":["Did Ali N. Hamoodi not publish the paper 'Pitch Angle Control of Wind Turbine Using Adaptive Fuzzy-PID Controller'?"],"info":{}}
{"id":"train_1469","question":"Was the paper 'DATeS: A Highly-Extensible Data Assimilation Testing Suite' not published by Ahmed Attia in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/AttiaS17> dblp:authoredBy <https://dblp.org/pid/120/3995> . <https://dblp.org/rec/journals/corr/AttiaS17> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/AttiaS17> dblp:authoredBy <https://dblp.org/pid/120/3995> . <https://dblp.org/rec/journals/corr/AttiaS17> dblp:publishedIn 'CoRR' } }","paraphrases":["Wasn't the paper 'DATeS: A Highly-Extensible Data Assimilation Testing Suite' published by the author A. Attia in CoRR?"],"info":{}}
{"id":"train_1470","question":"Did Sasvari, Peter and Blei, David M. not co-author the paper 'The macroeconomic effect of the information and communication technology in Hungary'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1204-1561> dblp:authoredBy <https://dblp.org/pid/35/11269> . <https://dblp.org/rec/journals/corr/abs-1204-1561> dblp:authoredBy <https://dblp.org/pid/86/1910> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1204-1561> dblp:authoredBy <https://dblp.org/pid/35/11269> . <https://dblp.org/rec/journals/corr/abs-1204-1561> dblp:authoredBy <https://dblp.org/pid/86/1910> } }","paraphrases":["Was the paper 'The macroeconomic effect of the information and communication technology in Hungary' not co-authored by Sasvari, Peter and Blei, David M.?"],"info":{}}
{"id":"train_1471","question":"Was the paper 'Hybrid LS-SA-PS methods for solving fuzzy non-linear programming problems' not published by P. Vasant in Math. Comput. Model.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mcm/Vasant13> dblp:authoredBy <https://dblp.org/pid/125/1514> . <https://dblp.org/rec/journals/mcm/Vasant13> dblp:publishedIn 'Math. Comput. Model.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/mcm/Vasant13> dblp:authoredBy <https://dblp.org/pid/125/1514> . <https://dblp.org/rec/journals/mcm/Vasant13> dblp:publishedIn 'Math. Comput. Model.' } }","paraphrases":["Has the paper 'Hybrid LS-SA-PS methods for solving fuzzy non-linear programming problems' not been published by P. Vasant in Math. Comput. Model.?"],"info":{}}
{"id":"train_1473","question":"Did Sebastian Pape not publish the paper 'Privacy Concerns and Behavior of Pok\\u00E9mon Go Players in Germany' in Privacy and Identity Management?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/primelife/Harborth017> dblp:authoredBy <https://dblp.org/pid/09/7922> . <https://dblp.org/rec/conf/primelife/Harborth017> dblp:publishedIn 'Privacy and Identity Management' FILTER NOT EXISTS { <https://dblp.org/rec/conf/primelife/Harborth017> dblp:authoredBy <https://dblp.org/pid/09/7922> . <https://dblp.org/rec/conf/primelife/Harborth017> dblp:publishedIn 'Privacy and Identity Management' } }","paraphrases":["Has the paper 'Privacy Concerns and Behavior of Pok\\u00E9mon Go Players in Germany' not been published by Sebastian Pape in Privacy and Identity Management?"],"info":{}}
{"id":"train_1474","question":"Has Arya Tanmay Gupta not published the paper 'Burning Geometric Graphs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2010-01439> dblp:authoredBy <https://dblp.org/pid/261/3730> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2010-01439> dblp:authoredBy <https://dblp.org/pid/261/3730> } }","paraphrases":["Did Arya Tanmay Gupta not publish the paper 'Burning Geometric Graphs'?"],"info":{}}
{"id":"train_1475","question":"Did Petr Kremen not publish the paper 'Relational Data Mining Applied to Virtual Engineering of Product Designs' in ILP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ilp/ZakovaZGTLKM06> dblp:authoredBy <https://dblp.org/pid/77/5702> . <https://dblp.org/rec/conf/ilp/ZakovaZGTLKM06> dblp:publishedIn 'ILP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ilp/ZakovaZGTLKM06> dblp:authoredBy <https://dblp.org/pid/77/5702> . <https://dblp.org/rec/conf/ilp/ZakovaZGTLKM06> dblp:publishedIn 'ILP' } }","paraphrases":["Has the paper 'Relational Data Mining Applied to Virtual Engineering of Product Designs' not been published by Petr K. in ILP?"],"info":{}}
{"id":"train_1476","question":"Wasn't the paper 'Frequent Items on Streams' published by the author Metwally, A. in Encyclopedia of Database Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/reference/db/Metwally18> dblp:authoredBy <https://dblp.org/pid/44/3654> . <https://dblp.org/rec/reference/db/Metwally18> dblp:publishedIn 'Encyclopedia of Database Systems (2nd ed.)' FILTER NOT EXISTS { <https://dblp.org/rec/reference/db/Metwally18> dblp:authoredBy <https://dblp.org/pid/44/3654> . <https://dblp.org/rec/reference/db/Metwally18> dblp:publishedIn 'Encyclopedia of Database Systems (2nd ed.)' } }","paraphrases":["Was the paper 'Frequent Items on Streams' not published by Ahmed Metwally in Encyclopedia of Database Systems?"],"info":{}}
{"id":"train_1477","question":"Was the paper 'Projected Gradient Descent Algorithms for Solving Nonlinear Inverse Problems with Generative Priors' not published by the person Zhaoqiang Liu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcai/LiuH22> dblp:authoredBy <https://dblp.org/pid/198/1405> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ijcai/LiuH22> dblp:authoredBy <https://dblp.org/pid/198/1405> } }","paraphrases":["Wasn't the paper 'Projected Gradient Descent Algorithms for Solving Nonlinear Inverse Problems with Generative Priors' not published by the author Z. Liu?"],"info":{}}
{"id":"train_1478","question":"Was the paper 'ISMB/ECCB 2021 proceedings' not published by Christophe Dessimoz in Bioinform.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bioinformatics/DessimozP21> dblp:authoredBy <https://dblp.org/pid/22/229> . <https://dblp.org/rec/journals/bioinformatics/DessimozP21> dblp:publishedIn 'Bioinform.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/bioinformatics/DessimozP21> dblp:authoredBy <https://dblp.org/pid/22/229> . <https://dblp.org/rec/journals/bioinformatics/DessimozP21> dblp:publishedIn 'Bioinform.' } }","paraphrases":["Wasn't the paper 'ISMB/ECCB 2021 proceedings' published by the author C. Dessimoz in Bioinform.?"],"info":{}}
{"id":"train_1480","question":"Was the paper 'On efficient 3D data dissemination' not published by Chu, Chung-Hua in Wirel. Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/winet/Chu13> dblp:authoredBy <https://dblp.org/pid/91/4286> . <https://dblp.org/rec/journals/winet/Chu13> dblp:publishedIn 'Wirel. Networks' FILTER NOT EXISTS { <https://dblp.org/rec/journals/winet/Chu13> dblp:authoredBy <https://dblp.org/pid/91/4286> . <https://dblp.org/rec/journals/winet/Chu13> dblp:publishedIn 'Wirel. Networks' } }","paraphrases":["Did Chu, Chung-Hua not publish the paper 'On efficient 3D data dissemination' in Wirel. Networks?"],"info":{}}
{"id":"train_1481","question":"Was the paper 'An intelligent assistant for interactive workflow composition' not published by Jihie K. in International Conference on Intelligent User Interfaces?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iui/KimSG04> dblp:authoredBy <https://dblp.org/pid/08/427> . <https://dblp.org/rec/conf/iui/KimSG04> dblp:publishedIn 'IUI' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iui/KimSG04> dblp:authoredBy <https://dblp.org/pid/08/427> . <https://dblp.org/rec/conf/iui/KimSG04> dblp:publishedIn 'IUI' } }","paraphrases":["Did Jihie K. not publish the paper 'An intelligent assistant for interactive workflow composition' in International Conference on Intelligent User Interfaces?"],"info":{}}
{"id":"train_1482","question":"Did Menzel, Wolfgang not publish the paper 'Robust Processing of Natural Language' in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-cmp-lg-9507003> dblp:authoredBy <https://dblp.org/pid/m/WolfgangMenzel> . <https://dblp.org/rec/journals/corr/abs-cmp-lg-9507003> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-cmp-lg-9507003> dblp:authoredBy <https://dblp.org/pid/m/WolfgangMenzel> . <https://dblp.org/rec/journals/corr/abs-cmp-lg-9507003> dblp:publishedIn 'CoRR' } }","paraphrases":["Was the paper 'Robust Processing of Natural Language' not published by Wolfgang Menzel in CoRR?"],"info":{}}
{"id":"train_1483","question":"Has the paper 'Runtime Verification on Hierarchical Properties of ROS-Based Robot Swarms' not been published by Chi Hu in IEEE Trans. Reliab.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tr/HuDYSZ20> dblp:authoredBy <https://dblp.org/pid/88/9232> . <https://dblp.org/rec/journals/tr/HuDYSZ20> dblp:publishedIn 'IEEE Trans. Reliab.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tr/HuDYSZ20> dblp:authoredBy <https://dblp.org/pid/88/9232> . <https://dblp.org/rec/journals/tr/HuDYSZ20> dblp:publishedIn 'IEEE Trans. Reliab.' } }","paraphrases":["Did Chi Hu not publish the paper 'Runtime Verification on Hierarchical Properties of ROS-Based Robot Swarms' in IEEE Trans. Reliab.?"],"info":{}}
{"id":"train_1484","question":"Have Cook, P. R. and Ananya Misra not co-authored the paper 'Building Collaborative Graphical interFaces in the Audicle'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nime/WangMC06> dblp:authoredBy <https://dblp.org/pid/33/6929> . <https://dblp.org/rec/conf/nime/WangMC06> dblp:authoredBy <https://dblp.org/pid/30/3154> FILTER NOT EXISTS { <https://dblp.org/rec/conf/nime/WangMC06> dblp:authoredBy <https://dblp.org/pid/33/6929> . <https://dblp.org/rec/conf/nime/WangMC06> dblp:authoredBy <https://dblp.org/pid/30/3154> } }","paraphrases":["Was the paper 'Building Collaborative Graphical interFaces in the Audicle' not co-authored by Cook, P. R. and A. Misra?"],"info":{}}
{"id":"train_1485","question":"Was the paper 'Neural Network Modelin of Nearshore Sandbar Behavior' not published by Pape, Leo in IJCNN?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcnn/PapeRWT06> dblp:authoredBy <https://dblp.org/pid/66/4580> . <https://dblp.org/rec/conf/ijcnn/PapeRWT06> dblp:publishedIn 'IJCNN' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ijcnn/PapeRWT06> dblp:authoredBy <https://dblp.org/pid/66/4580> . <https://dblp.org/rec/conf/ijcnn/PapeRWT06> dblp:publishedIn 'IJCNN' } }","paraphrases":["Did Leo Pape not publish the paper 'Neural Network Modelin of Nearshore Sandbar Behavior' in IJCNN?"],"info":{}}
{"id":"train_1486","question":"Was the paper 'Application of human-machine modeling technique in the flight safety simulation of civil aircraft' not published by Wei Z.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ical/ZhangMLG11> dblp:authoredBy <https://dblp.org/pid/10/4661-95> FILTER NOT EXISTS { <https://dblp.org/rec/conf/ical/ZhangMLG11> dblp:authoredBy <https://dblp.org/pid/10/4661-95> } }","paraphrases":["Has Wei Zhang not published the paper 'Application of human-machine modeling technique in the flight safety simulation of civil aircraft'?"],"info":{}}
{"id":"train_1487","question":"Did Kreutz-Delgado, K. not publish the paper 'Lip Posture Estimation using Kinematically Constrained Mixture Models' in BMVC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bmvc/KellyHKJ98> dblp:authoredBy <https://dblp.org/pid/15/5358> . <https://dblp.org/rec/conf/bmvc/KellyHKJ98> dblp:publishedIn 'BMVC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/bmvc/KellyHKJ98> dblp:authoredBy <https://dblp.org/pid/15/5358> . <https://dblp.org/rec/conf/bmvc/KellyHKJ98> dblp:publishedIn 'BMVC' } }","paraphrases":["Wasn't the paper 'Lip Posture Estimation using Kinematically Constrained Mixture Models' published by the author Kreutz-Delgado, K. in BMVC?"],"info":{}}
{"id":"train_1488","question":"Was the paper 'Design of topologically optimal microgripper' not published by Shyh-Chour Huang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/smc/HuangC08> dblp:authoredBy <https://dblp.org/pid/82/1675> FILTER NOT EXISTS { <https://dblp.org/rec/conf/smc/HuangC08> dblp:authoredBy <https://dblp.org/pid/82/1675> } }","paraphrases":["Wasn't the paper 'Design of topologically optimal microgripper' not published by the author Shyh-Chour Huang?"],"info":{}}
{"id":"train_1489","question":"Was the paper 'Linear analysis for determining and visualizing critical thermal boundaries of power systems' not published by Walter M. in ISGT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isgt/EntrikenMR15> dblp:authoredBy <https://dblp.org/pid/21/216> . <https://dblp.org/rec/conf/isgt/EntrikenMR15> dblp:publishedIn 'ISGT' FILTER NOT EXISTS { <https://dblp.org/rec/conf/isgt/EntrikenMR15> dblp:authoredBy <https://dblp.org/pid/21/216> . <https://dblp.org/rec/conf/isgt/EntrikenMR15> dblp:publishedIn 'ISGT' } }","paraphrases":["Has the paper 'Linear analysis for determining and visualizing critical thermal boundaries of power systems' not been published by Walter M. in ISGT?"],"info":{}}
{"id":"train_1490","question":"Has the paper 'Dual-Encoder Architecture with Encoder Selection for Joint Close-Talk and Far-Talk Speech Recognition' not been published by Marco Gaudesi in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2109-08744> dblp:authoredBy <https://dblp.org/pid/126/2116> . <https://dblp.org/rec/journals/corr/abs-2109-08744> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2109-08744> dblp:authoredBy <https://dblp.org/pid/126/2116> . <https://dblp.org/rec/journals/corr/abs-2109-08744> dblp:publishedIn 'CoRR' } }","paraphrases":["Wasn't the paper 'Dual-Encoder Architecture with Encoder Selection for Joint Close-Talk and Far-Talk Speech Recognition' published by the author Marco Gaudesi in CoRR?"],"info":{}}
{"id":"train_1491","question":"Did Guangyi Z. and Aristides G. not co-author the paper 'Diverse Rule Sets'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kdd/ZhangG20> dblp:authoredBy <https://dblp.org/pid/37/5580-1> . <https://dblp.org/rec/conf/kdd/ZhangG20> dblp:authoredBy <https://dblp.org/pid/g/AristidesGionis> FILTER NOT EXISTS { <https://dblp.org/rec/conf/kdd/ZhangG20> dblp:authoredBy <https://dblp.org/pid/37/5580-1> . <https://dblp.org/rec/conf/kdd/ZhangG20> dblp:authoredBy <https://dblp.org/pid/g/AristidesGionis> } }","paraphrases":["Was the paper 'Diverse Rule Sets' not co-authored by Guangyi Zhang and Aristides G.?"],"info":{}}
{"id":"train_1492","question":"Wasn't the paper 'On Unsupervised Nearest-neighbor Regression and Robust Loss Functions' not published by the author Kramer, O.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icaart/Kramer12> dblp:authoredBy <https://dblp.org/pid/34/4776> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icaart/Kramer12> dblp:authoredBy <https://dblp.org/pid/34/4776> } }","paraphrases":["Was the paper 'On Unsupervised Nearest-neighbor Regression and Robust Loss Functions' not published by the person Oliver Kramer?"],"info":{}}
{"id":"train_1493","question":"Has Noam Siegelman not published the paper 'Statistical learning abilities and their relation to language'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/llc/Siegelman20> dblp:authoredBy <https://dblp.org/pid/212/4309> FILTER NOT EXISTS { <https://dblp.org/rec/journals/llc/Siegelman20> dblp:authoredBy <https://dblp.org/pid/212/4309> } }","paraphrases":["Was the paper 'Statistical learning abilities and their relation to language' not published by the person Noam Siegelman?"],"info":{}}
{"id":"train_1494","question":"Has the paper 'Temporal Dynamics of Support and Attack Networks: From Argumentation to Zoology' not been published by John W. in Mechanizing Mathematical Reasoning?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/birthday/BarringerGW05> dblp:authoredBy <https://dblp.org/pid/62/2689-1> . <https://dblp.org/rec/conf/birthday/BarringerGW05> dblp:publishedIn 'Mechanizing Mathematical Reasoning' FILTER NOT EXISTS { <https://dblp.org/rec/conf/birthday/BarringerGW05> dblp:authoredBy <https://dblp.org/pid/62/2689-1> . <https://dblp.org/rec/conf/birthday/BarringerGW05> dblp:publishedIn 'Mechanizing Mathematical Reasoning' } }","paraphrases":["Wasn't the paper 'Temporal Dynamics of Support and Attack Networks: From Argumentation to Zoology' published by the author John W. in Mechanizing Mathematical Reasoning?"],"info":{}}
{"id":"train_1495","question":"Was the paper 'Inverse NP Problems' not published by Hubie Chen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mfcs/Chen03a> dblp:authoredBy <https://dblp.org/pid/83/3627> FILTER NOT EXISTS { <https://dblp.org/rec/conf/mfcs/Chen03a> dblp:authoredBy <https://dblp.org/pid/83/3627> } }","paraphrases":["Wasn't the paper 'Inverse NP Problems' not published by the author Chen, H.?"],"info":{}}
{"id":"train_1496","question":"Was the paper 'A Model for Selecting Media Type of Memory Cues in Ubiquitous Prostheses' not published by Agroudy, Passant El?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aughuman/ElagroudyF022> dblp:authoredBy <https://dblp.org/pid/176/1036> FILTER NOT EXISTS { <https://dblp.org/rec/conf/aughuman/ElagroudyF022> dblp:authoredBy <https://dblp.org/pid/176/1036> } }","paraphrases":["Has Passant El Agroudy not published the paper 'A Model for Selecting Media Type of Memory Cues in Ubiquitous Prostheses'?"],"info":{}}
{"id":"train_1497","question":"Have Pierpaolo Degano and Zunino, Roberto not co-authored the paper 'Secure Service Orchestration'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fosad/BartolettiDFZ07> dblp:authoredBy <https://dblp.org/pid/90/1344> . <https://dblp.org/rec/conf/fosad/BartolettiDFZ07> dblp:authoredBy <https://dblp.org/pid/99/2362> FILTER NOT EXISTS { <https://dblp.org/rec/conf/fosad/BartolettiDFZ07> dblp:authoredBy <https://dblp.org/pid/90/1344> . <https://dblp.org/rec/conf/fosad/BartolettiDFZ07> dblp:authoredBy <https://dblp.org/pid/99/2362> } }","paraphrases":["Did Pierpaolo Degano and Roberto Zunino not co-author the paper 'Secure Service Orchestration'?"],"info":{}}
{"id":"train_1498","question":"Has David A. May not published the paper 'Pipelined, Flexible Krylov Subspace Methods'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamsc/SananSM16> dblp:authoredBy <https://dblp.org/pid/121/4022> FILTER NOT EXISTS { <https://dblp.org/rec/journals/siamsc/SananSM16> dblp:authoredBy <https://dblp.org/pid/121/4022> } }","paraphrases":["Was the paper 'Pipelined, Flexible Krylov Subspace Methods' not published by David A. May?"],"info":{}}
{"id":"train_1499","question":"Did Jumpei Mizuno and M. Kamata not co-author the paper 'Subject Selection Bias in Intervention Experiments with Socially Assistive Robots and the Impact on the Representativeness of the Population'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/socrob/IgarashiNMIK19> dblp:authoredBy <https://dblp.org/pid/253/4001> . <https://dblp.org/rec/conf/socrob/IgarashiNMIK19> dblp:authoredBy <https://dblp.org/pid/76/3656> FILTER NOT EXISTS { <https://dblp.org/rec/conf/socrob/IgarashiNMIK19> dblp:authoredBy <https://dblp.org/pid/253/4001> . <https://dblp.org/rec/conf/socrob/IgarashiNMIK19> dblp:authoredBy <https://dblp.org/pid/76/3656> } }","paraphrases":["Was the paper 'Subject Selection Bias in Intervention Experiments with Socially Assistive Robots and the Impact on the Representativeness of the Population' not co-authored by Jumpei Mizuno and Minoru Kamata?"],"info":{}}
{"id":"train_1500","question":"Did Siu, S. W. I. and Jimmy C. F. Ngai not co-author the paper 'ProtPOS: a python package for the prediction of protein preferred orientation on a surface'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bioinformatics/NgaiMS16> dblp:authoredBy <https://dblp.org/pid/32/4243> . <https://dblp.org/rec/journals/bioinformatics/NgaiMS16> dblp:authoredBy <https://dblp.org/pid/168/0731> FILTER NOT EXISTS { <https://dblp.org/rec/journals/bioinformatics/NgaiMS16> dblp:authoredBy <https://dblp.org/pid/32/4243> . <https://dblp.org/rec/journals/bioinformatics/NgaiMS16> dblp:authoredBy <https://dblp.org/pid/168/0731> } }","paraphrases":["Was the paper 'ProtPOS: a python package for the prediction of protein preferred orientation on a surface' not co-authored by Siu, S. W. I. and Jimmy C. F. Ngai?"],"info":{}}
{"id":"train_1501","question":"Has Kai-Chun N. not published the paper 'Implementing Joux-Vitse's Crossbred Algorithm for Solving MQ Systems over GF(2) on GPUs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iacr/NiederhagenNY17> dblp:authoredBy <https://dblp.org/pid/152/9560> FILTER NOT EXISTS { <https://dblp.org/rec/journals/iacr/NiederhagenNY17> dblp:authoredBy <https://dblp.org/pid/152/9560> } }","paraphrases":["Was the paper 'Implementing Joux-Vitse's Crossbred Algorithm for Solving MQ Systems over GF(2) on GPUs' not published by the person Kai-Chun N.?"],"info":{}}
{"id":"train_1502","question":"Did Shigeru Shimamoto and Onozato, Yoshikuni not co-author the paper 'Effect of Propagation Delays on ALOHA Systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cn/OnozatoLSN86> dblp:authoredBy <https://dblp.org/pid/89/6673> . <https://dblp.org/rec/journals/cn/OnozatoLSN86> dblp:authoredBy <https://dblp.org/pid/40/3206> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cn/OnozatoLSN86> dblp:authoredBy <https://dblp.org/pid/89/6673> . <https://dblp.org/rec/journals/cn/OnozatoLSN86> dblp:authoredBy <https://dblp.org/pid/40/3206> } }","paraphrases":["Have Shigeru Shimamoto and Onozato, Yoshikuni not co-authored the paper 'Effect of Propagation Delays on ALOHA Systems'?"],"info":{}}
{"id":"train_1503","question":"Wasn't the paper 'Towards multiple hypothesis situation analysis' published by the author Roy, J. in International Conference on Information Fusion?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fusion/Roy07> dblp:authoredBy <https://dblp.org/pid/50/5016> . <https://dblp.org/rec/conf/fusion/Roy07> dblp:publishedIn 'FUSION' FILTER NOT EXISTS { <https://dblp.org/rec/conf/fusion/Roy07> dblp:authoredBy <https://dblp.org/pid/50/5016> . <https://dblp.org/rec/conf/fusion/Roy07> dblp:publishedIn 'FUSION' } }","paraphrases":["Did Jean Roy not publish the paper 'Towards multiple hypothesis situation analysis' in FUSION?"],"info":{}}
{"id":"train_1504","question":"Have Albers, S. J. and Stephanie L. Hazlitt not co-authored the paper 'bcdata: An R package for searching & retrieving data from the BC Data Catalogue'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jossw/TeucherAH21> dblp:authoredBy <https://dblp.org/pid/229/3938> . <https://dblp.org/rec/journals/jossw/TeucherAH21> dblp:authoredBy <https://dblp.org/pid/297/1470> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jossw/TeucherAH21> dblp:authoredBy <https://dblp.org/pid/229/3938> . <https://dblp.org/rec/journals/jossw/TeucherAH21> dblp:authoredBy <https://dblp.org/pid/297/1470> } }","paraphrases":["Was the paper 'bcdata: An R package for searching & retrieving data from the BC Data Catalogue' not co-authored by Albers, S. J. and Stephanie L. Hazlitt?"],"info":{}}
{"id":"train_1505","question":"Was the paper 'Noise-aware fingerprint localization algorithm for wireless sensor network based on adaptive fingerprint Kalman filter' not published by Zonghua Jiang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cn/FangNJC17> dblp:authoredBy <https://dblp.org/pid/197/3338> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cn/FangNJC17> dblp:authoredBy <https://dblp.org/pid/197/3338> } }","paraphrases":["Was the paper 'Noise-aware fingerprint localization algorithm for wireless sensor network based on adaptive fingerprint Kalman filter' not published by the person Z. Jiang?"],"info":{}}
{"id":"train_1506","question":"Did Ales Leonardis and Jeremy L. Wyatt not co-author the paper 'Compositional Hierarchical Representation of Shape Manifolds for Classification of Non-manifold Shapes'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccv/OzayAWL15> dblp:authoredBy <https://dblp.org/pid/l/AlesLeonardis> . <https://dblp.org/rec/conf/iccv/OzayAWL15> dblp:authoredBy <https://dblp.org/pid/12/4588> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccv/OzayAWL15> dblp:authoredBy <https://dblp.org/pid/l/AlesLeonardis> . <https://dblp.org/rec/conf/iccv/OzayAWL15> dblp:authoredBy <https://dblp.org/pid/12/4588> } }","paraphrases":["Was the paper 'Compositional Hierarchical Representation of Shape Manifolds for Classification of Non-manifold Shapes' not co-authored by Ales L. and Jeremy L. Wyatt?"],"info":{}}
{"id":"train_1507","question":"Wasn't the paper 'Event-Driven Synchronization of Switched Complex Networks: A Reachable-Set-Based Design' not published by the person named Jun Z.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tnn/SangZ21> dblp:authoredBy <https://dblp.org/pid/47/2026-2> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tnn/SangZ21> dblp:authoredBy <https://dblp.org/pid/47/2026-2> } }","paraphrases":["Did Jun Zhao not publish the paper 'Event-Driven Synchronization of Switched Complex Networks: A Reachable-Set-Based Design'?"],"info":{}}
{"id":"train_1508","question":"Was the paper 'Patterns for Human-Oriented Information Presentation' not published by the person Diethelm Bienhaus?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/europlop/Bienhaus00> dblp:authoredBy <https://dblp.org/pid/14/7864> FILTER NOT EXISTS { <https://dblp.org/rec/conf/europlop/Bienhaus00> dblp:authoredBy <https://dblp.org/pid/14/7864> } }","paraphrases":["Was the paper 'Patterns for Human-Oriented Information Presentation' not published by D. Bienhaus?"],"info":{}}
{"id":"train_1509","question":"Have B. Sivakumar and Benjamin Rosman not co-authored the paper 'Two-commodity inventory system with retrial demand'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eor/Sivakumar08> dblp:authoredBy <https://dblp.org/pid/78/5338> . <https://dblp.org/rec/journals/eor/Sivakumar08> dblp:authoredBy <https://dblp.org/pid/45/4591> FILTER NOT EXISTS { <https://dblp.org/rec/journals/eor/Sivakumar08> dblp:authoredBy <https://dblp.org/pid/78/5338> . <https://dblp.org/rec/journals/eor/Sivakumar08> dblp:authoredBy <https://dblp.org/pid/45/4591> } }","paraphrases":["Was the paper 'Two-commodity inventory system with retrial demand' not co-authored by B. Sivakumar and Benjamin Rosman?"],"info":{}}
