{"id":"train_5404","question":"Have the authors of the paper 'Are mobile users more vigilant?' not not published a publication in WebSci?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/websci/Phillips14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/websci/Phillips14> ) . ?y dblp:publishedIn 'WebSci' }","paraphrases":["Did the authors of 'Are mobile users more vigilant?' not not publish a paper in WebSci?"],"info":{}}
{"id":"train_5405","question":"Was the paper 'Dynamic reconfigurable network-on-chip design: innovations for computational processing and communication by Jih-Sheng Shen and Pao-Ann Hsuing' not not published in the year 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigsoft/Schaefer13d> dblp:yearOfPublication '2013' }","paraphrases":["Was the publication 'Dynamic reconfigurable network-on-chip design: innovations for computational processing and communication by Jih-Sheng Shen and Pao-Ann Hsuing' not not published in 2013?"],"info":{}}
{"id":"train_5406","question":"Have the authors of the paper 'Fast offline Transformer-based end-to-end automatic speech recognition for real-world applications' not not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2101-05600> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2101-05600> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Haven't the authors of the publication 'Fast offline Transformer-based end-to-end automatic speech recognition for real-world applications' not published a publication in CoRR?"],"info":{}}
{"id":"train_5407","question":"Was the paper '3D hand mesh reconstruction from a monocular RGB image' not not published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/vc/PengXZ20> dblp:yearOfPublication '2020' }","paraphrases":["Was the publication '3D hand mesh reconstruction from a monocular RGB image' not not published in 2020?"],"info":{}}
{"id":"train_5408","question":"Have the authors of the paper 'A Survey of Fuzzy Decision Tree Classifier Methodology' not not published a publication in ICFIE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icfie/WangLYC07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icfie/WangLYC07> ) . ?y dblp:publishedIn 'ICFIE' }","paraphrases":["Did the authors of 'A Survey of Fuzzy Decision Tree Classifier Methodology' not not publish a paper in ICFIE?"],"info":{}}
{"id":"train_5409","question":"Was the paper 'Robust Lyapunov Control Design for Bioinspired Pursuit With Autonomous Hovercraft' not not published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcst/ShishikaYP17> dblp:yearOfPublication '2017' }","paraphrases":["Was the publication 'Robust Lyapunov Control Design for Bioinspired Pursuit With Autonomous Hovercraft' not not published in 2017?"],"info":{}}
{"id":"train_5412","question":"Was 'Trade-offs between instantaneous and total capacity in multi-cell flash memories' not not published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isit/GadJB12> dblp:yearOfPublication '2012' }","paraphrases":["Was the paper 'Trade-offs between instantaneous and total capacity in multi-cell flash memories' not not published in the year 2012?"],"info":{}}
{"id":"train_5414","question":"Did the authors of the publication 'The Generation of Tests of Knowledge Check Using Genetic Algorithms' not not publish a paper in SOFA (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sofa/PopescuBP16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sofa/PopescuBP16> ) . ?y dblp:publishedIn 'SOFA (2)' }","paraphrases":["Haven't the authors of the publication 'The Generation of Tests of Knowledge Check Using Genetic Algorithms' not published a publication in SOFA (2)?"],"info":{}}
{"id":"train_5415","question":"Have the authors of the paper 'Polyoptimierung und stochastische Simulation f\\u00FCr die Analyse regionaler wasserwirtschaftlicher Strategien in Braunkohlebergbaugebieten' not not published a publication in Simulationstechnik?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/simulationstechnik/Kaden84> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/simulationstechnik/Kaden84> ) . ?y dblp:publishedIn 'Simulationstechnik' }","paraphrases":["Haven't the authors of the publication 'Polyoptimierung und stochastische Simulation f\\u00FCr die Analyse regionaler wasserwirtschaftlicher Strategien in Braunkohlebergbaugebieten' not published a publication in Simulationstechnik?"],"info":{}}
{"id":"train_5416","question":"Was 'Finite representations of real parametric curves and surfaces' not not published in 1995?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijcga/BajajR95> dblp:yearOfPublication '1995' }","paraphrases":["Was the paper 'Finite representations of real parametric curves and surfaces' not not published in the year 1995?"],"info":{}}
{"id":"train_5417","question":"Have the authors of the paper 'Thermal runaway avoidance using Hamilton-Jacobi reachability and model predictive control' not not published a publication in Comput. Chem. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cce/KanavalauL22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cce/KanavalauL22> ) . ?y dblp:publishedIn 'Comput. Chem. Eng.' }","paraphrases":["Did the authors of 'Thermal runaway avoidance using Hamilton-Jacobi reachability and model predictive control' not not publish a paper in Comput. Chem. Eng.?"],"info":{}}
{"id":"train_5419","question":"Was the paper 'Kalman filtering as a performance monitoring technique for a propensity scorecard' not not published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jors/Bijak11> dblp:yearOfPublication '2011' }","paraphrases":["Was the publication 'Kalman filtering as a performance monitoring technique for a propensity scorecard' not not published in 2011?"],"info":{}}
{"id":"train_5421","question":"Did the authors of the publication 'Cascaded Multi-level Transformed Dirichlet Process for Multi-pose Facial Expression Recognition' not not publish a paper in Comput. J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cj/MaoZWLD18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cj/MaoZWLD18> ) . ?y dblp:publishedIn 'Comput. J.' }","paraphrases":["Have the authors of the paper 'Cascaded Multi-level Transformed Dirichlet Process for Multi-pose Facial Expression Recognition' not not published a publication in Comput. J.?"],"info":{}}
{"id":"train_5422","question":"Was the publication 'Multivariate Approach to Alcohol Detection in Drivers by Sensors and Artificial Vision' not not published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwinac/Rosero-Montalvo19> dblp:yearOfPublication '2019' }","paraphrases":["Was the paper 'Multivariate Approach to Alcohol Detection in Drivers by Sensors and Artificial Vision' not not published in the year 2019?"],"info":{}}
{"id":"train_5423","question":"Haven't the authors of the publication 'An Overview on Preisach and Jiles-Atherton Hysteresis Models for Soft Magnetic Materials' not published a publication in DoCEIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ifip5-5/MeloA17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ifip5-5/MeloA17> ) . ?y dblp:publishedIn 'DoCEIS' }","paraphrases":["Did the authors of the publication 'An Overview on Preisach and Jiles-Atherton Hysteresis Models for Soft Magnetic Materials' not not publish a paper in DoCEIS?"],"info":{}}
{"id":"train_5424","question":"Was the paper 'Ankle cartilage surface segmentation using directional gradient vector flow snakes' not not published in the year 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icip/TangMACH04> dblp:yearOfPublication '2004' }","paraphrases":["Was 'Ankle cartilage surface segmentation using directional gradient vector flow snakes' not not published in 2004?"],"info":{}}
{"id":"train_5425","question":"Did the authors of 'Deception Jamming Against ISAR With Coupled Two-Dimensional Compressive Sensing via Sub-Nyquist Sampling' not not publish a paper in IEEE Access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/ChenPXW18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/access/ChenPXW18> ) . ?y dblp:publishedIn 'IEEE Access' }","paraphrases":["Have the authors of the paper 'Deception Jamming Against ISAR With Coupled Two-Dimensional Compressive Sensing via Sub-Nyquist Sampling' not not published a publication in IEEE Access?"],"info":{}}
{"id":"train_5427","question":"Haven't the authors of the publication 'Measuring the effect of cued recall on work meetings' not published a publication in UbiComp Adjunct?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/huc/BexhetiNBLC16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/huc/BexhetiNBLC16> ) . ?y dblp:publishedIn 'UbiComp Adjunct' }","paraphrases":["Did the authors of the publication 'Measuring the effect of cued recall on work meetings' not not publish a paper in UbiComp Adjunct?"],"info":{}}
{"id":"train_5432","question":"Was the paper 'Risk Budgeted Portfolio Optimization Using an Extended Ant Colony Optimization Metaheuristic' not not published in the year 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijamc-igi/Pai12> dblp:yearOfPublication '2012' }","paraphrases":["Was the publication 'Risk Budgeted Portfolio Optimization Using an Extended Ant Colony Optimization Metaheuristic' not not published in 2012?"],"info":{}}
{"id":"train_5433","question":"Was the paper 'SAMPLE: A Language Dependent Prototyping Environment' not not published in the year 1989?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/stacs/Jager89> dblp:yearOfPublication '1989' }","paraphrases":["Was the publication 'SAMPLE: A Language Dependent Prototyping Environment' not not published in 1989?"],"info":{}}
{"id":"train_5434","question":"Have the authors of the paper 'Controlling perceived stiffness of pinched objects using visual feedback of hand deformation' not not published a publication in HAPTICS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/haptics/BanNTH14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/haptics/BanNTH14> ) . ?y dblp:publishedIn 'HAPTICS' }","paraphrases":["Did the authors of the publication 'Controlling perceived stiffness of pinched objects using visual feedback of hand deformation' not not publish a paper in HAPTICS?"],"info":{}}
{"id":"train_5437","question":"Did the authors of the publication 'Wearable technology and consumer interaction: A systematic review and research agenda' not not publish a paper in Comput. Hum. Behav.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chb/FerreiraFRV21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/chb/FerreiraFRV21> ) . ?y dblp:publishedIn 'Comput. Hum. Behav.' }","paraphrases":["Have the authors of the paper 'Wearable technology and consumer interaction: A systematic review and research agenda' not not published a publication in Comput. Hum. Behav.?"],"info":{}}
{"id":"train_5439","question":"Did the authors of the publication 'Indexing Schemes for Multi-dimensional Moving Objects' not not publish a paper in Encyclopedia of GIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/reference/gis/ElbassioniEK08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/reference/gis/ElbassioniEK08> ) . ?y dblp:publishedIn 'Encyclopedia of GIS' }","paraphrases":["Have the authors of the paper 'Indexing Schemes for Multi-dimensional Moving Objects' not not published a publication in Encyclopedia of GIS?"],"info":{}}
{"id":"train_5441","question":"Did the authors of 'Review: Calculus: Modeling and Application, second edition Mathematical Association of America, Washington, DC, 2010 http://maapinnaclecartcom Price: $3500 ISBN 978-1-6144-610-1 by David A Smith and Lawrence C Moore' not not publish a paper in Am. Math. Mon.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tamm/Mayfield13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tamm/Mayfield13> ) . ?y dblp:publishedIn 'Am. Math. Mon.' }","paraphrases":["Have the authors of the paper 'Review: Calculus: Modeling and Application, second edition Mathematical Association of America, Washington, DC, 2010 http://maapinnaclecartcom Price: $3500 ISBN 978-1-6144-610-1 by David A Smith and Lawrence C Moore' not not published a publication in Am. Math. Mon.?"],"info":{}}
{"id":"train_5442","question":"Was the publication 'Improved multi-pass fast correlation attacks with applications' not not published in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chinaf/ZhangF11> dblp:yearOfPublication '2011' }","paraphrases":["Was the paper 'Improved multi-pass fast correlation attacks with applications' not not published in the year 2011?"],"info":{}}
{"id":"train_5444","question":"Have the authors of the paper 'Counting superspecial Richelot isogenies and its cryptographic application' not not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2003-00633> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2003-00633> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Did the authors of the publication 'Counting superspecial Richelot isogenies and its cryptographic application' not not publish a paper in CoRR?"],"info":{}}
{"id":"train_5447","question":"Have the authors of the paper 'Self-Supervised Learning from Semantically Imprecise Data' not not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2104-10901> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2104-10901> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Did the authors of the publication 'Self-Supervised Learning from Semantically Imprecise Data' not not publish a paper in CoRR?"],"info":{}}
{"id":"train_5448","question":"Have the authors of the paper 'A computer program package for restriction map analysis and manipulation' not not published a publication in Nucleic Acids Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/nar/ZehetnerL86> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/nar/ZehetnerL86> ) . ?y dblp:publishedIn 'Nucleic Acids Res.' }","paraphrases":["Haven't the authors of the publication 'A computer program package for restriction map analysis and manipulation' not published a publication in Nucleic Acids Res.?"],"info":{}}
{"id":"train_5453","question":"Have the authors of the paper 'Towards optimal alignment of protein structure distance matrices' not not published a publication in Bioinform.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bioinformatics/WohlersDK10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/bioinformatics/WohlersDK10> ) . ?y dblp:publishedIn 'Bioinform.' }","paraphrases":["Haven't the authors of the publication 'Towards optimal alignment of protein structure distance matrices' not published a publication in Bioinform.?"],"info":{}}
{"id":"train_5454","question":"Was the publication 'Improvements to Variable Elimination and Symbolic Probabilistic Inference for evaluating Influence Diagrams' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijar/CabanasCGM16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'Improvements to Variable Elimination and Symbolic Probabilistic Inference for evaluating Influence Diagrams' not not published in the year 2016?"],"info":{}}
{"id":"train_5456","question":"Did the authors of the publication 'SiCoTHEO: Simple Competitive Parallel Theorem Provers' not not publish a paper in International Conference on Automated Deduction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cade/Schumann96> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cade/Schumann96> ) . ?y dblp:publishedIn 'CADE' }","paraphrases":["Haven't the authors of the publication 'SiCoTHEO: Simple Competitive Parallel Theorem Provers' not published a publication in International Conference on Automated Deduction?"],"info":{}}
{"id":"train_5459","question":"Haven't the authors of the publication 'On the complexity of zero gap MIP' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2002-10490> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2002-10490> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Did the authors of 'On the complexity of zero gap MIP' not not publish a paper in CoRR?"],"info":{}}
{"id":"train_5461","question":"Was the paper 'Privacy-Preserving Incentive Mechanism for Mobile Crowdsensing' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/scn/WanYL21> dblp:yearOfPublication '2021' }","paraphrases":["Was 'Privacy-Preserving Incentive Mechanism for Mobile Crowdsensing' not not published in 2021?"],"info":{}}
{"id":"train_5462","question":"Haven't the authors of the publication 'AnisoMPM: animating anisotropic damage mechanics' not published a publication in ACM Trans. Graph.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tog/WolperCLFQLCJ20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tog/WolperCLFQLCJ20> ) . ?y dblp:publishedIn 'ACM Trans. Graph.' }","paraphrases":["Did the authors of 'AnisoMPM: animating anisotropic damage mechanics' not not publish a paper in ACM Trans. Graph.?"],"info":{}}
{"id":"train_5463","question":"Have the authors of the paper 'Online Fast Adaptation and Knowledge Accumulation (OSAKA): a New Approach to Continual Learning' not not published a publication in NeurIPS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nips/CacciaRONLPLRLV20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/nips/CacciaRONLPLRLV20> ) . ?y dblp:publishedIn 'NeurIPS' }","paraphrases":["Haven't the authors of the publication 'Online Fast Adaptation and Knowledge Accumulation (OSAKA): a New Approach to Continual Learning' not published a publication in NeurIPS?"],"info":{}}
{"id":"train_5465","question":"Haven't the authors of the publication 'Dual Complexes of Cubical Subdivisions of \\u211D n' not published a publication in Discret. Comput. Geom.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dcg/EdelsbrunnerK12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/dcg/EdelsbrunnerK12> ) . ?y dblp:publishedIn 'Discret. Comput. Geom.' }","paraphrases":["Have the authors of the paper 'Dual Complexes of Cubical Subdivisions of \\u211D n' not not published a publication in Discret. Comput. Geom.?"],"info":{}}
{"id":"train_5466","question":"Did the authors of the publication 'Weapons effects modelling for safety applications' not not publish a paper in Int. J. Intell. Def. Support Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijidss/AndersonRNKW18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijidss/AndersonRNKW18> ) . ?y dblp:publishedIn 'Int. J. Intell. Def. Support Syst.' }","paraphrases":["Have the authors of the paper 'Weapons effects modelling for safety applications' not not published a publication in Int. J. Intell. Def. Support Syst.?"],"info":{}}
{"id":"train_5468","question":"Did the authors of 'Recognizing American Sign Language Nonmanual Signal Grammar Errors in Continuous Videos' not not publish a paper in International Conference on Pattern Recognition?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icpr/VahdaniJTH20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icpr/VahdaniJTH20> ) . ?y dblp:publishedIn 'ICPR' }","paraphrases":["Haven't the authors of the publication 'Recognizing American Sign Language Nonmanual Signal Grammar Errors in Continuous Videos' not published a publication in ICPR?"],"info":{}}
{"id":"train_5470","question":"Have the authors of the paper 'Experiments on Supporting Interactive Proof Using Resolution' not not published a publication in International Joint Conference on Automated Reasoning?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cade/MengP04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cade/MengP04> ) . ?y dblp:publishedIn 'IJCAR' }","paraphrases":["Did the authors of the publication 'Experiments on Supporting Interactive Proof Using Resolution' not not publish a paper in IJCAR?"],"info":{}}
{"id":"train_5472","question":"Did the authors of the publication 'Face recognition with Bayesian convolutional networks for robust surveillance systems' not not publish a paper in EURASIP J. Image Video Process.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ejivp/ZafarGZALMS19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ejivp/ZafarGZALMS19> ) . ?y dblp:publishedIn 'EURASIP J. Image Video Process.' }","paraphrases":["Haven't the authors of the publication 'Face recognition with Bayesian convolutional networks for robust surveillance systems' not published a publication in EURASIP J. Image Video Process.?"],"info":{}}
{"id":"train_5473","question":"Haven't the authors of the publication 'A Novel Method of Developing Driving Cycle for Electric Vehicles to Evaluate the Private Driving Habits' not published a publication in IEEE Access?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/ChenZHZLWXY21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/access/ChenZHZLWXY21> ) . ?y dblp:publishedIn 'IEEE Access' }","paraphrases":["Did the authors of 'A Novel Method of Developing Driving Cycle for Electric Vehicles to Evaluate the Private Driving Habits' not not publish a paper in IEEE Access?"],"info":{}}
{"id":"train_5474","question":"Did the authors of 'Reductions between Expansion Problems' not not publish a paper in Computational Complexity Conference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/coco/RaghavendraST12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/coco/RaghavendraST12> ) . ?y dblp:publishedIn 'Computational Complexity Conference' }","paraphrases":["Haven't the authors of the publication 'Reductions between Expansion Problems' not published a publication in Computational Complexity Conference?"],"info":{}}
{"id":"train_5475","question":"Was the paper 'Gate-Induced Barrier Field Effect Transistor (GBFET) - A New Thin Film Transistor for Active Matrix Liquid Crystal Display Systems' not not published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vlsid/SivagnanameNNMB06> dblp:yearOfPublication '2006' }","paraphrases":["Was 'Gate-Induced Barrier Field Effect Transistor (GBFET) - A New Thin Film Transistor for Active Matrix Liquid Crystal Display Systems' not not published in 2006?"],"info":{}}
{"id":"train_5476","question":"Haven't the authors of the publication 'Adaptive Relay Selection for Regenerative OFDMA Relay Networks with Fairness Constraints' not published a publication in VTC Fall?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vtc/JeongL08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/vtc/JeongL08> ) . ?y dblp:publishedIn 'VTC Fall' }","paraphrases":["Have the authors of the paper 'Adaptive Relay Selection for Regenerative OFDMA Relay Networks with Fairness Constraints' not not published a publication in VTC Fall?"],"info":{}}
{"id":"train_5477","question":"Haven't the authors of the publication 'Fixed-Coefficient Iterative Bilateral Filters for Graph-Based Image Processing' not published a publication in Pacific-Rim Symposium on Image and Video Technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/psivt/JianIHU09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/psivt/JianIHU09> ) . ?y dblp:publishedIn 'PSIVT' }","paraphrases":["Did the authors of 'Fixed-Coefficient Iterative Bilateral Filters for Graph-Based Image Processing' not not publish a paper in PSIVT?"],"info":{}}
{"id":"train_5478","question":"Was the publication 'A Strategy for Mixed-Signal Yield Improvement' not not published in 2002?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dt/BordelonTMC02> dblp:yearOfPublication '2002' }","paraphrases":["Was the paper 'A Strategy for Mixed-Signal Yield Improvement' not not published in the year 2002?"],"info":{}}
{"id":"train_5479","question":"Did the authors of 'Oriented Projective Geometry: A Framework for Geometric Computations (Jorge Stolfi)' not not publish a paper in SIAM Rev.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamrev/Hughes93> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/siamrev/Hughes93> ) . ?y dblp:publishedIn 'SIAM Rev.' }","paraphrases":["Have the authors of the paper 'Oriented Projective Geometry: A Framework for Geometric Computations (Jorge Stolfi)' not not published a publication in SIAM Rev.?"],"info":{}}
{"id":"train_5480","question":"Did the authors of 'Will-They-Won't-They: A Very Large Dataset for Stance Detection on Twitter' not not publish a paper in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2005-00388> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2005-00388> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Haven't the authors of the publication 'Will-They-Won't-They: A Very Large Dataset for Stance Detection on Twitter' not published a publication in CoRR?"],"info":{}}
{"id":"train_5481","question":"Did the authors of the publication 'Dense interest features for video processing' not not publish a paper in ICIP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icip/GeestT14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icip/GeestT14> ) . ?y dblp:publishedIn 'ICIP' }","paraphrases":["Have the authors of the paper 'Dense interest features for video processing' not not published a publication in IEEE International Conference on Image Processing?"],"info":{}}
{"id":"train_5482","question":"Have the authors of the paper 'A Study of Implanted and Wearable Body Sensor Networks' not not published a publication in KES-AMSTA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kesamsta/UllahHSK08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/kesamsta/UllahHSK08> ) . ?y dblp:publishedIn 'KES-AMSTA' }","paraphrases":["Did the authors of 'A Study of Implanted and Wearable Body Sensor Networks' not not publish a paper in KES-AMSTA?"],"info":{}}
{"id":"train_5483","question":"Haven't the authors of the publication 'Crawling the client-side hidden web' not published a publication in ICWI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iadis/AlvarezPRV04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iadis/AlvarezPRV04> ) . ?y dblp:publishedIn 'ICWI' }","paraphrases":["Have the authors of the paper 'Crawling the client-side hidden web' not not published a publication in ICWI?"],"info":{}}
{"id":"train_5484","question":"Did the authors of 'On Spanners of Geometric Graphs' not not publish a paper in TAMC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/tamc/Kanj09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/tamc/Kanj09> ) . ?y dblp:publishedIn 'TAMC' }","paraphrases":["Have the authors of the paper 'On Spanners of Geometric Graphs' not not published a publication in Conference on Theory and Applications of Models of Computation?"],"info":{}}
{"id":"train_5485","question":"Haven't the authors of the publication 'A connectance-based approach for managing manufacturing knowledge' not published a publication in Ind. Manag. Data Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/imds/TanP04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/imds/TanP04> ) . ?y dblp:publishedIn 'Ind. Manag. Data Syst.' }","paraphrases":["Did the authors of the publication 'A connectance-based approach for managing manufacturing knowledge' not not publish a paper in Ind. Manag. Data Syst.?"],"info":{}}
{"id":"train_5486","question":"Was 'Fast calibration of hand movements-based interface for arm exoskeleton control' not not published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esann/MartinCM12> dblp:yearOfPublication '2012' }","paraphrases":["Was the paper 'Fast calibration of hand movements-based interface for arm exoskeleton control' not not published in the year 2012?"],"info":{}}
{"id":"train_5487","question":"Was 'Application of Parallel Distributed Implementation to Multiobjective Fuzzy Genetics-Based Machine Learning' not not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aciids/NojimaTI15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Application of Parallel Distributed Implementation to Multiobjective Fuzzy Genetics-Based Machine Learning' not not published in the year 2015?"],"info":{}}
