{"id":"train_322","question":"Which publications did Koen v. der Blom author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/184/9197> }","paraphrases":["Which papers did the author Koen v. der Blom write?"],"info":{}}
{"id":"train_323","question":"Which publications did Tuomo Takkula author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/212> }","paraphrases":["What are the papers written by the person Takkula, T.?"],"info":{}}
{"id":"train_324","question":"Which papers did the author Steven Zimmerman write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/219/5449> }","paraphrases":["What are the papers written by the person Steven Zimmerman?"],"info":{}}
{"id":"train_325","question":"The author J. A. Mariani is associated with which Wikidata identifier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/JohnAMariani> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of J. A. Mariani?"],"info":{}}
{"id":"train_326","question":"Find the primary affiliation of Chi Chung Ko.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/20/1154> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Ko, C. Chung."],"info":{}}
{"id":"train_327","question":"What are the papers written by Wen Zeng?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/55/6445> }","paraphrases":["What are the papers written by the person Wen Zeng?"],"info":{}}
{"id":"train_328","question":"Which publications did B. L. Evans author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/44/257> }","paraphrases":["What are the papers written by Brian L. Evans?"],"info":{}}
{"id":"train_329","question":"Which papers did the author Lijuan Wang write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/4119> }","paraphrases":["Which publications did Lijuan Wang author?"],"info":{}}
{"id":"train_330","question":"Which papers did the author L. Dee Swymer write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/01/3669> }","paraphrases":["What are the papers written by Swymer, L. Dee?"],"info":{}}
{"id":"train_331","question":"What are the papers written by Li, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/85/10246> }","paraphrases":["Which papers did the author Yueheng Li write?"],"info":{}}
{"id":"train_332","question":"What are the papers written by Dominic W.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/139/7614> }","paraphrases":["Which publications did Dominic Ward author?"],"info":{}}
{"id":"train_333","question":"What is the webpage of the person Vladik K.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/k/VladikKreinovich> dblp:webpage ?answer }","paraphrases":["What is the webpage of Vladik K.?"],"info":{}}
{"id":"train_334","question":"What are the papers written by A. Gupta?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/g/AmarnathGupta> }","paraphrases":["What are the papers written by the person A. Gupta?"],"info":{}}
{"id":"train_335","question":"What are the papers written by Geffray, S\\u00E9golen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/185/3020> }","paraphrases":["What are the papers written by the person Geffray, S\\u00E9golen?"],"info":{}}
{"id":"train_336","question":"What are the papers written by Nele Mentens?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/23/3870> }","paraphrases":["Which publications did Nele Mentens author?"],"info":{}}
{"id":"train_337","question":"What are the papers written by Jie Tian?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/t/JieTian> }","paraphrases":["What are the papers written by the person Tian, Jie?"],"info":{}}
{"id":"train_338","question":"What are the papers written by the person Himawan Gunadhi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/90/5499> }","paraphrases":["Which papers did the author Himawan Gunadhi write?"],"info":{}}
{"id":"train_339","question":"What is the Wikidata ID of Manuel F. Bertoa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/42/731> dblp:wikidata ?answer }","paraphrases":["The author Manuel F. Bertoa is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_340","question":"Which papers did the author W. S. Wang write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/5084> }","paraphrases":["What are the papers written by Wang, W. S.?"],"info":{}}
{"id":"train_341","question":"Which papers did the author Thibault Marin write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/72/8363> }","paraphrases":["What are the papers written by the person Thibault Marin?"],"info":{}}
{"id":"train_342","question":"The author Jens Mache is associated with which Wikidata identifier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/JensMache> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Jens Mache?"],"info":{}}
{"id":"train_343","question":"What are the papers written by David Jones?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/65/6010> }","paraphrases":["Which publications did Jones, David author?"],"info":{}}
{"id":"train_344","question":"What are the papers written by Ernesto d. Queir\\u00F3s Vieira Martins?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/67/867> }","paraphrases":["Which papers did the author Ernesto d. Queir\\u00F3s Vieira Martins write?"],"info":{}}
{"id":"train_345","question":"Which publications did Rodolphe S. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/54/461> }","paraphrases":["What are the papers written by Rodolphe S.?"],"info":{}}
{"id":"train_346","question":"What is the Wikidata ID of Seyedali Mirjalili?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/144/0554> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person S. Mirjalili."],"info":{}}
{"id":"train_347","question":"What is the webpage of Gurevich, Yuri?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/g/YuriGurevich> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Gurevich, Yuri?"],"info":{}}
{"id":"train_348","question":"What are the papers written by S. Kim?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/97/2562> }","paraphrases":["What are the papers written by the person Sung-Hee Kim?"],"info":{}}
{"id":"train_349","question":"What are the papers written by Kian Lam Tan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/56/10128> }","paraphrases":["Which papers did the author Kian Lam Tan write?"],"info":{}}
{"id":"train_350","question":"Which papers did Dan O. Popa publish in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/61/5165> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["List the papers published by Popa, D. O. in the last nine years."],"info":{}}
{"id":"train_351","question":"Mention the venues in which Alberto R. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/274/3007> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Alberto R. published papers?"],"info":{}}
{"id":"train_352","question":"What are the venues in which Niels O. Schiller published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/1423> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Niels O. Schiller published."],"info":{}}
{"id":"train_353","question":"Which papers did Eti Ben-Simon and Andrey Z. write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/83/11395> . ?answer dblp:authoredBy <https://dblp.org/pid/83/10230> }","paraphrases":["What are the papers written by Ben-Simon, E. and Andrey Zhdanov together?"],"info":{}}
{"id":"train_354","question":"Mention the venues in which Agostino M. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/6850> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Agostino Martinelli published?"],"info":{}}
{"id":"train_355","question":"Who are the co-authors of M. Guizani?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/15/1123> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/15/1123> ) }","paraphrases":["Mention the co-authors of M. Guizani."],"info":{}}
{"id":"train_357","question":"With which other authors has the author S. E. Davies written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/46/2545> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/46/2545> ) }","paraphrases":["Who are the co-authors of S. E. Davies?"],"info":{}}
{"id":"train_358","question":"Mention the co-authors of Mart\\u00EDn-Rodilla, Patricia.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/117/0754> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/117/0754> ) }","paraphrases":["With which other authors has the author Patricia Mart\\u00EDn-Rodilla written papers?"],"info":{}}
{"id":"train_359","question":"What are the papers written by Wu, C. and C. Jason Xue together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/45/3158-6> . ?answer dblp:authoredBy <https://dblp.org/pid/x/ChunJasonXue> }","paraphrases":["Which papers did Wu, C. and Chun Jason Xue write together?"],"info":{}}
{"id":"train_360","question":"With which other authors has the author Luo Jiang written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/173/9427> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/173/9427> ) }","paraphrases":["Who are the co-authors of Luo J.?"],"info":{}}
{"id":"train_361","question":"What are the venues in which Rolf-Peter Vollertsen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/09/2513> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Rolf-Peter Vollertsen published papers?"],"info":{}}
{"id":"train_363","question":"Mention the co-authors of M. Desco.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/3245> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/30/3245> ) }","paraphrases":["With which other authors has the author Manuel Desco written papers?"],"info":{}}
{"id":"train_365","question":"Mention the venues in which Andrea Asperti published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/a/AAsperti> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Andrea Asperti published?"],"info":{}}
{"id":"train_367","question":"With which other authors has the author A. E. Zhdanov written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/262/4190> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/262/4190> ) }","paraphrases":["Mention the co-authors of Aleksei E. Zhdanov."],"info":{}}
{"id":"train_368","question":"Which papers did Nguyen-Thinh Le publish in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/3705> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["List the papers published by Nguyen-Thinh Le in the last 8 years."],"info":{}}
{"id":"train_369","question":"Who are the co-authors of Antonio Ruiz-Mart\\u00EDnez?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/28/2375> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/28/2375> ) }","paraphrases":["With which other authors has the author A. Ruiz-Mart\\u00EDnez written papers?"],"info":{}}
{"id":"train_370","question":"List the papers published by Sadegh Abbaszadeh in the last 6 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/183/3311> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Which papers did Sadegh Abbaszadeh publish in the last 6 years?"],"info":{}}
{"id":"train_371","question":"In which conferences or journals has Gangi, M. Antonino Di published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/194/3473> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Mattia Antonino Di Gangi published?"],"info":{}}
{"id":"train_372","question":"Find the papers written by A. Ansper and Jan Willemson together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/4088> . ?answer dblp:authoredBy <https://dblp.org/pid/22/101> }","paraphrases":["Which papers did A. Ansper and Jan W. write together?"],"info":{}}
{"id":"train_375","question":"Mention the venues in which Thomas F. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/195/1482> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Thomas F. published papers?"],"info":{}}
{"id":"train_376","question":"Who are the co-authors of Giese, Andrew?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/08/10432> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/08/10432> ) }","paraphrases":["With which other authors has the author Giese, Andrew written papers?"],"info":{}}
{"id":"train_378","question":"List the papers published by Pablo G. in the last two years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/50/3472> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Which papers did Pablo Guerrero publish in the last 2 years?"],"info":{}}
{"id":"train_379","question":"In which conferences or journals has Graham R. Hellestrand published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/06/1253> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Graham R. Hellestrand published?"],"info":{}}
{"id":"train_380","question":"Who are the co-authors of H. Ishii?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/47/6327> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/47/6327> ) }","paraphrases":["With which other authors has the author Hideaki Ishii written papers?"],"info":{}}
{"id":"train_381","question":"In which conferences or journals has Hrvoje Sikic published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/07/1251> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Hrvoje Sikic published."],"info":{}}
{"id":"train_382","question":"With which other authors has the author Rubiao M. written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/135/8999> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/135/8999> ) }","paraphrases":["Mention the co-authors of Rubiao M.."],"info":{}}
{"id":"train_383","question":"Find the papers written by Aykut Beke and Kumbasar, T. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/169/5138> . ?answer dblp:authoredBy <https://dblp.org/pid/23/6999> }","paraphrases":["What are the papers written by Aykut B. and Kumbasar, T. together?"],"info":{}}
{"id":"train_384","question":"Find the papers written by Ricardo da Silva Torres and Leonor Patricia C. Morellato together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/s/RicardodaSilvaTorres> . ?answer dblp:authoredBy <https://dblp.org/pid/124/2103> }","paraphrases":["What are the papers written by Ricardo da Silva Torres and Leonor P. C. Morellato together?"],"info":{}}
{"id":"train_385","question":"In which conferences or journals has Wang, W. published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/150/1794> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Wenzhe Wang published?"],"info":{}}
{"id":"train_386","question":"Which papers did Kangfei Zhao publish in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/169/1501> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["List the papers published by K. Zhao in the last four years."],"info":{}}
{"id":"train_387","question":"What are the venues in which Turner, Martin J. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/t/MartinJTurner> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Martin J. Turner published papers?"],"info":{}}
{"id":"train_388","question":"In which conferences or journals has Hridesh Rajan published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/r/HrideshRajan> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Hridesh Rajan published."],"info":{}}
{"id":"train_389","question":"Find the papers written by Aysun Ozan Ayta\\u00E7 and Zeynep Nihan Odabas together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/2890> . ?answer dblp:authoredBy <https://dblp.org/pid/10/8200> }","paraphrases":["What are the papers written by Ayta\\u00E7, A. Ozan and Z. Nihan Odabas together?"],"info":{}}
{"id":"train_390","question":"List the papers published by Neil McGlohon in the last 5 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/156/0179> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["Which papers did McGlohon, Neil publish in the last five years?"],"info":{}}
{"id":"train_391","question":"List the papers published by Robert A. Maier in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/263/6474> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Robert A. Maier publish in the last four years?"],"info":{}}
{"id":"train_392","question":"In which conferences or journals has Yurischev, Mikhail A. published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/212/0131> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Yurischev, Mikhail A. published?"],"info":{}}
{"id":"train_393","question":"Which papers did Blaise G. publish in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/59/6859> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["List the papers published by Blaise Genest in the last five years."],"info":{}}
{"id":"train_394","question":"Mention the papers published by B. Berger with the author from MIT.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/BonnieBerger> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'MIT, Cambridge, USA' }","paraphrases":["Which publications did Bonnie Berger write with the author from MIT?"],"info":{}}
{"id":"train_395","question":"Mention the co-authors of Wei H..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/20/6417> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/20/6417> ) }","paraphrases":["With which other authors has the author Wei He written papers?"],"info":{}}
{"id":"train_396","question":"What are the venues in which Rathinam Senthamarai published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/312/8008> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Rathinam Senthamarai published papers?"],"info":{}}
{"id":"train_397","question":"What are the papers written by K. Q. Brown and Suresh Singh together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/60/2019> . ?answer dblp:authoredBy <https://dblp.org/pid/21/3471> }","paraphrases":["Find the papers written by K. Q. Brown and Suresh Singh together."],"info":{}}
{"id":"train_398","question":"In which conferences or journals has He J. published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/3790-1> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which He J. published."],"info":{}}
{"id":"train_399","question":"Which papers did Richard C. Rose publish in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/80/310> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["List the papers published by Richard C. Rose in the last five years."],"info":{}}
{"id":"train_400","question":"Mention the venues in which Y. Wu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/9480> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Yifei Wu published?"],"info":{}}
{"id":"train_401","question":"What are the papers written by T. Maruyama and Kobori, Tomoyoshi together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/91/4616> . ?answer dblp:authoredBy <https://dblp.org/pid/41/4810> }","paraphrases":["Which papers did T. Maruyama and Kobori, Tomoyoshi write together?"],"info":{}}
{"id":"train_402","question":"Mention the venues in which Minggang Yang published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/165/5242> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which M. Yang published?"],"info":{}}
{"id":"train_404","question":"With which other authors has the author L. Liang written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/244/7306> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/244/7306> ) }","paraphrases":["Who are the co-authors of L. Liang?"],"info":{}}
{"id":"train_405","question":"Find the papers written by Hag-Tae Kim and Ganduulga together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/140/7900> . ?answer dblp:authoredBy <https://dblp.org/pid/140/7914> }","paraphrases":["What are the papers written by Hag-Tae Kim and Ganduulga together?"],"info":{}}
{"id":"train_407","question":"Which papers did Huseyin Topaloglu and Sumit Kunnumkal write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/2081> . ?answer dblp:authoredBy <https://dblp.org/pid/80/6714> }","paraphrases":["What are the papers written by Huseyin Topaloglu and Sumit Kunnumkal together?"],"info":{}}
{"id":"train_408","question":"Find the papers written by Oldenburg, Lennart and Jungnickel, T. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/209/7122> . ?answer dblp:authoredBy <https://dblp.org/pid/173/5042> }","paraphrases":["What are the papers written by Lennart Oldenburg and Tim Jungnickel together?"],"info":{}}
{"id":"train_409","question":"List the papers published by Sylvain Schmitz in the last 8 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/62/6048> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Which papers did Schmitz, Sylvain publish in the last 8 years?"],"info":{}}
{"id":"train_410","question":"Mention the co-authors of Xiaohui Xu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/91/95> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/91/95> ) }","paraphrases":["With which other authors has the author Xu, Xiaohui written papers?"],"info":{}}
{"id":"train_412","question":"Mention the co-authors of Rowena Cullen.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/63/263> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/63/263> ) }","paraphrases":["Who are the co-authors of Cullen, R.?"],"info":{}}
{"id":"train_413","question":"Who are the co-authors of David Xiao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/3719> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/53/3719> ) }","paraphrases":["With which other authors has the author David Xiao written papers?"],"info":{}}
{"id":"train_414","question":"With which other authors has the author Amanda Legge written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/118/8267> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/118/8267> ) }","paraphrases":["Mention the co-authors of A. Legge."],"info":{}}
{"id":"train_416","question":"In which conferences or journals has R. Smits published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/91/3523> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Roel Smits published?"],"info":{}}
{"id":"train_417","question":"Which papers did S. Ollinger publish in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/213/1399> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["List the papers published by Sandrine Ollinger in the last four years."],"info":{}}
{"id":"train_418","question":"List the papers published by Duane F. Marble in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/61/3613> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Marble, Duane F. publish in the last four years?"],"info":{}}
{"id":"train_419","question":"What are the papers written by Mikhail K. and Vladimir Eremeev together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/245/7514> . ?answer dblp:authoredBy <https://dblp.org/pid/257/9980> }","paraphrases":["Find the papers written by Mikhail K. and Vladimir E. together."],"info":{}}
{"id":"train_420","question":"Who are the co-authors of Carlton J. Leuschen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/18/8958> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/18/8958> ) }","paraphrases":["Mention the co-authors of Carlton J. Leuschen."],"info":{}}
{"id":"train_421","question":"Which papers did Richard Bowden publish in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/RichardBowden> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["List the papers published by Richard Bowden in the last eight years."],"info":{}}
