{"id":"train_5126","question":"Did the authors of 'Integrating Linked Data through RDFS and OWL: Some Lessons Learnt' not publish a paper in RR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/rr/Hogan11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/rr/Hogan11> ) . ?y dblp:publishedIn 'RR' FILTER NOT EXISTS { <https://dblp.org/rec/conf/rr/Hogan11> dblp:publishedIn 'RR' } }","paraphrases":["Haven't the authors of the publication 'Integrating Linked Data through RDFS and OWL: Some Lessons Learnt' published a publication in RR?"],"info":{}}
{"id":"train_5127","question":"Was 'CIS Publication Spotlight [Publication Spotlight]' not published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cim/HeCTJOA21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cim/HeCTJOA21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the publication 'CIS Publication Spotlight [Publication Spotlight]' published in 2021?"],"info":{}}
{"id":"train_5128","question":"Haven't the authors of the publication 'Ethical regulations on robotics in Europe' published a publication in AI Soc.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ais/NagenborgCWP08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ais/NagenborgCWP08> ) . ?y dblp:publishedIn 'AI Soc.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ais/NagenborgCWP08> dblp:publishedIn 'AI Soc.' } }","paraphrases":["Have the authors of the paper 'Ethical regulations on robotics in Europe' not published a publication in AI Soc.?"],"info":{}}
{"id":"train_5131","question":"Did the authors of the publication 'Visual Servoing of Constrained Mobile Robots Based on Model Predictive Control' not publish 'Diagrams for Meaning Preservation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsmc/KeLXZ17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/rta/WellsPK03> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/rta/WellsPK03> != <https://dblp.org/rec/journals/tsmc/KeLXZ17> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/tsmc/KeLXZ17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/rta/WellsPK03> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/rta/WellsPK03> != <https://dblp.org/rec/journals/tsmc/KeLXZ17> ) } }","paraphrases":["Haven't the authors of the publication 'Visual Servoing of Constrained Mobile Robots Based on Model Predictive Control' published the paper 'Diagrams for Meaning Preservation'?"],"info":{}}
{"id":"train_5132","question":"Did the authors of the publication 'Estimating snow cover from publicly available images' not publish a paper in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/FedorovCFT15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/FedorovCFT15> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/FedorovCFT15> dblp:publishedIn 'CoRR' } }","paraphrases":["Haven't the authors of the publication 'Estimating snow cover from publicly available images' published a publication in CoRR?"],"info":{}}
{"id":"train_5133","question":"Have the authors of the paper 'Supply chain flexibility aspects and their impact on customers satisfaction of pharmaceutical industry in Jordan' not published a publication in Int. J. Bus. Perform. Supply Chain Model.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijbpscm/Al-HawaryMMA17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijbpscm/Al-HawaryMMA17> ) . ?y dblp:publishedIn 'Int. J. Bus. Perform. Supply Chain Model.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijbpscm/Al-HawaryMMA17> dblp:publishedIn 'Int. J. Bus. Perform. Supply Chain Model.' } }","paraphrases":["Did the authors of 'Supply chain flexibility aspects and their impact on customers satisfaction of pharmaceutical industry in Jordan' not publish a paper in Int. J. Bus. Perform. Supply Chain Model.?"],"info":{}}
{"id":"train_5134","question":"Wasn't the paper 'Book Review: Online Social Research: Methods, Issues, & Ethics' published in the year 2005?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/nms/Orgad05> dblp:yearOfPublication '2005' FILTER NOT EXISTS { <https://dblp.org/rec/journals/nms/Orgad05> dblp:yearOfPublication '2005' } }","paraphrases":["Wasn't the publication 'Book Review: Online Social Research: Methods, Issues, & Ethics' published in 2005?"],"info":{}}
{"id":"train_5135","question":"Wasn't the publication 'Data Analytics of Student Learning Outcomes Using Abet Course Files' published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sai/AlhakamiAA20> dblp:yearOfPublication '2020' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sai/AlhakamiAA20> dblp:yearOfPublication '2020' } }","paraphrases":["Was 'Data Analytics of Student Learning Outcomes Using Abet Course Files' not published in 2020?"],"info":{}}
{"id":"train_5136","question":"Did the authors of 'Cloud manufacturing: key issues and future perspectives' not publish a paper in Int. J. Comput. Integr. Manuf.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijcim/LiuWWXJ19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ijcim/LiuWWXJ19> ) . ?y dblp:publishedIn 'Int. J. Comput. Integr. Manuf.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijcim/LiuWWXJ19> dblp:publishedIn 'Int. J. Comput. Integr. Manuf.' } }","paraphrases":["Haven't the authors of the publication 'Cloud manufacturing: key issues and future perspectives' published a publication in Int. J. Comput. Integr. Manuf.?"],"info":{}}
{"id":"train_5137","question":"Haven't the authors of the publication 'Novel ultrasonic imaging modality based on circular integral data' published a publication in RIVF?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/rivf/RigaudON13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/rivf/RigaudON13> ) . ?y dblp:publishedIn 'RIVF' FILTER NOT EXISTS { <https://dblp.org/rec/conf/rivf/RigaudON13> dblp:publishedIn 'RIVF' } }","paraphrases":["Have the authors of the paper 'Novel ultrasonic imaging modality based on circular integral data' not published a publication in RIVF?"],"info":{}}
{"id":"train_5139","question":"Haven't the authors of the publication 'A convergence theorem for the inexact Newton methods based on H\\u00F6lder continuous Fr\\u00E9chet derivative' published the paper 'Transfer Function Estimation, Film Fusion and Image Restoration'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/ZhouZYT08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cvgip/AzencottCW96> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cvgip/AzencottCW96> != <https://dblp.org/rec/journals/amc/ZhouZYT08> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/amc/ZhouZYT08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cvgip/AzencottCW96> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/cvgip/AzencottCW96> != <https://dblp.org/rec/journals/amc/ZhouZYT08> ) } }","paraphrases":["Did the authors of 'A convergence theorem for the inexact Newton methods based on H\\u00F6lder continuous Fr\\u00E9chet derivative' not publish 'Transfer Function Estimation, Film Fusion and Image Restoration'?"],"info":{}}
{"id":"train_5140","question":"Wasn't the paper 'An overview of the CAVE project research activities in speaker verification' published in the year 2000?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/speech/BimbotBBGHJKLP00> dblp:yearOfPublication '2000' FILTER NOT EXISTS { <https://dblp.org/rec/journals/speech/BimbotBBGHJKLP00> dblp:yearOfPublication '2000' } }","paraphrases":["Wasn't the publication 'An overview of the CAVE project research activities in speaker verification' published in 2000?"],"info":{}}
{"id":"train_5141","question":"Was 'Tree Domination in Graphs' not published in 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/arscom/ChenSM04> dblp:yearOfPublication '2004' FILTER NOT EXISTS { <https://dblp.org/rec/journals/arscom/ChenSM04> dblp:yearOfPublication '2004' } }","paraphrases":["Wasn't the paper 'Tree Domination in Graphs' published in the year 2004?"],"info":{}}
{"id":"train_5142","question":"Did the authors of 'VC3: Trustworthy Data Analytics in the Cloud Using SGX' not publish 'Mutually Regressive Point Processes'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sp/SchusterCFGPMR15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/nips/ApostolopoulouL19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/nips/ApostolopoulouL19> != <https://dblp.org/rec/conf/sp/SchusterCFGPMR15> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/sp/SchusterCFGPMR15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/nips/ApostolopoulouL19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/nips/ApostolopoulouL19> != <https://dblp.org/rec/conf/sp/SchusterCFGPMR15> ) } }","paraphrases":["Have the authors of the paper 'VC3: Trustworthy Data Analytics in the Cloud Using SGX' not published the paper 'Mutually Regressive Point Processes'?"],"info":{}}
{"id":"train_5143","question":"Haven't the authors of the publication 'Modeling Deformable Objects for Computer-Aided Sculpting (CAS) Modeling Deformable Objects for Computer-Aided Sculpting (CAS)' published the paper 'Proof of permutationally convexity of MCSF games'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gmai/IgweK06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/mmor/Alidaee94> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/mmor/Alidaee94> != <https://dblp.org/rec/conf/gmai/IgweK06> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/gmai/IgweK06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/mmor/Alidaee94> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/mmor/Alidaee94> != <https://dblp.org/rec/conf/gmai/IgweK06> ) } }","paraphrases":["Have the authors of the paper 'Modeling Deformable Objects for Computer-Aided Sculpting (CAS) Modeling Deformable Objects for Computer-Aided Sculpting (CAS)' not published the paper 'Proof of permutationally convexity of MCSF games'?"],"info":{}}
{"id":"train_5145","question":"Wasn't the paper 'ASAP: Preventing Starvation in Backpressure Forwarding' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/milcom/MaNLZ18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/conf/milcom/MaNLZ18> dblp:yearOfPublication '2018' } }","paraphrases":["Was 'ASAP: Preventing Starvation in Backpressure Forwarding' not published in 2018?"],"info":{}}
{"id":"train_5146","question":"Wasn't the publication 'Following the electrons: methods for power management in commercial buildings' published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kdd/BellalaMALB12> dblp:yearOfPublication '2012' FILTER NOT EXISTS { <https://dblp.org/rec/conf/kdd/BellalaMALB12> dblp:yearOfPublication '2012' } }","paraphrases":["Wasn't the paper 'Following the electrons: methods for power management in commercial buildings' published in the year 2012?"],"info":{}}
{"id":"train_5147","question":"Haven't the authors of the publication 'A Framework for the Development of Context-Adaptable User Interfaces for Ubiquitous Computing Systems' published a publication in Sensors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/VarelaPBD16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/sensors/VarelaPBD16> ) . ?y dblp:publishedIn 'Sensors' FILTER NOT EXISTS { <https://dblp.org/rec/journals/sensors/VarelaPBD16> dblp:publishedIn 'Sensors' } }","paraphrases":["Did the authors of 'A Framework for the Development of Context-Adaptable User Interfaces for Ubiquitous Computing Systems' not publish a paper in Sensors?"],"info":{}}
{"id":"train_5148","question":"Did the authors of 'Managing the Federal Depository Library Program Electronic Collection: A Policy and Planning Document Governemnt Printing Office, Washington, DC (October, 1998)' not publish 'A General Model for Heterogeneous Web Services Integration'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/giq/Barkley99a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/awcc/ZhangGM04> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/awcc/ZhangGM04> != <https://dblp.org/rec/journals/giq/Barkley99a> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/giq/Barkley99a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/awcc/ZhangGM04> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/awcc/ZhangGM04> != <https://dblp.org/rec/journals/giq/Barkley99a> ) } }","paraphrases":["Have the authors of the paper 'Managing the Federal Depository Library Program Electronic Collection: A Policy and Planning Document Governemnt Printing Office, Washington, DC (October, 1998)' not published the paper 'A General Model for Heterogeneous Web Services Integration'?"],"info":{}}
{"id":"train_5150","question":"Wasn't the publication 'Unsupervised-learning financial reconciliation: a robust, accurate approach inspired by machine translation' published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icaif/Chew20> dblp:yearOfPublication '2020' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icaif/Chew20> dblp:yearOfPublication '2020' } }","paraphrases":["Wasn't the paper 'Unsupervised-learning financial reconciliation: a robust, accurate approach inspired by machine translation' published in the year 2020?"],"info":{}}
{"id":"train_5151","question":"Wasn't the publication 'An active learning-based SVM multi-class classification model' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pr/GuoW15> dblp:yearOfPublication '2015' FILTER NOT EXISTS { <https://dblp.org/rec/journals/pr/GuoW15> dblp:yearOfPublication '2015' } }","paraphrases":["Wasn't the paper 'An active learning-based SVM multi-class classification model' published in the year 2015?"],"info":{}}
{"id":"train_5155","question":"Wasn't the publication 'Estimation and Robustness Analysis of Protein Networks for Cell Cycle Systems' published in 2010?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEcca/AzumaKTA10> dblp:yearOfPublication '2010' FILTER NOT EXISTS { <https://dblp.org/rec/conf/IEEEcca/AzumaKTA10> dblp:yearOfPublication '2010' } }","paraphrases":["Was 'Estimation and Robustness Analysis of Protein Networks for Cell Cycle Systems' not published in 2010?"],"info":{}}
{"id":"train_5156","question":"Have the authors of the paper 'Consumer health information needs: A systematic review of instrument development' not published a publication in Inf. Process. Manag.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ipm/ChiPZ20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ipm/ChiPZ20> ) . ?y dblp:publishedIn 'Inf. Process. Manag.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ipm/ChiPZ20> dblp:publishedIn 'Inf. Process. Manag.' } }","paraphrases":["Did the authors of the publication 'Consumer health information needs: A systematic review of instrument development' not publish a paper in Inf. Process. Manag.?"],"info":{}}
{"id":"train_5157","question":"Did the authors of 'On The Robot As A Moral Agent' not publish a paper in Interacci\\u00F3n?","sparql":"ASK { <https://dblp.org/rec/conf/interaccion/NagatakiSHKKOMK18> <https://dblp.org/rdf/schema#authoredBy> ?x . ?y <https://dblp.org/rdf/schema#authoredBy> ?x FILTER (?y != <https://dblp.org/rec/conf/interaccion/NagatakiSHKKOMK18>) . ?y <https://dblp.org/rdf/schema#publishedIn> 'Interacci\\u00F3n' FILTER NOT EXISTS { <https://dblp.org/rec/conf/interaccion/NagatakiSHKKOMK18> <https://dblp.org/rdf/schema#publishedIn> 'Interacci\\u00F3n' } }","paraphrases":["Have the authors of the paper 'On The Robot As A Moral Agent' not published a publication in Interacci\\u00F3n?"],"info":{}}
{"id":"train_5158","question":"Did the authors of the publication 'Turning grain maps into diagrams' not publish a paper in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2205-06650> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2205-06650> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2205-06650> dblp:publishedIn 'CoRR' } }","paraphrases":["Have the authors of the paper 'Turning grain maps into diagrams' not published a publication in CoRR?"],"info":{}}
{"id":"train_5159","question":"Did the authors of 'Machinic dispossession and augmented despotism: Digital work in an Amazon warehouse' not publish a paper in New Media Soc.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/nms/Delfanti21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/nms/Delfanti21> ) . ?y dblp:publishedIn 'New Media Soc.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/nms/Delfanti21> dblp:publishedIn 'New Media Soc.' } }","paraphrases":["Have the authors of the paper 'Machinic dispossession and augmented despotism: Digital work in an Amazon warehouse' not published a publication in New Media Soc.?"],"info":{}}
{"id":"train_5160","question":"Wasn't the publication 'Smart Relay Architecture for Over-the-Horizon High Quality Communications With Unmanned Aerial Vehicles' published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/Blazquez-Garcia19> dblp:yearOfPublication '2019' FILTER NOT EXISTS { <https://dblp.org/rec/journals/access/Blazquez-Garcia19> dblp:yearOfPublication '2019' } }","paraphrases":["Was 'Smart Relay Architecture for Over-the-Horizon High Quality Communications With Unmanned Aerial Vehicles' not published in 2019?"],"info":{}}
{"id":"train_5161","question":"Did the authors of 'Towards patterns to enhance the communication in distributed software development environments' not publish a paper in Pattern Languages of Programs?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/plop/OberortnerKD11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/plop/OberortnerKD11> ) . ?y dblp:publishedIn 'PLoP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/plop/OberortnerKD11> dblp:publishedIn 'PLoP' } }","paraphrases":["Haven't the authors of the publication 'Towards patterns to enhance the communication in distributed software development environments' published a publication in PLoP?"],"info":{}}
{"id":"train_5162","question":"Wasn't the publication 'A dynamic instruction set computer' published in 1995?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fccm/WirthlinH95> dblp:yearOfPublication '1995' FILTER NOT EXISTS { <https://dblp.org/rec/conf/fccm/WirthlinH95> dblp:yearOfPublication '1995' } }","paraphrases":["Was 'A dynamic instruction set computer' not published in 1995?"],"info":{}}
{"id":"train_5165","question":"Did the authors of '/ed (slashed): gut feelings when being cut and pierced' not publish 'Information Needs of Rural Communities'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/siggraph/OoshimaFHAWK08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jci/YusopIYADGSSYKR13> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/jci/YusopIYADGSSYKR13> != <https://dblp.org/rec/conf/siggraph/OoshimaFHAWK08> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/siggraph/OoshimaFHAWK08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jci/YusopIYADGSSYKR13> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/jci/YusopIYADGSSYKR13> != <https://dblp.org/rec/conf/siggraph/OoshimaFHAWK08> ) } }","paraphrases":["Have the authors of the paper '/ed (slashed): gut feelings when being cut and pierced' not published the paper 'Information Needs of Rural Communities'?"],"info":{}}
{"id":"train_5166","question":"Wasn't the publication 'Privacy-preserving Cross-domain Routing Optimization - A Cryptographic Approach' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/ChenQZ15> dblp:yearOfPublication '2015' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/ChenQZ15> dblp:yearOfPublication '2015' } }","paraphrases":["Was 'Privacy-preserving Cross-domain Routing Optimization - A Cryptographic Approach' not published in 2015?"],"info":{}}
{"id":"train_5167","question":"Have the authors of the paper 'Number Portability Parameters for the \\tel\\ URI' not published the paper 'Learning SAS by Example: A Programmer's Guide'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/rfc/rfc4694> dblp:authoredBy ?x . <https://dblp.org/rec/journals/technometrics/Holt08> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/technometrics/Holt08> != <https://dblp.org/rec/journals/rfc/rfc4694> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/rfc/rfc4694> dblp:authoredBy ?x . <https://dblp.org/rec/journals/technometrics/Holt08> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/technometrics/Holt08> != <https://dblp.org/rec/journals/rfc/rfc4694> ) } }","paraphrases":["Did the authors of the publication 'Number Portability Parameters for the \\tel\\ URI' not publish 'Learning SAS by Example: A Programmer's Guide'?"],"info":{}}
{"id":"train_5168","question":"Haven't the authors of the publication 'An Anonymous Authentication and Communication Protocol for Wireless Mesh Networks' published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1107-5538> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1107-5538> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1107-5538> dblp:publishedIn 'CoRR' } }","paraphrases":["Did the authors of 'An Anonymous Authentication and Communication Protocol for Wireless Mesh Networks' not publish a paper in CoRR?"],"info":{}}
{"id":"train_5169","question":"Wasn't the publication 'Analysis of a Cooperative Caching-Multicast Strategy in D2D-Aided Networks' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wcl/LiWWS21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/wcl/LiWWS21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the paper 'Analysis of a Cooperative Caching-Multicast Strategy in D2D-Aided Networks' published in the year 2021?"],"info":{}}
{"id":"train_5171","question":"Haven't the authors of the publication 'Playas: homeland mirage' published a publication in ACM Multimedia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mm/StennerKW05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/mm/StennerKW05> ) . ?y dblp:publishedIn 'ACM Multimedia' FILTER NOT EXISTS { <https://dblp.org/rec/conf/mm/StennerKW05> dblp:publishedIn 'ACM Multimedia' } }","paraphrases":["Did the authors of the publication 'Playas: homeland mirage' not publish a paper in ACM Multimedia?"],"info":{}}
{"id":"train_5172","question":"Was 'Model-Based Control of Planar Piezoelectric Inchworm Soft Robot for Crawling in Constrained Environments' not published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2203-15198> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2203-15198> dblp:yearOfPublication '2022' } }","paraphrases":["Wasn't the paper 'Model-Based Control of Planar Piezoelectric Inchworm Soft Robot for Crawling in Constrained Environments' published in the year 2022?"],"info":{}}
{"id":"train_5173","question":"Wasn't the publication 'A cooperative nearest neighbours topology control algorithm for wireless ad hoc networks' published in 2003?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icccn/GerharzWMJ03> dblp:yearOfPublication '2003' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icccn/GerharzWMJ03> dblp:yearOfPublication '2003' } }","paraphrases":["Wasn't the paper 'A cooperative nearest neighbours topology control algorithm for wireless ad hoc networks' published in the year 2003?"],"info":{}}
{"id":"train_5174","question":"Have the authors of the paper 'Generalized Outer Bounds on the Finite Geometric Sum of Ellipsoids' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2107-08912> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2107-08912> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2107-08912> dblp:publishedIn 'CoRR' } }","paraphrases":["Haven't the authors of the publication 'Generalized Outer Bounds on the Finite Geometric Sum of Ellipsoids' published a publication in CoRR?"],"info":{}}
{"id":"train_5175","question":"Did the authors of 'Secure Consensus of Multiagent Systems With Input Saturation and Distributed Multiple DoS Attacks' not publish a paper in IEEE Trans. Circuits Syst. II Express Briefs?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcasII/DuYDQ22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tcasII/DuYDQ22> ) . ?y dblp:publishedIn 'IEEE Trans. Circuits Syst. II Express Briefs' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tcasII/DuYDQ22> dblp:publishedIn 'IEEE Trans. Circuits Syst. II Express Briefs' } }","paraphrases":["Haven't the authors of the publication 'Secure Consensus of Multiagent Systems With Input Saturation and Distributed Multiple DoS Attacks' published a publication in IEEE Trans. Circuits Syst. II Express Briefs?"],"info":{}}
{"id":"train_5176","question":"Wasn't the paper 'Robust automated Parkinson disease detection based on voice signals with transfer learning' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eswa/KaramanCAP21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/eswa/KaramanCAP21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the publication 'Robust automated Parkinson disease detection based on voice signals with transfer learning' published in 2021?"],"info":{}}
{"id":"train_5178","question":"Haven't the authors of the publication 'Classification of cardiac sound signals using constrained tunable-Q wavelet transform' published the paper 'Requirements Elicitation Techniques Applied in Software Startups'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eswa/PatidarP14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/euromicro/RafiqBWL17> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/euromicro/RafiqBWL17> != <https://dblp.org/rec/journals/eswa/PatidarP14> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/eswa/PatidarP14> dblp:authoredBy ?x . <https://dblp.org/rec/conf/euromicro/RafiqBWL17> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/euromicro/RafiqBWL17> != <https://dblp.org/rec/journals/eswa/PatidarP14> ) } }","paraphrases":["Did the authors of 'Classification of cardiac sound signals using constrained tunable-Q wavelet transform' not publish 'Requirements Elicitation Techniques Applied in Software Startups'?"],"info":{}}
{"id":"train_5179","question":"Haven't the authors of the publication 'An Empirical Study on the Relationship between User Characteristics and Quality Factors for Effective Shopping Mall Websites Implementation' published a publication in SERA (selected papers)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sera/KwonKSL13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sera/KwonKSL13> ) . ?y dblp:publishedIn 'SERA (selected papers)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sera/KwonKSL13> dblp:publishedIn 'SERA (selected papers)' } }","paraphrases":["Did the authors of 'An Empirical Study on the Relationship between User Characteristics and Quality Factors for Effective Shopping Mall Websites Implementation' not publish a paper in ACIS Conference on Software Engineering Research, Management and Applications?"],"info":{}}
{"id":"train_5180","question":"Wasn't the paper 'Predicting Network Security Situation Based on a Combination Model of Multiple Neural Networks' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijsi/ZhangJ14> dblp:yearOfPublication '2014' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijsi/ZhangJ14> dblp:yearOfPublication '2014' } }","paraphrases":["Wasn't the publication 'Predicting Network Security Situation Based on a Combination Model of Multiple Neural Networks' published in 2014?"],"info":{}}
{"id":"train_5181","question":"Wasn't the paper 'Data Structures for Halfplane Proximity Queries and Incremental Voronoi Diagrams' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/algorithmica/AronovBDGILS18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/journals/algorithmica/AronovBDGILS18> dblp:yearOfPublication '2018' } }","paraphrases":["Was 'Data Structures for Halfplane Proximity Queries and Incremental Voronoi Diagrams' not published in 2018?"],"info":{}}
{"id":"train_5182","question":"Wasn't the paper 'Gr\\u00F6bner Representations of Binary Matroids' published in the year 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaecc/Borges-QuintanaBM09> dblp:yearOfPublication '2009' FILTER NOT EXISTS { <https://dblp.org/rec/conf/aaecc/Borges-QuintanaBM09> dblp:yearOfPublication '2009' } }","paraphrases":["Was 'Gr\\u00F6bner Representations of Binary Matroids' not published in 2009?"],"info":{}}
{"id":"train_5183","question":"Was 'SegChainW2V: Towards a Generic Automatic Video Segmentation Framework, Based on Lexical Chains of Audio Transcriptions and Word Embeddings' not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kes/ChifuF16> dblp:yearOfPublication '2016' FILTER NOT EXISTS { <https://dblp.org/rec/conf/kes/ChifuF16> dblp:yearOfPublication '2016' } }","paraphrases":["Wasn't the publication 'SegChainW2V: Towards a Generic Automatic Video Segmentation Framework, Based on Lexical Chains of Audio Transcriptions and Word Embeddings' published in 2016?"],"info":{}}
