{"id":"train_3583","question":"Find the number of authors of the paper 'Covid-on-the-Web: Exploring the COVID-19 scientific literature through visualization of linked data from entity and argument mining'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/qss/MeninMGGCCGMMVW21> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Covid-on-the-Web: Exploring the COVID-19 scientific literature through visualization of linked data from entity and argument mining' have?"],"info":{}}
{"id":"train_3584","question":"The paper 'On learning the derivatives of an unknown mapping with multilayer feedforward networks' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/nn/GallantW92> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'On learning the derivatives of an unknown mapping with multilayer feedforward networks' have?"],"info":{}}
{"id":"train_3587","question":"'Editorial' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cg/Encarnacao07> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Editorial' published?"],"info":{}}
{"id":"train_3588","question":"'Threats and Security Issues in Cloud Storage and Content Delivery Networks: Analysis' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fruct/WaguiaM21> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Threats and Security Issues in Cloud Storage and Content Delivery Networks: Analysis' published?"],"info":{}}
{"id":"train_3589","question":"Mention the year in which 'Regador : APP for coffee water potential estimation' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sbsi/SilvaSVS22> dblp:yearOfPublication ?answer }","paraphrases":["'Regador : APP for coffee water potential estimation' was published in which year?"],"info":{}}
{"id":"train_3590","question":"Mention the venue in which 'Embodied Interaction Design to Promote Creative Social Engagement for Older Adults' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/LeeOMF20> dblp:publishedIn ?answer }","paraphrases":["Find the venue in which the paper 'Embodied Interaction Design to Promote Creative Social Engagement for Older Adults' was published."],"info":{}}
{"id":"train_3591","question":"When was 'Finite Entailment of Local Queries in the Z Family of Description Logics' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aaai/BednarczykK22> dblp:yearOfPublication ?answer }","paraphrases":["'Finite Entailment of Local Queries in the Z Family of Description Logics' was published in which year?"],"info":{}}
{"id":"train_3595","question":"When was 'Local Contrast Phase Descriptor for Quality Assessment of Fingerprint Images' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/premi/SharmaD19> dblp:yearOfPublication ?answer }","paraphrases":["'Local Contrast Phase Descriptor for Quality Assessment of Fingerprint Images' was published in which year?"],"info":{}}
{"id":"train_3598","question":"Find the venue in which the paper 'Concept Drift in documents and Formal Concept Analysis' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ejc/MiyazakiT09> dblp:publishedIn ?answer }","paraphrases":["The paper 'Concept Drift in documents and Formal Concept Analysis' was published in which venue?"],"info":{}}
{"id":"train_3599","question":"Find the venue in which the paper 'A Semantic Web framework to enable sustainable lodging best management practices in the USA' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jitt/ScarinciM14> dblp:publishedIn ?answer }","paraphrases":["The paper 'A Semantic Web framework to enable sustainable lodging best management practices in the USA' was published in which venue?"],"info":{}}
{"id":"train_3600","question":"Name the authors of the paper 'Identification of Influencing Factors Regarding the Decision for or Against an Open Access Publication of Scientists of Medical Informatics: Description and First Results of Group Discussions and Interviews'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/medinfo/KuballaSMTH19> dblp:authoredBy ?answer }","paraphrases":["'Identification of Influencing Factors Regarding the Decision for or Against an Open Access Publication of Scientists of Medical Informatics: Description and First Results of Group Discussions and Interviews' was authored by which authors?"],"info":{}}
{"id":"train_3601","question":"When was 'Leveraging the subtleties of location' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eusai/Dobson05> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Leveraging the subtleties of location' published?"],"info":{}}
{"id":"train_3602","question":"Find the number of authors of the paper 'Design Structure Analysis and Transaction Recording in SystemC'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/fdl/KlingaufG06> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Design Structure Analysis and Transaction Recording in SystemC' have?"],"info":{}}
{"id":"train_3603","question":"What year was 'Students' and Parents' Attitudes towards Online Privacy: An International Study' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hicss/ClemonsW15> dblp:yearOfPublication ?answer }","paraphrases":["'Students' and Parents' Attitudes towards Online Privacy: An International Study' was published in which year?"],"info":{}}
{"id":"train_3604","question":"Where was 'Optimization of non-cooperative P2P network from the game theory point of view' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wcnc/RozarioHN11> dblp:publishedIn ?answer }","paraphrases":["The paper 'Optimization of non-cooperative P2P network from the game theory point of view' was published in which venue?"],"info":{}}
{"id":"train_3605","question":"Mention the number of authors of the paper 'Automatic Bus Ticketing System Bangladesh'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icccnt/AlamZK21> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Automatic Bus Ticketing System Bangladesh' have?"],"info":{}}
{"id":"train_3606","question":"List the authors of the paper 'SDRAM Architecture & Single Event Effects Revealed with Laser'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iolts/BougerolMB08> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'SDRAM Architecture & Single Event Effects Revealed with Laser'?"],"info":{}}
{"id":"train_3607","question":"Mention the venue in which 'Information System for Quality Control of Polyethylene Production in a Circular Economy' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/momlet/BaranKBPL21> dblp:publishedIn ?answer }","paraphrases":["The paper 'Information System for Quality Control of Polyethylene Production in a Circular Economy' was published in which venue?"],"info":{}}
{"id":"train_3608","question":"'ASICS: Authenticated Key Exchange Security Incorporating Certification Systems' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/esorics/BoydCFPPS13> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'ASICS: Authenticated Key Exchange Security Incorporating Certification Systems'?"],"info":{}}
{"id":"train_3610","question":"In which venue was the paper 'Fr-ONT: An Algorithm for Frequent Concept Mining with Formal Ontologies' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ismis/LawrynowiczP11> dblp:publishedIn ?answer }","paraphrases":["The paper 'Fr-ONT: An Algorithm for Frequent Concept Mining with Formal Ontologies' was published in which venue?"],"info":{}}
{"id":"train_3611","question":"List the authors of the paper 'Model problem and testbed for experiments with adaptation in smart cyber-physical systems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icse/MatenaBGH16> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Model problem and testbed for experiments with adaptation in smart cyber-physical systems'?"],"info":{}}
{"id":"train_3612","question":"Find the venue in which the paper 'Trust Aware Secure Energy Efficient Hybrid Protocol for MANET' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/VeeraiahKPAAAA21> dblp:publishedIn ?answer }","paraphrases":["Where was 'Trust Aware Secure Energy Efficient Hybrid Protocol for MANET' published?"],"info":{}}
{"id":"train_3613","question":"Where was 'Advances in the MIR instrument: Integration, control subsystem and analysis of the flight dynamics for beamsteering purposes' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/igarss/OnrubiaGPPQAC15> dblp:publishedIn ?answer }","paraphrases":["The paper 'Advances in the MIR instrument: Integration, control subsystem and analysis of the flight dynamics for beamsteering purposes' was published in which venue?"],"info":{}}
{"id":"train_3614","question":"Who is the author of the paper 'Mean shift: An information theoretic perspective'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/prl/RaoMP09> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Mean shift: An information theoretic perspective'?"],"info":{}}
{"id":"train_3616","question":"Find the number of authors of the paper 'An Efficient Approach to Semantic Segmentation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/ijcv/CsurkaP11> dblp:numberOfCreators ?answer }","paraphrases":["Mention the number of authors of the paper 'An Efficient Approach to Semantic Segmentation'."],"info":{}}
{"id":"train_3617","question":"When was 'Limited Communication, Multi-robot Team Based Coverage' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icra/RekleitisLNC04> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Limited Communication, Multi-robot Team Based Coverage' was published in which year?"],"info":{}}
{"id":"train_3618","question":"Mention the number of authors of the paper 'PerfectDoc: A Ground Truthing Environment for Complex Documents'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icdar/YacoubSS05> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'PerfectDoc: A Ground Truthing Environment for Complex Documents' have?"],"info":{}}
{"id":"train_3620","question":"Mention the number of authors of the paper 'Groupware for realtime collaboration'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/chi/HillB94> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Groupware for realtime collaboration' has how many authors?"],"info":{}}
{"id":"train_3621","question":"How many authors does 'A collaborative approach to heading estimation for smartphone-based PDR indoor localisation' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/ipin/AbadiLHCN14> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'A collaborative approach to heading estimation for smartphone-based PDR indoor localisation' has how many authors?"],"info":{}}
{"id":"train_3625","question":"Find the number of authors of the paper 'Vehicle Velocity Observer Design Using 6-D IMU and Multiple-Observer Approach'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/tits/OhC12> dblp:numberOfCreators ?answer }","paraphrases":["The paper 'Vehicle Velocity Observer Design Using 6-D IMU and Multiple-Observer Approach' has how many authors?"],"info":{}}
{"id":"train_3628","question":"In which venue was the paper 'Acceptance of Healthcare Robots for the Older Population: Review and Future Directions' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijsr/BroadbentSM09> dblp:publishedIn ?answer }","paraphrases":["The paper 'Acceptance of Healthcare Robots for the Older Population: Review and Future Directions' was published in which venue?"],"info":{}}
{"id":"train_3629","question":"The paper 'Pr\\u00FCfgrundlagen nach \\u00A7 8a' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dud/Woitke21> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Pr\\u00FCfgrundlagen nach \\u00A7 8a' published?"],"info":{}}
{"id":"train_3630","question":"List the authors of the paper 'What are you doing while answering your smartphone?'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icpr/AbateNBM18> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'What are you doing while answering your smartphone?'?"],"info":{}}
{"id":"train_3631","question":"'Research on Enrichment for Anammox Bacteria Inoculated via Enhanced Endogenous Denitrification' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/lsms/YuanHDLP10> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Research on Enrichment for Anammox Bacteria Inoculated via Enhanced Endogenous Denitrification'?"],"info":{}}
{"id":"train_3632","question":"List the authors of the paper 'Group topic-author model for efficient discovery of latent social astroturfing groups in tourism domain'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cybersec/AlallaqAH19> dblp:authoredBy ?answer }","paraphrases":["'Group topic-author model for efficient discovery of latent social astroturfing groups in tourism domain' was authored by which authors?"],"info":{}}
{"id":"train_3633","question":"Find the number of authors of the paper 'Phoneme-dependent speech synthesis in the time and frequency domains'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/interspeech/Fries93> dblp:numberOfCreators ?answer }","paraphrases":["Mention the number of authors of the paper 'Phoneme-dependent speech synthesis in the time and frequency domains'."],"info":{}}
{"id":"train_3634","question":"Find the venue in which the paper 'Biomolecular Reaction and Interaction Dynamics Global Environment (BRIDGE)' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bioinformatics/SenapathiBBGN19> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Biomolecular Reaction and Interaction Dynamics Global Environment (BRIDGE)' published?"],"info":{}}
{"id":"train_3635","question":"List the authors of the paper 'Creating domain-specific modeling languages using by-demonstration technique'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/oopsla/Cho11a> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Creating domain-specific modeling languages using by-demonstration technique'?"],"info":{}}
{"id":"train_3638","question":"'An Overview on Data Security in Cloud Computing' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1812-09053> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'An Overview on Data Security in Cloud Computing'?"],"info":{}}
{"id":"train_3641","question":"What year was 'lpopt: A Rule Optimization Tool for Answer Set Programming' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/fuin/BichlerMW20> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'lpopt: A Rule Optimization Tool for Answer Set Programming' was published in which year?"],"info":{}}
{"id":"train_3642","question":"Find the venue in which the paper 'A Travelling Wave Solution for Nonlinear Colloid Facilitated Mass Transport in Porous Media' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/numta/CuomoGS19> dblp:publishedIn ?answer }","paraphrases":["Where was 'A Travelling Wave Solution for Nonlinear Colloid Facilitated Mass Transport in Porous Media' published?"],"info":{}}
{"id":"train_3643","question":"Mention the venue in which 'Benefiting from Linear Behaviour of a Nonlinear Reset-Based Element at Certain Frequencies' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/anzcc/KarbasizadehDSV20> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Benefiting from Linear Behaviour of a Nonlinear Reset-Based Element at Certain Frequencies' published?"],"info":{}}
{"id":"train_3644","question":"The paper 'Performance evaluation of mobile medical multimedia transmission over ITS GeoNetworking protocol' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/healthcom/VargaB16> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Performance evaluation of mobile medical multimedia transmission over ITS GeoNetworking protocol' have?"],"info":{}}
{"id":"train_3646","question":"What year was 'Proactive policies for the stochastic resource-constrained project scheduling problem' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/eor/DeblaereDH11> dblp:yearOfPublication ?answer }","paraphrases":["'Proactive policies for the stochastic resource-constrained project scheduling problem' was published in which year?"],"info":{}}
{"id":"train_3648","question":"The paper 'Dimension Independent Matrix Square using MapReduce' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1304-1467> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Dimension Independent Matrix Square using MapReduce' published?"],"info":{}}
{"id":"train_3649","question":"Mention the venue in which 'Comparative Document Summarisation via Classification' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1812-02171> dblp:publishedIn ?answer }","paraphrases":["Where was 'Comparative Document Summarisation via Classification' published?"],"info":{}}
{"id":"train_3651","question":"The paper 'Taxonomy of New Software Exporting Nations' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/ejisdc/Carmel03> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Taxonomy of New Software Exporting Nations' have?"],"info":{}}
{"id":"train_3652","question":"'A framework of Voronoi diagram for planning multiple paths in free space' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jetai/BanerjeeC13> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'A framework of Voronoi diagram for planning multiple paths in free space'?"],"info":{}}
{"id":"train_3656","question":"How many authors does the publication 'Chaotic image cryptosystem using DNA deletion and DNA insertion' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/sigpro/HuLGGY17> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Chaotic image cryptosystem using DNA deletion and DNA insertion' have?"],"info":{}}
{"id":"train_3658","question":"The paper 'Use of electronic health records to support a public health response to the COVID-19 pandemic in the United States: a perspective from 15 academic medical centers' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jamia/MadhavanBBBDEFJ21> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Use of electronic health records to support a public health response to the COVID-19 pandemic in the United States: a perspective from 15 academic medical centers' published?"],"info":{}}
{"id":"train_3659","question":"Mention the year in which 'Using a fine-grained multiple-choice response format in educational drill-and-practice video games' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ile/BeserraNG17> dblp:yearOfPublication ?answer }","paraphrases":["'Using a fine-grained multiple-choice response format in educational drill-and-practice video games' was published in which year?"],"info":{}}
{"id":"train_3660","question":"'Predicting MR angiography image appearance for realistic models of stenosed carotid and renal arteries' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/spa/KlepaczkoS16> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Predicting MR angiography image appearance for realistic models of stenosed carotid and renal arteries'?"],"info":{}}
{"id":"train_3661","question":"The paper 'A Traffic-Grooming Algorithm for Wavelength-Routed Optical Networks' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/informs/DawandeGNS07> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'A Traffic-Grooming Algorithm for Wavelength-Routed Optical Networks' have?"],"info":{}}
{"id":"train_3662","question":"The paper 'Pedagogical Agents in the Multimedia Natural Sciences for Children' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icalt/MorozovTB03> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Pedagogical Agents in the Multimedia Natural Sciences for Children' published?"],"info":{}}
{"id":"train_3664","question":"Mention the venue in which 'Children's Transfer of Spatial Learning from Virtual Reality to Real Environments' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cbsn/McComasPL98> dblp:publishedIn ?answer }","paraphrases":["The paper 'Children's Transfer of Spatial Learning from Virtual Reality to Real Environments' was published in which venue?"],"info":{}}
{"id":"train_3665","question":"Mention the year in which 'Where Was Alexander the Great in 325 BC? Toward Understanding History Text with a World Model' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/emnlp/MurakamiT15> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'Where Was Alexander the Great in 325 BC? Toward Understanding History Text with a World Model' was published in which year?"],"info":{}}
{"id":"train_3668","question":"What year was 'Navigation abseits von Stra\\u00DFen' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/agit/PrullerSSFS16> dblp:yearOfPublication ?answer }","paraphrases":["'Navigation abseits von Stra\\u00DFen' was published in which year?"],"info":{}}
{"id":"train_3670","question":"When was 'Local sensor: click to find and point to do' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/chi/Yan09> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Local sensor: click to find and point to do' published?"],"info":{}}
{"id":"train_3671","question":"Mention the number of authors of the paper 'Low-Cost and Robust Geographic Opportunistic Routing in a Strip Topology Wireless Network'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/tosn/LiuFLXCLLT19> dblp:numberOfCreators ?answer }","paraphrases":["Find the number of authors of the paper 'Low-Cost and Robust Geographic Opportunistic Routing in a Strip Topology Wireless Network'."],"info":{}}
{"id":"train_3672","question":"'Visual sentence-phrase-based document representation for effective and efficient content-based image retrieval' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/f-egc/sayadMUD10> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Visual sentence-phrase-based document representation for effective and efficient content-based image retrieval' published?"],"info":{}}
{"id":"train_3674","question":"List the authors of the paper 'Inference of fault signatures of discrete-event systems from event logs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dx/ChristopherPG17> dblp:authoredBy ?answer }","paraphrases":["'Inference of fault signatures of discrete-event systems from event logs' was authored by which authors?"],"info":{}}
{"id":"train_3677","question":"'Optimal Resource Allocation for Uplink Data Collection in Nonorthogonal Multiple Access Networks' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/WuZNQ0Z18> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Optimal Resource Allocation for Uplink Data Collection in Nonorthogonal Multiple Access Networks' published?"],"info":{}}
{"id":"train_3679","question":"The paper 'Wind-Tunnel Testing for strategy and market design' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isda/Tsang06> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Wind-Tunnel Testing for strategy and market design' published?"],"info":{}}
{"id":"train_3680","question":"'Teaching Android App Development to First Year Undergraduates: Textual Programming or Visual Programming?' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/tale/LiangNK21> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Teaching Android App Development to First Year Undergraduates: Textual Programming or Visual Programming?' published?"],"info":{}}
{"id":"train_3683","question":"Mention the venue in which 'Integration Framework of MES Toward Data Security Interoperation' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/caise/WeiBXMLW20> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Integration Framework of MES Toward Data Security Interoperation' published?"],"info":{}}
{"id":"train_3684","question":"'Luna-TX: An Optimized Transactional Mechanism for Persistent Memory' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/nvmsa/ShuLCLS19> dblp:yearOfPublication ?answer }","paraphrases":["When was 'Luna-TX: An Optimized Transactional Mechanism for Persistent Memory' published?"],"info":{}}
{"id":"train_3685","question":"When was 'What Can We Learn from Almost a Decade of Food Tweets' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hlt/SprogisR20> dblp:yearOfPublication ?answer }","paraphrases":["Mention the year in which 'What Can We Learn from Almost a Decade of Food Tweets' was published."],"info":{}}
{"id":"train_3686","question":"The paper 'A partial result about the factorization conjecture for finite variable-length codes' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dm/Felice93> dblp:publishedIn ?answer }","paraphrases":["Where was 'A partial result about the factorization conjecture for finite variable-length codes' published?"],"info":{}}
{"id":"train_3687","question":"Name the authors of the paper '\\A Safer Cloud\\, Data Isolation and Security by Tus-Man Protocol'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/socpros/BhardwajPS12> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper '\\A Safer Cloud\\, Data Isolation and Security by Tus-Man Protocol'?"],"info":{}}
{"id":"train_3689","question":"How many authors does 'What is the cost of living online?' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/cacm/Greengard21d> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'What is the cost of living online?' have?"],"info":{}}
{"id":"train_3691","question":"What year was 'Analysis of Market Opportunities for Chinese Private Express Delivery Industry' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isdevel/JiangBT09> dblp:yearOfPublication ?answer }","paraphrases":["'Analysis of Market Opportunities for Chinese Private Express Delivery Industry' was published in which year?"],"info":{}}
