{"id":"train_931","question":"Who are the co-authors of Ruibin M. in the last 7 years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/207/5786> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/207/5786> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Ruibin Ma in the last 7 years and where are they affiliated?"],"info":{}}
{"id":"train_932","question":"In which venues did David Murray-Rust publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/93/100> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that David Murray-Rust published and in which venues?"],"info":{}}
{"id":"train_936","question":"Mention the papers published by A. Ghaffari Hadigheh and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/60/4071> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Alireza Ghaffari Hadigheh publish and in which year?"],"info":{}}
{"id":"train_937","question":"What are the titles of the papers that Daryush D. Mehta published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/56/9879> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Daryush D. Mehta publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_938","question":"Which publications did Francesco D'Ettorre author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/310/0083> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Francesco D. and in which year."],"info":{}}
{"id":"train_939","question":"List the titles of the papers that Nikolay M. Safyannikov published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/210/5566> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Safyannikov, N. M. published papers and the titles of these papers."],"info":{}}
{"id":"train_944","question":"List the venues in which Erel, Erdal published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/12/5013> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Erdal Erel published and in which venues."],"info":{}}
{"id":"train_945","question":"Which papers did author Glen Thorpe publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/145/8693> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Glen Thorpe author and in which year?"],"info":{}}
{"id":"train_947","question":"Mention the papers published by Freedman, M. J. and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/65/1370> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Michael J. Freedman author and in which year?"],"info":{}}
{"id":"train_948","question":"Mention the papers published by Ryan Zarick and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/38/10444> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Ryan Zarick publish and in which year?"],"info":{}}
{"id":"train_949","question":"Which papers did author Ryszard Kozera publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/97/6638> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Kozera, R. author and in which year?"],"info":{}}
{"id":"train_950","question":"List the titles of the papers that S. Madarasmi published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/32/2497> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Suthep Madarasmi published papers and the titles of these papers."],"info":{}}
{"id":"train_951","question":"Which publications did Kiril T. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/79/8750> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Kiril T. and in which year."],"info":{}}
{"id":"train_952","question":"Mention the other authors with whom Miroslav V. has co-authored papers in the last nine years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/160/8748> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/160/8748> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Miroslav V. in the last nine years and where are they affiliated?"],"info":{}}
{"id":"train_954","question":"List the titles of the papers that Zhao, D. published in the last seven years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/191/2316> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Dongwei Zhao published papers in the last 7 years and the titles of these papers."],"info":{}}
{"id":"train_956","question":"List the venues in which Kevin Lamshoft published papers in the last two years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/213/9645> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Lamshoft, K. published in the last 2 years and in which venues?"],"info":{}}
{"id":"train_959","question":"List the titles of the papers that Li, C. published in the last six years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/1926-1> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Li, C. published papers in the last six years and the titles of these papers."],"info":{}}
{"id":"train_960","question":"What are the titles of the papers that Ju-Sheng Mi published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/18/2850> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Ju-Sheng M. publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_962","question":"In which venues did E. Ilhan Konukseven publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/6524> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that E. Ilhan Konukseven published and in which venues?"],"info":{}}
{"id":"train_963","question":"Which publications did Srinivas Katkoori author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/01/4012> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Katkoori, Srinivas and in which year."],"info":{}}
{"id":"train_965","question":"What are the titles of the papers that Z. Ma published and in which venues?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/138/5978> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Z. Ma publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_966","question":"Name the co-authors of Zia, M. in the last 6 years and where are they affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/5431> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/76/5431> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Muhammad Zia in the last 6 years and where are they affiliated?"],"info":{}}
{"id":"train_967","question":"List the venues in which Poupard, G. published papers in the last 3 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/4095> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Poupard, G. published in the last 3 years and in which venues?"],"info":{}}
{"id":"train_968","question":"Mention the other authors with whom Matteo M. has co-authored papers in the last seven years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/38/9508> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/38/9508> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Matteo M. in the last seven years and where are they affiliated?"],"info":{}}
{"id":"train_970","question":"Mention the other authors with whom Micha\\u00EBl Aupetit has co-authored papers in the last two years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/48/3879> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/48/3879> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Aupetit, M. in the last two years and where are they affiliated?"],"info":{}}
{"id":"train_973","question":"Mention the other authors with whom Geist, Matthieu has co-authored papers in the last four years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/38/6508> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/38/6508> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Geist, Matthieu in the last 4 years and where are they affiliated?"],"info":{}}
{"id":"train_974","question":"Mention the other authors with whom Rick Chartrand has co-authored papers in the last 2 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/03/641> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/03/641> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of R. Chartrand in the last 2 years and where are they affiliated?"],"info":{}}
{"id":"train_976","question":"Which papers did author Mohammad Rafiqul Haider publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/46/9350> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Haider, M. Rafiqul author and in which year?"],"info":{}}
{"id":"train_978","question":"List the venues in which Yulong Tao published papers in the last six years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/260/0220> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that Yulong T. published in the last six years and in which venues."],"info":{}}
{"id":"train_979","question":"Mention the papers published by Shu Liang and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/148/4739> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Shu Liang publish and in which year?"],"info":{}}
{"id":"train_980","question":"Which papers did author Sara Ayoubi publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/23/10124> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Sara Ayoubi and in which year."],"info":{}}
{"id":"train_982","question":"Mention the papers published by Christof Eck and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/41/4351> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Christof Eck author and in which year?"],"info":{}}
{"id":"train_983","question":"List the titles of the papers that Sorin Vlase published in the last 6 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/124/7711> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which S. Vlase published papers in the last six years and the titles of these papers."],"info":{}}
{"id":"train_984","question":"List the titles of the papers that Wang, X. published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/37/3003> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Xiaomin Wang publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_985","question":"Mention the papers published by Wang, Hsiao-Chuan and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/61/2535> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Wang, Hsiao-Chuan author and in which year?"],"info":{}}
{"id":"train_987","question":"List the titles of the papers that Kuno Schedler published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/45/2390> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Schedler, Kuno published papers and the titles of these papers."],"info":{}}
{"id":"train_990","question":"In which venues did Panos Vassiliadis publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/13/1242> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Panos Vassiliadis published and in which venues?"],"info":{}}
{"id":"train_991","question":"Which publications did L. Sun author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/95/6619-6> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by L. Sun and in which year."],"info":{}}
{"id":"train_992","question":"Which papers did author Heng H. publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/03/281> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Heng Huang author and in which year?"],"info":{}}
{"id":"train_993","question":"Mention the papers published by Rabab Altabtabaei and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/322/2539> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author R. Altabtabaei publish and in which year?"],"info":{}}
{"id":"train_994","question":"List the venues in which Nicholas G. published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/55/4788> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Nicholas Glean published and in which venues?"],"info":{}}
{"id":"train_995","question":"List the titles of the papers that M. Barbovschi published in the last four years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/164/1672> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Monica Barbovschi published papers in the last four years and the titles of these papers."],"info":{}}
{"id":"train_998","question":"Which papers did author Mikhail Bilenko publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/13/1269> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Mikhail Bilenko author and in which year?"],"info":{}}
{"id":"train_999","question":"Which papers did author A. Otero publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/77/7019> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Abraham Otero author and in which year?"],"info":{}}
{"id":"train_1000","question":"Which papers did author Janet M. Twomey publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/99/3553> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by J. M. Twomey and in which year."],"info":{}}
{"id":"train_1001","question":"Which publications did Feng, J. author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/162/9090> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Feng, J. publish and in which year?"],"info":{}}
{"id":"train_1003","question":"Which papers did author Tao Cui publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/58/2994> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Cui, Tao and in which year."],"info":{}}
{"id":"train_1004","question":"Which publications did Wang, Wei author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/w/WeiWang> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Wang, Wei publish and in which year?"],"info":{}}
{"id":"train_1005","question":"Which papers did author Hyun-Goo Yoon publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/51/7082> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Hyun-Goo Yoon author and in which year?"],"info":{}}
{"id":"train_1006","question":"Mention the other authors with whom Olabi, A. G. has co-authored papers in the last nine years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/5083> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/67/5083> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Olabi, A. G. in the last nine years and where are they affiliated?"],"info":{}}
{"id":"train_1007","question":"Mention the other authors with whom Alfredo P. has co-authored papers in the last four years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/152/3138> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/152/3138> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of Alfredo P. in the last four years and where are they affiliated?"],"info":{}}
{"id":"train_1008","question":"List the titles of the papers that Kang, J. Jin published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/186/1573> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Kang, J. Jin published and in which venues?"],"info":{}}
{"id":"train_1011","question":"Which publications did Gustavo Alonso author and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/a/GustavoAlonso> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Gustavo Alonso publish and in which year?"],"info":{}}
{"id":"train_1014","question":"List the venues in which Muhammad Afzal published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/49/4911> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the titles of the papers that M. Afzal published and in which venues."],"info":{}}
{"id":"train_1015","question":"List the venues in which Samir B. published papers in the last 2 years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/26/10668> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Samir B. published in the last 2 years and in which venues?"],"info":{}}
{"id":"train_1017","question":"Mention the other authors with whom Rupert Wegerif has co-authored papers in the last 9 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/5723> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/76/5723> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Name the co-authors of R. Wegerif in the last 9 years and where are they affiliated?"],"info":{}}
{"id":"train_1018","question":"Which papers did author Somprakash B. publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/74/1644> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Mention the papers published by Somprakash Bandyopadhyay and in which year."],"info":{}}
{"id":"train_1020","question":"List the venues in which Ningjian H. published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/85/748> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Ningjian Huang publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_1021","question":"List the venues in which Liang, Mangui published papers in the last three years and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/02/2000> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Mangui Liang published in the last three years and in which venues?"],"info":{}}
{"id":"train_1025","question":"Which papers did author J. Rouas publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/69/2845> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did J. Rouas author and in which year?"],"info":{}}
{"id":"train_1026","question":"List the venues in which Li, Zhiping published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/77/4850> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Li, Zhiping publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_1027","question":"List the venues in which Kinn Abass Bakon published papers and the titles of these papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/307/4355> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Kinn Abass Bakon published and in which venues?"],"info":{}}
{"id":"train_1029","question":"Which papers did author Min Li publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/82/0-7> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did Min Li author and in which year?"],"info":{}}
{"id":"train_1030","question":"Mention the papers published by Omega Gamage and in which year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/248/5341> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which papers did author Gamage, O. publish and in which year?"],"info":{}}
{"id":"train_1031","question":"List the titles of the papers that Gang Deng published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/98/6900> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["In which venues did Gang Deng publish papers and what are the titles of these papers?"],"info":{}}
{"id":"train_1035","question":"List the titles of the papers that Ren C. Luo published in the last 5 years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/70/1753> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which R. C. Luo published papers in the last five years and the titles of these papers."],"info":{}}
