{"id":"train_0","question":"What are the papers written by the person Wazir Muhammad?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/211/3355> }","paraphrases":["Which papers did the author Wazir Muhammad write?"],"info":{}}
{"id":"train_1","question":"What is the Wikidata ID of Yvo Desmedt?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/d/YvoDesmedt> dblp:wikidata ?answer }","paraphrases":["The author Y. Desmedt is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_2","question":"What is the primary affiliation of Leandro Krug Wives?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/w/LeandroKrugWives> dblp:primaryAffiliation ?answer }","paraphrases":["Leandro Krug Wives is primarily affiliated to which institution?"],"info":{}}
{"id":"train_3","question":"What is the webpage of Ravi Kumar?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/k/RaviKumar> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Ravi Kumar?"],"info":{}}
{"id":"train_4","question":"Which publications did Lambe, Larry A. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/13/378> }","paraphrases":["Which papers did the author Lambe, Larry A. write?"],"info":{}}
{"id":"train_5","question":"Mention the primary affiliation of Jo\\u00E3o Marcos Travassos Romano.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/20/4410> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Romano, Jo\\u00E3o Marcos Travassos?"],"info":{}}
{"id":"train_6","question":"Show the Wikidata ID of the person Martin Zachariasen.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/97/5868> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Zachariasen, M.?"],"info":{}}
{"id":"train_7","question":"Which publications did Nicholas D. Lane author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/2663> }","paraphrases":["What are the papers written by the person Nicholas D. Lane?"],"info":{}}
{"id":"train_8","question":"Which papers did the author Nishikawa, Ken'ya write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/124/9189> }","paraphrases":["Which publications did Nishikawa, Ken'ya author?"],"info":{}}
{"id":"train_9","question":"What is the webpage of the person Nic V.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/44/3693> dblp:webpage ?answer }","paraphrases":["What is the webpage of Nic Volanschi?"],"info":{}}
{"id":"train_10","question":"What is the webpage of Jun'ichi Tsujii?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/t/JunichiTsujii> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Jun'ichi T.?"],"info":{}}
{"id":"train_11","question":"Which papers did the author Christopher Mayershofer write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/286/7023> }","paraphrases":["Which publications did Mayershofer, C. author?"],"info":{}}
{"id":"train_12","question":"What are the papers written by the person M. Sidi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/s/MosheSidi> }","paraphrases":["Which publications did Moshe Sidi author?"],"info":{}}
{"id":"train_13","question":"What is the webpage of the person Masayuki Murata?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/99/4092> dblp:webpage ?answer }","paraphrases":["What is the webpage of Murata, Masayuki?"],"info":{}}
{"id":"train_14","question":"Which papers did the author Jingdong Li write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/119/1790> }","paraphrases":["Which publications did J. Li author?"],"info":{}}
{"id":"train_15","question":"What are the papers written by T. Arthur Terlep?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/122/6276> }","paraphrases":["Which papers did the author T. Arthur Terlep write?"],"info":{}}
{"id":"train_16","question":"What is the webpage of the person D. E. O'Leary?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/o/DanielEOLeary> dblp:webpage ?answer }","paraphrases":["What is the webpage of D. E. O'Leary?"],"info":{}}
{"id":"train_17","question":"Which publications did Lixian Zhang author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/45/2915> }","paraphrases":["Which papers did the author L. Zhang write?"],"info":{}}
{"id":"train_18","question":"Mention the primary affiliation of Alan W. Black.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/b/AlanWBlack> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Alan W. Black?"],"info":{}}
{"id":"train_19","question":"What is the webpage of the person Zdonik, Stanley B.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/z/SBZdonik> dblp:webpage ?answer }","paraphrases":["What is the webpage of Stanley B. Zdonik?"],"info":{}}
{"id":"train_20","question":"What are the papers written by the person Amon Rapp?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/1669> }","paraphrases":["What are the papers written by Amon Rapp?"],"info":{}}
{"id":"train_21","question":"Which publications did Nishi, H. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/2020> }","paraphrases":["What are the papers written by Nishi, H.?"],"info":{}}
{"id":"train_22","question":"What are the papers written by Abhinav Srivastava?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/77/252> }","paraphrases":["What are the papers written by the person Abhinav Srivastava?"],"info":{}}
{"id":"train_23","question":"What are the papers written by Jialu D.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/75/6755> }","paraphrases":["What are the papers written by the person Jialu D.?"],"info":{}}
{"id":"train_24","question":"What are the papers written by Richard McCreadie?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/7184> }","paraphrases":["What are the papers written by the person McCreadie, Richard?"],"info":{}}
{"id":"train_25","question":"Which papers did the author Wu, Kui write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/181/2711-3> }","paraphrases":["What are the papers written by Kui Wu?"],"info":{}}
{"id":"train_26","question":"Which publications did Brooks, S. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/01/10677> }","paraphrases":["What are the papers written by the person Stoney Brooks?"],"info":{}}
{"id":"train_27","question":"What are the papers written by Frolkovic, P.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/1770> }","paraphrases":["What are the papers written by the person Frolkovic, P.?"],"info":{}}
{"id":"train_28","question":"What is the webpage of Lutz Schr\\u00F6der?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/69/2397> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Lutz S.?"],"info":{}}
{"id":"train_30","question":"Roccetti, Marco is primarily affiliated to which institution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/r/MarcoRoccetti> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Marco Roccetti?"],"info":{}}
{"id":"train_31","question":"Which publications did Young, K. Soo author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/69/6071> }","paraphrases":["What are the papers written by Kim Soo Young?"],"info":{}}
{"id":"train_32","question":"The author Haitao Z. is associated with which Wikidata identifier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/43/4261> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person Haitao Z.."],"info":{}}
{"id":"train_33","question":"What are the papers written by Amit K. Patel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/18/1100> }","paraphrases":["Which papers did the author Amit K. Patel write?"],"info":{}}
{"id":"train_34","question":"What are the papers written by Sciannamblo, Mariacristina?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/211/2985> }","paraphrases":["What are the papers written by the person Sciannamblo, Mariacristina?"],"info":{}}
{"id":"train_35","question":"What is the webpage of Anita K. Jones?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/01/5537> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person A. K. Jones?"],"info":{}}
{"id":"train_36","question":"Which papers did the author Markus Str\\u00E4ssler write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/20/1410> }","paraphrases":["Which publications did M. Str\\u00E4ssler author?"],"info":{}}
{"id":"train_38","question":"What is the webpage of the person Murat Yuksel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/58/2891> dblp:webpage ?answer }","paraphrases":["What is the webpage of Murat Yuksel?"],"info":{}}
{"id":"train_39","question":"What is the primary affiliation of Jie Lu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/39/2936-1> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Jie Lu."],"info":{}}
{"id":"train_40","question":"Which publications did Xu, D. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/09/3493-2> }","paraphrases":["What are the papers written by Dong Xu?"],"info":{}}
{"id":"train_41","question":"What is the Wikidata ID of Paul Mulholland?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/82/1232> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person Paul Mulholland."],"info":{}}
{"id":"train_42","question":"Which publications did Vasconcelos, L. O. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/169/7076> }","paraphrases":["Which papers did the author Vasconcelos, L. O. write?"],"info":{}}
{"id":"train_43","question":"What is the webpage of Lionel S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/75/3681> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Lionel Seinturier?"],"info":{}}
{"id":"train_44","question":"What are the papers written by Scott Rose?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/13/4027> }","paraphrases":["What are the papers written by the person Scott R.?"],"info":{}}
{"id":"train_45","question":"Martin Schoeberl is primarily affiliated to which institution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/29/3006> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Martin Schoeberl."],"info":{}}
{"id":"train_46","question":"Show the Wikidata ID of the person Matt M. Botvinick.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/98/5712> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Matt M. Botvinick?"],"info":{}}
{"id":"train_47","question":"What are the papers written by Temple, Dorota?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/10012> }","paraphrases":["What are the papers written by the person Temple, Dorota?"],"info":{}}
{"id":"train_48","question":"What is the webpage of the person Vidal, Vincent?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/09/5817-1> dblp:webpage ?answer }","paraphrases":["What is the webpage of Vidal, Vincent?"],"info":{}}
{"id":"train_49","question":"What are the papers written by Shengying Zhu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/133/3294> }","paraphrases":["Which papers did the author Zhu, Shengying write?"],"info":{}}
{"id":"train_50","question":"Mention the primary affiliation of Martin Hofmann.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/h/MartinHofmann> dblp:primaryAffiliation ?answer }","paraphrases":["M. Hofmann is primarily affiliated to which institution?"],"info":{}}
{"id":"train_51","question":"Which publications did George Feuerlicht author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/435> }","paraphrases":["What are the papers written by Feuerlicht, G.?"],"info":{}}
{"id":"train_53","question":"Mention the primary affiliation of M. Thelwall.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/t/MikeThelwall> dblp:primaryAffiliation ?answer }","paraphrases":["Mike Thelwall is primarily affiliated to which institution?"],"info":{}}
{"id":"train_54","question":"What are the papers written by Rui L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/96/4282-16> }","paraphrases":["What are the papers written by the person Rui L.?"],"info":{}}
{"id":"train_55","question":"What are the papers written by the person Colin Schultz?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/307/3319> }","paraphrases":["Which publications did Colin Schultz author?"],"info":{}}
{"id":"train_56","question":"Mention the primary affiliation of Alexander Kaplan.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/17/2079> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Kaplan, Alexander?"],"info":{}}
{"id":"train_57","question":"What are the papers written by the person F. Hancock?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/29/8394> }","paraphrases":["What are the papers written by Fiona Hancock?"],"info":{}}
{"id":"train_58","question":"What are the papers written by Poo, G.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/80/4721> }","paraphrases":["Which publications did Gee-Swee Poo author?"],"info":{}}
{"id":"train_59","question":"What is the webpage of Antonio Liotta?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/31/1394> dblp:webpage ?answer }","paraphrases":["What is the webpage of the person Antonio Liotta?"],"info":{}}
{"id":"train_60","question":"A. Di Nola is primarily affiliated to which institution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/61/351> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Antonio Di Nola."],"info":{}}
{"id":"train_61","question":"Which papers did the author Cui, Hantao write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/198/0921> }","paraphrases":["What are the papers written by Hantao Cui?"],"info":{}}
{"id":"train_62","question":"What are the papers written by the person C. Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/3837> }","paraphrases":["Which publications did Chuan Li author?"],"info":{}}
{"id":"train_63","question":"What are the papers written by Maarten Mennes?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/11383> }","paraphrases":["What are the papers written by the person Maarten Mennes?"],"info":{}}
{"id":"train_64","question":"What are the papers written by the person S. Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/47/1217> }","paraphrases":["What are the papers written by Shenghong Li?"],"info":{}}
{"id":"train_65","question":"What is the webpage of the person Jian Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/y/JianYang3> dblp:webpage ?answer }","paraphrases":["What is the webpage of Jian Yang?"],"info":{}}
{"id":"train_66","question":"Find the primary affiliation of Constantinos Marios Angelopoulos.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/17/7911> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Constantinos Marios Angelopoulos."],"info":{}}
{"id":"train_67","question":"What are the papers written by the person Bhandari, S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/203/2229> }","paraphrases":["What are the papers written by Bhandari, S.?"],"info":{}}
{"id":"train_68","question":"The author Mohammad Dabbagh is associated with which Wikidata identifier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/144/1116> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Mohammad Dabbagh?"],"info":{}}
{"id":"train_69","question":"Mention the primary affiliation of Philip W..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/w/PhilipWadler> dblp:primaryAffiliation ?answer }","paraphrases":["Find the primary affiliation of Philip W.."],"info":{}}
{"id":"train_70","question":"What are the papers written by the person M. Parker?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/5205> }","paraphrases":["Which papers did the author M. Parker write?"],"info":{}}
{"id":"train_71","question":"Which papers did the author Tsung-Han Tsai write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/4711-1> }","paraphrases":["What are the papers written by Tsung-Han Tsai?"],"info":{}}
{"id":"train_72","question":"What are the papers written by Jason Thompson?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/59/11233> }","paraphrases":["What are the papers written by the person J. Thompson?"],"info":{}}
{"id":"train_73","question":"Which papers did the author Chittarsu Raghunandan write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/5174> }","paraphrases":["What are the papers written by the person C. Raghunandan?"],"info":{}}
{"id":"train_74","question":"Show the Wikidata ID of the person Rabiee, Hamid R..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/01/4547> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Hamid R. Rabiee?"],"info":{}}
{"id":"train_75","question":"What is the primary affiliation of Marek H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/37/2425> dblp:primaryAffiliation ?answer }","paraphrases":["Marek H. is primarily affiliated to which institution?"],"info":{}}
{"id":"train_76","question":"What are the papers written by Weiwei Wan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/50/1829> }","paraphrases":["Which publications did W. Wan author?"],"info":{}}
{"id":"train_77","question":"Show the Wikidata ID of the person Gregory Beylkin.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/21/3858> dblp:wikidata ?answer }","paraphrases":["The author Gregory Beylkin is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_78","question":"Which publications did Narasimhan, S. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/30/4580> }","paraphrases":["What are the papers written by the person Sridhar Narasimhan?"],"info":{}}
{"id":"train_79","question":"Which papers did the author Michele Morelli write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/87/3453> }","paraphrases":["Which publications did Michele Morelli author?"],"info":{}}
{"id":"train_80","question":"Which publications did Chen, Chih-Cheng author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/01/1736> }","paraphrases":["Which papers did the author Chen, Chih-Cheng write?"],"info":{}}
{"id":"train_81","question":"What is the Wikidata ID of Travis Gagie?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/00/3487> dblp:wikidata ?answer }","paraphrases":["Show the Wikidata ID of the person Travis Gagie."],"info":{}}
{"id":"train_82","question":"Which publications did Hiroaki Harai author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/570> }","paraphrases":["What are the papers written by Hiroaki Harai?"],"info":{}}
{"id":"train_83","question":"What are the papers written by the person Ga\\u00EBl Varoquaux?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/36/7585> }","paraphrases":["Which publications did Ga\\u00EBl Varoquaux author?"],"info":{}}
{"id":"train_84","question":"What is the webpage of the person B. J. Gao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/g/ByronJGao> dblp:webpage ?answer }","paraphrases":["What is the webpage of Byron J. Gao?"],"info":{}}
{"id":"train_85","question":"What are the papers written by Sutter, Robbie De?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/4711> }","paraphrases":["Which papers did the author Robbie De Sutter write?"],"info":{}}
{"id":"train_86","question":"Which papers did the author Higdon, J. B. write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/298/7180> }","paraphrases":["What are the papers written by Higdon, J. B.?"],"info":{}}
{"id":"train_87","question":"Mention the primary affiliation of M\\u00E9n\\u00E9las, B. Jerry.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/118/8361> dblp:primaryAffiliation ?answer }","paraphrases":["What is the primary affiliation of Bob-Antoine Jerry M\\u00E9n\\u00E9las?"],"info":{}}
{"id":"train_88","question":"What are the papers written by the person Anders H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/7468> }","paraphrases":["What are the papers written by Anders Haug?"],"info":{}}
{"id":"train_89","question":"Which publications did Ohta, M. author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/74/1812> }","paraphrases":["Which papers did the author Ohta, M. write?"],"info":{}}
{"id":"train_90","question":"What are the papers written by Barbara A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/166/4711> }","paraphrases":["Which papers did the author Barbara A. write?"],"info":{}}
{"id":"train_91","question":"What are the papers written by Octaviano, M. V.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/245/7143> }","paraphrases":["Which publications did Manolito V. Octaviano author?"],"info":{}}
{"id":"train_92","question":"Which papers did the author Nawala, Jakub write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/218/4331> }","paraphrases":["What are the papers written by the person Jakub Nawala?"],"info":{}}
{"id":"train_93","question":"Which publications did Benjamin C. Pierce author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/p/BenjaminCPierce> }","paraphrases":["Which papers did the author B. C. Pierce write?"],"info":{}}
{"id":"train_94","question":"Which papers did the author H. Zhou write?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/3707-7> }","paraphrases":["What are the papers written by the person Hang Zhou?"],"info":{}}
{"id":"train_95","question":"What is the webpage of the person A. Khandelwal?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/126/9502-2> dblp:webpage ?answer }","paraphrases":["What is the webpage of Apoorv Khandelwal?"],"info":{}}
{"id":"train_96","question":"What are the papers written by Ochimizu, K.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/3896> }","paraphrases":["What are the papers written by the person Ochimizu, K.?"],"info":{}}
{"id":"train_97","question":"What is the primary affiliation of T. M\\u00F6ller?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/TorstenMoller> dblp:primaryAffiliation ?answer }","paraphrases":["T. M\\u00F6ller is primarily affiliated to which institution?"],"info":{}}
{"id":"train_98","question":"Show the Wikidata ID of the person Barry W. Boehm.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/b/BarryWBoehm> dblp:wikidata ?answer }","paraphrases":["The author Barry W. Boehm is associated with which Wikidata identifier?"],"info":{}}
{"id":"train_99","question":"Show the Wikidata ID of the person Paolo Torroni.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/t/PaoloTorroni> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of P. Torroni?"],"info":{}}
{"id":"train_100","question":"Which publications did Maia Rohm author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/222/1191> }","paraphrases":["What are the papers written by Maia R.?"],"info":{}}
{"id":"train_101","question":"What are the papers written by the person Morantes, J. Leonardo Puentes?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/192/1358> }","paraphrases":["Which papers did the author Jorge Leonardo Puentes Morantes write?"],"info":{}}
{"id":"train_102","question":"What is the primary affiliation of Neri Merhav?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/92/1103> dblp:primaryAffiliation ?answer }","paraphrases":["Mention the primary affiliation of Neri M.."],"info":{}}
{"id":"train_103","question":"What are the papers written by the person Laura Franzoi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/117/9834> }","paraphrases":["Which papers did the author Laura Franzoi write?"],"info":{}}
{"id":"train_104","question":"Which publications did Diane Corney author?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/06/198> }","paraphrases":["Which papers did the author Diane C. write?"],"info":{}}
{"id":"train_105","question":"Show the Wikidata ID of the person Pedro U. Lima.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/24/2178> dblp:wikidata ?answer }","paraphrases":["What is the Wikidata ID of Pedro U. Lima?"],"info":{}}
{"id":"train_106","question":"What are the papers written by the person Beatrice Amrhein?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/18/4361> }","paraphrases":["Which papers did the author Amrhein, Beatrice write?"],"info":{}}
{"id":"train_107","question":"What are the papers written by the person Brscic, D.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/15/5375> }","paraphrases":["Which papers did the author Drazen Brscic write?"],"info":{}}
