{"id":"train_4149","question":"Name the other publications published by the authors of 'Strongly-Resilient and Non-Interactive Hierarchical Key-Agreement in MANETs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iacr/GennaroHKRRW08> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/iacr/GennaroHKRRW08> ) }","paraphrases":["List the other publications published by the authors of 'Strongly-Resilient and Non-Interactive Hierarchical Key-Agreement in MANETs'."],"info":{}}
{"id":"train_4150","question":"List the venues of the other papers published by the authors of 'Causal Structure Discovery between Clusters of Nodes Induced by Latent Factors'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/clear2/SquiresYNAU22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/clear2/SquiresYNAU22> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Causal Structure Discovery between Clusters of Nodes Induced by Latent Factors'?"],"info":{}}
{"id":"train_4151","question":"List the years in which the authors of 'Benchmarking Neural Network Architectures for Acoustic Sensor Networks' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ITGspeech/EbbersHSH18> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ITGspeech/EbbersHSH18> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Benchmarking Neural Network Architectures for Acoustic Sensor Networks' published in which other years?"],"info":{}}
{"id":"train_4153","question":"Find the venue of the paper 'A linear-non-linear model for a computational call-by-value lambda calculus (extended abstract)' authored by Beno\\u00EEt Valiron.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-0801-0813> dblp:authoredBy <https://dblp.org/pid/48/1480> . <https://dblp.org/rec/journals/corr/abs-0801-0813> dblp:publishedIn ?answer }","paraphrases":["Valiron, Beno\\u00EEt published the paper 'A linear-non-linear model for a computational call-by-value lambda calculus (extended abstract)' in which venue?"],"info":{}}
{"id":"train_4155","question":"Mention the venue of the paper 'A Narrative Analysis by Text Mining Technique Using Key Graph: Similarity and Difference of a View of Oral Health and Oral Risk Cognition between Japanese Living People and Dentists' authored by Fukiko K..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icdm/KobayashiN14> dblp:authoredBy <https://dblp.org/pid/160/6061> . <https://dblp.org/rec/conf/icdm/KobayashiN14> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'A Narrative Analysis by Text Mining Technique Using Key Graph: Similarity and Difference of a View of Oral Health and Oral Risk Cognition between Japanese Living People and Dentists' authored by Fukiko K. published?"],"info":{}}
{"id":"train_4156","question":"Show the webpages of authors of 'Reducing the data transmission in sensor networks through Kruskal-Wallis model'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wimob/JaberTMJZH17> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Reducing the data transmission in sensor networks through Kruskal-Wallis model' have which webpages?"],"info":{}}
{"id":"train_4161","question":"Name the other publications published by the authors of 'Increasing trust in complex machine learning systems: studies in the music domain'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigir/Kim21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/sigir/Kim21> ) }","paraphrases":["Which other publications were published by the authors of 'Increasing trust in complex machine learning systems: studies in the music domain'?"],"info":{}}
{"id":"train_4162","question":"List the venues of the other papers published by the authors of 'Fast Distributed Algorithms for Testing Graph Properties'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/Censor-HillelFS16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/corr/Censor-HillelFS16> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'Fast Distributed Algorithms for Testing Graph Properties'."],"info":{}}
{"id":"train_4164","question":"Show the webpages of authors of 'Evaluation of DysWebxia: a reading app designed for people with dyslexia'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/w4a/RelloB14> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Evaluation of DysWebxia: a reading app designed for people with dyslexia'?"],"info":{}}
{"id":"train_4166","question":"The authors of 'Longitudinal Associations in Youth Involvement as Victimized, Bullying, or Witnessing Cyberbullying' published in which other years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cbsn/HolfeldM18> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cbsn/HolfeldM18> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Longitudinal Associations in Youth Involvement as Victimized, Bullying, or Witnessing Cyberbullying' publishing?"],"info":{}}
{"id":"train_4168","question":"Find the venue of the paper 'Pruning High-Similarity Clusters to Optimize Data Diversity when Building Ensemble Classifiers' authored by Brijesh K. Verma.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcia/FletcherV19> dblp:authoredBy <https://dblp.org/pid/32/6785> . <https://dblp.org/rec/journals/ijcia/FletcherV19> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'Pruning High-Similarity Clusters to Optimize Data Diversity when Building Ensemble Classifiers' authored by Brijesh K. Verma."],"info":{}}
{"id":"train_4169","question":"List the other publications published by the authors of 'OOP for Business Data Processing'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/joop/Riehle96> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/joop/Riehle96> ) }","paraphrases":["Which other publications were published by the authors of 'OOP for Business Data Processing'?"],"info":{}}
{"id":"train_4172","question":"Find the years in which the authors of 'Stigmergic cooperation of nanoparticles for swarm fuzzy control of low-density lipoprotein concentration in the arterial wall' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/asc/RowhanimaneshA15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/asc/RowhanimaneshA15> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Stigmergic cooperation of nanoparticles for swarm fuzzy control of low-density lipoprotein concentration in the arterial wall' published in which other years?"],"info":{}}
{"id":"train_4173","question":"What are the webpages of authors of 'Does comma selection help to cope with local optima?'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gecco/Doerr20a> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Does comma selection help to cope with local optima?' have which webpages?"],"info":{}}
{"id":"train_4175","question":"Mention the venues of the other papers published by the authors of 'An infeasibility certificate for nonlinear programming based on Pareto criticality condition'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/orl/MuhammadCGT16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/orl/MuhammadCGT16> ) }","paraphrases":["In which venues were the other papers published by the authors of 'An infeasibility certificate for nonlinear programming based on Pareto criticality condition'?"],"info":{}}
{"id":"train_4176","question":"Show the webpages of authors of 'Interpretable Deep Convolutional Neural Networks via Meta-learning'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcnn/LiuWM18> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Interpretable Deep Convolutional Neural Networks via Meta-learning'?"],"info":{}}
{"id":"train_4177","question":"Name the other publications published by the authors of 'Fingerprint Pore Extraction Using Convolutional Neural Networks and Logical Operation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ccbr/ZhaoLS18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/ccbr/ZhaoLS18> ) }","paraphrases":["List the other publications published by the authors of 'Fingerprint Pore Extraction Using Convolutional Neural Networks and Logical Operation'."],"info":{}}
{"id":"train_4178","question":"In which other years were the authors of 'An RNA-Seq Bioinformatics Pipeline for Data Processing of Arabidopsis Thaliana Datasets' publishing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icbra/DeshpandeJFLTY17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icbra/DeshpandeJFLTY17> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'An RNA-Seq Bioinformatics Pipeline for Data Processing of Arabidopsis Thaliana Datasets' published in which other years?"],"info":{}}
{"id":"train_4179","question":"Name the other publications published by the authors of 'Analysis on the Path of Integration and Development of Internet and Ideological Political Education'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iciscae/Wu21c> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/iciscae/Wu21c> ) }","paraphrases":["Which other publications were published by the authors of 'Analysis on the Path of Integration and Development of Internet and Ideological Political Education'?"],"info":{}}
{"id":"train_4181","question":"List the venues of the other papers published by the authors of 'Wind Turbines Partial Load Power Regulation Using a Fast MPC Approach'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1911-03199> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1911-03199> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Wind Turbines Partial Load Power Regulation Using a Fast MPC Approach'?"],"info":{}}
{"id":"train_4185","question":"Find the years in which the authors of 'FAQ: Questions Asked Frequently' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/KhamisNRR15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/KhamisNRR15> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'FAQ: Questions Asked Frequently' published other papers."],"info":{}}
{"id":"train_4190","question":"Mention the venue of the paper 'Towards variant management and change impact analysis in safety-oriented process-product lines' authored by Javed, M. Atif.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sac/JavedGC19> dblp:authoredBy <https://dblp.org/pid/144/9533> . <https://dblp.org/rec/conf/sac/JavedGC19> dblp:publishedIn ?answer }","paraphrases":["Javed, M. Atif published the paper 'Towards variant management and change impact analysis in safety-oriented process-product lines' in which venue?"],"info":{}}
{"id":"train_4192","question":"Name the other publications published by the authors of 'The well-posedness and stability of a repairable standby human-machine system'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/mcm/WangX06> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/mcm/WangX06> ) }","paraphrases":["List the other publications published by the authors of 'The well-posedness and stability of a repairable standby human-machine system'."],"info":{}}
{"id":"train_4194","question":"Mention the venue of the paper 'Consciousness as a Brain Complex Reflection of the Outer World Causal Relationships' authored by Vityaev, E..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/bica/Vityaev19> dblp:authoredBy <https://dblp.org/pid/39/5181> . <https://dblp.org/rec/conf/bica/Vityaev19> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Consciousness as a Brain Complex Reflection of the Outer World Causal Relationships' authored by Evgenii Vityaev."],"info":{}}
{"id":"train_4195","question":"Find the venue of the paper 'An ontology-based integration approach for medical information standards' authored by \\u00DCnalir, M. Osman.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/siu/SezerCuB17> dblp:authoredBy <https://dblp.org/pid/48/5039> . <https://dblp.org/rec/conf/siu/SezerCuB17> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'An ontology-based integration approach for medical information standards' authored by \\u00DCnalir, M. Osman published?"],"info":{}}
{"id":"train_4196","question":"Mention the venues of the other papers published by the authors of 'Reduction of Discrete Dynamical Systems over Graphs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/advcs/MortveitR04> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/advcs/MortveitR04> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'Reduction of Discrete Dynamical Systems over Graphs'?"],"info":{}}
{"id":"train_4199","question":"Mention the venue of the paper 'Reasoning About Linear Constraints Using Parametric Queries' authored by Joskowicz, L..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fsttcs/HuynhJLL90> dblp:authoredBy <https://dblp.org/pid/66/2699> . <https://dblp.org/rec/conf/fsttcs/HuynhJLL90> dblp:publishedIn ?answer }","paraphrases":["Leo Joskowicz published the paper 'Reasoning About Linear Constraints Using Parametric Queries' in which venue?"],"info":{}}
{"id":"train_4200","question":"Find the authors of 'On the Stability of Best Effort Flow Control Mechanisms in On-Chip Architectures' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/mascots/TalebiK08> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/mascots/TalebiK08> ) }","paraphrases":["Who are the authors of the publication 'On the Stability of Best Effort Flow Control Mechanisms in On-Chip Architectures' and what other papers did they publish?"],"info":{}}
{"id":"train_4202","question":"List the authors of 'Diversity as width' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/scw/BasiliV13> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/scw/BasiliV13> ) }","paraphrases":["Who are the authors of the publication 'Diversity as width' and where did they publish other papers?"],"info":{}}
{"id":"train_4204","question":"Who are the authors of the publication 'Observe, Discuss, and Reason with Evidence in Science: Scaffolding Conceptual Change with ODRES' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/iadis/AngeliVLS05> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/iadis/AngeliVLS05> ) }","paraphrases":["Who are the authors of the publication 'Observe, Discuss, and Reason with Evidence in Science: Scaffolding Conceptual Change with ODRES' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4205","question":"Find the authors of 'The Analysis of Stress-Induced Duplex Destabilization in Long Genomic DNA Sequences' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jcb/BenhamB04> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jcb/BenhamB04> ) }","paraphrases":["Who are the authors of 'The Analysis of Stress-Induced Duplex Destabilization in Long Genomic DNA Sequences' and which other papers did they publish?"],"info":{}}
{"id":"train_4206","question":"Find the authors of 'Spectral Image Visualization Using Generative Adversarial Networks' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1802-02290> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1802-02290> ) }","paraphrases":["Who are the authors of the publication 'Spectral Image Visualization Using Generative Adversarial Networks' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4208","question":"List the authors of 'Visually induced motion sickness: Single- versus dual-axis motion' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/displays/DielsH11> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/displays/DielsH11> ) }","paraphrases":["Find the authors of 'Visually induced motion sickness: Single- versus dual-axis motion' and the other papers they published."],"info":{}}
{"id":"train_4209","question":"Who are the authors of the publication 'Implementing Protected Multi-User Communication for Myrinet' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/canpc/NagarSS98> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/canpc/NagarSS98> ) }","paraphrases":["Who are the authors of the publication 'Implementing Protected Multi-User Communication for Myrinet' and where did they publish other papers?"],"info":{}}
{"id":"train_4213","question":"Find the authors of 'Space-Efficient Counting in Graphs on Surfaces' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/cc/BravermanKR09> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/cc/BravermanKR09> ) }","paraphrases":["Who are the authors of the publication 'Space-Efficient Counting in Graphs on Surfaces' and which other papers did they publish?"],"info":{}}
{"id":"train_4215","question":"List the authors of 'PAVLOV: A Programmable Architecture for Volume Processing' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/egh/KreegerK98> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/egh/KreegerK98> ) }","paraphrases":["Who are the authors of the publication 'PAVLOV: A Programmable Architecture for Volume Processing' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4217","question":"List the authors of 'Some algorithms for the mean curvature flow under topological changes' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1908-09690> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/corr/abs-1908-09690> ) }","paraphrases":["Who are the authors of the publication 'Some algorithms for the mean curvature flow under topological changes' and what other papers did they publish?"],"info":{}}
{"id":"train_4218","question":"Find the authors of 'Adopting telemedicine services in the airline framework' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/titb/BeltrameBM01> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/titb/BeltrameBM01> ) }","paraphrases":["Who are the authors of the publication 'Adopting telemedicine services in the airline framework' and which other papers did they publish?"],"info":{}}
{"id":"train_4219","question":"Find the authors of 'GlycanAnalyzer: software for automated interpretation of N-glycan profiles after exoglycosidase digestions' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/bioinformatics/WalshNWTCJTR19> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/bioinformatics/WalshNWTCJTR19> ) }","paraphrases":["Who are the authors of the publication 'GlycanAnalyzer: software for automated interpretation of N-glycan profiles after exoglycosidase digestions' and where did they publish other papers?"],"info":{}}
{"id":"train_4220","question":"List the authors of 'Opportunities: A Unifying Framework for Planning and Execution' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/aips/PryorC94> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/aips/PryorC94> ) }","paraphrases":["Find the authors of 'Opportunities: A Unifying Framework for Planning and Execution' and the other papers they published."],"info":{}}
{"id":"train_4222","question":"Find the authors of 'Tailored e-Health services for the dementia care setting: a pilot study of 'eHealthMonitor'' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/midm/SchallerMGCGESG15> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/midm/SchallerMGCGESG15> ) }","paraphrases":["Who are the authors of the publication 'Tailored e-Health services for the dementia care setting: a pilot study of 'eHealthMonitor'' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4224","question":"Who are the authors of the publication 'Implementing Critical Success Factors in Software Reuse' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ibmsj/Wasmund93> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/ibmsj/Wasmund93> ) }","paraphrases":["Who are the authors of the publication 'Implementing Critical Success Factors in Software Reuse' and what other papers did they publish?"],"info":{}}
{"id":"train_4225","question":"Find the authors of 'Cancellation-Free Circuits in Unbounded and Bounded Depth' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/fct/BoyarF13> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/fct/BoyarF13> ) }","paraphrases":["List the authors of 'Cancellation-Free Circuits in Unbounded and Bounded Depth' and the venues of the other papers they published."],"info":{}}
{"id":"train_4226","question":"Find the authors of 'Legal Compliance Through Design: Preliminary Results' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/jurix/HashmiCK18> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["List the authors of 'Legal Compliance Through Design: Preliminary Results' and their affiliations."],"info":{}}
{"id":"train_4227","question":"List the authors of 'Automatische Generierung optimaler modellbasierter Regressionstests' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/gi/PinteBSO07> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/gi/PinteBSO07> ) }","paraphrases":["Who are the authors of the publication 'Automatische Generierung optimaler modellbasierter Regressionstests' and what other papers did they publish?"],"info":{}}
{"id":"train_4228","question":"List the authors of 'A 15-19-GHz All-Digital Tri-Phasing Transmitter With an Integrated Multilevel Class-D Power Amplifier Achieving 100-MHz RF Bandwidth' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jssc/LembergMRANSAVK19> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/jssc/LembergMRANSAVK19> ) }","paraphrases":["Who are the authors of 'A 15-19-GHz All-Digital Tri-Phasing Transmitter With an Integrated Multilevel Class-D Power Amplifier Achieving 100-MHz RF Bandwidth' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4230","question":"Who are the authors of the publication 'Getting Out Of A Tailorability Dilemma' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/gi/DraxlerS06> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/gi/DraxlerS06> ) }","paraphrases":["Who are the authors of the publication 'Getting Out Of A Tailorability Dilemma' and which other papers did they publish?"],"info":{}}
{"id":"train_4232","question":"Who are the authors of the publication 'Manifold Adaptive Kernel Local Fisher Discriminant Analysis for Face Recognition' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jmm2/WangS12> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/jmm2/WangS12> ) }","paraphrases":["Who are the authors of 'Manifold Adaptive Kernel Local Fisher Discriminant Analysis for Face Recognition' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4234","question":"List the authors of 'High-Dimensional Neural Feature Using Rectified Linear Unit And Random Matrix Instance' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icassp/JavidVSC20> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icassp/JavidVSC20> ) }","paraphrases":["Who are the authors of 'High-Dimensional Neural Feature Using Rectified Linear Unit And Random Matrix Instance' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4236","question":"List the authors of 'An intuitive model of perceptual grouping for HCI design' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/chi/RosenholtzTSW09> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'An intuitive model of perceptual grouping for HCI design' and what are their affiliations?"],"info":{}}
{"id":"train_4238","question":"List the authors of 'Maximum Agreement Subtree (of 2 Binary Trees)' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/reference/algo/Hariharan16> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/reference/algo/Hariharan16> ) }","paraphrases":["Who are the authors of the publication 'Maximum Agreement Subtree (of 2 Binary Trees)' and what other papers did they publish?"],"info":{}}
