{"id":"train_2630","question":"Name the venue in which Chentouf published the paper about Interaction management.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/telsys/ChentoufCK03> dblp:authoredBy <https://dblp.org/pid/31/5752> . <https://dblp.org/rec/journals/telsys/ChentoufCK03> dblp:publishedIn ?answer }","paraphrases":["Zohair published the paper on Interaction management in which venue?"],"info":{}}
{"id":"train_2631","question":"Name the author who published the paper on Machine translation and has the name Richens.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cj/Richens58> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Machine translation and has the name Richens?"],"info":{}}
{"id":"train_2632","question":"Which author published the paper on -criteria and has the name Grzegorz?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cn/BoronskiB13> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on -criteria and has the name Bocewicz."],"info":{}}
{"id":"train_2634","question":"Which author published the paper on Reasoning agents and has the name Rakib?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/concurrency/RakibF21> dblp:authoredBy ?answer }","paraphrases":["Which author named Abdur published the paper on Reasoning agents?"],"info":{}}
{"id":"train_2636","question":"In which venue did Paul publish the paper about Trace languages?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mfcs/DiekertGP91> dblp:authoredBy <https://dblp.org/pid/g/PaulGastin> . <https://dblp.org/rec/conf/mfcs/DiekertGP91> dblp:publishedIn ?answer }","paraphrases":["Gastin published the paper on Trace languages in which venue?"],"info":{}}
{"id":"train_2637","question":"Name the venue in which Hu published the paper about Communication networks.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tcyb/FangWHFH22> dblp:authoredBy <https://dblp.org/pid/48/5388-2> . <https://dblp.org/rec/journals/tcyb/FangWHFH22> dblp:publishedIn ?answer }","paraphrases":["Hu published the paper on Communication networks in which venue?"],"info":{}}
{"id":"train_2638","question":"Which paper on Dynamics model was published by Norbert in SMC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/27/3869> . ?answer dblp:publishedIn 'SMC' }","paraphrases":["Mention the publication on Dynamics model that was published by Norbert in IEEE Conference on Systems, Man and Cybernetics."],"info":{}}
{"id":"train_2639","question":"Name the venue in which Vasco published the paper about Reaction attacks.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iacr/VascoS02> dblp:authoredBy <https://dblp.org/pid/23/2309> . <https://dblp.org/rec/journals/iacr/VascoS02> dblp:publishedIn ?answer }","paraphrases":["In which venue did Mar\\u00EDa publish the paper about Reaction attacks?"],"info":{}}
{"id":"train_2640","question":"In which venue did Seedoyal publish the paper about Work performance?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcis/DoargajudhurD20> dblp:authoredBy <https://dblp.org/pid/244/9739> . <https://dblp.org/rec/journals/jcis/DoargajudhurD20> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Melina published the paper about Work performance."],"info":{}}
{"id":"train_2641","question":"Which research paper on Dependence perspective was published by Mark in UKAIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/16/4797> . ?answer dblp:publishedIn 'UKAIS' }","paraphrases":["Which paper on Dependence perspective was published by Borman in UKAIS?"],"info":{}}
{"id":"train_2642","question":"Name the venue in which H\\u00E9l\\u00E8ne published the paper about Hci design.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/KondratovaF22> dblp:authoredBy <https://dblp.org/pid/97/8731> . <https://dblp.org/rec/conf/hci/KondratovaF22> dblp:publishedIn ?answer }","paraphrases":["In which venue did Fournier publish the paper about Hci design?"],"info":{}}
{"id":"train_2643","question":"In which venue did Dan publish the paper about Group signatures?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iacr/BonehEF18> dblp:authoredBy <https://dblp.org/pid/b/DanBoneh> . <https://dblp.org/rec/journals/iacr/BonehEF18> dblp:publishedIn ?answer }","paraphrases":["Boneh published the paper on Group signatures in which venue?"],"info":{}}
{"id":"train_2644","question":"Mention the publication on Decision trees that was published by Kim in Pattern Recognit..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/32/1546> . ?answer dblp:publishedIn 'Pattern Recognit.' }","paraphrases":["Which research paper on Decision trees was published by Shearer in Pattern Recognit.?"],"info":{}}
{"id":"train_2645","question":"Name the author who published the paper on Animation transition and has the name Wang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/grapp/WangLWX15> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Animation transition and has the name Zheng?"],"info":{}}
{"id":"train_2646","question":"Name the venue in which Suthakorn published the paper about Navigation concept.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/robio/NakdhamabhornS11> dblp:authoredBy <https://dblp.org/pid/79/5915> . <https://dblp.org/rec/conf/robio/NakdhamabhornS11> dblp:publishedIn ?answer }","paraphrases":["In which venue did Suthakorn publish the paper about Navigation concept?"],"info":{}}
{"id":"train_2647","question":"Rao published the paper on Sensor networks in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/inffus/DAA19> dblp:authoredBy <https://dblp.org/pid/158/4427> . <https://dblp.org/rec/journals/inffus/DAA19> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Chandra published the paper about Sensor networks."],"info":{}}
{"id":"train_2649","question":"Name the venue in which Yoram published the paper about Voting games.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/atal/SeeBK14> dblp:authoredBy <https://dblp.org/pid/70/2671> . <https://dblp.org/rec/conf/atal/SeeBK14> dblp:publishedIn ?answer }","paraphrases":["In which venue did Yoram publish the paper about Voting games?"],"info":{}}
{"id":"train_2650","question":"Name the venue in which Qiaomin published the paper about Carlo planning.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2006-04672> dblp:authoredBy <https://dblp.org/pid/37/10269> . <https://dblp.org/rec/journals/corr/abs-2006-04672> dblp:publishedIn ?answer }","paraphrases":["Qiaomin published the paper on Carlo planning in which venue?"],"info":{}}
{"id":"train_2651","question":"Name the author who published the paper on Spectrum sharing and has the name Umadevi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/wpc/VijayU21> dblp:authoredBy ?answer }","paraphrases":["Which author named K. published the paper on Spectrum sharing?"],"info":{}}
{"id":"train_2655","question":"Name the author who published the paper on Map representation and has the name Ruqi.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cgf/HuangO17> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Map representation and has the name Ruqi?"],"info":{}}
{"id":"train_2657","question":"Name the venue in which Wang published the paper about Classification algorithm.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tfs/DuanWPLWL18> dblp:authoredBy <https://dblp.org/pid/05/9114> . <https://dblp.org/rec/journals/tfs/DuanWPLWL18> dblp:publishedIn ?answer }","paraphrases":["Wang published the paper on Classification algorithm in which venue?"],"info":{}}
{"id":"train_2658","question":"Which author published the paper on Aggregation methods and has the name Zenon?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jdcta/MoultonCK09> dblp:authoredBy ?answer }","paraphrases":["Which author named Chaczko published the paper on Aggregation methods?"],"info":{}}
{"id":"train_2659","question":"Which author named Azizian published the paper on Learning model?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amcis/RastegariaA17> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Learning model and has the name Azizian?"],"info":{}}
{"id":"train_2661","question":"Name the venue in which Shimizu published the paper about Engineering credit point system.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/kes/OgawaS17> dblp:authoredBy <https://dblp.org/pid/126/2736> . <https://dblp.org/rec/conf/kes/OgawaS17> dblp:publishedIn ?answer }","paraphrases":["In which venue did Akira publish the paper about Engineering credit point system?"],"info":{}}
{"id":"train_2662","question":"In which venue did Tao publish the paper about Data placement algorithm?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tjs/XiaoCL11> dblp:authoredBy <https://dblp.org/pid/69/510> . <https://dblp.org/rec/journals/tjs/XiaoCL11> dblp:publishedIn ?answer }","paraphrases":["Chen published the paper on Data placement algorithm in which venue?"],"info":{}}
{"id":"train_2663","question":"Which author published the paper on -biomanipulation and has the name Luo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mfi/LuoS12> dblp:authoredBy ?answer }","paraphrases":["Which author named Yudong published the paper on -biomanipulation?"],"info":{}}
{"id":"train_2664","question":"In which venue did S. publish the paper about Feedback technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/conf-irm/PiccoloSB12> dblp:authoredBy <https://dblp.org/pid/99/1852> . <https://dblp.org/rec/conf/conf-irm/PiccoloSB12> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which S. published the paper about Feedback technology."],"info":{}}
{"id":"train_2666","question":"In which venue did Compagna publish the paper about Threat identification?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icst/CarboneCPP15> dblp:authoredBy <https://dblp.org/pid/c/LucaCompagna> . <https://dblp.org/rec/conf/icst/CarboneCPP15> dblp:publishedIn ?answer }","paraphrases":["Compagna published the paper on Threat identification in which venue?"],"info":{}}
{"id":"train_2667","question":"Name the venue in which Shinkyu published the paper about Software firm mergers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ecis/LegerY05> dblp:authoredBy <https://dblp.org/pid/27/1630> . <https://dblp.org/rec/conf/ecis/LegerY05> dblp:publishedIn ?answer }","paraphrases":["Shinkyu published the paper on Software firm mergers in which venue?"],"info":{}}
{"id":"train_2669","question":"Name the venue in which Wei published the paper about Acceleration framework.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccd/LyonsWB14> dblp:authoredBy <https://dblp.org/pid/21/5583> . <https://dblp.org/rec/conf/iccd/LyonsWB14> dblp:publishedIn ?answer }","paraphrases":["Gu-Yeon published the paper on Acceleration framework in which venue?"],"info":{}}
{"id":"train_2670","question":"Which author named Salabun published the paper on Comet method?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/kes/SalabunK18> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Comet method and has the name Salabun."],"info":{}}
{"id":"train_2671","question":"Name the venue in which Laliwala published the paper about Services composition.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/IEEEscc/Laliwala06> dblp:authoredBy <https://dblp.org/pid/39/4628> . <https://dblp.org/rec/conf/IEEEscc/Laliwala06> dblp:publishedIn ?answer }","paraphrases":["Zakir published the paper on Services composition in which venue?"],"info":{}}
{"id":"train_2673","question":"Haimin published the paper on Reachability analysis in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2004-07876> dblp:authoredBy <https://dblp.org/pid/224/8581> . <https://dblp.org/rec/journals/corr/abs-2004-07876> dblp:publishedIn ?answer }","paraphrases":["In which venue did Hu publish the paper about Reachability analysis?"],"info":{}}
{"id":"train_2674","question":"Yingming published the paper on Rank hoca in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/emnlp/JinHLZ19> dblp:authoredBy <https://dblp.org/pid/119/1901> . <https://dblp.org/rec/conf/emnlp/JinHLZ19> dblp:publishedIn ?answer }","paraphrases":["In which venue did Yingming publish the paper about Rank hoca?"],"info":{}}
{"id":"train_2675","question":"Mention the publication on Epidemic dynamics that was published by Suraj in Comput. Math. Methods Medicine.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/128/6290> . ?answer dblp:publishedIn 'Comput. Math. Methods Medicine' }","paraphrases":["Which research paper on Epidemic dynamics was published by Verma in Comput. Math. Methods Medicine?"],"info":{}}
{"id":"train_2676","question":"Mention the publication on -edge that was published by Sofiane in SIGSPATIAL/GIS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/07/225> . ?answer dblp:publishedIn 'SIGSPATIAL/GIS' }","paraphrases":["Which paper on -edge was published by Abbar in SIGSPATIAL/GIS?"],"info":{}}
{"id":"train_2677","question":"Which paper on Power allocation was published by Sanjay in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/9326> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which research paper on Power allocation was published by Goyal in CoRR?"],"info":{}}
{"id":"train_2679","question":"Which author named Seiichi published the paper on Assertion mechanism?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/jckbse/SakakibaraSK08> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Assertion mechanism and has the name Komiya?"],"info":{}}
{"id":"train_2680","question":"Name the author who published the paper on Tree models and has the name Tinga.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2204-03743> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Tree models and has the name Tiedo?"],"info":{}}
{"id":"train_2682","question":"Which author named Ahnn published the paper on Encoding ribonuclease?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/nar/MarchAI85> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Encoding ribonuclease and has the name J.."],"info":{}}
{"id":"train_2683","question":"Name the venue in which Sawant published the paper about Recognition system.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcat/ShahSSD15> dblp:authoredBy <https://dblp.org/pid/161/6899> . <https://dblp.org/rec/journals/ijcat/ShahSSD15> dblp:publishedIn ?answer }","paraphrases":["In which venue did Sawant publish the paper about Recognition system?"],"info":{}}
{"id":"train_2684","question":"In which venue did Jackson publish the paper about Arc-?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jgt/Jackson88> dblp:authoredBy <https://dblp.org/pid/64/6203> . <https://dblp.org/rec/journals/jgt/Jackson88> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Jackson published the paper about Arc-."],"info":{}}
{"id":"train_2686","question":"Name the venue in which Zou published the paper about Language classes.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sete/WangZ21a> dblp:authoredBy <https://dblp.org/pid/139/7656> . <https://dblp.org/rec/conf/sete/WangZ21a> dblp:publishedIn ?answer }","paraphrases":["In which venue did Di publish the paper about Language classes?"],"info":{}}
{"id":"train_2687","question":"Mention the publication on Service composition optimization that was published by Xiwei in SOLI.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/8425> . ?answer dblp:publishedIn 'SOLI' }","paraphrases":["Which research paper on Service composition optimization was published by Xiwei in SOLI?"],"info":{}}
{"id":"train_2688","question":"Which author named Chen published the paper on Microphone arrays?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/taslp/TuC22> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Microphone arrays and has the name Huawei?"],"info":{}}
{"id":"train_2690","question":"Name the author who published the paper on Multimodal perception and has the name Alain.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ras/DroniouIS15> dblp:authoredBy ?answer }","paraphrases":["Which author named Droniou published the paper on Multimodal perception?"],"info":{}}
{"id":"train_2691","question":"Mention the publication on Network alignment that was published by Nazmul in GECCO.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/10584> . ?answer dblp:publishedIn 'GECCO' }","paraphrases":["Which research paper on Network alignment was published by Haque in GECCO?"],"info":{}}
{"id":"train_2692","question":"Which author published the paper on Care system and has the name Huang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cmpb/YeSZSHH21> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Care system and has the name Yifeng."],"info":{}}
{"id":"train_2695","question":"Olson published the paper on Wreath product cyclic in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icassp/MirchandaniFRHO00> dblp:authoredBy <https://dblp.org/pid/150/4586> . <https://dblp.org/rec/conf/icassp/MirchandaniFRHO00> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Timothy published the paper about Wreath product cyclic."],"info":{}}
{"id":"train_2696","question":"Which paper on Speaker verification was published by Zhiyuan in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/72/7546> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Mention the publication on Speaker verification that was published by Tang in CoRR."],"info":{}}
{"id":"train_2697","question":"Which author named Xavier published the paper on Fire plume?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/whispers/DeschampsMBFL11> dblp:authoredBy ?answer }","paraphrases":["Name the author who published the paper on Fire plume and has the name Xavier."],"info":{}}
{"id":"train_2699","question":"Name the author who published the paper on Design experience and has the name Spencer.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fecs/WildeALF10> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Design experience and has the name G.?"],"info":{}}
{"id":"train_2700","question":"Name the venue in which Joneja published the paper about Polygon containment problem.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tase/WeiZJX17> dblp:authoredBy <https://dblp.org/pid/77/2737> . <https://dblp.org/rec/journals/tase/WeiZJX17> dblp:publishedIn ?answer }","paraphrases":["In which venue did Ajay publish the paper about Polygon containment problem?"],"info":{}}
{"id":"train_2701","question":"Mention the publication on Privacy verification that was published by Mohamadreza in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/15/11238> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which research paper on Privacy verification was published by Ahmadi in CoRR?"],"info":{}}
{"id":"train_2702","question":"Mention the publication on Crop leaves that was published by Guo in Remote. Sens..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/144/8032> . ?answer dblp:publishedIn 'Remote. Sens.' }","paraphrases":["Which research paper on Crop leaves was published by Guo in Remote. Sens.?"],"info":{}}
{"id":"train_2703","question":"Mention the publication on Expression recognition that was published by Alvaro in Pattern Recognit..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/57/8614> . ?answer dblp:publishedIn 'Pattern Recognit.' }","paraphrases":["Which research paper on Expression recognition was published by Alvaro in Pattern Recognit.?"],"info":{}}
{"id":"train_2704","question":"Name the author who published the paper on Haptic interface and has the name Jun.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/smc/OkadaOKOA21> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Haptic interface and has the name Ozawa?"],"info":{}}
{"id":"train_2705","question":"H. published the paper on Supply chain in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcim/MakatsorisCR04> dblp:authoredBy <https://dblp.org/pid/04/4280> . <https://dblp.org/rec/journals/ijcim/MakatsorisCR04> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which D. published the paper about Supply chain."],"info":{}}
{"id":"train_2706","question":"Name the author who published the paper on Tech futures and has the name Tawanna.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/chi/HarringtonD21> dblp:authoredBy ?answer }","paraphrases":["Which author named Dillahunt published the paper on Tech futures?"],"info":{}}
{"id":"train_2707","question":"Name the venue in which Hassan published the paper about Trust model.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/isecure/ShakeriB12> dblp:authoredBy <https://dblp.org/pid/127/2309> . <https://dblp.org/rec/journals/isecure/ShakeriB12> dblp:publishedIn ?answer }","paraphrases":["Shakeri published the paper on Trust model in which venue?"],"info":{}}
{"id":"train_2708","question":"Difeng published the paper on Head motions in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vr/YuLZX19> dblp:authoredBy <https://dblp.org/pid/229/0012> . <https://dblp.org/rec/conf/vr/YuLZX19> dblp:publishedIn ?answer }","paraphrases":["In which venue did Yu publish the paper about Head motions?"],"info":{}}
{"id":"train_2709","question":"Which research paper on Desert margin was published by Uriel in Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/300/6563> . ?answer dblp:publishedIn 'Remote. Sens.' }","paraphrases":["Which paper on Desert margin was published by Safriel in Remote. Sens.?"],"info":{}}
{"id":"train_2710","question":"Finger published the paper on Correspondence theory in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aiml/Finger00> dblp:authoredBy <https://dblp.org/pid/50/3312> . <https://dblp.org/rec/conf/aiml/Finger00> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Marcelo published the paper about Correspondence theory."],"info":{}}
{"id":"train_2711","question":"Mention the publication on Program development that was published by E. in IBM Syst. J..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/12/6966> . ?answer dblp:publishedIn 'IBM Syst. J.' }","paraphrases":["Which research paper on Program development was published by E. in IBM Syst. J.?"],"info":{}}
{"id":"train_2712","question":"Which author named C. published the paper on Materials management?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ACMse/Nowading79> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Materials management and has the name David?"],"info":{}}
{"id":"train_2713","question":"Liss published the paper on Resolution ct in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/scsc/RajendranRAL16> dblp:authoredBy <https://dblp.org/pid/189/1151> . <https://dblp.org/rec/conf/scsc/RajendranRAL16> dblp:publishedIn ?answer }","paraphrases":["In which venue did Michael publish the paper about Resolution ct?"],"info":{}}
{"id":"train_2714","question":"Which paper on Slam system was published by Rui in ROBIO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/37/5619> . ?answer dblp:publishedIn 'ROBIO' }","paraphrases":["Mention the publication on Slam system that was published by Rui in ROBIO."],"info":{}}
{"id":"train_2715","question":"Name the venue in which Evangelos published the paper about Shellcode detection.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/virology/PolychronakisAM07> dblp:authoredBy <https://dblp.org/pid/m/EvangelosPMarkatos> . <https://dblp.org/rec/journals/virology/PolychronakisAM07> dblp:publishedIn ?answer }","paraphrases":["In which venue did Evangelos publish the paper about Shellcode detection?"],"info":{}}
{"id":"train_2716","question":"Which paper on Fintech case study was published by Zaitsev in AMCIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/10439> . ?answer dblp:publishedIn 'AMCIS' }","paraphrases":["Mention the publication on Fintech case study that was published by Anna in AMCIS."],"info":{}}
{"id":"train_2720","question":"Name the author who published the paper on Indexing source descriptions and has the name Kurt.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ideas/LangeDR10> dblp:authoredBy ?answer }","paraphrases":["Which author named Rothermel published the paper on Indexing source descriptions?"],"info":{}}
{"id":"train_2721","question":"In which venue did B. publish the paper about User interface?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijoci/SSSAB21> dblp:authoredBy <https://dblp.org/pid/299/6850> . <https://dblp.org/rec/journals/ijoci/SSSAB21> dblp:publishedIn ?answer }","paraphrases":["Santhosh published the paper on User interface in which venue?"],"info":{}}
{"id":"train_2722","question":"Name the author who published the paper on Optimization algorithm and has the name Scott.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/envsoft/YangGSS15> dblp:authoredBy ?answer }","paraphrases":["Which author named Sellars published the paper on Optimization algorithm?"],"info":{}}
{"id":"train_2724","question":"Mention the publication on Matching market that was published by Martin in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/61/6037> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["Which research paper on Matching market was published by I. in CoRR?"],"info":{}}
{"id":"train_2725","question":"Sridhar published the paper on Research note in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/isr/KimMN05> dblp:authoredBy <https://dblp.org/pid/30/4580> . <https://dblp.org/rec/journals/isr/KimMN05> dblp:publishedIn ?answer }","paraphrases":["Name the venue in which Sridhar published the paper about Research note."],"info":{}}
{"id":"train_2726","question":"Which author named Sun published the paper on Machine translation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/rocling/SunC91> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Machine translation and has the name Chung-Teng?"],"info":{}}
{"id":"train_2727","question":"Name the author who published the paper on Lyrics text and has the name Rafael.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ismir/ZhangRS17> dblp:authoredBy ?answer }","paraphrases":["Which author published the paper on Lyrics text and has the name Rafael?"],"info":{}}
