{"id":"train_1557","question":"Was the paper 'Modeling of DLL-based frequency multiplier in time and frequency domain with Matlab Simulink' not co-authored by Saeedi, Saeed and Sharifkhani, Mohammad?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apccas/GholamiSS10> dblp:authoredBy <https://dblp.org/pid/03/4917> . <https://dblp.org/rec/conf/apccas/GholamiSS10> dblp:authoredBy <https://dblp.org/pid/56/546> FILTER NOT EXISTS { <https://dblp.org/rec/conf/apccas/GholamiSS10> dblp:authoredBy <https://dblp.org/pid/03/4917> . <https://dblp.org/rec/conf/apccas/GholamiSS10> dblp:authoredBy <https://dblp.org/pid/56/546> } }","paraphrases":["Did Saeed Saeedi and Mohammad Sharifkhani not co-author the paper 'Modeling of DLL-based frequency multiplier in time and frequency domain with Matlab Simulink'?"],"info":{}}
{"id":"train_1558","question":"Wasn't the paper 'Application of the Discrete Wavelet Transform for the Robust Detection of the impulsive Incidences: Application to arterial Blood pressure Characteristic Events Detection-Delineation' not published by the author Reza Rahmani?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijwmip/HomaeinezhadATGR11> dblp:authoredBy <https://dblp.org/pid/90/10384> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijwmip/HomaeinezhadATGR11> dblp:authoredBy <https://dblp.org/pid/90/10384> } }","paraphrases":["Has Reza Rahmani not published the paper 'Application of the Discrete Wavelet Transform for the Robust Detection of the impulsive Incidences: Application to arterial Blood pressure Characteristic Events Detection-Delineation'?"],"info":{}}
{"id":"train_1559","question":"Did Martinelli, Rafael not publish the paper 'A new exact algorithm for the multi-depot vehicle routing problem under capacity and route length constraints' in Discret. Optim.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/disopt/ContardoM14> dblp:authoredBy <https://dblp.org/pid/45/9557> . <https://dblp.org/rec/journals/disopt/ContardoM14> dblp:publishedIn 'Discret. Optim.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/disopt/ContardoM14> dblp:authoredBy <https://dblp.org/pid/45/9557> . <https://dblp.org/rec/journals/disopt/ContardoM14> dblp:publishedIn 'Discret. Optim.' } }","paraphrases":["Was the paper 'A new exact algorithm for the multi-depot vehicle routing problem under capacity and route length constraints' not published by Rafael Martinelli in Discret. Optim.?"],"info":{}}
{"id":"train_1560","question":"Have Karl Magnus Petersson and Anders S. not co-authored the paper 'On Forgetful Attractor Network Memories'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/annimab/LansnerSPI00> dblp:authoredBy <https://dblp.org/pid/01/3268> . <https://dblp.org/rec/conf/annimab/LansnerSPI00> dblp:authoredBy <https://dblp.org/pid/41/6156> FILTER NOT EXISTS { <https://dblp.org/rec/conf/annimab/LansnerSPI00> dblp:authoredBy <https://dblp.org/pid/01/3268> . <https://dblp.org/rec/conf/annimab/LansnerSPI00> dblp:authoredBy <https://dblp.org/pid/41/6156> } }","paraphrases":["Was the paper 'On Forgetful Attractor Network Memories' not co-authored by K. Magnus Petersson and Anders Sandberg?"],"info":{}}
{"id":"train_1561","question":"Was the paper 'Contour simplification and motion compensated coding' not published by C. Gu in Signal Process. Image Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/spic/GuK95> dblp:authoredBy <https://dblp.org/pid/05/4489> . <https://dblp.org/rec/journals/spic/GuK95> dblp:publishedIn 'Signal Process. Image Commun.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/spic/GuK95> dblp:authoredBy <https://dblp.org/pid/05/4489> . <https://dblp.org/rec/journals/spic/GuK95> dblp:publishedIn 'Signal Process. Image Commun.' } }","paraphrases":["Has the paper 'Contour simplification and motion compensated coding' not been published by Chuang Gu in Signal Process. Image Commun.?"],"info":{}}
{"id":"train_1562","question":"Has Y. Pomanysochka not published the paper 'Noise Filtration in the Digital Images Using Fuzzy Sets and Fuzzy Logic'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icteri/PomanysochkaKS19> dblp:authoredBy <https://dblp.org/pid/251/4931> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icteri/PomanysochkaKS19> dblp:authoredBy <https://dblp.org/pid/251/4931> } }","paraphrases":["Was the paper 'Noise Filtration in the Digital Images Using Fuzzy Sets and Fuzzy Logic' not published by Y. Pomanysochka?"],"info":{}}
{"id":"train_1563","question":"Was the paper 'Remote Sensing Image Denoising Based on Deep and Shallow Feature Fusion and Attention Mechanism' not co-authored by Guoling Bi and Hengyi Lv?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/remotesensing/HanZLZLB22> dblp:authoredBy <https://dblp.org/pid/207/4942> . <https://dblp.org/rec/journals/remotesensing/HanZLZLB22> dblp:authoredBy <https://dblp.org/pid/228/0968> FILTER NOT EXISTS { <https://dblp.org/rec/journals/remotesensing/HanZLZLB22> dblp:authoredBy <https://dblp.org/pid/207/4942> . <https://dblp.org/rec/journals/remotesensing/HanZLZLB22> dblp:authoredBy <https://dblp.org/pid/228/0968> } }","paraphrases":["Have Guoling Bi and Hengyi Lv not co-authored the paper 'Remote Sensing Image Denoising Based on Deep and Shallow Feature Fusion and Attention Mechanism'?"],"info":{}}
{"id":"train_1564","question":"Did Qi, Zhichang and Mengluo Ji not co-author the paper 'Automated WCET Analysis Based on Program Modes'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icse/JiWLQ06> dblp:authoredBy <https://dblp.org/pid/q/ZhichangQi> . <https://dblp.org/rec/conf/icse/JiWLQ06> dblp:authoredBy <https://dblp.org/pid/j/MengluoJi> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icse/JiWLQ06> dblp:authoredBy <https://dblp.org/pid/q/ZhichangQi> . <https://dblp.org/rec/conf/icse/JiWLQ06> dblp:authoredBy <https://dblp.org/pid/j/MengluoJi> } }","paraphrases":["Was the paper 'Automated WCET Analysis Based on Program Modes' not co-authored by Qi, Zhichang and M. Ji?"],"info":{}}
{"id":"train_1565","question":"Has the paper 'In-Out Separation and Column Generation Stabilization by Dual Price Smoothing' not been published by R. Sadykov in SEA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wea/PessoaSUV13> dblp:authoredBy <https://dblp.org/pid/74/5791> . <https://dblp.org/rec/conf/wea/PessoaSUV13> dblp:publishedIn 'SEA' FILTER NOT EXISTS { <https://dblp.org/rec/conf/wea/PessoaSUV13> dblp:authoredBy <https://dblp.org/pid/74/5791> . <https://dblp.org/rec/conf/wea/PessoaSUV13> dblp:publishedIn 'SEA' } }","paraphrases":["Was the paper 'In-Out Separation and Column Generation Stabilization by Dual Price Smoothing' not published by R. Sadykov in SEA?"],"info":{}}
{"id":"train_1566","question":"Wasn't the paper 'Solving Large Problems with a Small Working Memory' published by the author Z. Pizlo in J. Probl. Solving?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jps/PizloS13> dblp:authoredBy <https://dblp.org/pid/10/6112> . <https://dblp.org/rec/journals/jps/PizloS13> dblp:publishedIn 'J. Probl. Solving' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jps/PizloS13> dblp:authoredBy <https://dblp.org/pid/10/6112> . <https://dblp.org/rec/journals/jps/PizloS13> dblp:publishedIn 'J. Probl. Solving' } }","paraphrases":["Was the paper 'Solving Large Problems with a Small Working Memory' not published by Z. Pizlo in J. Probl. Solving?"],"info":{}}
{"id":"train_1567","question":"Did Xueyuan Zhang not publish the paper 'Fractal dimension feature for distinguishing between overlapped speech and single-speaker speech' in International Conference on Machine Learning and Cybernetics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icmlc/LiHLZF12> dblp:authoredBy <https://dblp.org/pid/83/6422> . <https://dblp.org/rec/conf/icmlc/LiHLZF12> dblp:publishedIn 'ICMLC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icmlc/LiHLZF12> dblp:authoredBy <https://dblp.org/pid/83/6422> . <https://dblp.org/rec/conf/icmlc/LiHLZF12> dblp:publishedIn 'ICMLC' } }","paraphrases":["Was the paper 'Fractal dimension feature for distinguishing between overlapped speech and single-speaker speech' not published by Zhang, X. in ICMLC?"],"info":{}}
{"id":"train_1569","question":"Was the paper 'Coding-adaptive transforms' not published by Lelescu, D.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vcip/LelescuB04> dblp:authoredBy <https://dblp.org/pid/37/487> FILTER NOT EXISTS { <https://dblp.org/rec/conf/vcip/LelescuB04> dblp:authoredBy <https://dblp.org/pid/37/487> } }","paraphrases":["Wasn't the paper 'Coding-adaptive transforms' not published by the author Lelescu, D.?"],"info":{}}
{"id":"train_1570","question":"Was the paper 'Secure Cloud Storage for Medical IoT Data using Adaptive Neuro-Fuzzy Inference System' not published by J. Nebhen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijfs/MohiyuddinJCRSN22> dblp:authoredBy <https://dblp.org/pid/58/9836> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijfs/MohiyuddinJCRSN22> dblp:authoredBy <https://dblp.org/pid/58/9836> } }","paraphrases":["Has Jamel Nebhen not published the paper 'Secure Cloud Storage for Medical IoT Data using Adaptive Neuro-Fuzzy Inference System'?"],"info":{}}
{"id":"train_1571","question":"Was the paper 'Localized random projections with applications to coherent array imaging' not co-authored by Justin K. Romberg and Mark A. Davenport?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/allerton/SrinivasaDR18> dblp:authoredBy <https://dblp.org/pid/77/4461> . <https://dblp.org/rec/conf/allerton/SrinivasaDR18> dblp:authoredBy <https://dblp.org/pid/84/5453> FILTER NOT EXISTS { <https://dblp.org/rec/conf/allerton/SrinivasaDR18> dblp:authoredBy <https://dblp.org/pid/77/4461> . <https://dblp.org/rec/conf/allerton/SrinivasaDR18> dblp:authoredBy <https://dblp.org/pid/84/5453> } }","paraphrases":["Did Justin K. Romberg and Mark A. Davenport not co-author the paper 'Localized random projections with applications to coherent array imaging'?"],"info":{}}
{"id":"train_1572","question":"Wasn't the paper 'Tracker for sleepy drivers at the wheel' published by the author Sania Bhatti in ICSPCS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icspcs/MemonMBKM17> dblp:authoredBy <https://dblp.org/pid/82/8377> . <https://dblp.org/rec/conf/icspcs/MemonMBKM17> dblp:publishedIn 'ICSPCS' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icspcs/MemonMBKM17> dblp:authoredBy <https://dblp.org/pid/82/8377> . <https://dblp.org/rec/conf/icspcs/MemonMBKM17> dblp:publishedIn 'ICSPCS' } }","paraphrases":["Did Sania B. not publish the paper 'Tracker for sleepy drivers at the wheel' in ICSPCS?"],"info":{}}
{"id":"train_1573","question":"Have Waqas Nawaz and Dolgorsuren, Batjargal not co-authored the paper 'Dynamic Taxi Trip Information Management using G* System'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bigdas/DolgorsurenNL15> dblp:authoredBy <https://dblp.org/pid/40/11146> . <https://dblp.org/rec/conf/bigdas/DolgorsurenNL15> dblp:authoredBy <https://dblp.org/pid/197/0989> FILTER NOT EXISTS { <https://dblp.org/rec/conf/bigdas/DolgorsurenNL15> dblp:authoredBy <https://dblp.org/pid/40/11146> . <https://dblp.org/rec/conf/bigdas/DolgorsurenNL15> dblp:authoredBy <https://dblp.org/pid/197/0989> } }","paraphrases":["Was the paper 'Dynamic Taxi Trip Information Management using G* System' not co-authored by Waqas Nawaz and Batjargal Dolgorsuren?"],"info":{}}
{"id":"train_1574","question":"Was the paper 'Towards adapting fantasy, curiosity and challenge in multimodal dialogue systems for preschoolers' not published by Theofanis Kannetis?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icmi/KannetisP09> dblp:authoredBy <https://dblp.org/pid/50/5627> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icmi/KannetisP09> dblp:authoredBy <https://dblp.org/pid/50/5627> } }","paraphrases":["Was the paper 'Towards adapting fantasy, curiosity and challenge in multimodal dialogue systems for preschoolers' not published by the person Theofanis Kannetis?"],"info":{}}
{"id":"train_1575","question":"Was the paper 'The SMoLCS ToolSet' not co-authored by Franco Morando and Egidio Astesiano?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/tapsoft/AstesianoRM95> dblp:authoredBy <https://dblp.org/pid/46/2813> . <https://dblp.org/rec/conf/tapsoft/AstesianoRM95> dblp:authoredBy <https://dblp.org/pid/a/EAstesiano> FILTER NOT EXISTS { <https://dblp.org/rec/conf/tapsoft/AstesianoRM95> dblp:authoredBy <https://dblp.org/pid/46/2813> . <https://dblp.org/rec/conf/tapsoft/AstesianoRM95> dblp:authoredBy <https://dblp.org/pid/a/EAstesiano> } }","paraphrases":["Have Franco M. and Astesiano, E. not co-authored the paper 'The SMoLCS ToolSet'?"],"info":{}}
{"id":"train_1576","question":"Have Florian Lemmerich and J. Baumeister not co-authored the paper 'Taking OWL to Athens'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esws/ReutelshoeferLBWH10> dblp:authoredBy <https://dblp.org/pid/51/3723> . <https://dblp.org/rec/conf/esws/ReutelshoeferLBWH10> dblp:authoredBy <https://dblp.org/pid/35/5849> FILTER NOT EXISTS { <https://dblp.org/rec/conf/esws/ReutelshoeferLBWH10> dblp:authoredBy <https://dblp.org/pid/51/3723> . <https://dblp.org/rec/conf/esws/ReutelshoeferLBWH10> dblp:authoredBy <https://dblp.org/pid/35/5849> } }","paraphrases":["Was the paper 'Taking OWL to Athens' not co-authored by Florian Lemmerich and J. Baumeister?"],"info":{}}
{"id":"train_1577","question":"Wasn't the paper 'Enabling user cooperation through embedded coding and awareness of source content dynamics' published by the author A. Kwasinski in ICASSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/Kwasinski10> dblp:authoredBy <https://dblp.org/pid/50/6296> . <https://dblp.org/rec/conf/icassp/Kwasinski10> dblp:publishedIn 'ICASSP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icassp/Kwasinski10> dblp:authoredBy <https://dblp.org/pid/50/6296> . <https://dblp.org/rec/conf/icassp/Kwasinski10> dblp:publishedIn 'ICASSP' } }","paraphrases":["Was the paper 'Enabling user cooperation through embedded coding and awareness of source content dynamics' not published by Andres Kwasinski in ICASSP?"],"info":{}}
{"id":"train_1578","question":"Didn't Vilares, D. publish the paper 'A Transition-based Algorithm for Unrestricted AMR Parsing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1805-09007> dblp:authoredBy <https://dblp.org/pid/128/2835> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1805-09007> dblp:authoredBy <https://dblp.org/pid/128/2835> } }","paraphrases":["Was the paper 'A Transition-based Algorithm for Unrestricted AMR Parsing' not published by David Vilares?"],"info":{}}
{"id":"train_1579","question":"Wasn't the paper 'On the P\\u00F3lya Enumeration Theorem' published by the author Fel, L. G. in Intell. Inf. Manag.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iim/Fel09> dblp:authoredBy <https://dblp.org/pid/89/5483> . <https://dblp.org/rec/journals/iim/Fel09> dblp:publishedIn 'Intell. Inf. Manag.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/iim/Fel09> dblp:authoredBy <https://dblp.org/pid/89/5483> . <https://dblp.org/rec/journals/iim/Fel09> dblp:publishedIn 'Intell. Inf. Manag.' } }","paraphrases":["Was the paper 'On the P\\u00F3lya Enumeration Theorem' not published by Leonid G. Fel in Intell. Inf. Manag.?"],"info":{}}
{"id":"train_1580","question":"Was the paper 'Flexible load balancing with multi-dimensional state-space collapse: Throughput and heavy-traffic delay optimality' not published by Zhou, Xingyu in Perform. Evaluation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pe/ZhouTS18> dblp:authoredBy <https://dblp.org/pid/07/10352-1> . <https://dblp.org/rec/journals/pe/ZhouTS18> dblp:publishedIn 'Perform. Evaluation' FILTER NOT EXISTS { <https://dblp.org/rec/journals/pe/ZhouTS18> dblp:authoredBy <https://dblp.org/pid/07/10352-1> . <https://dblp.org/rec/journals/pe/ZhouTS18> dblp:publishedIn 'Perform. Evaluation' } }","paraphrases":["Has the paper 'Flexible load balancing with multi-dimensional state-space collapse: Throughput and heavy-traffic delay optimality' not been published by Zhou, Xingyu in Perform. Evaluation?"],"info":{}}
{"id":"train_1581","question":"Did Turau, V. and Ghaith Tarawneh not co-author the paper 'HTTPExplorer: exploring the hypertext transfer protocol'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iticse/Turau03> dblp:authoredBy <https://dblp.org/pid/79/156> . <https://dblp.org/rec/conf/iticse/Turau03> dblp:authoredBy <https://dblp.org/pid/121/1592> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iticse/Turau03> dblp:authoredBy <https://dblp.org/pid/79/156> . <https://dblp.org/rec/conf/iticse/Turau03> dblp:authoredBy <https://dblp.org/pid/121/1592> } }","paraphrases":["Have Volker Turau and Ghaith Tarawneh not co-authored the paper 'HTTPExplorer: exploring the hypertext transfer protocol'?"],"info":{}}
{"id":"train_1582","question":"Was the paper 'Bayesian tensor factorization-drive breast cancer subtyping by integrating multi-omics data' not published by Bowen Cheng in J. Biomed. Informatics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jbi/LiuCJH22> dblp:authoredBy <https://dblp.org/pid/73/8079> . <https://dblp.org/rec/journals/jbi/LiuCJH22> dblp:publishedIn 'J. Biomed. Informatics' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jbi/LiuCJH22> dblp:authoredBy <https://dblp.org/pid/73/8079> . <https://dblp.org/rec/journals/jbi/LiuCJH22> dblp:publishedIn 'J. Biomed. Informatics' } }","paraphrases":["Did Bowen C. not publish the paper 'Bayesian tensor factorization-drive breast cancer subtyping by integrating multi-omics data' in J. Biomed. Informatics?"],"info":{}}
{"id":"train_1583","question":"Wasn't the paper 'Formulas for the impulse response of a digital filter with an arbitrary piecewise-linear frequency response' published by the author Russell J. Niederjohn in IEEE Trans. Signal Process.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsp/ChanHN95> dblp:authoredBy <https://dblp.org/pid/171/1945> . <https://dblp.org/rec/journals/tsp/ChanHN95> dblp:publishedIn 'IEEE Trans. Signal Process.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tsp/ChanHN95> dblp:authoredBy <https://dblp.org/pid/171/1945> . <https://dblp.org/rec/journals/tsp/ChanHN95> dblp:publishedIn 'IEEE Trans. Signal Process.' } }","paraphrases":["Has the paper 'Formulas for the impulse response of a digital filter with an arbitrary piecewise-linear frequency response' not been published by Russell J. Niederjohn in IEEE Trans. Signal Process.?"],"info":{}}
{"id":"train_1584","question":"Wasn't the paper 'Two-Hop Monitoring Mechanism Based on Relaxed Flow Conservation Constraints against Selective Routing Attacks in Wireless Sensor Networks' not published by the author Abdelghani Bouras?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/DerhabBBMK20> dblp:authoredBy <https://dblp.org/pid/23/8408> FILTER NOT EXISTS { <https://dblp.org/rec/journals/sensors/DerhabBBMK20> dblp:authoredBy <https://dblp.org/pid/23/8408> } }","paraphrases":["Wasn't the paper 'Two-Hop Monitoring Mechanism Based on Relaxed Flow Conservation Constraints against Selective Routing Attacks in Wireless Sensor Networks' not published by the person named Abdelghani Bouras?"],"info":{}}
{"id":"train_1586","question":"Have Huaxiong Wang and Benjamin Hong Meng Tan not co-authored the paper 'Fully homomorphic encryption over the integers for non-binary plaintexts without the sparse subset sum problem'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcs/AungLTW19> dblp:authoredBy <https://dblp.org/pid/52/4513> . <https://dblp.org/rec/journals/tcs/AungLTW19> dblp:authoredBy <https://dblp.org/pid/181/1558> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tcs/AungLTW19> dblp:authoredBy <https://dblp.org/pid/52/4513> . <https://dblp.org/rec/journals/tcs/AungLTW19> dblp:authoredBy <https://dblp.org/pid/181/1558> } }","paraphrases":["Was the paper 'Fully homomorphic encryption over the integers for non-binary plaintexts without the sparse subset sum problem' not co-authored by Huaxiong W. and Benjamin Hong Meng Tan?"],"info":{}}
{"id":"train_1587","question":"Wasn't the paper 'Augmented Reality Appendages for Robots: Design Considerations and Recommendations for Maximizing Social and Functional Perception' published by the author I. Goktan in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2205-06747> dblp:authoredBy <https://dblp.org/pid/320/4585> . <https://dblp.org/rec/journals/corr/abs-2205-06747> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2205-06747> dblp:authoredBy <https://dblp.org/pid/320/4585> . <https://dblp.org/rec/journals/corr/abs-2205-06747> dblp:publishedIn 'CoRR' } }","paraphrases":["Was the paper 'Augmented Reality Appendages for Robots: Design Considerations and Recommendations for Maximizing Social and Functional Perception' not published by Ipek Goktan in CoRR?"],"info":{}}
{"id":"train_1588","question":"Wasn't the paper 'Living semantic platform' not published by the author Chen, Willy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/i-semantics/ChenL15> dblp:authoredBy <https://dblp.org/pid/05/3909> FILTER NOT EXISTS { <https://dblp.org/rec/conf/i-semantics/ChenL15> dblp:authoredBy <https://dblp.org/pid/05/3909> } }","paraphrases":["Was the paper 'Living semantic platform' not published by the person Chen, Willy?"],"info":{}}
{"id":"train_1589","question":"Have Abdulla Eid and S. Dawson-Haggerty not co-authored the paper 'A comparison between Suzuki invariant code and one-point Hermitian code'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dmaa/Eid22> dblp:authoredBy <https://dblp.org/pid/132/6673> . <https://dblp.org/rec/journals/dmaa/Eid22> dblp:authoredBy <https://dblp.org/pid/31/5644> FILTER NOT EXISTS { <https://dblp.org/rec/journals/dmaa/Eid22> dblp:authoredBy <https://dblp.org/pid/132/6673> . <https://dblp.org/rec/journals/dmaa/Eid22> dblp:authoredBy <https://dblp.org/pid/31/5644> } }","paraphrases":["Was the paper 'A comparison between Suzuki invariant code and one-point Hermitian code' not co-authored by Abdulla Eid and Stephen Dawson-Haggerty?"],"info":{}}
{"id":"train_1590","question":"Was the paper 'Insights into individual's online shopping continuance intention' not published by Ramlah Hussein?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/imds/MohamedHZH14> dblp:authoredBy <https://dblp.org/pid/56/7464> FILTER NOT EXISTS { <https://dblp.org/rec/journals/imds/MohamedHZH14> dblp:authoredBy <https://dblp.org/pid/56/7464> } }","paraphrases":["Was the paper 'Insights into individual's online shopping continuance intention' not published by the person Ramlah H.?"],"info":{}}
{"id":"train_1591","question":"Was the paper 'Sensitivity analysis of CRA based controllers in fractional order systems' not published by M. Haeri?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigpro/TabatabaeiH12> dblp:authoredBy <https://dblp.org/pid/78/2874> FILTER NOT EXISTS { <https://dblp.org/rec/journals/sigpro/TabatabaeiH12> dblp:authoredBy <https://dblp.org/pid/78/2874> } }","paraphrases":["Wasn't the paper 'Sensitivity analysis of CRA based controllers in fractional order systems' not published by the person named Mohammad Haeri?"],"info":{}}
{"id":"train_1592","question":"Has the paper 'A Case Study on Formal Verification of Self-Adaptive Behaviors in a Decentralized System' not been published by M. U. Iftikhar in FOCLASA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1208-4635> dblp:authoredBy <https://dblp.org/pid/117/9113> . <https://dblp.org/rec/journals/corr/abs-1208-4635> dblp:publishedIn 'FOCLASA' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1208-4635> dblp:authoredBy <https://dblp.org/pid/117/9113> . <https://dblp.org/rec/journals/corr/abs-1208-4635> dblp:publishedIn 'FOCLASA' } }","paraphrases":["Was the paper 'A Case Study on Formal Verification of Self-Adaptive Behaviors in a Decentralized System' not published by M. U. Iftikhar in FOCLASA?"],"info":{}}
{"id":"train_1594","question":"Was the paper 'LAN based distributed database management system architecture (LADDBMS) (abstract only)' not published by Narayanan, T. S. in ACM Conference on Computer Science?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acm/Narayanan85> dblp:authoredBy <https://dblp.org/pid/82/5224> . <https://dblp.org/rec/conf/acm/Narayanan85> dblp:publishedIn 'ACM Conference on Computer Science' FILTER NOT EXISTS { <https://dblp.org/rec/conf/acm/Narayanan85> dblp:authoredBy <https://dblp.org/pid/82/5224> . <https://dblp.org/rec/conf/acm/Narayanan85> dblp:publishedIn 'ACM Conference on Computer Science' } }","paraphrases":["Wasn't the paper 'LAN based distributed database management system architecture (LADDBMS) (abstract only)' published by the author T. S. Narayanan in ACM Conference on Computer Science?"],"info":{}}
{"id":"train_1595","question":"Was the paper 'Measuring Efficiency of Semi-automated Brain Tumor Segmentation by Simulating User Interaction' not published by Aaron Avery in Frontiers Comput. Neurosci.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ficn/GeringKYMAKKHCP20> dblp:authoredBy <https://dblp.org/pid/230/3540> . <https://dblp.org/rec/journals/ficn/GeringKYMAKKHCP20> dblp:publishedIn 'Frontiers Comput. Neurosci.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ficn/GeringKYMAKKHCP20> dblp:authoredBy <https://dblp.org/pid/230/3540> . <https://dblp.org/rec/journals/ficn/GeringKYMAKKHCP20> dblp:publishedIn 'Frontiers Comput. Neurosci.' } }","paraphrases":["Wasn't the paper 'Measuring Efficiency of Semi-automated Brain Tumor Segmentation by Simulating User Interaction' published by the author Avery, A. in Frontiers Comput. Neurosci.?"],"info":{}}
{"id":"train_1596","question":"Was the paper 'Intelligent Gas-sensing Systems for Bacterial Clinical Isolates in Vitro Classification' not co-authored by Vassilis S. Kodogiannis and Tetsuya Iizuka?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/npsc/Kodogiannis05> dblp:authoredBy <https://dblp.org/pid/k/VSKodogiannis> . <https://dblp.org/rec/journals/npsc/Kodogiannis05> dblp:authoredBy <https://dblp.org/pid/28/2164> FILTER NOT EXISTS { <https://dblp.org/rec/journals/npsc/Kodogiannis05> dblp:authoredBy <https://dblp.org/pid/k/VSKodogiannis> . <https://dblp.org/rec/journals/npsc/Kodogiannis05> dblp:authoredBy <https://dblp.org/pid/28/2164> } }","paraphrases":["Have V. S. Kodogiannis and Iizuka, Tetsuya not co-authored the paper 'Intelligent Gas-sensing Systems for Bacterial Clinical Isolates in Vitro Classification'?"],"info":{}}
{"id":"train_1598","question":"Was the paper 'PSO-DQ: An Improved Routing Protocol Based on PSO using Dynamic Queue Mechanism for MANETs' not published by Sudip Kumar Sahana in J. Inf. Sci. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jise/KumariS22> dblp:authoredBy <https://dblp.org/pid/150/2659> . <https://dblp.org/rec/journals/jise/KumariS22> dblp:publishedIn 'J. Inf. Sci. Eng.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jise/KumariS22> dblp:authoredBy <https://dblp.org/pid/150/2659> . <https://dblp.org/rec/journals/jise/KumariS22> dblp:publishedIn 'J. Inf. Sci. Eng.' } }","paraphrases":["Has the paper 'PSO-DQ: An Improved Routing Protocol Based on PSO using Dynamic Queue Mechanism for MANETs' not been published by Sudip Kumar Sahana in J. Inf. Sci. Eng.?"],"info":{}}
{"id":"train_1599","question":"Did Domenico Ursino not publish the paper 'Supporting User-Profiled Semantic Web-Oriented Search' in CIA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cia/PalopoliRTU01> dblp:authoredBy <https://dblp.org/pid/u/DomenicoUrsino> . <https://dblp.org/rec/conf/cia/PalopoliRTU01> dblp:publishedIn 'CIA' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cia/PalopoliRTU01> dblp:authoredBy <https://dblp.org/pid/u/DomenicoUrsino> . <https://dblp.org/rec/conf/cia/PalopoliRTU01> dblp:publishedIn 'CIA' } }","paraphrases":["Has the paper 'Supporting User-Profiled Semantic Web-Oriented Search' not been published by D. Ursino in CIA?"],"info":{}}
{"id":"train_1600","question":"Was the paper 'Immune infiltration and clinical significance analyses of the coagulation-related genes in hepatocellular carcinoma' not co-authored by Yang, Jian and Jin, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bib/HeYJ22> dblp:authoredBy <https://dblp.org/pid/181/2854> . <https://dblp.org/rec/journals/bib/HeYJ22> dblp:authoredBy <https://dblp.org/pid/325/3156> FILTER NOT EXISTS { <https://dblp.org/rec/journals/bib/HeYJ22> dblp:authoredBy <https://dblp.org/pid/181/2854> . <https://dblp.org/rec/journals/bib/HeYJ22> dblp:authoredBy <https://dblp.org/pid/325/3156> } }","paraphrases":["Have Jian Yang and Jin, Y. not co-authored the paper 'Immune infiltration and clinical significance analyses of the coagulation-related genes in hepatocellular carcinoma'?"],"info":{}}
{"id":"train_1601","question":"Didn't Ryuichi T. publish the paper 'ConvLab-2: An Open-Source Toolkit for Building, Evaluating, and Diagnosing Dialogue Systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2002-04793> dblp:authoredBy <https://dblp.org/pid/222/7875> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2002-04793> dblp:authoredBy <https://dblp.org/pid/222/7875> } }","paraphrases":["Was the paper 'ConvLab-2: An Open-Source Toolkit for Building, Evaluating, and Diagnosing Dialogue Systems' not published by the person Ryuichi T.?"],"info":{}}
{"id":"train_1602","question":"Didn't Jonathan Hasenburg publish the paper 'Managing Latency and Excess Data Dissemination in Fog-Based Publish/Subscribe Systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icfc/HasenburgSTB20> dblp:authoredBy <https://dblp.org/pid/230/6948> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icfc/HasenburgSTB20> dblp:authoredBy <https://dblp.org/pid/230/6948> } }","paraphrases":["Wasn't the paper 'Managing Latency and Excess Data Dissemination in Fog-Based Publish/Subscribe Systems' not published by the person named Jonathan Hasenburg?"],"info":{}}
