{"id":"train_4239","question":"Who are the authors of the publication 'Design and performance of a 3G mobile satellite system' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/milcom/RavishankarMBNJ11> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/milcom/RavishankarMBNJ11> ) }","paraphrases":["Who are the authors of the publication 'Design and performance of a 3G mobile satellite system' and what other papers did they publish?"],"info":{}}
{"id":"train_4241","question":"Who are the authors of the publication 'Unsupervised Learning of Camera Pose with Compositional Re-estimation' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/wacv/NabaviHFW20> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/wacv/NabaviHFW20> ) }","paraphrases":["Who are the authors of the publication 'Unsupervised Learning of Camera Pose with Compositional Re-estimation' and which other papers did they publish?"],"info":{}}
{"id":"train_4243","question":"List the authors of 'Affine Disentangled GAN for Interpretable and Robust AV Perception' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1907-05274> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Affine Disentangled GAN for Interpretable and Robust AV Perception' and where are they from?"],"info":{}}
{"id":"train_4245","question":"Who are the authors of the publication 'Fourier-based Video Prediction through Relational Object Motion' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/esann/MosbachB21> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Fourier-based Video Prediction through Relational Object Motion' and where are they from?"],"info":{}}
{"id":"train_4246","question":"Find the authors of 'Brown ROS Package: Reproducibility for Shared Experimentation and Learning from Demonstration' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/aaai/OsentoskiJCJ10> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/aaai/OsentoskiJCJ10> ) }","paraphrases":["Who are the authors of the publication 'Brown ROS Package: Reproducibility for Shared Experimentation and Learning from Demonstration' and where did they publish other papers?"],"info":{}}
{"id":"train_4249","question":"List the authors of 'Recent Approaches in Handwriting Recognition with Markovian Modelling and Recurrent Neural Networks' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/wirn/Likforman-Sulem13> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Find the authors of 'Recent Approaches in Handwriting Recognition with Markovian Modelling and Recurrent Neural Networks' and their affiliations."],"info":{}}
{"id":"train_4250","question":"Find the authors of 'Blind image quality assessment in the contourlet domain' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/spic/LiGZZWB21> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/spic/LiGZZWB21> ) }","paraphrases":["List the authors of 'Blind image quality assessment in the contourlet domain' and the venues of the other papers they published."],"info":{}}
{"id":"train_4253","question":"List the authors of 'On the Efficient Generation of Prime-Order Elliptic Curves' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/joc/KonstantinouKSZ10> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/joc/KonstantinouKSZ10> ) }","paraphrases":["Who are the authors of the publication 'On the Efficient Generation of Prime-Order Elliptic Curves' and where did they publish other papers?"],"info":{}}
{"id":"train_4255","question":"List the authors of 'Classified-Filter-based Post-Compensation Interpolation for Color Filter Array demosaicing' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icassp/GuoLLWL12> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icassp/GuoLLWL12> ) }","paraphrases":["Who are the authors of 'Classified-Filter-based Post-Compensation Interpolation for Color Filter Array demosaicing' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4256","question":"List the authors of 'Run-Time Monitoring of Data-Handling Violations' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/esorics/HappaMGC18> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/esorics/HappaMGC18> ) }","paraphrases":["Who are the authors of 'Run-Time Monitoring of Data-Handling Violations' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4259","question":"Find the authors of 'Extending Maple with compiled routines' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/cse/Dubois00> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/cse/Dubois00> ) }","paraphrases":["Who are the authors of the publication 'Extending Maple with compiled routines' and what other papers did they publish?"],"info":{}}
{"id":"train_4260","question":"List the authors of 'Analysis of Forced Expiratory Flow Signals Using the New Luus-Jaakola Optimization Procedure' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tbe/HeMXZHSZ15> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/tbe/HeMXZHSZ15> ) }","paraphrases":["Who are the authors of 'Analysis of Forced Expiratory Flow Signals Using the New Luus-Jaakola Optimization Procedure' and which other papers did they publish?"],"info":{}}
{"id":"train_4262","question":"List the authors of 'Voice Production Mechanisms of Vocal Vibrato in Male Singers' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/taslp/ArroabarrenC07> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Voice Production Mechanisms of Vocal Vibrato in Male Singers' and where are they from?"],"info":{}}
{"id":"train_4264","question":"List the authors of 'Real-time frequency parameter extraction for electronic support systems' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/siu/OrtatatliOSOYG16> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/siu/OrtatatliOSOYG16> ) }","paraphrases":["Who are the authors of the publication 'Real-time frequency parameter extraction for electronic support systems' and where did they publish other papers?"],"info":{}}
{"id":"train_4266","question":"Find the authors of 'Rotational invariants for Tchebichef moments' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ieiceee/GohBA10> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/ieiceee/GohBA10> ) }","paraphrases":["Who are the authors of the publication 'Rotational invariants for Tchebichef moments' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4267","question":"List the authors of 'Traffic Sign Detection using Deep Random Mapping Autoencoder Network' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icinfa/YangY018> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/icinfa/YangY018> ) }","paraphrases":["Who are the authors of 'Traffic Sign Detection using Deep Random Mapping Autoencoder Network' and which other papers did they publish?"],"info":{}}
{"id":"train_4269","question":"Find the authors of 'Intrusion detection systems for IoT-based smart environments: a survey' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jcloudc/ElrawyAH18> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jcloudc/ElrawyAH18> ) }","paraphrases":["Who are the authors of the publication 'Intrusion detection systems for IoT-based smart environments: a survey' and which other papers did they publish?"],"info":{}}
{"id":"train_4270","question":"Who are the authors of the publication 'Performance analysis of a new random access protocol for OCDMA networks' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/pnc/SunYWX07> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/pnc/SunYWX07> ) }","paraphrases":["Who are the authors of the publication 'Performance analysis of a new random access protocol for OCDMA networks' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4271","question":"Who are the authors of the publication 'Introducing Redundancy in the Radio Planning of LPWA Networks for Internet of Things' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/winsys/VieiraMC16> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Introducing Redundancy in the Radio Planning of LPWA Networks for Internet of Things' and where are they from?"],"info":{}}
{"id":"train_4276","question":"List the authors of 'The Dilated Triple' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1006-1080> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/corr/abs-1006-1080> ) }","paraphrases":["Who are the authors of 'The Dilated Triple' and which other papers did they publish?"],"info":{}}
{"id":"train_4277","question":"Find the authors of 'Automatic post-synchronization of speech utterances' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/interspeech/Verhelst97> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/interspeech/Verhelst97> ) }","paraphrases":["List the authors of 'Automatic post-synchronization of speech utterances' and the other papers they published."],"info":{}}
{"id":"train_4279","question":"Who are the authors of the publication 'Modeling and Simulation of an Adaptive Neuro-Fuzzy Inference System (ANFIS) for Mobile Learning' and where are they from?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tlt/Al-HmouzSAY12> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Modeling and Simulation of an Adaptive Neuro-Fuzzy Inference System (ANFIS) for Mobile Learning' and what are their affiliations?"],"info":{}}
{"id":"train_4280","question":"Who are the authors of the publication 'A Distance-Based Locally Informed Particle Swarm Model for Multimodal Optimization' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tec/QuSD13> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/tec/QuSD13> ) }","paraphrases":["Who are the authors of the publication 'A Distance-Based Locally Informed Particle Swarm Model for Multimodal Optimization' and which other papers did they publish?"],"info":{}}
{"id":"train_4284","question":"Who are the authors of the publication 'Preface' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jgo/Hadjisavvas12> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jgo/Hadjisavvas12> ) }","paraphrases":["Who are the authors of 'Preface' and which other papers did they publish?"],"info":{}}
{"id":"train_4287","question":"List the authors of 'Preface' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jar/AutexierMMN08> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/jar/AutexierMMN08> ) }","paraphrases":["Who are the authors of the publication 'Preface' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4288","question":"Find the authors of 'NoC-Based Hardware Accelerator for Breakpoint Phylogeny' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tc/MajumderSPK12> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'NoC-Based Hardware Accelerator for Breakpoint Phylogeny' and where are they from?"],"info":{}}
{"id":"train_4290","question":"List the authors of 'Enough is enough: Inductive sufficiency guides learners' ratings of informant helpfulness' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cogsci/ShaftoGFS12> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/cogsci/ShaftoGFS12> ) }","paraphrases":["Who are the authors of 'Enough is enough: Inductive sufficiency guides learners' ratings of informant helpfulness' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4293","question":"Who are the authors of 'Solving reliability redundancy allocation problems with orthogonal simplified swarm optimization' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ijcnn/YehCJH15> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/ijcnn/YehCJH15> ) }","paraphrases":["Who are the authors of the publication 'Solving reliability redundancy allocation problems with orthogonal simplified swarm optimization' and what other papers did they publish?"],"info":{}}
{"id":"train_4294","question":"Who are the authors of 'Impact of anonymity on roles of personal and group identities in online communities' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/iam/KimLL19> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/iam/KimLL19> ) }","paraphrases":["Who are the authors of the publication 'Impact of anonymity on roles of personal and group identities in online communities' and where did they publish other papers?"],"info":{}}
{"id":"train_4295","question":"Find the authors of 'End-to-End Learning of Visual Representations From Uncurated Instructional Videos' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/cvpr/MiechASLSZ20> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/cvpr/MiechASLSZ20> ) }","paraphrases":["List the authors of 'End-to-End Learning of Visual Representations From Uncurated Instructional Videos' and the venues of the other papers they published."],"info":{}}
{"id":"train_4296","question":"Find the authors of 'Product Review Translation using Phrase Replacement and Attention Guided Noise Augmentation' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/mtsummit/GuptaCGE21> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/mtsummit/GuptaCGE21> ) }","paraphrases":["Who are the authors of 'Product Review Translation using Phrase Replacement and Attention Guided Noise Augmentation' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4298","question":"List the authors of 'SQTime: Time-Enhanced Social Search Querying' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/er/LionakisSK14> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'SQTime: Time-Enhanced Social Search Querying' and where are they from?"],"info":{}}
{"id":"train_4299","question":"Who are the authors of the publication 'A Novel Active Contours Model for Environmental Change Detection from Multitemporal Synthetic Aperture Radar Images' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/remotesensing/AhmadiH20> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/remotesensing/AhmadiH20> ) }","paraphrases":["Who are the authors of the publication 'A Novel Active Contours Model for Environmental Change Detection from Multitemporal Synthetic Aperture Radar Images' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4303","question":"List the authors of 'Security Strategy Analysis for Critical Information Infrastructures' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/critis/TorresSS08> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/critis/TorresSS08> ) }","paraphrases":["Who are the authors of the publication 'Security Strategy Analysis for Critical Information Infrastructures' and which other papers did they publish?"],"info":{}}
{"id":"train_4306","question":"Find the authors of 'Analysis and Implementation of the Discrete Element Method Using a Dedicated Highly Parallel Architecture in Reconfigurable Computing' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/fccm/SchaferQC02> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/fccm/SchaferQC02> ) }","paraphrases":["Who are the authors of 'Analysis and Implementation of the Discrete Element Method Using a Dedicated Highly Parallel Architecture in Reconfigurable Computing' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4309","question":"Find the authors of 'Bayesian network-based seismic damage estimation for power and potable water supply systems' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ress/LeeCLP20> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/ress/LeeCLP20> ) }","paraphrases":["Who are the authors of the publication 'Bayesian network-based seismic damage estimation for power and potable water supply systems' and what other papers did they publish?"],"info":{}}
{"id":"train_4311","question":"Who are the authors of the publication 'Simplest optimal guillotine cutting patterns for strips of identical circles' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jco/CuiGH08> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/jco/CuiGH08> ) }","paraphrases":["Who are the authors of 'Simplest optimal guillotine cutting patterns for strips of identical circles' and which other papers did they publish?"],"info":{}}
{"id":"train_4313","question":"List the authors of 'Tough Shift: Exploring the Complexities of Shifting Residential Electricity Use Through a Casual Mobile Game' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/chiplay/BrewerVHR15> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/chiplay/BrewerVHR15> ) }","paraphrases":["Who are the authors of the publication 'Tough Shift: Exploring the Complexities of Shifting Residential Electricity Use Through a Casual Mobile Game' and what other papers did they publish?"],"info":{}}
{"id":"train_4315","question":"Find the authors of 'RTMC: An Error Control Protocol for IP-based Audio-Visual Multicast Applications' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icccn/CarleO98> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'RTMC: An Error Control Protocol for IP-based Audio-Visual Multicast Applications' and what are their affiliations?"],"info":{}}
{"id":"train_4317","question":"Find the authors of 'Robust measurement of fundamental frequency and degree of voicing' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/interspeech/Holmes98a> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/interspeech/Holmes98a> ) }","paraphrases":["List the authors of 'Robust measurement of fundamental frequency and degree of voicing' and the venues of the other papers they published."],"info":{}}
{"id":"train_4318","question":"Who are the authors of the publication 'Simulation of Photovoltaics for Defence Applications - Power Generation Assessment and Investigation of the Available Integration Areas of Photovoltaic Devices on a Virtual Infantryman' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/simultech/ParaskevopoulosT12> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/simultech/ParaskevopoulosT12> ) }","paraphrases":["Who are the authors of the publication 'Simulation of Photovoltaics for Defence Applications - Power Generation Assessment and Investigation of the Available Integration Areas of Photovoltaic Devices on a Virtual Infantryman' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4320","question":"Who are the authors of the publication 'Time-accurate multi-scale anisotropic mesh adaptation for unsteady flows in CFD' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/jcphy/AlauzetLO18> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/jcphy/AlauzetLO18> ) }","paraphrases":["Who are the authors of 'Time-accurate multi-scale anisotropic mesh adaptation for unsteady flows in CFD' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4321","question":"List the authors of 'Cloud computing security, data, and performance issues' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/wocc/SinhaK14> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/wocc/SinhaK14> ) }","paraphrases":["Who are the authors of 'Cloud computing security, data, and performance issues' and which other papers did they publish?"],"info":{}}
{"id":"train_4322","question":"List the authors of 'Decomposition of transition systems into sets of synchronizing state machines' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/dsd/TerenCV21> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/dsd/TerenCV21> ) }","paraphrases":["Find the authors of 'Decomposition of transition systems into sets of synchronizing state machines' and the venues of the other papers they published."],"info":{}}
{"id":"train_4324","question":"Find the authors of 'A New Application for Description Logics: Disaster Management' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/dlog/GrathwohlBR99> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/dlog/GrathwohlBR99> ) }","paraphrases":["Who are the authors of the publication 'A New Application for Description Logics: Disaster Management' and which other papers did they publish?"],"info":{}}
{"id":"train_4326","question":"List the authors of 'Hybrid adapted fast correlation FCBF-support vector machine recursive feature elimination for feature selection' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/idt/DjellaliGG20> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Hybrid adapted fast correlation FCBF-support vector machine recursive feature elimination for feature selection' and where are they from?"],"info":{}}
{"id":"train_4327","question":"Find the authors of 'Optimal Fillings - A new spatial subdivision problem related to packing and covering' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1208-5752> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1208-5752> ) }","paraphrases":["List the authors of 'Optimal Fillings - A new spatial subdivision problem related to packing and covering' and the venues of the other papers they published."],"info":{}}
{"id":"train_4330","question":"Find the authors of 'Variations on Minimal Linear Codes' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icmcta/CohenM14> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["List the authors of 'Variations on Minimal Linear Codes' and their affiliations."],"info":{}}
{"id":"train_4334","question":"Find the authors of '3DPO: A Three-Dimensional Part Orientation System' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/ijcai/BolesHH83> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/ijcai/BolesHH83> ) }","paraphrases":["Who are the authors of the publication '3DPO: A Three-Dimensional Part Orientation System' and what are the venues of the other papers they published?"],"info":{}}
