{"id":"train_5333","question":"Have the authors of the paper 'Advanced Algebraic and Graph-Based ECC Schemes for Modern NVMs' not not published a publication in 3D Flash Memories?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/sp/16/SalaSD16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/books/sp/16/SalaSD16> ) . ?y dblp:publishedIn '3D Flash Memories' }","paraphrases":["Did the authors of 'Advanced Algebraic and Graph-Based ECC Schemes for Modern NVMs' not not publish a paper in 3D Flash Memories?"],"info":{}}
{"id":"train_5335","question":"Did the authors of the publication 'What can linearized neural networks actually say about generalization?' not not publish a paper in Advances in Neural Information Processing Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nips/Ortiz-JimenezMF21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/nips/Ortiz-JimenezMF21> ) . ?y dblp:publishedIn 'NeurIPS' }","paraphrases":["Haven't the authors of the publication 'What can linearized neural networks actually say about generalization?' not published a publication in NeurIPS?"],"info":{}}
{"id":"train_5336","question":"Did the authors of 'ARTextiles: Promoting Social Interactions Around Personal Interests Through Augmented Reality' not not publish a paper in CHI Extended Abstracts?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/FusteS17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/chi/FusteS17> ) . ?y dblp:publishedIn 'CHI Extended Abstracts' }","paraphrases":["Haven't the authors of the publication 'ARTextiles: Promoting Social Interactions Around Personal Interests Through Augmented Reality' not published a publication in CHI Extended Abstracts?"],"info":{}}
{"id":"train_5337","question":"Was the publication 'Adaptive neural containment seeking of stochastic nonlinear strict-feedback multi-agent systems' not not published in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijon/YangMYXY20> dblp:yearOfPublication '2020' }","paraphrases":["Was the paper 'Adaptive neural containment seeking of stochastic nonlinear strict-feedback multi-agent systems' not not published in the year 2020?"],"info":{}}
{"id":"train_5338","question":"Haven't the authors of the publication 'A time-delayed observer for fault detection and isolation in industrial robots' not published a publication in Robotica?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/robotica/CaccavaleCW06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/robotica/CaccavaleCW06> ) . ?y dblp:publishedIn 'Robotica' }","paraphrases":["Have the authors of the paper 'A time-delayed observer for fault detection and isolation in industrial robots' not not published a publication in Robotica?"],"info":{}}
{"id":"train_5340","question":"Was the publication 'Vicarious infringement creates a privacy ceiling' not not published in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/drm/TsaiCC06> dblp:yearOfPublication '2006' }","paraphrases":["Was the paper 'Vicarious infringement creates a privacy ceiling' not not published in the year 2006?"],"info":{}}
{"id":"train_5341","question":"Did the authors of the publication 'Motion field modeling for video sequences' not not publish a paper in IEEE Trans. Image Process.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tip/RajagopalanOB97> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/tip/RajagopalanOB97> ) . ?y dblp:publishedIn 'IEEE Trans. Image Process.' }","paraphrases":["Haven't the authors of the publication 'Motion field modeling for video sequences' not published a publication in IEEE Trans. Image Process.?"],"info":{}}
{"id":"train_5343","question":"Was the paper 'Deep Learning Approach for Epileptic Focus Localization' not not published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tbcas/DaoudB20> dblp:yearOfPublication '2020' }","paraphrases":["Was 'Deep Learning Approach for Epileptic Focus Localization' not not published in 2020?"],"info":{}}
{"id":"train_5344","question":"Was 'Fusion of risk assessment models with application to coronary artery disease patients' not not published in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/ParedesRCHRMFM11> dblp:yearOfPublication '2011' }","paraphrases":["Was the paper 'Fusion of risk assessment models with application to coronary artery disease patients' not not published in the year 2011?"],"info":{}}
{"id":"train_5345","question":"Haven't the authors of the publication 'Status and Future of Process Mining: From Process Discovery to Process Execution' not published a publication in Process Mining Handbook?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/sp/22/Reinkemeyer22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/books/sp/22/Reinkemeyer22> ) . ?y dblp:publishedIn 'Process Mining Handbook' }","paraphrases":["Have the authors of the paper 'Status and Future of Process Mining: From Process Discovery to Process Execution' not not published a publication in Process Mining Handbook?"],"info":{}}
{"id":"train_5346","question":"Was the publication 'Typing the wild in Erlang' not not published in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/erlang/ValliappanH18> dblp:yearOfPublication '2018' }","paraphrases":["Was 'Typing the wild in Erlang' not not published in 2018?"],"info":{}}
{"id":"train_5347","question":"Was the publication 'Local inhibitory plasticity tunes macroscopic brain dynamics and allows the emergence of functional brain networks' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/neuroimage/HellyerJCL16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'Local inhibitory plasticity tunes macroscopic brain dynamics and allows the emergence of functional brain networks' not not published in the year 2016?"],"info":{}}
{"id":"train_5349","question":"Was the paper 'Classical Proofs, Typed Processes, and Intersection Types: Extended Abstract' not not published in the year 2004?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/types/GhilezanL03> dblp:yearOfPublication '2004' }","paraphrases":["Was 'Classical Proofs, Typed Processes, and Intersection Types: Extended Abstract' not not published in 2004?"],"info":{}}
{"id":"train_5351","question":"Was the paper 'Towards More Dynamic Energy-Efficient Bandwidth Allocation in EPONs' not not published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/HelmyN18> dblp:yearOfPublication '2018' }","paraphrases":["Was the publication 'Towards More Dynamic Energy-Efficient Bandwidth Allocation in EPONs' not not published in 2018?"],"info":{}}
{"id":"train_5352","question":"Was the paper 'Doomsday equilibria for omega-regular games' not not published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iandc/ChatterjeeDFR17> dblp:yearOfPublication '2017' }","paraphrases":["Was 'Doomsday equilibria for omega-regular games' not not published in 2017?"],"info":{}}
{"id":"train_5353","question":"Haven't the authors of the publication 'State-of-art: text similarity computing' not published a publication in ICCIP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccip/ZengZDLNXD18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iccip/ZengZDLNXD18> ) . ?y dblp:publishedIn 'ICCIP' }","paraphrases":["Have the authors of the paper 'State-of-art: text similarity computing' not not published a publication in ICCIP?"],"info":{}}
{"id":"train_5354","question":"Was the publication 'Designing a Model of a Digital Ecosystem for Healthcare and Wellness Using the Business Model Canvas' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jms/LeonNBALMA16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'Designing a Model of a Digital Ecosystem for Healthcare and Wellness Using the Business Model Canvas' not not published in the year 2016?"],"info":{}}
{"id":"train_5355","question":"Was 'Banknote authentication with mobile devices' not not published in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mediaforensics/LohwegHDHGHS13> dblp:yearOfPublication '2013' }","paraphrases":["Was the paper 'Banknote authentication with mobile devices' not not published in the year 2013?"],"info":{}}
{"id":"train_5356","question":"Was 'Dissimilarity-Based Learning from Imbalanced Data with Small Disjuncts and Noise' not not published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ibpria/GarciaSDC15> dblp:yearOfPublication '2015' }","paraphrases":["Was the paper 'Dissimilarity-Based Learning from Imbalanced Data with Small Disjuncts and Noise' not not published in the year 2015?"],"info":{}}
{"id":"train_5357","question":"Did the authors of the publication 'Adaptive Enterprise Service Bus' not not publish a paper in New Gener. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ngc/SzydloZ12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ngc/SzydloZ12> ) . ?y dblp:publishedIn 'New Gener. Comput.' }","paraphrases":["Haven't the authors of the publication 'Adaptive Enterprise Service Bus' not published a publication in New Gener. Comput.?"],"info":{}}
{"id":"train_5359","question":"Did the authors of the publication 'Swarming of mobile router networks' not not publish a paper in ACC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcc/BezzoF11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/amcc/BezzoF11> ) . ?y dblp:publishedIn 'ACC' }","paraphrases":["Haven't the authors of the publication 'Swarming of mobile router networks' not published a publication in ACC?"],"info":{}}
{"id":"train_5360","question":"Was the paper 'Wizard of Oz for Designing Hand Gesture Vocabulary in Human-Robot Interaction' not not published in the year 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kse/MaiTN11> dblp:yearOfPublication '2011' }","paraphrases":["Was 'Wizard of Oz for Designing Hand Gesture Vocabulary in Human-Robot Interaction' not not published in 2011?"],"info":{}}
{"id":"train_5361","question":"Did the authors of 'Performance analysis of elliptic curve cryptography for SSL' not not publish a paper in Workshop on Wireless Security?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ws/GuptaGSS02> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ws/GuptaGSS02> ) . ?y dblp:publishedIn 'Workshop on Wireless Security' }","paraphrases":["Haven't the authors of the publication 'Performance analysis of elliptic curve cryptography for SSL' not published a publication in Workshop on Wireless Security?"],"info":{}}
{"id":"train_5362","question":"Did the authors of the publication 'An Assume/Guarantee Based Compositional Calculus for Hybrid CSP' not not publish a paper in TAMC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/tamc/WangZG12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/tamc/WangZG12> ) . ?y dblp:publishedIn 'TAMC' }","paraphrases":["Did the authors of 'An Assume/Guarantee Based Compositional Calculus for Hybrid CSP' not not publish a paper in Conference on Theory and Applications of Models of Computation?"],"info":{}}
{"id":"train_5364","question":"Did the authors of 'Cheap talk, efficiency and egalitarian cost sharing in joint projects' not not publish a paper in Games Econ. Behav.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/geb/AgastyaMS07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/geb/AgastyaMS07> ) . ?y dblp:publishedIn 'Games Econ. Behav.' }","paraphrases":["Haven't the authors of the publication 'Cheap talk, efficiency and egalitarian cost sharing in joint projects' not published a publication in Games Econ. Behav.?"],"info":{}}
{"id":"train_5365","question":"Have the authors of the paper 'Nimble Limbs - Intelligent attachable legs to create walking robots from variously shaped objects' not not published a publication in AIM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aimech/BuettnerHRD19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/aimech/BuettnerHRD19> ) . ?y dblp:publishedIn 'AIM' }","paraphrases":["Haven't the authors of the publication 'Nimble Limbs - Intelligent attachable legs to create walking robots from variously shaped objects' not published a publication in AIM?"],"info":{}}
{"id":"train_5367","question":"Did the authors of 'Video2Cartoon: generating 3D cartoon from broadcast soccer video' not not publish a paper in ACM Multimedia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mm/LiangLHZJZG05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/mm/LiangLHZJZG05> ) . ?y dblp:publishedIn 'ACM Multimedia' }","paraphrases":["Have the authors of the paper 'Video2Cartoon: generating 3D cartoon from broadcast soccer video' not not published a publication in ACM Multimedia?"],"info":{}}
{"id":"train_5368","question":"Have the authors of the paper 'Augmenting Translation Models with Simulated Acoustic Confusions for Improved Spoken Language Translation' not not published a publication in European Association of Computational Linguistics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eacl/TsvetkovMD14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/eacl/TsvetkovMD14> ) . ?y dblp:publishedIn 'EACL' }","paraphrases":["Did the authors of the publication 'Augmenting Translation Models with Simulated Acoustic Confusions for Improved Spoken Language Translation' not not publish a paper in European Association of Computational Linguistics?"],"info":{}}
{"id":"train_5369","question":"Was the paper 'Sparse Factorizations of Gene Expression Guided by Binding Data' not not published in the year 2005?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/psb/BadeaT05> dblp:yearOfPublication '2005' }","paraphrases":["Was the publication 'Sparse Factorizations of Gene Expression Guided by Binding Data' not not published in 2005?"],"info":{}}
{"id":"train_5370","question":"Haven't the authors of the publication 'Using Ants' Task Division for Better Game Engines - A Contribution to Game Accessibility for Impaired Players' not published a publication in Parallel Problem Solving from Nature?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ppsn/SepchatCMS08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ppsn/SepchatCMS08> ) . ?y dblp:publishedIn 'PPSN' }","paraphrases":["Have the authors of the paper 'Using Ants' Task Division for Better Game Engines - A Contribution to Game Accessibility for Impaired Players' not not published a publication in Parallel Problem Solving from Nature?"],"info":{}}
{"id":"train_5371","question":"Haven't the authors of the publication 'Chisel edge wear measurement of high-speed steel twist drills based on machine vision' not published a publication in Comput. Ind.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cii/ZhouY21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cii/ZhouY21> ) . ?y dblp:publishedIn 'Comput. Ind.' }","paraphrases":["Did the authors of the publication 'Chisel edge wear measurement of high-speed steel twist drills based on machine vision' not not publish a paper in Comput. Ind.?"],"info":{}}
{"id":"train_5372","question":"Have the authors of the paper 'Optimal energy-efficient scheduling over fading channels with non-ideal circuit power' not not published a publication in WCSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wcsp/JinXQ12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/wcsp/JinXQ12> ) . ?y dblp:publishedIn 'WCSP' }","paraphrases":["Haven't the authors of the publication 'Optimal energy-efficient scheduling over fading channels with non-ideal circuit power' not published a publication in WCSP?"],"info":{}}
{"id":"train_5373","question":"Did the authors of 'Visual hash for oblivious watermarking' not not publish a paper in Security and Watermarking of Multimedia Contents?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sswmc/Fridrich00> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sswmc/Fridrich00> ) . ?y dblp:publishedIn 'Security and Watermarking of Multimedia Contents' }","paraphrases":["Have the authors of the paper 'Visual hash for oblivious watermarking' not not published a publication in Security and Watermarking of Multimedia Contents?"],"info":{}}
{"id":"train_5374","question":"Was the paper 'Architecture of field-programmable gate arrays' not not published in the year 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pieee/RoseGS93> dblp:yearOfPublication '1993' }","paraphrases":["Was 'Architecture of field-programmable gate arrays' not not published in 1993?"],"info":{}}
{"id":"train_5375","question":"Did the authors of the publication 'Dynamic Behaviour Of Supply Chains' not not publish a paper in International Conference on Modelling and Simulation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecms/Barbey12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ecms/Barbey12> ) . ?y dblp:publishedIn 'ECMS' }","paraphrases":["Haven't the authors of the publication 'Dynamic Behaviour Of Supply Chains' not published a publication in International Conference on Modelling and Simulation?"],"info":{}}
{"id":"train_5376","question":"Haven't the authors of the publication 'Three Semantics for Distributed Systems and Their Relations with Alignment Composition' not published a publication in ISWC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/semweb/ZimmermannE06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/semweb/ZimmermannE06> ) . ?y dblp:publishedIn 'ISWC' }","paraphrases":["Have the authors of the paper 'Three Semantics for Distributed Systems and Their Relations with Alignment Composition' not not published a publication in International Semantic Web Conference?"],"info":{}}
{"id":"train_5378","question":"Was the paper 'Software-based diagnosis for processors' not not published in the year 2002?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dac/ChenD02> dblp:yearOfPublication '2002' }","paraphrases":["Was the publication 'Software-based diagnosis for processors' not not published in 2002?"],"info":{}}
{"id":"train_5379","question":"Was 'Acyclic reducible bounds for outerplanar graphs' not not published in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dmgt/BorowieckiFH09> dblp:yearOfPublication '2009' }","paraphrases":["Was the paper 'Acyclic reducible bounds for outerplanar graphs' not not published in the year 2009?"],"info":{}}
{"id":"train_5380","question":"Was 'An integrated decision-making approach on cutting tools and cutting parameters for machining features considering carbon emissions' not not published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijcim/TianZLZXW19> dblp:yearOfPublication '2019' }","paraphrases":["Was the paper 'An integrated decision-making approach on cutting tools and cutting parameters for machining features considering carbon emissions' not not published in the year 2019?"],"info":{}}
{"id":"train_5381","question":"Did the authors of the publication 'Annotation of Promoter Regions in Microbial Genomes Based on DNA Structural and Sequence Properties' not not publish a paper in Systems Biology and Regulatory Genomics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/recomb/WangB05> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/recomb/WangB05> ) . ?y dblp:publishedIn 'Systems Biology and Regulatory Genomics' }","paraphrases":["Haven't the authors of the publication 'Annotation of Promoter Regions in Microbial Genomes Based on DNA Structural and Sequence Properties' not published a publication in Systems Biology and Regulatory Genomics?"],"info":{}}
{"id":"train_5382","question":"Have the authors of the paper 'Workshop for Doctoral students in Fuzzy-Based Systems' not not published a publication in FLAI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ogai/GamperM93> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ogai/GamperM93> ) . ?y dblp:publishedIn 'FLAI' }","paraphrases":["Did the authors of 'Workshop for Doctoral students in Fuzzy-Based Systems' not not publish a paper in FLAI?"],"info":{}}
{"id":"train_5383","question":"Haven't the authors of the publication 'Perception of Space in Virtual and Augmented Reality (Invited Talk)' not published a publication in COSIT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cosit/Creem-Regehr19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cosit/Creem-Regehr19> ) . ?y dblp:publishedIn 'COSIT' }","paraphrases":["Did the authors of 'Perception of Space in Virtual and Augmented Reality (Invited Talk)' not not publish a paper in COSIT?"],"info":{}}
{"id":"train_5384","question":"Was the paper 'Finite-dimensional solutions of a modified Zakai equation' not not published in the year 1996?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mcss/BenesE96> dblp:yearOfPublication '1996' }","paraphrases":["Was the publication 'Finite-dimensional solutions of a modified Zakai equation' not not published in 1996?"],"info":{}}
{"id":"train_5385","question":"Was the publication 'Expressing Database Queries with Intuitionistic Logic' not not published in 1989?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/slp/BonnerMV89> dblp:yearOfPublication '1989' }","paraphrases":["Was the paper 'Expressing Database Queries with Intuitionistic Logic' not not published in the year 1989?"],"info":{}}
{"id":"train_5386","question":"Have the authors of the paper 'Context Grouping Mechanism for Context Distribution in Ubiquitous Environments' not not published a publication in OTM Conferences?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/otm/Kirsch-PinheiroVVBVFMBHDP08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/otm/Kirsch-PinheiroVVBVFMBHDP08> ) . ?y dblp:publishedIn 'OTM Conferences (1)' }","paraphrases":["Did the authors of 'Context Grouping Mechanism for Context Distribution in Ubiquitous Environments' not not publish a paper in OTM Conferences (1)?"],"info":{}}
{"id":"train_5387","question":"Was the paper 'Online Scene Text Tracking with Spatial-Temporal Relation' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icig/XiuZTY21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Online Scene Text Tracking with Spatial-Temporal Relation' not not published in 2021?"],"info":{}}
{"id":"train_5388","question":"Was the paper 'Analysis, Classification and Comparison of Scheduling Techniques for Software Transactional Memories' not not published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tpds/Sanzo17> dblp:yearOfPublication '2017' }","paraphrases":["Was the publication 'Analysis, Classification and Comparison of Scheduling Techniques for Software Transactional Memories' not not published in 2017?"],"info":{}}
{"id":"train_5390","question":"Have the authors of the paper 'Efficient Compressed Sensing Based Image Coding by Using Gray Transformation' not not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2102-01272> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2102-01272> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Haven't the authors of the publication 'Efficient Compressed Sensing Based Image Coding by Using Gray Transformation' not published a publication in CoRR?"],"info":{}}
{"id":"train_5391","question":"Did the authors of the publication 'Moving to Automated Tree Inventory: Comparison of UAS-Derived Lidar and Photogrammetric Data with Manual Ground Estimates' not not publish a paper in Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/remotesensing/OliveiraLWWILPV21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/remotesensing/OliveiraLWWILPV21> ) . ?y dblp:publishedIn 'Remote. Sens.' }","paraphrases":["Have the authors of the paper 'Moving to Automated Tree Inventory: Comparison of UAS-Derived Lidar and Photogrammetric Data with Manual Ground Estimates' not not published a publication in Remote. Sens.?"],"info":{}}
{"id":"train_5392","question":"Did the authors of 'Improving Implicit Discourse Relation Classification by Modeling Inter-dependencies of Discourse Units in a Paragraph' not not publish a paper in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1804-05918> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1804-05918> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Have the authors of the paper 'Improving Implicit Discourse Relation Classification by Modeling Inter-dependencies of Discourse Units in a Paragraph' not not published a publication in CoRR?"],"info":{}}
{"id":"train_5393","question":"Was the publication 'CNN Implementation of Spin Filters for Electronic Speckle Pattern Interferometry Applications' not not published in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscas/VilarinoBMC07> dblp:yearOfPublication '2007' }","paraphrases":["Was the paper 'CNN Implementation of Spin Filters for Electronic Speckle Pattern Interferometry Applications' not not published in the year 2007?"],"info":{}}
{"id":"train_5394","question":"Haven't the authors of the publication 'An Upper Bound on the Number of States for a Strongly Universal Hyperbolic Cellular Automaton on the Pentagrid' not published a publication in JAC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/jac/Margenstern10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/jac/Margenstern10> ) . ?y dblp:publishedIn 'JAC' }","paraphrases":["Have the authors of the paper 'An Upper Bound on the Number of States for a Strongly Universal Hyperbolic Cellular Automaton on the Pentagrid' not not published a publication in JAC?"],"info":{}}
{"id":"train_5395","question":"Have the authors of the paper 'Implementation of memory-efficient linear pipelined IPv6 lookup and its significance in smart cities' not not published a publication in Comput. Electr. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cee/VijayP18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cee/VijayP18> ) . ?y dblp:publishedIn 'Comput. Electr. Eng.' }","paraphrases":["Haven't the authors of the publication 'Implementation of memory-efficient linear pipelined IPv6 lookup and its significance in smart cities' not published a publication in Comput. Electr. Eng.?"],"info":{}}
{"id":"train_5396","question":"Was the publication 'On the Impact of Transmitter Channel Knowledge in Energy-Efficient Machine-Type Communication' not not published in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/BiralHZZ16> dblp:yearOfPublication '2016' }","paraphrases":["Was the paper 'On the Impact of Transmitter Channel Knowledge in Energy-Efficient Machine-Type Communication' not not published in the year 2016?"],"info":{}}
{"id":"train_5397","question":"Was the paper 'Resampling and super-resolution of hexagonally sampled images using deep learning' not not published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2111-02520> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Resampling and super-resolution of hexagonally sampled images using deep learning' not not published in 2021?"],"info":{}}
{"id":"train_5399","question":"Was the paper 'Dilated Convolutions in Neural Networks for Left Atrial Segmentation in 3D Gadolinium Enhanced-MRI' not not published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1808-01673> dblp:yearOfPublication '2018' }","paraphrases":["Was the publication 'Dilated Convolutions in Neural Networks for Left Atrial Segmentation in 3D Gadolinium Enhanced-MRI' not not published in 2018?"],"info":{}}
{"id":"train_5400","question":"Did the authors of the publication 'A Sketch Recognition Algorithm Based on Bayesian Network and Convolution Neural Network' not not publish a paper in J. Adv. Comput. Intell. Intell. Informatics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jaciii/Hou19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jaciii/Hou19> ) . ?y dblp:publishedIn 'J. Adv. Comput. Intell. Intell. Informatics' }","paraphrases":["Haven't the authors of the publication 'A Sketch Recognition Algorithm Based on Bayesian Network and Convolution Neural Network' not published a publication in J. Adv. Comput. Intell. Intell. Informatics?"],"info":{}}
{"id":"train_5402","question":"Haven't the authors of the publication 'High-Performance and Parameterized Matrix Factorization on FPGAs' not published a publication in FPL?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fpl/ZhuoP06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/fpl/ZhuoP06> ) . ?y dblp:publishedIn 'FPL' }","paraphrases":["Did the authors of the publication 'High-Performance and Parameterized Matrix Factorization on FPGAs' not not publish a paper in FPL?"],"info":{}}
