{"id":"train_5948","question":"List the venues in which 'From Spin Glasses to Negative-Weight Percolation' and 'Emergency management for information systems in public health a case study of the 2009 pandemic-flu response in Japan' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/entropy/HartmannMN19> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/percom/MurotaKO10> dblp:publishedIn ?answer } }","paraphrases":["Where were 'From Spin Glasses to Negative-Weight Percolation' and 'Emergency management for information systems in public health a case study of the 2009 pandemic-flu response in Japan' published?"],"info":{}}
{"id":"train_5950","question":"In 1997 in ICIP (2), what are the titles of the papers on Fractal image?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icip/RuhlHS97> dblp:publishedIn 'ICIP (2)' . <https://dblp.org/rec/conf/icip/RuhlHS97> dblp:yearOfPublication '1997' . <https://dblp.org/rec/conf/icip/RuhlHS97> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Fractal image that were published in IEEE International Conference on Image Processing in 1997?"],"info":{}}
{"id":"train_5951","question":"In J. Integr. Des. Process. Sci. in 2013, who are the authors that published papers about Model extrapolation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jid/HowarMW13> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jid/HowarMW13> dblp:publishedIn 'J. Integr. Des. Process. Sci.' . <https://dblp.org/rec/journals/jid/HowarMW13> dblp:yearOfPublication '2013' }","paraphrases":["In 2013 in J. Integr. Des. Process. Sci., who are the authors that published papers about Model extrapolation?"],"info":{}}
{"id":"train_5953","question":"Who are the authors that published papers about Prover contest in International Conference on Automated Deduction in 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cade/HutterB99> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/cade/HutterB99> dblp:publishedIn 'CADE' . <https://dblp.org/rec/conf/cade/HutterB99> dblp:yearOfPublication '1999' }","paraphrases":["In 1999 in CADE, who are the authors that published papers about Prover contest?"],"info":{}}
{"id":"train_5954","question":"In 2019 in CSOC (3), who are the authors that published papers about Control construction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/csoc/TrofimovaSI18> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/csoc/TrofimovaSI18> dblp:publishedIn 'CSOC (3)' . <https://dblp.org/rec/conf/csoc/TrofimovaSI18> dblp:yearOfPublication '2019' }","paraphrases":["In the year 2019 in CSOC, who are the authors that published research papers about Control construction?"],"info":{}}
{"id":"train_5955","question":"In SANER in 2020, who are the authors that published papers about Usage search?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wcre/AsyrofiT0J20> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/wcre/AsyrofiT0J20> dblp:publishedIn 'SANER' . <https://dblp.org/rec/conf/wcre/AsyrofiT0J20> dblp:yearOfPublication '2020' }","paraphrases":["In the year 2020 in SANER, who are the authors that published research papers about Usage search?"],"info":{}}
{"id":"train_5956","question":"In the year 2010 in IEEE Trans. Geosci. Remote. Sens., what are the titles of the research papers on Imaging method?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tgrs/ZhuSY10> dblp:publishedIn 'IEEE Trans. Geosci. Remote. Sens.' . <https://dblp.org/rec/journals/tgrs/ZhuSY10> dblp:yearOfPublication '2010' . <https://dblp.org/rec/journals/tgrs/ZhuSY10> dblp:title ?answer }","paraphrases":["In IEEE Trans. Geosci. Remote. Sens. in 2010, what are the titles of the papers on Imaging method?"],"info":{}}
{"id":"train_5957","question":"Mention the year in which New York University published a paper on Haplotype construction.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/psb/AnantharamanMM05> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'New York University, USA' . <https://dblp.org/rec/conf/psb/AnantharamanMM05> dblp:yearOfPublication ?answer }","paraphrases":["New York University published a paper on Haplotype construction in what year?"],"info":{}}
{"id":"train_5958","question":"In 2020 in UAI, who are the authors that published papers about Privacy constraints?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/uai/ZhangBL20> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/uai/ZhangBL20> dblp:publishedIn 'UAI' . <https://dblp.org/rec/conf/uai/ZhangBL20> dblp:yearOfPublication '2020' }","paraphrases":["In UAI in 2020, who are the authors that published papers about Privacy constraints?"],"info":{}}
{"id":"train_5959","question":"In 2001 in Internet Res., what are the titles of the papers on Interface usability?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/intr/RoyDA01> dblp:publishedIn 'Internet Res.' . <https://dblp.org/rec/journals/intr/RoyDA01> dblp:yearOfPublication '2001' . <https://dblp.org/rec/journals/intr/RoyDA01> dblp:title ?answer }","paraphrases":["In the year 2001 in Internet Res., what are the titles of the research papers on Interface usability?"],"info":{}}
{"id":"train_5960","question":"In Int. J. Softw. Eng. Knowl. Eng. in 1999, what are the titles of the papers on Software engineering?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijseke/AcunaLJM99> dblp:publishedIn 'Int. J. Softw. Eng. Knowl. Eng.' . <https://dblp.org/rec/journals/ijseke/AcunaLJM99> dblp:yearOfPublication '1999' . <https://dblp.org/rec/journals/ijseke/AcunaLJM99> dblp:title ?answer }","paraphrases":["In the year 1999 in Int. J. Softw. Eng. Knowl. Eng., what are the titles of the research papers on Software engineering?"],"info":{}}
{"id":"train_5961","question":"In 2007 in International Teletraffic Congress, who are the authors that published papers about Diagnose compound scan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/itc/HuangCGHCM07> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/itc/HuangCGHCM07> dblp:publishedIn 'ITC' . <https://dblp.org/rec/conf/itc/HuangCGHCM07> dblp:yearOfPublication '2007' }","paraphrases":["Who are the authors that published papers about Diagnose compound scan in ITC in 2007?"],"info":{}}
{"id":"train_5962","question":"In DG.O in 2015, who are the authors that published papers about Government data?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dgo/CorreaCS15> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/dgo/CorreaCS15> dblp:publishedIn 'DG.O' . <https://dblp.org/rec/conf/dgo/CorreaCS15> dblp:yearOfPublication '2015' }","paraphrases":["Who are the authors that published papers about Government data in DG.O in 2015?"],"info":{}}
{"id":"train_5963","question":"In the year 2008 in J. Graph Theory, who are the authors that published research papers about Type degree conditions?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jgt/KostochkaY08> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jgt/KostochkaY08> dblp:publishedIn 'J. Graph Theory' . <https://dblp.org/rec/journals/jgt/KostochkaY08> dblp:yearOfPublication '2008' }","paraphrases":["In 2008 in J. Graph Theory, who are the authors that published papers about Type degree conditions?"],"info":{}}
{"id":"train_5964","question":"In Appl. Math. Lett. in 2020, what are the titles of the papers on Time delay?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/appml/HerronMM20> dblp:publishedIn 'Appl. Math. Lett.' . <https://dblp.org/rec/journals/appml/HerronMM20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/appml/HerronMM20> dblp:title ?answer }","paraphrases":["In 2020 in Appl. Math. Lett., what are the titles of the papers on Time delay?"],"info":{}}
{"id":"train_5965","question":"In the year 2011 in GENSiPS, what are the titles of the research papers on Kalman filter approach?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gensips/NoorSNN11> dblp:publishedIn 'GENSiPS' . <https://dblp.org/rec/conf/gensips/NoorSNN11> dblp:yearOfPublication '2011' . <https://dblp.org/rec/conf/gensips/NoorSNN11> dblp:title ?answer }","paraphrases":["In 2011 in GENSiPS, what are the titles of the papers on Kalman filter approach?"],"info":{}}
{"id":"train_5966","question":"In 2007 in Comput. Math. Appl., who are the authors that published papers about Wave solution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cma/Zhang07a> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/cma/Zhang07a> dblp:publishedIn 'Comput. Math. Appl.' . <https://dblp.org/rec/journals/cma/Zhang07a> dblp:yearOfPublication '2007' }","paraphrases":["In the year 2007 in Comput. Math. Appl., who are the authors that published research papers about Wave solution?"],"info":{}}
{"id":"train_5967","question":"In 2020 in Annu. Rev. Control., what are the titles of the papers on Epidemic waves?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/arc/ScharbargMMC20> dblp:publishedIn 'Annu. Rev. Control.' . <https://dblp.org/rec/journals/arc/ScharbargMMC20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/arc/ScharbargMMC20> dblp:title ?answer }","paraphrases":["In Annu. Rev. Control. in 2020, what are the titles of the papers on Epidemic waves?"],"info":{}}
{"id":"train_5968","question":"In MILCOM in 2018, who are the authors that published papers about Reinforcement learning approach?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/milcom/JohnstonDL18> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/milcom/JohnstonDL18> dblp:publishedIn 'MILCOM' . <https://dblp.org/rec/conf/milcom/JohnstonDL18> dblp:yearOfPublication '2018' }","paraphrases":["Who are the authors that published papers about Reinforcement learning approach in MILCOM in 2018?"],"info":{}}
{"id":"train_5969","question":"In the year 2005 in ICC, who are the authors that published research papers about Routing scheme?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icc/ChuL05> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icc/ChuL05> dblp:publishedIn 'ICC' . <https://dblp.org/rec/conf/icc/ChuL05> dblp:yearOfPublication '2005' }","paraphrases":["In ICC in 2005, who are the authors that published papers about Routing scheme?"],"info":{}}
{"id":"train_5970","question":"What are the titles of the papers on State analysis that were published in Biomed. Signal Process. Control. in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bspc/IbrahimSP14> dblp:publishedIn 'Biomed. Signal Process. Control.' . <https://dblp.org/rec/journals/bspc/IbrahimSP14> dblp:yearOfPublication '2014' . <https://dblp.org/rec/journals/bspc/IbrahimSP14> dblp:title ?answer }","paraphrases":["In 2014 in Biomed. Signal Process. Control., what are the titles of the papers on State analysis?"],"info":{}}
{"id":"train_5971","question":"In 2015 in Educational Data Mining, what are the titles of the papers on Data comprehension?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/edm/Geryk15> dblp:publishedIn 'EDM' . <https://dblp.org/rec/conf/edm/Geryk15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/conf/edm/Geryk15> dblp:title ?answer }","paraphrases":["In the year 2015 in Educational Data Mining, what are the titles of the research papers on Data comprehension?"],"info":{}}
{"id":"train_5973","question":"In PVM/MPI in 1997, who are the authors that published papers about Control activities?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pvm/MysliwiecSS97> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/pvm/MysliwiecSS97> dblp:publishedIn 'PVM/MPI' . <https://dblp.org/rec/conf/pvm/MysliwiecSS97> dblp:yearOfPublication '1997' }","paraphrases":["In the year 1997 in PVM/MPI, who are the authors that published research papers about Control activities?"],"info":{}}
{"id":"train_5974","question":"In the year 2013 in Pattern Recognit., who are the authors that published research papers about Background adaptation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pr/ParkB13> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/pr/ParkB13> dblp:publishedIn 'Pattern Recognit.' . <https://dblp.org/rec/journals/pr/ParkB13> dblp:yearOfPublication '2013' }","paraphrases":["Who are the authors that published papers about Background adaptation in Pattern Recognit. in 2013?"],"info":{}}
{"id":"train_5975","question":"In Signal Process. in 1997, what are the titles of the papers on Dsp algorithms?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sigpro/Akopian97> dblp:publishedIn 'Signal Process.' . <https://dblp.org/rec/journals/sigpro/Akopian97> dblp:yearOfPublication '1997' . <https://dblp.org/rec/journals/sigpro/Akopian97> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Dsp algorithms that were published in Signal Process. in 1997?"],"info":{}}
{"id":"train_5976","question":"In the year 1990 in ECAI, who are the authors that published research papers about Planning knowledge?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ecai/Yang90> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/ecai/Yang90> dblp:publishedIn 'ECAI' . <https://dblp.org/rec/conf/ecai/Yang90> dblp:yearOfPublication '1990' }","paraphrases":["In European Conference on Artificial Intelligence in 1990, who are the authors that published papers about Planning knowledge?"],"info":{}}
{"id":"train_5977","question":"In the year 2007 in Int. J. Data Warehous. Min., what are the titles of the research papers on Series data?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jdwm/SavlaC07> dblp:publishedIn 'Int. J. Data Warehous. Min.' . <https://dblp.org/rec/journals/jdwm/SavlaC07> dblp:yearOfPublication '2007' . <https://dblp.org/rec/journals/jdwm/SavlaC07> dblp:title ?answer }","paraphrases":["In 2007 in Int. J. Data Warehous. Min., what are the titles of the papers on Series data?"],"info":{}}
{"id":"train_5978","question":"In CoRR in 2007, what are the titles of the papers on Signal set?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-0704-2509> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-0704-2509> dblp:yearOfPublication '2007' . <https://dblp.org/rec/journals/corr/abs-0704-2509> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Signal set that were published in CoRR in 2007?"],"info":{}}
{"id":"train_5979","question":"In the year 2021 in CoRR, who are the authors that published research papers about Euler scheme?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2106-03731> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-2106-03731> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2106-03731> dblp:yearOfPublication '2021' }","paraphrases":["In CoRR in 2021, who are the authors that published papers about Euler scheme?"],"info":{}}
{"id":"train_5980","question":"What are the titles of the papers on Time series that were published in Encyclopedia of Complexity and Systems Science in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/reference/complexity/MillsM09> dblp:publishedIn 'Encyclopedia of Complexity and Systems Science' . <https://dblp.org/rec/reference/complexity/MillsM09> dblp:yearOfPublication '2009' . <https://dblp.org/rec/reference/complexity/MillsM09> dblp:title ?answer }","paraphrases":["In the year 2009 in Encyclopedia of Complexity and Systems Science, what are the titles of the research papers on Time series?"],"info":{}}
{"id":"train_5981","question":"In 2021 in CoRR, what are the titles of the papers on Vessel segmentations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2109-13845> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2109-13845> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/corr/abs-2109-13845> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Vessel segmentations that were published in CoRR in 2021?"],"info":{}}
{"id":"train_5982","question":"In 2013 in VISAPP (2), who are the authors that published papers about Projector calibration?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/visapp/MadhkourMG13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/visapp/MadhkourMG13> dblp:publishedIn 'VISAPP (2)' . <https://dblp.org/rec/conf/visapp/MadhkourMG13> dblp:yearOfPublication '2013' }","paraphrases":["Who are the authors that published papers about Projector calibration in VISAPP in 2013?"],"info":{}}
{"id":"train_5983","question":"In Web Intelligence in 2003, what are the titles of the papers on Graph structures?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/webi/Miao03> dblp:publishedIn 'Web Intelligence' . <https://dblp.org/rec/conf/webi/Miao03> dblp:yearOfPublication '2003' . <https://dblp.org/rec/conf/webi/Miao03> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Graph structures that were published in Web Intelligence in 2003?"],"info":{}}
{"id":"train_5984","question":"In Comput. Biol. Medicine in 2019, what are the titles of the papers on Learning approaches?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cbm/MovahedMO19> dblp:publishedIn 'Comput. Biol. Medicine' . <https://dblp.org/rec/journals/cbm/MovahedMO19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/journals/cbm/MovahedMO19> dblp:title ?answer }","paraphrases":["In the year 2019 in Comput. Biol. Medicine, what are the titles of the research papers on Learning approaches?"],"info":{}}
{"id":"train_5985","question":"When was the paper on Storage architecture by LaSIGE/FCUL published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscc/BraulioMMKD18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'LaSIGE/FCUL, Portugal' . <https://dblp.org/rec/conf/iscc/BraulioMMKD18> dblp:yearOfPublication ?answer }","paraphrases":["LaSIGE/FCUL, Portugal published a paper on Storage architecture in what year?"],"info":{}}
{"id":"train_5986","question":"In 2016 in SIAM J. Imaging Sci., who are the authors that published papers about Kernel metrics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/siamis/RoussillonG16> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/siamis/RoussillonG16> dblp:publishedIn 'SIAM J. Imaging Sci.' . <https://dblp.org/rec/journals/siamis/RoussillonG16> dblp:yearOfPublication '2016' }","paraphrases":["In the year 2016 in SIAM J. Imaging Sci., who are the authors that published research papers about Kernel metrics?"],"info":{}}
{"id":"train_5987","question":"What are the titles of the papers on Acronym sense that were published in Int. J. Medical Informatics in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijmi/KashyapBCB20> dblp:publishedIn 'Int. J. Medical Informatics' . <https://dblp.org/rec/journals/ijmi/KashyapBCB20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/ijmi/KashyapBCB20> dblp:title ?answer }","paraphrases":["In 2020 in Int. J. Medical Informatics, what are the titles of the papers on Acronym sense?"],"info":{}}
{"id":"train_5988","question":"In 2018 in Wirel. Commun. Mob. Comput., what are the titles of the papers on Power splitting strategy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/wicomm/WangLYR18> dblp:publishedIn 'Wirel. Commun. Mob. Comput.' . <https://dblp.org/rec/journals/wicomm/WangLYR18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/wicomm/WangLYR18> dblp:title ?answer }","paraphrases":["In Wirel. Commun. Mob. Comput. in 2018, what are the titles of the papers on Power splitting strategy?"],"info":{}}
{"id":"train_5989","question":"In the year 2008 in IEEE/IFIP International Conference on Dependable Systems and Networks, who are the authors that published research papers about Software vulnerabilities?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dsn/LinZX08> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/dsn/LinZX08> dblp:publishedIn 'DSN' . <https://dblp.org/rec/conf/dsn/LinZX08> dblp:yearOfPublication '2008' }","paraphrases":["In DSN in 2008, who are the authors that published papers about Software vulnerabilities?"],"info":{}}
{"id":"train_5990","question":"In the year 2022 in Inf., what are the titles of the research papers on Behavior change?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/information/TajKH22> dblp:publishedIn 'Inf.' . <https://dblp.org/rec/journals/information/TajKH22> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/information/TajKH22> dblp:title ?answer }","paraphrases":["In Inf. in 2022, what are the titles of the papers on Behavior change?"],"info":{}}
{"id":"train_5991","question":"In International ACM SIGACCESS Conference on Computers and Accessibility in 2016, who are the authors that published papers about Design workshop?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/assets/BennettSBDS16> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/assets/BennettSBDS16> dblp:publishedIn 'ASSETS' . <https://dblp.org/rec/conf/assets/BennettSBDS16> dblp:yearOfPublication '2016' }","paraphrases":["In the year 2016 in International ACM SIGACCESS Conference on Computers and Accessibility, who are the authors that published research papers about Design workshop?"],"info":{}}
{"id":"train_5992","question":"In the year 2017 in CoRR, who are the authors that published research papers about Care unit?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/RubinPXDRNM17> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/RubinPXDRNM17> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/RubinPXDRNM17> dblp:yearOfPublication '2017' }","paraphrases":["In CoRR in 2017, who are the authors that published papers about Care unit?"],"info":{}}
{"id":"train_5993","question":"Mention the year in which University of British Columbia published a paper on Spectrum watermarking.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icip/NezhadaryaWW09> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of British Columbia, Vancouver, Canada' . <https://dblp.org/rec/conf/icip/NezhadaryaWW09> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Spectrum watermarking by University of British Columbia, Vancouver, Canada published?"],"info":{}}
{"id":"train_5994","question":"Who are the authors that published papers about Innovation game in RSFDGrC in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/rsfdgrc/Ohsawa09> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/rsfdgrc/Ohsawa09> dblp:publishedIn 'RSFDGrC' . <https://dblp.org/rec/conf/rsfdgrc/Ohsawa09> dblp:yearOfPublication '2009' }","paraphrases":["In the year 2009 in RSFDGrC, who are the authors that published research papers about Innovation game?"],"info":{}}
{"id":"train_5995","question":"In the year 2007 in Advances in Computer Entertainment Technology, what are the titles of the research papers on Guide system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ACMace/KusunokiSMI07> dblp:publishedIn 'Advances in Computer Entertainment Technology' . <https://dblp.org/rec/conf/ACMace/KusunokiSMI07> dblp:yearOfPublication '2007' . <https://dblp.org/rec/conf/ACMace/KusunokiSMI07> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Guide system that were published in Advances in Computer Entertainment Technology in 2007?"],"info":{}}
{"id":"train_5996","question":"In IEEE Trans. Inf. Forensics Secur. in 2009, who are the authors that published papers about Code alteration?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tifs/GardnerGR09> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/tifs/GardnerGR09> dblp:publishedIn 'IEEE Trans. Inf. Forensics Secur.' . <https://dblp.org/rec/journals/tifs/GardnerGR09> dblp:yearOfPublication '2009' }","paraphrases":["Who are the authors that published papers about Code alteration in IEEE Trans. Inf. Forensics Secur. in 2009?"],"info":{}}
{"id":"train_5997","question":"In AINA Workshops in 2012, who are the authors that published papers about Scheduling clusters?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aina/NagauRHD12> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/aina/NagauRHD12> dblp:publishedIn 'AINA Workshops' . <https://dblp.org/rec/conf/aina/NagauRHD12> dblp:yearOfPublication '2012' }","paraphrases":["Who are the authors that published papers about Scheduling clusters in AINA Workshops in 2012?"],"info":{}}
{"id":"train_5998","question":"Mention the year in which University of Waterloo, David R. Cheriton School of Computer Science published a paper on Keyword spotting.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1710-10361> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Waterloo, David R. Cheriton School of Computer Science' . <https://dblp.org/rec/journals/corr/abs-1710-10361> dblp:yearOfPublication ?answer }","paraphrases":["University of Waterloo, David R. Cheriton School of Computer Science published a paper on Keyword spotting in what year?"],"info":{}}
{"id":"train_5999","question":"In the year 2021 in J. Bioinform. Comput. Biol., what are the titles of the research papers on Gene evolution?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jbcb/ChuaTS21> dblp:publishedIn 'J. Bioinform. Comput. Biol.' . <https://dblp.org/rec/journals/jbcb/ChuaTS21> dblp:yearOfPublication '2021' . <https://dblp.org/rec/journals/jbcb/ChuaTS21> dblp:title ?answer }","paraphrases":["In 2021 in J. Bioinform. Comput. Biol., what are the titles of the papers on Gene evolution?"],"info":{}}
{"id":"train_6001","question":"In the year 2009 in ACC, what are the titles of the research papers on Controls modelling?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amcc/Bolender09> dblp:publishedIn 'ACC' . <https://dblp.org/rec/conf/amcc/Bolender09> dblp:yearOfPublication '2009' . <https://dblp.org/rec/conf/amcc/Bolender09> dblp:title ?answer }","paraphrases":["In 2009 in ACC, what are the titles of the papers on Controls modelling?"],"info":{}}
{"id":"train_6002","question":"In 2017 in International Conference on Computer Supported Cooperative Work in Design, what are the titles of the papers on Textrank approach?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cscwd/NanosJIH17> dblp:publishedIn 'CSCWD' . <https://dblp.org/rec/conf/cscwd/NanosJIH17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/conf/cscwd/NanosJIH17> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Textrank approach that were published in CSCWD in 2017?"],"info":{}}
{"id":"train_6003","question":"What are the titles of the papers on Structurization method that were published in IEEE Trans. Robotics Autom. in 1999?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/trob/KimC99> dblp:publishedIn 'IEEE Trans. Robotics Autom.' . <https://dblp.org/rec/journals/trob/KimC99> dblp:yearOfPublication '1999' . <https://dblp.org/rec/journals/trob/KimC99> dblp:title ?answer }","paraphrases":["In 1999 in IEEE Trans. Robotics Autom., what are the titles of the papers on Structurization method?"],"info":{}}
{"id":"train_6004","question":"In the year 2010 in ISIT, what are the titles of the research papers on Distance decoding?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isit/LiDGP10> dblp:publishedIn 'ISIT' . <https://dblp.org/rec/conf/isit/LiDGP10> dblp:yearOfPublication '2010' . <https://dblp.org/rec/conf/isit/LiDGP10> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Distance decoding that were published in IEEE International Symposium on Information Theory in 2010?"],"info":{}}
{"id":"train_6005","question":"In 2012 in AsiaSim, what are the titles of the papers on Information system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/asiasim/ZhouM12> dblp:publishedIn 'AsiaSim (2)' . <https://dblp.org/rec/conf/asiasim/ZhouM12> dblp:yearOfPublication '2012' . <https://dblp.org/rec/conf/asiasim/ZhouM12> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Information system that were published in AsiaSim in 2012?"],"info":{}}
