{"id":"train_1603","question":"Was the paper 'Efficient two-sample designs for microarray experiments with biological replications' not published by Jobst Landgrebe?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/isb/LandgrebeBB04> dblp:authoredBy <https://dblp.org/pid/43/5210> FILTER NOT EXISTS { <https://dblp.org/rec/journals/isb/LandgrebeBB04> dblp:authoredBy <https://dblp.org/pid/43/5210> } }","paraphrases":["Has Jobst Landgrebe not published the paper 'Efficient two-sample designs for microarray experiments with biological replications'?"],"info":{}}
{"id":"train_1604","question":"Have Shun Yang and Natasha A. Flowers not co-authored the paper 'Spacetime Symmetries and Classical Mechanics'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/symmetry/BertschingerFMP19> dblp:authoredBy <https://dblp.org/pid/196/9147> . <https://dblp.org/rec/journals/symmetry/BertschingerFMP19> dblp:authoredBy <https://dblp.org/pid/235/9612> FILTER NOT EXISTS { <https://dblp.org/rec/journals/symmetry/BertschingerFMP19> dblp:authoredBy <https://dblp.org/pid/196/9147> . <https://dblp.org/rec/journals/symmetry/BertschingerFMP19> dblp:authoredBy <https://dblp.org/pid/235/9612> } }","paraphrases":["Was the paper 'Spacetime Symmetries and Classical Mechanics' not co-authored by Shun Yang and Natasha A. Flowers?"],"info":{}}
{"id":"train_1605","question":"Wasn't the paper 'Editorial: special issue on web content mining' not published by the author Bing Liu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigkdd/LiuC04> dblp:authoredBy <https://dblp.org/pid/l/BingLiu1> FILTER NOT EXISTS { <https://dblp.org/rec/journals/sigkdd/LiuC04> dblp:authoredBy <https://dblp.org/pid/l/BingLiu1> } }","paraphrases":["Was the paper 'Editorial: special issue on web content mining' not published by the person Bing L.?"],"info":{}}
{"id":"train_1606","question":"Did Bent S\\u00F8rensen not publish the paper 'A Semiotic Note on Branding' in Cybern. Hum. Knowing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chk/ThellefsenSA07> dblp:authoredBy <https://dblp.org/pid/129/5948> . <https://dblp.org/rec/journals/chk/ThellefsenSA07> dblp:publishedIn 'Cybern. Hum. Knowing' FILTER NOT EXISTS { <https://dblp.org/rec/journals/chk/ThellefsenSA07> dblp:authoredBy <https://dblp.org/pid/129/5948> . <https://dblp.org/rec/journals/chk/ThellefsenSA07> dblp:publishedIn 'Cybern. Hum. Knowing' } }","paraphrases":["Was the paper 'A Semiotic Note on Branding' not published by Bent S\\u00F8rensen in Cybern. Hum. Knowing?"],"info":{}}
{"id":"train_1607","question":"Did Diel, Elisa not publish the paper 'Communication Challenges and Strategies in Distributed DevOps' in ICGSE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icgse/DielMC16> dblp:authoredBy <https://dblp.org/pid/186/8964> . <https://dblp.org/rec/conf/icgse/DielMC16> dblp:publishedIn 'ICGSE' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icgse/DielMC16> dblp:authoredBy <https://dblp.org/pid/186/8964> . <https://dblp.org/rec/conf/icgse/DielMC16> dblp:publishedIn 'ICGSE' } }","paraphrases":["Wasn't the paper 'Communication Challenges and Strategies in Distributed DevOps' published by the author Elisa Diel in IEEE International Conference on Global Software Engineering?"],"info":{}}
{"id":"train_1608","question":"Wasn't the paper 'A survey of shape analysis techniques' not published by the author Loncaric, S.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pr/Loncaric98> dblp:authoredBy <https://dblp.org/pid/l/SvenLoncaric> FILTER NOT EXISTS { <https://dblp.org/rec/journals/pr/Loncaric98> dblp:authoredBy <https://dblp.org/pid/l/SvenLoncaric> } }","paraphrases":["Was the paper 'A survey of shape analysis techniques' not published by Sven Loncaric?"],"info":{}}
{"id":"train_1609","question":"Have Z. Yang and Shiheng W. not co-authored the paper 'Exploring Semantics of Software Artifacts to Improve Requirements Traceability Recovery: A Hybrid Approach'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/apsec/WangLY19> dblp:authoredBy <https://dblp.org/pid/70/2539> . <https://dblp.org/rec/conf/apsec/WangLY19> dblp:authoredBy <https://dblp.org/pid/40/10207> FILTER NOT EXISTS { <https://dblp.org/rec/conf/apsec/WangLY19> dblp:authoredBy <https://dblp.org/pid/70/2539> . <https://dblp.org/rec/conf/apsec/WangLY19> dblp:authoredBy <https://dblp.org/pid/40/10207> } }","paraphrases":["Was the paper 'Exploring Semantics of Software Artifacts to Improve Requirements Traceability Recovery: A Hybrid Approach' not co-authored by Zhen Yang and Shiheng W.?"],"info":{}}
{"id":"train_1610","question":"Have Alan Bulley and Ning Shan not co-authored the paper 'Canadian statistics: evidence for enlightened democracy'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iassist/Bulley05> dblp:authoredBy <https://dblp.org/pid/146/5432> . <https://dblp.org/rec/conf/iassist/Bulley05> dblp:authoredBy <https://dblp.org/pid/42/6415> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iassist/Bulley05> dblp:authoredBy <https://dblp.org/pid/146/5432> . <https://dblp.org/rec/conf/iassist/Bulley05> dblp:authoredBy <https://dblp.org/pid/42/6415> } }","paraphrases":["Was the paper 'Canadian statistics: evidence for enlightened democracy' not co-authored by Bulley, A. and Ning Shan?"],"info":{}}
{"id":"train_1611","question":"Has the paper 'Scale Dependencies and Self-Similarity Through Wavelet Scattering Covariance' not been published by Rudy Morel in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2204-10177> dblp:authoredBy <https://dblp.org/pid/318/9215> . <https://dblp.org/rec/journals/corr/abs-2204-10177> dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2204-10177> dblp:authoredBy <https://dblp.org/pid/318/9215> . <https://dblp.org/rec/journals/corr/abs-2204-10177> dblp:publishedIn 'CoRR' } }","paraphrases":["Wasn't the paper 'Scale Dependencies and Self-Similarity Through Wavelet Scattering Covariance' published by the author Rudy Morel in CoRR?"],"info":{}}
{"id":"train_1612","question":"Was the paper 'Multiclass SVM based spoken hindi numerals recognition' not published by Teena Mittal?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iajit/MittalS15> dblp:authoredBy <https://dblp.org/pid/172/5260> FILTER NOT EXISTS { <https://dblp.org/rec/journals/iajit/MittalS15> dblp:authoredBy <https://dblp.org/pid/172/5260> } }","paraphrases":["Didn't Mittal, Teena publish the paper 'Multiclass SVM based spoken hindi numerals recognition'?"],"info":{}}
{"id":"train_1613","question":"Wasn't the paper 'Autoregressive Belief Propagation for Decoding Block Codes' not published by the person named Lior Wolf?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2103-11780> dblp:authoredBy <https://dblp.org/pid/83/4103> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2103-11780> dblp:authoredBy <https://dblp.org/pid/83/4103> } }","paraphrases":["Did Lior Wolf not publish the paper 'Autoregressive Belief Propagation for Decoding Block Codes'?"],"info":{}}
{"id":"train_1614","question":"Was the paper 'Wireless bandwidth in the making' not published by Sergio V. in IEEE Commun. Mag.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cm/Verdu00> dblp:authoredBy <https://dblp.org/pid/v/SVerdu> . <https://dblp.org/rec/journals/cm/Verdu00> dblp:publishedIn 'IEEE Commun. Mag.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cm/Verdu00> dblp:authoredBy <https://dblp.org/pid/v/SVerdu> . <https://dblp.org/rec/journals/cm/Verdu00> dblp:publishedIn 'IEEE Commun. Mag.' } }","paraphrases":["Has the paper 'Wireless bandwidth in the making' not been published by Sergio Verd\\u00FA in IEEE Commun. Mag.?"],"info":{}}
{"id":"train_1615","question":"Has the paper 'Design and Implementation of an Underlay Control Channel for Cognitive Radios' not been published by Behrouz Farhang-Boroujeny in IEEE J. Sel. Areas Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jsac/WasdenMF12> dblp:authoredBy <https://dblp.org/pid/69/3244> . <https://dblp.org/rec/journals/jsac/WasdenMF12> dblp:publishedIn 'IEEE J. Sel. Areas Commun.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jsac/WasdenMF12> dblp:authoredBy <https://dblp.org/pid/69/3244> . <https://dblp.org/rec/journals/jsac/WasdenMF12> dblp:publishedIn 'IEEE J. Sel. Areas Commun.' } }","paraphrases":["Did Farhang-Boroujeny, B. not publish the paper 'Design and Implementation of an Underlay Control Channel for Cognitive Radios' in IEEE J. Sel. Areas Commun.?"],"info":{}}
{"id":"train_1617","question":"Was the paper 'Ponzi Contracts Detection Based on Improved Convolutional Neural Network' not published by Chen, Shiping in IEEE International Conference on Services Computing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEscc/LouZC20> dblp:authoredBy <https://dblp.org/pid/65/287> . <https://dblp.org/rec/conf/IEEEscc/LouZC20> dblp:publishedIn 'SCC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/IEEEscc/LouZC20> dblp:authoredBy <https://dblp.org/pid/65/287> . <https://dblp.org/rec/conf/IEEEscc/LouZC20> dblp:publishedIn 'SCC' } }","paraphrases":["Has the paper 'Ponzi Contracts Detection Based on Improved Convolutional Neural Network' not been published by Shiping Chen in IEEE International Conference on Services Computing?"],"info":{}}
{"id":"train_1618","question":"Wasn't the paper 'High-Speed Parallel Hardware Architecture for Galois Counter Mode' published by the author Akashi S. in ISCAS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscas/Satoh07> dblp:authoredBy <https://dblp.org/pid/63/2154> . <https://dblp.org/rec/conf/iscas/Satoh07> dblp:publishedIn 'ISCAS' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iscas/Satoh07> dblp:authoredBy <https://dblp.org/pid/63/2154> . <https://dblp.org/rec/conf/iscas/Satoh07> dblp:publishedIn 'ISCAS' } }","paraphrases":["Did Akashi Satoh not publish the paper 'High-Speed Parallel Hardware Architecture for Galois Counter Mode' in ISCAS?"],"info":{}}
{"id":"train_1619","question":"Did D. A. Kapilow not publish the paper 'Tools for real-time signal-processing research' in IEEE Commun. Mag.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cm/SnyderQMK93> dblp:authoredBy <https://dblp.org/pid/59/8233> . <https://dblp.org/rec/journals/cm/SnyderQMK93> dblp:publishedIn 'IEEE Commun. Mag.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cm/SnyderQMK93> dblp:authoredBy <https://dblp.org/pid/59/8233> . <https://dblp.org/rec/journals/cm/SnyderQMK93> dblp:publishedIn 'IEEE Commun. Mag.' } }","paraphrases":["Was the paper 'Tools for real-time signal-processing research' not published by D. A. Kapilow in IEEE Commun. Mag.?"],"info":{}}
{"id":"train_1620","question":"Did Skaf-Molli, H. not publish the paper 'DSMW: a distributed infrastructure for the cooperative edition of semantic wiki documents' in ACM Symposium on Document Engineering?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/doceng/Skaf-MolliCM10> dblp:authoredBy <https://dblp.org/pid/s/HalaSkaf> . <https://dblp.org/rec/conf/doceng/Skaf-MolliCM10> dblp:publishedIn 'ACM Symposium on Document Engineering' FILTER NOT EXISTS { <https://dblp.org/rec/conf/doceng/Skaf-MolliCM10> dblp:authoredBy <https://dblp.org/pid/s/HalaSkaf> . <https://dblp.org/rec/conf/doceng/Skaf-MolliCM10> dblp:publishedIn 'ACM Symposium on Document Engineering' } }","paraphrases":["Was the paper 'DSMW: a distributed infrastructure for the cooperative edition of semantic wiki documents' not published by Skaf-Molli, H. in ACM Symposium on Document Engineering?"],"info":{}}
{"id":"train_1621","question":"Was the paper 'Methods for obtaining robust tracking control laws' not co-authored by William E. Schmitendorf and Lee, S. Jae?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/automatica/Schmitendorf87> dblp:authoredBy <https://dblp.org/pid/59/11374> . <https://dblp.org/rec/journals/automatica/Schmitendorf87> dblp:authoredBy <https://dblp.org/pid/55/378> FILTER NOT EXISTS { <https://dblp.org/rec/journals/automatica/Schmitendorf87> dblp:authoredBy <https://dblp.org/pid/59/11374> . <https://dblp.org/rec/journals/automatica/Schmitendorf87> dblp:authoredBy <https://dblp.org/pid/55/378> } }","paraphrases":["Did William E. Schmitendorf and Seong Jae Lee not co-author the paper 'Methods for obtaining robust tracking control laws'?"],"info":{}}
{"id":"train_1622","question":"Was the paper 'Acoustic analysis of imitated voice produced by a professional impersonator' not published by Tatsuya K. in Interspeech?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/interspeech/Kitamura08> dblp:authoredBy <https://dblp.org/pid/52/3517> . <https://dblp.org/rec/conf/interspeech/Kitamura08> dblp:publishedIn 'INTERSPEECH' FILTER NOT EXISTS { <https://dblp.org/rec/conf/interspeech/Kitamura08> dblp:authoredBy <https://dblp.org/pid/52/3517> . <https://dblp.org/rec/conf/interspeech/Kitamura08> dblp:publishedIn 'INTERSPEECH' } }","paraphrases":["Wasn't the paper 'Acoustic analysis of imitated voice produced by a professional impersonator' published by the author Tatsuya Kitamura in Interspeech?"],"info":{}}
{"id":"train_1623","question":"Was the paper 'Multi-Scale Cost Volumes Cascade Network for Stereo Matching' not co-authored by Jia, X. and Chen, Wei?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icra/JiaCLLWTH21> dblp:authoredBy <https://dblp.org/pid/23/10777> . <https://dblp.org/rec/conf/icra/JiaCLLWTH21> dblp:authoredBy <https://dblp.org/pid/c/WeiChen9> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icra/JiaCLLWTH21> dblp:authoredBy <https://dblp.org/pid/23/10777> . <https://dblp.org/rec/conf/icra/JiaCLLWTH21> dblp:authoredBy <https://dblp.org/pid/c/WeiChen9> } }","paraphrases":["Did Xiaogang Jia and Chen, Wei not co-author the paper 'Multi-Scale Cost Volumes Cascade Network for Stereo Matching'?"],"info":{}}
{"id":"train_1625","question":"Did Y. Yang and Junqing Y. not co-author the paper 'Adversarial Style Mining for One-Shot Unsupervised Domain Adaptation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nips/LuoLGY020> dblp:authoredBy <https://dblp.org/pid/33/4854-1> . <https://dblp.org/rec/conf/nips/LuoLGY020> dblp:authoredBy <https://dblp.org/pid/79/1515> FILTER NOT EXISTS { <https://dblp.org/rec/conf/nips/LuoLGY020> dblp:authoredBy <https://dblp.org/pid/33/4854-1> . <https://dblp.org/rec/conf/nips/LuoLGY020> dblp:authoredBy <https://dblp.org/pid/79/1515> } }","paraphrases":["Was the paper 'Adversarial Style Mining for One-Shot Unsupervised Domain Adaptation' not co-authored by Yi Yang and Junqing Yu?"],"info":{}}
{"id":"train_1626","question":"Was the paper 'Using extended Kalman filter for failure detection and prognostic of degradation process in feedback control system' not published by Mohamed Hedi Moulahi in J. Syst. Control. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jsce/MoulahiH22> dblp:authoredBy <https://dblp.org/pid/272/0034> . <https://dblp.org/rec/journals/jsce/MoulahiH22> dblp:publishedIn 'J. Syst. Control. Eng.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jsce/MoulahiH22> dblp:authoredBy <https://dblp.org/pid/272/0034> . <https://dblp.org/rec/journals/jsce/MoulahiH22> dblp:publishedIn 'J. Syst. Control. Eng.' } }","paraphrases":["Has the paper 'Using extended Kalman filter for failure detection and prognostic of degradation process in feedback control system' not been published by M. Hedi Moulahi in J. Syst. Control. Eng.?"],"info":{}}
{"id":"train_1627","question":"Was the paper 'Simulation of Orientation Contrast Sensitive Cell Behavior in TiViPE' not published by Lourens, Tino in IWINAC (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwinac/LourensB05> dblp:authoredBy <https://dblp.org/pid/81/6566> . <https://dblp.org/rec/conf/iwinac/LourensB05> dblp:publishedIn 'IWINAC (1)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iwinac/LourensB05> dblp:authoredBy <https://dblp.org/pid/81/6566> . <https://dblp.org/rec/conf/iwinac/LourensB05> dblp:publishedIn 'IWINAC (1)' } }","paraphrases":["Did Tino Lourens not publish the paper 'Simulation of Orientation Contrast Sensitive Cell Behavior in TiViPE' in International Work-conference on the Interplay between Natural and Artificial Computation?"],"info":{}}
{"id":"train_1628","question":"Was the paper 'Sample Complexity Bounds for Differentially Private Learning' not published by the person Chaudhuri, Kamalika?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jmlr/ChaudhuriH11> dblp:authoredBy <https://dblp.org/pid/56/6435> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jmlr/ChaudhuriH11> dblp:authoredBy <https://dblp.org/pid/56/6435> } }","paraphrases":["Did Chaudhuri, Kamalika not publish the paper 'Sample Complexity Bounds for Differentially Private Learning'?"],"info":{}}
{"id":"train_1629","question":"Was the paper 'Stochastic Modeling of Distributed, Dynamic, Randomized Clustering Protocols for Wireless Sensor Networks' not co-authored by Glen Takahara and Hossam S. Hassanein?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icppw/WangHT04> dblp:authoredBy <https://dblp.org/pid/76/3272> . <https://dblp.org/rec/conf/icppw/WangHT04> dblp:authoredBy <https://dblp.org/pid/07/3173> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icppw/WangHT04> dblp:authoredBy <https://dblp.org/pid/76/3272> . <https://dblp.org/rec/conf/icppw/WangHT04> dblp:authoredBy <https://dblp.org/pid/07/3173> } }","paraphrases":["Did G. Takahara and Hossam S. Hassanein not co-author the paper 'Stochastic Modeling of Distributed, Dynamic, Randomized Clustering Protocols for Wireless Sensor Networks'?"],"info":{}}
{"id":"train_1630","question":"Has the paper 'Optical networks special issue based on selected IEEE ICOCN 2014 papers' not been published by Jason P. Jue in Photonic Netw. Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/pnc/ShenCZJ16> dblp:authoredBy <https://dblp.org/pid/28/4351> . <https://dblp.org/rec/journals/pnc/ShenCZJ16> dblp:publishedIn 'Photonic Netw. Commun.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/pnc/ShenCZJ16> dblp:authoredBy <https://dblp.org/pid/28/4351> . <https://dblp.org/rec/journals/pnc/ShenCZJ16> dblp:publishedIn 'Photonic Netw. Commun.' } }","paraphrases":["Was the paper 'Optical networks special issue based on selected IEEE ICOCN 2014 papers' not published by J. P. Jue in Photonic Netw. Commun.?"],"info":{}}
{"id":"train_1632","question":"Wasn't the paper 'Hybrid predictive modelling: Thyrotoxic atrial fibrillation case' not published by the author Alina Y. Babenko?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jocs/DerevitskiiSBK21> dblp:authoredBy <https://dblp.org/pid/264/2049> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jocs/DerevitskiiSBK21> dblp:authoredBy <https://dblp.org/pid/264/2049> } }","paraphrases":["Was the paper 'Hybrid predictive modelling: Thyrotoxic atrial fibrillation case' not published by Alina Y. Babenko?"],"info":{}}
{"id":"train_1633","question":"Wasn't the paper 'The Role of Frame-Based Representation in Reasoning' published by the author Richard Fikes in Commun. ACM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacm/FikesK85> dblp:authoredBy <https://dblp.org/pid/f/RichardFikes> . <https://dblp.org/rec/journals/cacm/FikesK85> dblp:publishedIn 'Commun. ACM' FILTER NOT EXISTS { <https://dblp.org/rec/journals/cacm/FikesK85> dblp:authoredBy <https://dblp.org/pid/f/RichardFikes> . <https://dblp.org/rec/journals/cacm/FikesK85> dblp:publishedIn 'Commun. ACM' } }","paraphrases":["Was the paper 'The Role of Frame-Based Representation in Reasoning' not published by Richard Fikes in Commun. ACM?"],"info":{}}
{"id":"train_1635","question":"Did Haipeng Yang not publish the paper 'A Reduced Mixed Representation Based Multi-Objective Evolutionary Algorithm for Large-Scale Overlapping Community Detection' in IEEE Congress on Evolutionary Computation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cec/LuoZYLL0S21> dblp:authoredBy <https://dblp.org/pid/214/5686> . <https://dblp.org/rec/conf/cec/LuoZYLL0S21> dblp:publishedIn 'CEC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cec/LuoZYLL0S21> dblp:authoredBy <https://dblp.org/pid/214/5686> . <https://dblp.org/rec/conf/cec/LuoZYLL0S21> dblp:publishedIn 'CEC' } }","paraphrases":["Has the paper 'A Reduced Mixed Representation Based Multi-Objective Evolutionary Algorithm for Large-Scale Overlapping Community Detection' not been published by Yang, Haipeng in CEC?"],"info":{}}
{"id":"train_1636","question":"Did Muhammad Asad Khan and Uzmi, Z. Afzal not co-author the paper 'Social Groups Based Content Caching in Wireless Networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mobiwac/MustafaKKU21> dblp:authoredBy <https://dblp.org/pid/27/9281> . <https://dblp.org/rec/conf/mobiwac/MustafaKKU21> dblp:authoredBy <https://dblp.org/pid/75/3860> FILTER NOT EXISTS { <https://dblp.org/rec/conf/mobiwac/MustafaKKU21> dblp:authoredBy <https://dblp.org/pid/27/9281> . <https://dblp.org/rec/conf/mobiwac/MustafaKKU21> dblp:authoredBy <https://dblp.org/pid/75/3860> } }","paraphrases":["Was the paper 'Social Groups Based Content Caching in Wireless Networks' not co-authored by Khan, M. Asad and Uzmi, Z. Afzal?"],"info":{}}
{"id":"train_1637","question":"Wasn't the paper 'Relaxing of flexible RDF queries: A relative proximity relation-based approach' not published by the author Zhang, F.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jifs/TongCZ17> dblp:authoredBy <https://dblp.org/pid/03/4774-1> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jifs/TongCZ17> dblp:authoredBy <https://dblp.org/pid/03/4774-1> } }","paraphrases":["Didn't Zhang, F. publish the paper 'Relaxing of flexible RDF queries: A relative proximity relation-based approach'?"],"info":{}}
{"id":"train_1638","question":"Was the paper 'Human Trajectory Prediction with Social Information Encoding' not co-authored by He, L. and Yue Zhou?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/prcv/RenZH18> dblp:authoredBy <https://dblp.org/pid/30/1513> . <https://dblp.org/rec/conf/prcv/RenZH18> dblp:authoredBy <https://dblp.org/pid/78/6191-5> FILTER NOT EXISTS { <https://dblp.org/rec/conf/prcv/RenZH18> dblp:authoredBy <https://dblp.org/pid/30/1513> . <https://dblp.org/rec/conf/prcv/RenZH18> dblp:authoredBy <https://dblp.org/pid/78/6191-5> } }","paraphrases":["Did Liming He and Yue Zhou not co-author the paper 'Human Trajectory Prediction with Social Information Encoding'?"],"info":{}}
{"id":"train_1639","question":"Wasn't the paper 'The moral limits of the market: the case of consumer scoring data' not published by the author A. Pham?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ethicsit/PhamC19> dblp:authoredBy <https://dblp.org/pid/222/7687> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ethicsit/PhamC19> dblp:authoredBy <https://dblp.org/pid/222/7687> } }","paraphrases":["Was the paper 'The moral limits of the market: the case of consumer scoring data' not published by the person A. Pham?"],"info":{}}
{"id":"train_1641","question":"Was the paper 'Compiling a Partition-Based Two-Level Formalism' not co-authored by Stephen G. Pulman and Edmund Grimley-Evans?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/coling/EvansKP96> dblp:authoredBy <https://dblp.org/pid/86/5978> . <https://dblp.org/rec/conf/coling/EvansKP96> dblp:authoredBy <https://dblp.org/pid/03/5895> FILTER NOT EXISTS { <https://dblp.org/rec/conf/coling/EvansKP96> dblp:authoredBy <https://dblp.org/pid/86/5978> . <https://dblp.org/rec/conf/coling/EvansKP96> dblp:authoredBy <https://dblp.org/pid/03/5895> } }","paraphrases":["Have Stephen G. Pulman and Edmund Grimley-Evans not co-authored the paper 'Compiling a Partition-Based Two-Level Formalism'?"],"info":{}}
{"id":"train_1642","question":"Wasn't the paper 'Applicability of Machine Learning Methods to Multi-label Medical Text Classification' not published by the person named Lenivtceva, Iuliia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iccS/LenivtcevaSKK20> dblp:authoredBy <https://dblp.org/pid/267/8275> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iccS/LenivtcevaSKK20> dblp:authoredBy <https://dblp.org/pid/267/8275> } }","paraphrases":["Was the paper 'Applicability of Machine Learning Methods to Multi-label Medical Text Classification' not published by Lenivtceva, Iuliia?"],"info":{}}
{"id":"train_1644","question":"Was the paper 'An Evaluation of Information Highlighting Methods on Computer Screens Using an Eye Movement Monitor' not co-authored by Reza Pouraghabagher and Douglas B.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/PouraghabagherB93> dblp:authoredBy <https://dblp.org/pid/99/3994> . <https://dblp.org/rec/conf/hci/PouraghabagherB93> dblp:authoredBy <https://dblp.org/pid/65/521> FILTER NOT EXISTS { <https://dblp.org/rec/conf/hci/PouraghabagherB93> dblp:authoredBy <https://dblp.org/pid/99/3994> . <https://dblp.org/rec/conf/hci/PouraghabagherB93> dblp:authoredBy <https://dblp.org/pid/65/521> } }","paraphrases":["Did Reza Pouraghabagher and Douglas B. not co-author the paper 'An Evaluation of Information Highlighting Methods on Computer Screens Using an Eye Movement Monitor'?"],"info":{}}
{"id":"train_1647","question":"Did Ivo J. P. M. Tim\\u00F3teo not publish the paper 'Learning Dynamic Systems from Time-series Data - An Application to Gene Regulatory Networks' in ICPRAM (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icpram/TimoteoH15> dblp:authoredBy <https://dblp.org/pid/05/9592> . <https://dblp.org/rec/conf/icpram/TimoteoH15> dblp:publishedIn 'ICPRAM (2)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icpram/TimoteoH15> dblp:authoredBy <https://dblp.org/pid/05/9592> . <https://dblp.org/rec/conf/icpram/TimoteoH15> dblp:publishedIn 'ICPRAM (2)' } }","paraphrases":["Wasn't the paper 'Learning Dynamic Systems from Time-series Data - An Application to Gene Regulatory Networks' published by the author Ivo J. P. M. Tim\\u00F3teo in ICPRAM (2)?"],"info":{}}
{"id":"train_1648","question":"Did Deborah J. Armstrong not publish the paper 'Who needs the help desk? Tackling one's own technological problem via self IT service' in Inf. Organ.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iando/ZazaJA21> dblp:authoredBy <https://dblp.org/pid/68/306> . <https://dblp.org/rec/journals/iando/ZazaJA21> dblp:publishedIn 'Inf. Organ.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/iando/ZazaJA21> dblp:authoredBy <https://dblp.org/pid/68/306> . <https://dblp.org/rec/journals/iando/ZazaJA21> dblp:publishedIn 'Inf. Organ.' } }","paraphrases":["Was the paper 'Who needs the help desk? Tackling one's own technological problem via self IT service' not published by Deborah J. Armstrong in Inf. Organ.?"],"info":{}}
{"id":"train_1649","question":"Was the paper 'Enrollments explode! but diversity students are leaving' not published by Maggie Johnson?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacm/CerfJ16> dblp:authoredBy <https://dblp.org/pid/97/7913> FILTER NOT EXISTS { <https://dblp.org/rec/journals/cacm/CerfJ16> dblp:authoredBy <https://dblp.org/pid/97/7913> } }","paraphrases":["Didn't Maggie Johnson publish the paper 'Enrollments explode! but diversity students are leaving'?"],"info":{}}
{"id":"train_1650","question":"Was the paper 'An improved scheme of audio watermarking based on turbo codes and channel effect modeling' not co-authored by Majoul, Taoufik and Ja\\u00EFdane, Meriem?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/MajoulRJ11> dblp:authoredBy <https://dblp.org/pid/95/9878> . <https://dblp.org/rec/conf/icassp/MajoulRJ11> dblp:authoredBy <https://dblp.org/pid/42/6610> FILTER NOT EXISTS { <https://dblp.org/rec/conf/icassp/MajoulRJ11> dblp:authoredBy <https://dblp.org/pid/95/9878> . <https://dblp.org/rec/conf/icassp/MajoulRJ11> dblp:authoredBy <https://dblp.org/pid/42/6610> } }","paraphrases":["Did Taoufik Majoul and Ja\\u00EFdane, Meriem not co-author the paper 'An improved scheme of audio watermarking based on turbo codes and channel effect modeling'?"],"info":{}}
{"id":"train_1651","question":"Was the paper 'Prime forms and minimal change in propositional belief bases' not co-authored by Guilherme Bittencourt and Perrussel, Laurent?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amai/MarchiBP10> dblp:authoredBy <https://dblp.org/pid/64/1847> . <https://dblp.org/rec/journals/amai/MarchiBP10> dblp:authoredBy <https://dblp.org/pid/79/5272> FILTER NOT EXISTS { <https://dblp.org/rec/journals/amai/MarchiBP10> dblp:authoredBy <https://dblp.org/pid/64/1847> . <https://dblp.org/rec/journals/amai/MarchiBP10> dblp:authoredBy <https://dblp.org/pid/79/5272> } }","paraphrases":["Have G. Bittencourt and Laurent Perrussel not co-authored the paper 'Prime forms and minimal change in propositional belief bases'?"],"info":{}}
{"id":"train_1653","question":"Has the paper 'A novel recurrent neural network and its finite-time solution to time-varying complex matrix inversion' not been published by Yongsheng Z. in Neurocomputing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijon/XiaoZLLT19> dblp:authoredBy <https://dblp.org/pid/55/6614> . <https://dblp.org/rec/journals/ijon/XiaoZLLT19> dblp:publishedIn 'Neurocomputing' FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijon/XiaoZLLT19> dblp:authoredBy <https://dblp.org/pid/55/6614> . <https://dblp.org/rec/journals/ijon/XiaoZLLT19> dblp:publishedIn 'Neurocomputing' } }","paraphrases":["Wasn't the paper 'A novel recurrent neural network and its finite-time solution to time-varying complex matrix inversion' published by the author Yongsheng Z. in Neurocomputing?"],"info":{}}
{"id":"train_1654","question":"Was the paper 'Observer-based indirect adaptive fuzzy control for SISO nonlinear systems with unknown gain sign' not published by Wuxi Shi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijon/Shi16> dblp:authoredBy <https://dblp.org/pid/12/8492> FILTER NOT EXISTS { <https://dblp.org/rec/journals/ijon/Shi16> dblp:authoredBy <https://dblp.org/pid/12/8492> } }","paraphrases":["Wasn't the paper 'Observer-based indirect adaptive fuzzy control for SISO nonlinear systems with unknown gain sign' not published by the person named Wuxi Shi?"],"info":{}}
