{"id":"train_3029","question":"Report the count of papers that Kazuhiro Suzuki has published in Graphs Comb..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/01/3109> . ?answer dblp:publishedIn 'Graphs Comb.' }","paraphrases":["Count the number of papers that Suzuki, Kazuhiro has published in Graphs Comb.."],"info":{}}
{"id":"train_3030","question":"How many co-authors does Xudong L. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/15/3008> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/15/3008> ) }","paraphrases":["Count the number of co-authors that Xudong L. has."],"info":{}}
{"id":"train_3032","question":"Count the number of co-authors that Filipe R. Cordeiro has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/75/6833> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/75/6833> ) }","paraphrases":["How many co-authors does Filipe R. Cordeiro have?"],"info":{}}
{"id":"train_3033","question":"Count the number of co-authors that Shaaban, Khaled M. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/62/7281> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/62/7281> ) }","paraphrases":["How many co-authors does Khaled M. Shaaban have?"],"info":{}}
{"id":"train_3034","question":"Count the number of co-authors that Anil Y\\u00FCce has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/134/1533> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/134/1533> ) }","paraphrases":["How many co-authors does A. Y\\u00FCce have?"],"info":{}}
{"id":"train_3035","question":"How many papers has Alireza Eydi published in Reliab. Eng. Syst. Saf.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/192/5489> . ?answer dblp:publishedIn 'Reliab. Eng. Syst. Saf.' }","paraphrases":["Report the count of papers that Alireza Eydi has published in Reliab. Eng. Syst. Saf.."],"info":{}}
{"id":"train_3038","question":"Count the number of co-authors that Michael K. Reiter has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/r/MichaelKReiter> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/r/MichaelKReiter> ) }","paraphrases":["How many co-authors does Michael K. Reiter have?"],"info":{}}
{"id":"train_3039","question":"Count the number of co-authors that Tuvi Etzion has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/58/5154> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/58/5154> ) }","paraphrases":["How many co-authors does Tuvi E. have?"],"info":{}}
{"id":"train_3040","question":"Count the number of co-authors that Juan Caballero has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/35/3587> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/35/3587> ) }","paraphrases":["How many co-authors does Caballero, Juan have?"],"info":{}}
{"id":"train_3041","question":"How many research papers has Yuchen L. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/69/10440> }","paraphrases":["Mention the number of papers that Yuchen Liu has published."],"info":{}}
{"id":"train_3042","question":"What is the average number of co-authors for research papers published by Pogge, H. Bernhard?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/42/964> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Pogge, H. Bernhard?"],"info":{}}
{"id":"train_3043","question":"Report the average number of publications by Yining Wu per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/57/7065> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Yining Wu per year?"],"info":{}}
{"id":"train_3045","question":"What is the average number of research papers published by the author Varvara Antoniou per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/201/3077> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Varvara Antoniou per year?"],"info":{}}
{"id":"train_3047","question":"What is the average number of papers published by B. Lin per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/l/BillLin> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Bill Lin per year."],"info":{}}
{"id":"train_3048","question":"What is the average number of research papers published by the author Ricardo Quintero per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/17/5380> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by R. Quintero per year?"],"info":{}}
{"id":"train_3049","question":"What is the average number of co-authors for research papers published by Gustaf S\\u00F6derlind?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/26/1608> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["Report the average number of co-authors for publications published by S\\u00F6derlind, Gustaf."],"info":{}}
{"id":"train_3050","question":"What is the average number of papers published by Volker W. per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/w/VWeispfenning> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Volker W. per year?"],"info":{}}
{"id":"train_3051","question":"What is the average number of papers published by G. Zheng per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/273/5741> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Guan Zheng per year."],"info":{}}
{"id":"train_3053","question":"Report the average number of co-authors for publications published by Archanaa S. Krishnan.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/212/9543> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Krishnan, A. S.?"],"info":{}}
{"id":"train_3054","question":"How many papers has Rosileia Milagres published in Bus. Process. Manag. J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/244/9066> . ?answer dblp:publishedIn 'Bus. Process. Manag. J.' }","paraphrases":["In Bus. Process. Manag. J., how many papers has Milagres, R. published?"],"info":{}}
{"id":"train_3055","question":"Count the number of papers that MariNieves Pardo-Rodriguez has published in EMBC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/277/6837> . ?answer dblp:publishedIn 'EMBC' }","paraphrases":["How many papers has MariNieves Pardo-Rodriguez published in EMBC?"],"info":{}}
{"id":"train_3056","question":"How many papers has Elisa Gugliotta published in JEP-TALN-RECITAL (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/192/8763> . ?answer dblp:publishedIn 'JEP-TALN-RECITAL (2)' }","paraphrases":["Report the count of papers that Gugliotta, E. has published in JEP-TALN-RECITAL (2)."],"info":{}}
{"id":"train_3057","question":"Count the number of papers that Ling Z. has published in IEEE Access.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/80/2999> . ?answer dblp:publishedIn 'IEEE Access' }","paraphrases":["Report the count of papers that Ling Zou has published in IEEE Access."],"info":{}}
{"id":"train_3058","question":"How many co-authors does J. Flynn Fee have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/123/2030> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/123/2030> ) }","paraphrases":["Count the number of co-authors that Joan Flynn Fee has."],"info":{}}
{"id":"train_3059","question":"Report the average number of co-authors for publications published by Li, X..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/66/2069> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Xiao Li?"],"info":{}}
{"id":"train_3060","question":"Report the average number of publications by Gluck, M. A. per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/33/3118> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Gluck, M. A. per year?"],"info":{}}
{"id":"train_3061","question":"What is the average number of papers published by Anand Kumar Madasamy per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/186/7709> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Anand Kumar Madasamy per year?"],"info":{}}
{"id":"train_3062","question":"Report the average number of publications by Cimini, Gionata per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/154/6043> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Gionata Cimini per year?"],"info":{}}
{"id":"train_3063","question":"What is the average number of papers published by E. Formenti per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/98/3810> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by E. Formenti per year."],"info":{}}
{"id":"train_3064","question":"How many research papers has Trygve Thomessen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/155/1154> }","paraphrases":["How many papers has Trygve Thomessen published?"],"info":{}}
{"id":"train_3065","question":"How many papers has Haim S. published in Conference on Learning Theory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/s/HaimSchweitzer> . ?answer dblp:publishedIn 'COLT' }","paraphrases":["Count the number of papers that Haim S. has published in Conference on Learning Theory."],"info":{}}
{"id":"train_3066","question":"What is the average number of co-authors for papers published by Sundararaman Rajagopalan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/224/7637> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Sundararaman Rajagopalan?"],"info":{}}
{"id":"train_3067","question":"How many research papers has Ruihai Dong published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/94/11082> }","paraphrases":["How many papers has Ruihai Dong published?"],"info":{}}
{"id":"train_3068","question":"Count the number of papers that Soldani, David has published in ITNAC.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/12/6968> . ?answer dblp:publishedIn 'ITNAC' }","paraphrases":["Report the count of papers that Soldani, David has published in International Telecommunication Networks and Applications Conference."],"info":{}}
{"id":"train_3069","question":"How many co-authors does O. Lysne have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/l/OlavLysne> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/l/OlavLysne> ) }","paraphrases":["Count the number of co-authors that O. Lysne has."],"info":{}}
{"id":"train_3070","question":"How many research papers has Nicolas Usunier published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/3983> }","paraphrases":["How many papers has N. Usunier published?"],"info":{}}
{"id":"train_3072","question":"What is the average number of papers published by Frank S. de Boer per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/b/DSsBoer> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Frank S. de Boer per year?"],"info":{}}
{"id":"train_3073","question":"What is the average number of co-authors for papers published by Z. Yu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/156/7811> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["Report the average number of co-authors for publications published by Zhonggen Yu."],"info":{}}
{"id":"train_3074","question":"What is the average number of papers published by Roy, A. per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/1746> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Arijit Roy per year?"],"info":{}}
{"id":"train_3075","question":"What is the average number of co-authors for papers published by Carlos Mena?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/213/2084> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Carlos Mena?"],"info":{}}
{"id":"train_3077","question":"Report the average number of publications by K. Pohl per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/p/KlausPohl> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Klaus Pohl per year?"],"info":{}}
{"id":"train_3078","question":"Mention the number of papers that B. McMillan has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/76/2058> }","paraphrases":["How many research papers has Brockway McMillan published?"],"info":{}}
{"id":"train_3079","question":"What is the average number of co-authors for research papers published by Mathieu Bernard?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/72/8556> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Mathieu Bernard?"],"info":{}}
{"id":"train_3081","question":"Report the average number of publications by K. Mkhwanazi per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/314/3274> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author K. Mkhwanazi per year?"],"info":{}}
{"id":"train_3083","question":"Mention the number of papers that Elham S. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/70/612> }","paraphrases":["How many research papers has Elham Semsar-Kazerooni published?"],"info":{}}
{"id":"train_3084","question":"How many research papers has Carl Hewitt published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/h/CarlHewitt> }","paraphrases":["How many papers has C. Hewitt published?"],"info":{}}
{"id":"train_3085","question":"Mention the number of papers that Liu, Feng has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/77/1318> }","paraphrases":["How many papers has Liu, Feng published?"],"info":{}}
{"id":"train_3086","question":"Count the number of co-authors that Ban, H. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/2480> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/19/2480> ) }","paraphrases":["How many co-authors does Ban, H. have?"],"info":{}}
{"id":"train_3087","question":"How many papers has Di Shen published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/190/5637> }","paraphrases":["How many research papers has Di S. published?"],"info":{}}
{"id":"train_3088","question":"What is the average number of research papers published by the author Rahim Hosseini per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/271/6550> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by R. Hosseini per year?"],"info":{}}
{"id":"train_3089","question":"Count the number of co-authors that Ignacio S. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/70/310> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/70/310> ) }","paraphrases":["How many co-authors does Ignacio S. have?"],"info":{}}
{"id":"train_3092","question":"How many papers has V. Rosa Meireles Elias published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/316/9521> }","paraphrases":["Mention the number of papers that Vitor Rosa Meireles Elias has published."],"info":{}}
{"id":"train_3093","question":"How many co-authors does Kirubaveni S. have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/310/2563> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/310/2563> ) }","paraphrases":["Count the number of co-authors that Kirubaveni S. has."],"info":{}}
{"id":"train_3094","question":"What is the average number of papers published by F. Jiang per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/58/3794> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author Fan Jiang per year?"],"info":{}}
{"id":"train_3095","question":"Count the number of co-authors that Hussmann, Stephan has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/26/19> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/26/19> ) }","paraphrases":["How many co-authors does Hussmann, Stephan have?"],"info":{}}
{"id":"train_3096","question":"Count the number of co-authors that Yamamoto, Koji has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/07/3340-1> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/07/3340-1> ) }","paraphrases":["How many co-authors does Yamamoto, Koji have?"],"info":{}}
{"id":"train_3097","question":"Mention the number of papers that Cerda, Mauricio has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/2682> }","paraphrases":["How many research papers has Mauricio Cerda published?"],"info":{}}
{"id":"train_3098","question":"Count the number of co-authors that Mezei, J\\u00F3zsef has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/28/7651> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/28/7651> ) }","paraphrases":["How many co-authors does Mezei, J\\u00F3zsef have?"],"info":{}}
{"id":"train_3099","question":"Report the average number of publications by B. Soh per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/725> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of research papers published by the author B. Soh per year?"],"info":{}}
{"id":"train_3100","question":"Count the number of papers that F. Li has published in IEEE J. Sel. Top. Appl. Earth Obs. Remote. Sens..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/73/237> . ?answer dblp:publishedIn 'IEEE J. Sel. Top. Appl. Earth Obs. Remote. Sens.' }","paraphrases":["How many papers has Fan Li published in IEEE J. Sel. Top. Appl. Earth Obs. Remote. Sens.?"],"info":{}}
{"id":"train_3101","question":"Count the number of co-authors that Natarajan M. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/12/3598> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/12/3598> ) }","paraphrases":["How many co-authors does Natarajan M. have?"],"info":{}}
{"id":"train_3102","question":"How many research papers has Murat Saraclar published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/1394> }","paraphrases":["Mention the number of papers that Murat Saraclar has published."],"info":{}}
{"id":"train_3104","question":"What is the average number of co-authors for research papers published by Munteanu, Cristian?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/42/4751> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Cristian Munteanu?"],"info":{}}
{"id":"train_3105","question":"Report the count of papers that Chia-Shiang Tseng has published in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/92/8574> . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["How many papers has Chia-Shiang Tseng published in CoRR?"],"info":{}}
{"id":"train_3106","question":"What is the average number of co-authors for papers published by Michael Vynnycky?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/43/3744> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Michael Vynnycky?"],"info":{}}
{"id":"train_3107","question":"Report the average number of co-authors for publications published by Guo, Licheng.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/226/3843> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Guo, Licheng?"],"info":{}}
{"id":"train_3108","question":"How many papers has Arun Sojan published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/306/1085> }","paraphrases":["How many research papers has Sojan, Arun published?"],"info":{}}
{"id":"train_3109","question":"Report the count of papers that Waranya Mahanan has published in EIDWT.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/160/4840> . ?answer dblp:publishedIn 'EIDWT' }","paraphrases":["How many papers has Mahanan, W. published in EIDWT?"],"info":{}}
{"id":"train_3110","question":"How many co-authors does Kazuya Kobayashi have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/22/10007> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/22/10007> ) }","paraphrases":["Count the number of co-authors that Kazuya Kobayashi has."],"info":{}}
{"id":"train_3111","question":"Report the average number of co-authors for publications published by F. Lecumberry.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/79/8108> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by F. Lecumberry?"],"info":{}}
{"id":"train_3112","question":"What is the average number of research papers published by the author Zanchettin, Andrea Maria per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/13/8366> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Andrea Maria Zanchettin per year?"],"info":{}}
{"id":"train_3113","question":"Report the average number of co-authors for publications published by Peeters, M..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/3039> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Peeters, M.?"],"info":{}}
{"id":"train_3114","question":"Count the number of papers that Hirotoshi Y. has published in J. Robotics Mechatronics.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/191/5411> . ?answer dblp:publishedIn 'J. Robotics Mechatronics' }","paraphrases":["How many papers has Hirotoshi Yamamoto published in J. Robotics Mechatronics?"],"info":{}}
{"id":"train_3115","question":"Mention the number of papers that Tilove, R. B. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/15/5522> }","paraphrases":["How many papers has Tilove, R. B. published?"],"info":{}}
{"id":"train_3117","question":"How many co-authors does Markus T\\u00F6rm\\u00E4nen have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/10350> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/53/10350> ) }","paraphrases":["Count the number of co-authors that Markus T\\u00F6rm\\u00E4nen has."],"info":{}}
{"id":"train_3118","question":"How many co-authors does Gerry Reid have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/14/6003> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/14/6003> ) }","paraphrases":["Count the number of co-authors that G. Reid has."],"info":{}}
