{"id":"train_4774","question":"Did the authors of the publication 'Exploring system architectures in AADL via Polychrony and SynDEx' also publish a publication in ISPAN?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fcsc/YuMGBTGS13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/fcsc/YuMGBTGS13> ) . ?y dblp:publishedIn 'ISPAN' }","paraphrases":["Did the authors of 'Exploring system architectures in AADL via Polychrony and SynDEx' also publish a paper in the venue ISPAN?"],"info":{}}
{"id":"train_4775","question":"Did the authors of the paper 'Deep Neural Networks for Nonlinear Model Order Reduction of Unsteady Flows' also publish a publication in Appl. Soft Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2007-00936> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2007-00936> ) . ?y dblp:publishedIn 'Appl. Soft Comput.' }","paraphrases":["Did the authors of 'Deep Neural Networks for Nonlinear Model Order Reduction of Unsteady Flows' also publish a paper in the venue Appl. Soft Comput.?"],"info":{}}
{"id":"train_4776","question":"Did the authors of the publication 'Rechnerverbund: Motivation, M\\u00F6glichkeiten und Gefahren' also publish a publication in ACM Symposium on Document Engineering?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kivs/Handler76> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/kivs/Handler76> ) . ?y dblp:publishedIn 'ACM Symposium on Document Engineering' }","paraphrases":["Did the authors of 'Rechnerverbund: Motivation, M\\u00F6glichkeiten und Gefahren' also publish a paper in the venue ACM Symposium on Document Engineering?"],"info":{}}
{"id":"train_4777","question":"Did the authors of the paper 'Opting DC-voltage Droop Control for WF-VSCs in AC-MTDC grids for Effective Frequency and DC-voltage Support' also publish the paper 'Using mouse-tracking data to visualise decision landscapes'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iecon/KumarP21> dblp:authoredBy ?x . <https://dblp.org/rec/conf/cogsci/ZgonnikovAPO17> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/cogsci/ZgonnikovAPO17> != <https://dblp.org/rec/conf/iecon/KumarP21> ) }","paraphrases":["Did the authors of the publication 'Opting DC-voltage Droop Control for WF-VSCs in AC-MTDC grids for Effective Frequency and DC-voltage Support' also publish 'Using mouse-tracking data to visualise decision landscapes'?"],"info":{}}
{"id":"train_4780","question":"Did the authors of the paper 'Management of Research Data in Image Format: An Exploratory Study on Current Practices' also publish the paper 'Similarity learning via dissimilarity space in CBIR'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ercimdl/FernandesRL20> dblp:authoredBy ?x . <https://dblp.org/rec/conf/mir/NguyenWS06> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/mir/NguyenWS06> != <https://dblp.org/rec/conf/ercimdl/FernandesRL20> ) }","paraphrases":["Did the authors of 'Management of Research Data in Image Format: An Exploratory Study on Current Practices' also publish the publication 'Similarity learning via dissimilarity space in CBIR'?"],"info":{}}
{"id":"train_4781","question":"Was the paper 'An Introduction to PC Clusters for High Performance Computing' published in the year 2001?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijhpca/Sterling01> dblp:yearOfPublication '2001' }","paraphrases":["Was the publication 'An Introduction to PC Clusters for High Performance Computing' published in 2001?"],"info":{}}
{"id":"train_4783","question":"Did the authors of the publication 'Aprendendo Contexto para Adaptar Processo' publish other papers in Encyclopedia of Machine Learning?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sbsi/CarvalhoSRN13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/sbsi/CarvalhoSRN13> ) . ?y dblp:publishedIn 'Encyclopedia of Machine Learning' }","paraphrases":["Did the authors of the paper 'Aprendendo Contexto para Adaptar Processo' also publish a publication in Encyclopedia of Machine Learning?"],"info":{}}
{"id":"train_4784","question":"Was the publication 'A Dynamic Hierarchical Map Partitioning for MMOG' published in 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ispa/KimY06> dblp:yearOfPublication '2006' }","paraphrases":["Was 'A Dynamic Hierarchical Map Partitioning for MMOG' published in 2006?"],"info":{}}
{"id":"train_4785","question":"Was the publication 'A Verification-Based Localization Method for Unstable Radio Sensor Networks in Smart Home Environments' published in the year 2008?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mue/HuangWC08> dblp:yearOfPublication '2008' }","paraphrases":["Was 'A Verification-Based Localization Method for Unstable Radio Sensor Networks in Smart Home Environments' published in 2008?"],"info":{}}
{"id":"train_4786","question":"Is University of Macau the primary affiliation of the authors of 'A Framework of Business Intelligence-Driven Data Mining for E-business'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ncm/HangF09> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Macau, Department of Computer and Information Science, China' }","paraphrases":["Do the authors of 'A Framework of Business Intelligence-Driven Data Mining for E-business' have University of Macau, Department of Computer and Information Science, China as their primary affiliation?"],"info":{}}
{"id":"train_4788","question":"Was the paper 'Ex2: Intergrating Ada and Extra Support in a Doubly Portable Extended Executive Designed for Hard Real Time Systems' published in the year 1994?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/adaEurope/PitetteCGS94> dblp:yearOfPublication '1994' }","paraphrases":["Was 'Ex2: Intergrating Ada and Extra Support in a Doubly Portable Extended Executive Designed for Hard Real Time Systems' published in 1994?"],"info":{}}
{"id":"train_4789","question":"Did the authors of the paper 'Incorporating hopped spectral gaps into nonrecurrent nonlinear FMCW radar emissions' also publish the publication 'A self-organising protocol for Bluetooth scatternet formation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/camsap/JakaboskyBM15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ett/RoyKSS05> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/ett/RoyKSS05> != <https://dblp.org/rec/conf/camsap/JakaboskyBM15> ) }","paraphrases":["Did the authors of the publication 'Incorporating hopped spectral gaps into nonrecurrent nonlinear FMCW radar emissions' also publish 'A self-organising protocol for Bluetooth scatternet formation'?"],"info":{}}
{"id":"train_4790","question":"Did the authors of the publication 'Midpoint vs Single Score in Multi-Criteria Optimization under Life Cycle Assessment Constraints: the Case of Potable Water Treatment Chains' publish other papers in IEEE Trans. Wirel. Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/enviroinfo/CapitanescuIMB15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/enviroinfo/CapitanescuIMB15> ) . ?y dblp:publishedIn 'IEEE Trans. Wirel. Commun.' }","paraphrases":["Did the authors of the paper 'Midpoint vs Single Score in Multi-Criteria Optimization under Life Cycle Assessment Constraints: the Case of Potable Water Treatment Chains' also publish a publication in IEEE Trans. Wirel. Commun.?"],"info":{}}
{"id":"train_4791","question":"Did the authors of 'Modeling Skewed Distribution Using Multifractals and the '80-20' Law' also publish a paper in the venue Nucleic Acids Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vldb/FaloutsosMS96> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/vldb/FaloutsosMS96> ) . ?y dblp:publishedIn 'Nucleic Acids Res.' }","paraphrases":["Did the authors of the publication 'Modeling Skewed Distribution Using Multifractals and the '80-20' Law' also publish a publication in Nucleic Acids Res.?"],"info":{}}
{"id":"train_4792","question":"Did the authors of the paper 'Hybrid Adaptive Ray-Moment Method (HARM2): A highly parallel method for radiation hydrodynamics on adaptive grids' also publish a publication in ISCIS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcphy/RosenKOLK17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jcphy/RosenKOLK17> ) . ?y dblp:publishedIn 'ISCIS' }","paraphrases":["Did the authors of 'Hybrid Adaptive Ray-Moment Method (HARM2): A highly parallel method for radiation hydrodynamics on adaptive grids' also publish a paper in the venue ISCIS?"],"info":{}}
{"id":"train_4793","question":"Did the authors of the paper 'Mapping the Evolution of Intellectual Structure in Information Management Using Author Co-citation Analysis' also publish the paper 'User Experience Evaluation in Entertainment and Games'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/monet/Gonzalez-Valiente21a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/interact/Bernhaupt11> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/interact/Bernhaupt11> != <https://dblp.org/rec/journals/monet/Gonzalez-Valiente21a> ) }","paraphrases":["Did the authors of 'Mapping the Evolution of Intellectual Structure in Information Management Using Author Co-citation Analysis' also publish 'User Experience Evaluation in Entertainment and Games'?"],"info":{}}
{"id":"train_4794","question":"Did the authors of the paper 'Assortment optimization under the multinomial logit model with product synergies' also publish a publication in ISVC (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/orl/LoT19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/orl/LoT19> ) . ?y dblp:publishedIn 'ISVC (1)' }","paraphrases":["Did the authors of the publication 'Assortment optimization under the multinomial logit model with product synergies' publish other papers in ISVC (1)?"],"info":{}}
{"id":"train_4795","question":"Was the publication 'Rule-Based Event Processing and Reaction Rules' published in the year 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ruleml/PaschkeK09> dblp:yearOfPublication '2009' }","paraphrases":["Was 'Rule-Based Event Processing and Reaction Rules' published in 2009?"],"info":{}}
{"id":"train_4796","question":"Did the authors of the publication 'Fair Division of Goods with Market Values' publish other papers in Int. J. Man Mach. Stud.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1910-01615> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1910-01615> ) . ?y dblp:publishedIn 'Int. J. Man Mach. Stud.' }","paraphrases":["Did the authors of 'Fair Division of Goods with Market Values' also publish a paper in the venue Int. J. Man Mach. Stud.?"],"info":{}}
{"id":"train_4797","question":"Was 'Active Disturbance Rejection Control for Delayed Electromagnetic Docking of Spacecraft in Elliptical Orbits' published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/taes/LiuYZS22> dblp:yearOfPublication '2022' }","paraphrases":["Was the paper 'Active Disturbance Rejection Control for Delayed Electromagnetic Docking of Spacecraft in Elliptical Orbits' published in the year 2022?"],"info":{}}
{"id":"train_4798","question":"Did the authors of the publication 'Efficient binary codes for extremely high-dimensional data' publish other papers in International Conference on Conceptual Structures?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icip/LinL14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icip/LinL14> ) . ?y dblp:publishedIn 'ICCS' }","paraphrases":["Did the authors of the paper 'Efficient binary codes for extremely high-dimensional data' also publish a publication in ICCS?"],"info":{}}
{"id":"train_4799","question":"Did the authors of 'Combinatorial Text Classification: the Effect of Multi-Parameterized Correlation Clustering' also publish a paper in the venue Allerton?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gc/Barr0AC19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/gc/Barr0AC19> ) . ?y dblp:publishedIn 'Allerton' }","paraphrases":["Did the authors of 'Combinatorial Text Classification: the Effect of Multi-Parameterized Correlation Clustering' also publish a paper in Allerton?"],"info":{}}
{"id":"train_4801","question":"Was the publication 'Determining the Trustworthiness of New Electronic Contracts' published in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esaw/GrothMMOLG09> dblp:yearOfPublication '2009' }","paraphrases":["Was the paper 'Determining the Trustworthiness of New Electronic Contracts' published in the year 2009?"],"info":{}}
{"id":"train_4802","question":"Did the authors of the publication 'SC-RANSAC: Spatial consistency on RANSAC' also publish a publication in Neural Process. Lett.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mta/FotouhiHKK19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/mta/FotouhiHKK19> ) . ?y dblp:publishedIn 'Neural Process. Lett.' }","paraphrases":["Did the authors of 'SC-RANSAC: Spatial consistency on RANSAC' also publish a paper in Neural Process. Lett.?"],"info":{}}
{"id":"train_4803","question":"Was the paper 'Layered Hierarchical Caching for SVC-Based HTTP Adaptive Streaming over C-RAN' published in the year 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wcnc/ZhangLY17> dblp:yearOfPublication '2017' }","paraphrases":["Was the publication 'Layered Hierarchical Caching for SVC-Based HTTP Adaptive Streaming over C-RAN' published in 2017?"],"info":{}}
{"id":"train_4804","question":"Was the publication 'Robot behavior coordination using decision-making neurophysiological mechanism' published in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/robio/LanL09> dblp:yearOfPublication '2009' }","paraphrases":["Was the publication 'Robot behavior coordination using decision-making neurophysiological mechanism' published in the year 2009?"],"info":{}}
{"id":"train_4805","question":"Did the authors of 'Global software alliances: The Challenge of 'Standardization'' also publish a paper in FUSION?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sjis/Sahay03> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/sjis/Sahay03> ) . ?y dblp:publishedIn 'FUSION' }","paraphrases":["Did the authors of the paper 'Global software alliances: The Challenge of 'Standardization'' also publish a publication in International Conference on Information Fusion?"],"info":{}}
{"id":"train_4806","question":"Did the authors of the publication 'Being a Mentor in open source projects' also publish the paper 'RTP Payload Format for MIDI'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jisa/SteinmacherBTGI21> dblp:authoredBy ?x . <https://dblp.org/rec/journals/rfc/rfc6295> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/rfc/rfc6295> != <https://dblp.org/rec/journals/jisa/SteinmacherBTGI21> ) }","paraphrases":["Did the authors of 'Being a Mentor in open source projects' also publish 'RTP Payload Format for MIDI'?"],"info":{}}
{"id":"train_4807","question":"Did the authors of 'Encode the \\STOP\\ command by photo-stimulation for precise control of rat-robot' also publish a paper in the venue INFORMS J. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/ChenQGSXZ13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/embc/ChenQGSXZ13> ) . ?y dblp:publishedIn 'INFORMS J. Comput.' }","paraphrases":["Did the authors of the publication 'Encode the \\STOP\\ command by photo-stimulation for precise control of rat-robot' publish other papers in INFORMS J. Comput.?"],"info":{}}
{"id":"train_4809","question":"Did the authors of the publication 'Glance and Glimpse Network: A Stochastic Attention Model Driven by Class Saliency' also publish the paper 'Contextual Replication for Mobile Users'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/accv/LiGL16> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icmb/RanganST05> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icmb/RanganST05> != <https://dblp.org/rec/conf/accv/LiGL16> ) }","paraphrases":["Did the authors of the publication 'Glance and Glimpse Network: A Stochastic Attention Model Driven by Class Saliency' also publish 'Contextual Replication for Mobile Users'?"],"info":{}}
{"id":"train_4810","question":"Was the paper 'Motion errors in ISAR imaging of approaching targets' published in the year 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/RobertsonM93> dblp:yearOfPublication '1993' }","paraphrases":["Was the publication 'Motion errors in ISAR imaging of approaching targets' published in 1993?"],"info":{}}
{"id":"train_4811","question":"Was 'Do Daily Scrums Have to Take Place Each Day? A Case Study of Customized Scrum Principles at an E-commerce Company' published in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hicss/PaulyMB15> dblp:yearOfPublication '2015' }","paraphrases":["Was the publication 'Do Daily Scrums Have to Take Place Each Day? A Case Study of Customized Scrum Principles at an E-commerce Company' published in the year 2015?"],"info":{}}
{"id":"train_4812","question":"Did the authors of the publication 'Qualitative graph limit theory Cantor Dynamical Systems and Constant-Time Distributed Algorithms' also publish a publication in BIOCOMP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1812-07511> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1812-07511> ) . ?y dblp:publishedIn 'BIOCOMP' }","paraphrases":["Did the authors of the publication 'Qualitative graph limit theory Cantor Dynamical Systems and Constant-Time Distributed Algorithms' publish other papers in BIOCOMP?"],"info":{}}
{"id":"train_4813","question":"Was the publication 'Finite-time Controllers for a Class of Planar Nonlinear Systems with Mismatched Disturbances' published in the year 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amcc/CaoQ21> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Finite-time Controllers for a Class of Planar Nonlinear Systems with Mismatched Disturbances' published in 2021?"],"info":{}}
{"id":"train_4814","question":"Did the authors of the publication 'A Truly Random Number Generator Based on a Pulse Excited Cross Coupled Chaotic Oscillator' also publish a publication in CDC/ECC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscis/Ergun10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/iscis/Ergun10> ) . ?y dblp:publishedIn 'CDC/ECC' }","paraphrases":["Did the authors of 'A Truly Random Number Generator Based on a Pulse Excited Cross Coupled Chaotic Oscillator' also publish a paper in CDC/ECC?"],"info":{}}
{"id":"train_4815","question":"Was 'Der datenschutzrechtliche Rahmen f\\u00FCr Datentreuh\\u00E4nder' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dud/Kuhling21a> dblp:yearOfPublication '2021' }","paraphrases":["Was the publication 'Der datenschutzrechtliche Rahmen f\\u00FCr Datentreuh\\u00E4nder' published in the year 2021?"],"info":{}}
{"id":"train_4816","question":"Did the authors of the paper 'Shared smallcell networks multi-operator or third party solutions - or both?' also publish the publication 'Seq-2-Seq based Refinement of ASR Output for Spoken Name Capture'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wiopt/MarkendahlG13> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-2203-15833> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/corr/abs-2203-15833> != <https://dblp.org/rec/conf/wiopt/MarkendahlG13> ) }","paraphrases":["Did the authors of the publication 'Shared smallcell networks multi-operator or third party solutions - or both?' also publish the paper 'Seq-2-Seq based Refinement of ASR Output for Spoken Name Capture'?"],"info":{}}
{"id":"train_4818","question":"Did the authors of the publication 'Reducing Risk of Rollover in Curve for Heavy-Duty Vehicles with an Agent-Based Advanced Driver Assistance System' publish other papers in ECML/PKDD?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/IEEEcit/TiengoCF16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/IEEEcit/TiengoCF16> ) . ?y dblp:publishedIn 'ECML/PKDD (2)' }","paraphrases":["Did the authors of the publication 'Reducing Risk of Rollover in Curve for Heavy-Duty Vehicles with an Agent-Based Advanced Driver Assistance System' also publish a publication in ECML/PKDD (2)?"],"info":{}}
{"id":"train_4819","question":"Did the authors of the publication 'A contribution to the synthesis of Italian intonation' also publish a publication in IEEE Trans. Biomed. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/interspeech/Avesani90> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/interspeech/Avesani90> ) . ?y dblp:publishedIn 'IEEE Trans. Biomed. Eng.' }","paraphrases":["Did the authors of 'A contribution to the synthesis of Italian intonation' also publish a paper in IEEE Trans. Biomed. Eng.?"],"info":{}}
{"id":"train_4820","question":"Was the publication 'Algorithms for computing the sparsest shifts of polynomials via the Berlekamp/Massey algorithm' published in 2002?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/issac/GiesbrechtKL02> dblp:yearOfPublication '2002' }","paraphrases":["Was the paper 'Algorithms for computing the sparsest shifts of polynomials via the Berlekamp/Massey algorithm' published in the year 2002?"],"info":{}}
{"id":"train_4821","question":"Did the authors of the publication 'Active Offline Policy Selection' also publish a publication in Bioinform.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2106-10251> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2106-10251> ) . ?y dblp:publishedIn 'Bioinform.' }","paraphrases":["Did the authors of 'Active Offline Policy Selection' also publish a paper in the venue Bioinform.?"],"info":{}}
{"id":"train_4822","question":"Did the authors of 'Improved image filter based on SPCNN' also publish a paper in CAIP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chinaf/ZhangW08a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/chinaf/ZhangW08a> ) . ?y dblp:publishedIn 'CAIP' }","paraphrases":["Did the authors of the publication 'Improved image filter based on SPCNN' publish other papers in CAIP?"],"info":{}}
{"id":"train_4824","question":"Did the authors of the publication 'Petapixel photography and the limits of camera information capacity' also publish a publication in Concurr. Pract. Exp.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cimaging/BradyMFGGVK13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cimaging/BradyMFGGVK13> ) . ?y dblp:publishedIn 'Concurr. Pract. Exp.' }","paraphrases":["Did the authors of 'Petapixel photography and the limits of camera information capacity' also publish a paper in Concurr. Pract. Exp.?"],"info":{}}
{"id":"train_4825","question":"Was 'Solving Cubic Equations By the Quadratic Formula' published in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/Kalantari14> dblp:yearOfPublication '2014' }","paraphrases":["Was the publication 'Solving Cubic Equations By the Quadratic Formula' published in 2014?"],"info":{}}
{"id":"train_4826","question":"Is University of Vienna, Austria the primary affiliation of the authors of 'HPF and Numerical Libraries'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/acpc/EholdGKU99> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Vienna, Austria' }","paraphrases":["Do the authors of 'HPF and Numerical Libraries' have University of Vienna as their primary affiliation?"],"info":{}}
{"id":"train_4827","question":"Did the authors of the publication 'Scary films good, scary flights bad: topic driven feature selection for classification of sentiment' publish other papers in CICC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cikm/Nowson09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cikm/Nowson09> ) . ?y dblp:publishedIn 'CICC' }","paraphrases":["Did the authors of 'Scary films good, scary flights bad: topic driven feature selection for classification of sentiment' also publish a paper in CICC?"],"info":{}}
{"id":"train_4829","question":"Did the authors of the publication 'Performance analysis of coverage-centric heterogeneous cellular networks using dual-slope path loss model' publish other papers in ICOIN?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cn/ShehzadKA21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cn/ShehzadKA21> ) . ?y dblp:publishedIn 'ICOIN' }","paraphrases":["Did the authors of 'Performance analysis of coverage-centric heterogeneous cellular networks using dual-slope path loss model' also publish a paper in ICOIN?"],"info":{}}
{"id":"train_4830","question":"Did the authors of the paper 'A New Process to Processor Assignment Criterion for Reducing Rollbacks in Optimistic Simulation' also publish a publication in International Symposium on Latin American Theoretical Informatics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jpdc/SomS93> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jpdc/SomS93> ) . ?y dblp:publishedIn 'LATIN' }","paraphrases":["Did the authors of 'A New Process to Processor Assignment Criterion for Reducing Rollbacks in Optimistic Simulation' also publish a paper in the venue LATIN?"],"info":{}}
{"id":"train_4833","question":"Did the authors of the paper 'Visual terrain classification by flying robots' also publish the publication 'A Modeling View of Process Improvement'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icra/KhanMZ12> dblp:authoredBy ?x . <https://dblp.org/rec/conf/spice/Salviano11> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/spice/Salviano11> != <https://dblp.org/rec/conf/icra/KhanMZ12> ) }","paraphrases":["Did the authors of the paper 'Visual terrain classification by flying robots' also publish the paper 'A Modeling View of Process Improvement'?"],"info":{}}
{"id":"train_4834","question":"Was 'Exploring the benefits of scheduling with advanced and real-time information integration in Industry 40: A computational study' published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jiii/Fernandez-Viagas22> dblp:yearOfPublication '2022' }","paraphrases":["Was the publication 'Exploring the benefits of scheduling with advanced and real-time information integration in Industry 40: A computational study' published in the year 2022?"],"info":{}}
{"id":"train_4835","question":"Did the authors of the publication 'Incomplete Transition Complexity of Basic Operations on Finite Languages' also publish the publication 'An adaptive doctor-recommender system'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1302-0750> dblp:authoredBy ?x . <https://dblp.org/rec/journals/behaviourIT/WaqarMDDA19> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/behaviourIT/WaqarMDDA19> != <https://dblp.org/rec/journals/corr/abs-1302-0750> ) }","paraphrases":["Did the authors of 'Incomplete Transition Complexity of Basic Operations on Finite Languages' also publish 'An adaptive doctor-recommender system'?"],"info":{}}
{"id":"train_4836","question":"Did the authors of the paper 'Cross layer adaptive congestion control for best-effort traffic of IEEE 80211e in mobile ad hoc networks' also publish a publication in Electron. Notes Theor. Comput. Sci.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/csndsp/AnupamaGG16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/csndsp/AnupamaGG16> ) . ?y dblp:publishedIn 'Electron. Notes Theor. Comput. Sci.' }","paraphrases":["Did the authors of the publication 'Cross layer adaptive congestion control for best-effort traffic of IEEE 80211e in mobile ad hoc networks' publish other papers in Electron. Notes Theor. Comput. Sci.?"],"info":{}}
{"id":"train_4837","question":"Was 'What should be done about the illegal immigration from Mexico to the United States?' published in 2007?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mcm/CroweL07> dblp:yearOfPublication '2007' }","paraphrases":["Was the paper 'What should be done about the illegal immigration from Mexico to the United States?' published in the year 2007?"],"info":{}}
{"id":"train_4838","question":"Did the authors of 'Chemical vapor deposition synthesis of two-dimensional freestanding transition metal oxychloride for electronic applications' also publish a paper in the venue Appl. Soft Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/chinaf/YanWWXLCCPCSLM19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/chinaf/YanWWXLCCPCSLM19> ) . ?y dblp:publishedIn 'Appl. Soft Comput.' }","paraphrases":["Did the authors of 'Chemical vapor deposition synthesis of two-dimensional freestanding transition metal oxychloride for electronic applications' also publish a paper in Appl. Soft Comput.?"],"info":{}}
