{"id":"train_1263","question":"Was the paper 'A Use Case Textual Description for Context Aware SPL Based on a Controlled Experiment' published by Neto, Pedro de Alc\\u00E2ntara dos Santos in CAiSE Forum?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/caise/SantosAN13> dblp:authoredBy <https://dblp.org/pid/23/3085> . <https://dblp.org/rec/conf/caise/SantosAN13> dblp:publishedIn 'CAiSE Forum' }","paraphrases":["Did Pedro de Alc\\u00E2ntara dos Santos Neto publish the paper 'A Use Case Textual Description for Context Aware SPL Based on a Controlled Experiment' in CAiSE Forum?"],"info":{}}
{"id":"train_1264","question":"Was the paper 'A Recurrence Generating Multiples of Primes: 10655' co-authored by Saracino, D. and Poonacha, P. G.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tamm/BenczeSSAABSBBCCFGGGHKKKLLMMOYPSPRSSSSTTTT00> dblp:authoredBy <https://dblp.org/pid/45/4694> . <https://dblp.org/rec/journals/tamm/BenczeSSAABSBBCCFGGGHKKKLLMMOYPSPRSSSSTTTT00> dblp:authoredBy <https://dblp.org/pid/38/3700> }","paraphrases":["Have Dan Saracino and Poonacha, P. G. co-authored the paper 'A Recurrence Generating Multiples of Primes: 10655'?"],"info":{}}
{"id":"train_1266","question":"Did Mats B\\u00F6rjesson publish in Sensors in the last seven years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/230/3341> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:publishedIn 'Sensors' }","paraphrases":["Has Mats B\\u00F6rjesson published in Sensors in the last 7 years?"],"info":{}}
{"id":"train_1267","question":"Was the paper 'Towards Spiral Brick Column Building Robots' published by the person named Osman, A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2011-03643> dblp:authoredBy <https://dblp.org/pid/278/2504> }","paraphrases":["Was the paper 'Towards Spiral Brick Column Building Robots' published by the person Abdelhaleem Osman?"],"info":{}}
{"id":"train_1268","question":"Has Y. Ae Kim published in Knowl. Based Syst. in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/30/5389> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'Knowl. Based Syst.' }","paraphrases":["Did Young Ae Kim publish in Knowl. Based Syst. in the last 3 years?"],"info":{}}
{"id":"train_1269","question":"Did Mahfuzur Rahman publish the paper 'The war of presence and instant messaging: right protocols and APIs' in CCNC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccnc/DebbabiR04> dblp:authoredBy <https://dblp.org/pid/30/213> . <https://dblp.org/rec/conf/ccnc/DebbabiR04> dblp:publishedIn 'CCNC' }","paraphrases":["Was the paper 'The war of presence and instant messaging: right protocols and APIs' published by Mahfuzur Rahman in CCNC?"],"info":{}}
{"id":"train_1270","question":"Did Rakesh Kumar publish the paper 'Software-based gate-level information flow security for IoT systems' in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/micro/CherupalliDYKS17> dblp:authoredBy <https://dblp.org/pid/98/4371-2> . <https://dblp.org/rec/conf/micro/CherupalliDYKS17> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did Rakesh K. publish the paper 'Software-based gate-level information flow security for IoT systems' in the last two years?"],"info":{}}
{"id":"train_1271","question":"Did N. Wiegand publish the paper 'Preserving Detail in a Combined Land Use Ontology'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/giscience/Wiegand12a> dblp:authoredBy <https://dblp.org/pid/43/2212> }","paraphrases":["Was the paper 'Preserving Detail in a Combined Land Use Ontology' published by the author Nancy Wiegand?"],"info":{}}
{"id":"train_1272","question":"Was the paper 'Mining Biologically Significant Co-regulation Patterns from Microarray Data' co-authored by Yuhai Z. and G. Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/rskt/ZhaoYW06> dblp:authoredBy <https://dblp.org/pid/73/5946> . <https://dblp.org/rec/conf/rskt/ZhaoYW06> dblp:authoredBy <https://dblp.org/pid/64/146> }","paraphrases":["Have Yuhai Z. and Guoren Wang co-authored the paper 'Mining Biologically Significant Co-regulation Patterns from Microarray Data'?"],"info":{}}
{"id":"train_1273","question":"Did Wang, Yi-Ying publish the paper 'Nerve Cell Segmentation via Multi-Scale Gradient Watershed Hierarchies' in EMBC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/WangSLJ06> dblp:authoredBy <https://dblp.org/pid/63/8043> . <https://dblp.org/rec/conf/embc/WangSLJ06> dblp:publishedIn 'EMBC' }","paraphrases":["Was the paper 'Nerve Cell Segmentation via Multi-Scale Gradient Watershed Hierarchies' published by Yi-Ying Wang in EMBC?"],"info":{}}
{"id":"train_1274","question":"Was the paper 'Parallel Implementation of Interval Analysis for Equations Solving' published by J. Merlet in PVM/MPI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pvm/PapegayDM03> dblp:authoredBy <https://dblp.org/pid/m/JeanPierreMerlet> . <https://dblp.org/rec/conf/pvm/PapegayDM03> dblp:publishedIn 'PVM/MPI' }","paraphrases":["Did Jean-Pierre Merlet publish the paper 'Parallel Implementation of Interval Analysis for Equations Solving' in PVM/MPI?"],"info":{}}
{"id":"train_1275","question":"Was the paper 'Keep Your AI-es on the Road: Tackling Distracted Driver Detection with Convolutional Neural Networks and Targeted Data Augmentation' published by the person Jasmine Bayrooti?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2006-10955> dblp:authoredBy <https://dblp.org/pid/267/9542> }","paraphrases":["Did Bayrooti, J. publish the paper 'Keep Your AI-es on the Road: Tackling Distracted Driver Detection with Convolutional Neural Networks and Targeted Data Augmentation'?"],"info":{}}
{"id":"train_1276","question":"Was the paper 'Implementation of a Depth from Light Field Algorithm on FPGA' published by the person named Jonas P. L\\u00FCke?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/CondeLG19> dblp:authoredBy <https://dblp.org/pid/87/9246> }","paraphrases":["Was the paper 'Implementation of a Depth from Light Field Algorithm on FPGA' published by the author Jonas P. L\\u00FCke?"],"info":{}}
{"id":"train_1277","question":"Did Roberto Maestri publish the paper 'Paced Breathing Increases the Redundancy of Cardiorespiratory Control in Healthy Individuals and Chronic Heart Failure Patients'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/entropy/PortaMBMCVRP18> dblp:authoredBy <https://dblp.org/pid/06/5311> }","paraphrases":["Was the paper 'Paced Breathing Increases the Redundancy of Cardiorespiratory Control in Healthy Individuals and Chronic Heart Failure Patients' published by the author Roberto Maestri?"],"info":{}}
{"id":"train_1278","question":"Has Ward Whitt published in Queueing Syst. Theory Appl. in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/89/3911> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn 'Queueing Syst. Theory Appl.' }","paraphrases":["Did W. Whitt publish in Queueing Syst. Theory Appl. in the last six years?"],"info":{}}
{"id":"train_1279","question":"Was the paper 'A Human-Computer Interface for Non-computer Specialists' co-authored by Jacob Palme and Mohsen Sayadi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/spe/Palme79> dblp:authoredBy <https://dblp.org/pid/49/3421> . <https://dblp.org/rec/journals/spe/Palme79> dblp:authoredBy <https://dblp.org/pid/220/7960> }","paraphrases":["Did Jacob Palme and Sayadi, Mohsen co-author the paper 'A Human-Computer Interface for Non-computer Specialists'?"],"info":{}}
{"id":"train_1280","question":"Did Yang, J. publish the paper 'Multi-scale Semantic Representation and Supervision for Remote Sensing Change Detection'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icigp/HeY022> dblp:authoredBy <https://dblp.org/pid/00/7674> }","paraphrases":["Was the paper 'Multi-scale Semantic Representation and Supervision for Remote Sensing Change Detection' published by the person named Yang, J.?"],"info":{}}
{"id":"train_1283","question":"Did Walid Ben-Ameur publish the paper 'The k-Separator Problem' in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cocoon/Ben-AmeurMN13> dblp:authoredBy <https://dblp.org/pid/23/3446> . <https://dblp.org/rec/conf/cocoon/Ben-AmeurMN13> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Did Walid Ben-Ameur publish the paper 'The k-Separator Problem' in the last 8 years?"],"info":{}}
{"id":"train_1284","question":"Did Azar, A. Taher publish the paper 'Measurement of Renal Function'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/series/sci/Azar13> dblp:authoredBy <https://dblp.org/pid/67/9796> }","paraphrases":["Was the paper 'Measurement of Renal Function' published by the person Azar, A. Taher?"],"info":{}}
{"id":"train_1285","question":"Was the paper 'A Lower Bound for the Chaotic Control Parameter of Wang-Smith's CSA' published by Zheng, Liying in IMSCCS (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/imsccs/ZhengT06a> dblp:authoredBy <https://dblp.org/pid/48/6193> . <https://dblp.org/rec/conf/imsccs/ZhengT06a> dblp:publishedIn 'IMSCCS (2)' }","paraphrases":["Did Liying Zheng publish the paper 'A Lower Bound for the Chaotic Control Parameter of Wang-Smith's CSA' in IMSCCS?"],"info":{}}
{"id":"train_1287","question":"Has William B. published in IDC in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/242/2280> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'IDC' }","paraphrases":["Did William B. publish in IDC in the last two years?"],"info":{}}
{"id":"train_1288","question":"Have Mukesh Kumar Chandrakar and Anup Mishra co-authored the paper 'Brain Tumor Detection Using Multipath Convolution Neural Network (CNN)'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijcvip/ChandrakarM20> dblp:authoredBy <https://dblp.org/pid/286/9262> . <https://dblp.org/rec/journals/ijcvip/ChandrakarM20> dblp:authoredBy <https://dblp.org/pid/286/9369> }","paraphrases":["Was the paper 'Brain Tumor Detection Using Multipath Convolution Neural Network (CNN)' co-authored by M. Kumar Chandrakar and Anup Mishra?"],"info":{}}
{"id":"train_1289","question":"Has Hideki Asoh published in ICDM Workshops in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/45/2329> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'ICDM Workshops' }","paraphrases":["Did Hideki Asoh publish in ICDM Workshops in the last 3 years?"],"info":{}}
{"id":"train_1290","question":"Was the paper 'An Algorithm for Odor Source Localization based on Source Term Estimation' published by Ali M. in IEEE International Conference on Robotics and Automation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icra/RahbarMM19> dblp:authoredBy <https://dblp.org/pid/17/3144> . <https://dblp.org/rec/conf/icra/RahbarMM19> dblp:publishedIn 'ICRA' }","paraphrases":["Did Ali Marjovi publish the paper 'An Algorithm for Odor Source Localization based on Source Term Estimation' in ICRA?"],"info":{}}
{"id":"train_1292","question":"Did Jiangtao Lu and Hongmin L. co-author the paper 'A compile-time optimization framework for Ada rendezvous'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigplan/LuZLX04> dblp:authoredBy <https://dblp.org/pid/24/4960> . <https://dblp.org/rec/journals/sigplan/LuZLX04> dblp:authoredBy <https://dblp.org/pid/89/4782> }","paraphrases":["Was the paper 'A compile-time optimization framework for Ada rendezvous' co-authored by Jiangtao Lu and Hongmin Lu?"],"info":{}}
{"id":"train_1293","question":"Was the paper 'Data envelopment analysis for evaluating Japanese universities' published by S. Aoki in Artif. Life Robotics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/alr/AokiIG10> dblp:authoredBy <https://dblp.org/pid/42/2449> . <https://dblp.org/rec/journals/alr/AokiIG10> dblp:publishedIn 'Artif. Life Robotics' }","paraphrases":["Did S. Aoki publish the paper 'Data envelopment analysis for evaluating Japanese universities' in Artif. Life Robotics?"],"info":{}}
{"id":"train_1294","question":"Was the paper 'Estimating the Physical Activity with Smartphones: Analysis of the Device Position and Comparison with GT3X+ Actigraph' published by the person named Corella, Cristina?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isami/RodriguezMPCAJ16> dblp:authoredBy <https://dblp.org/pid/180/5237> }","paraphrases":["Was the paper 'Estimating the Physical Activity with Smartphones: Analysis of the Device Position and Comparison with GT3X+ Actigraph' published by the person Corella, Cristina?"],"info":{}}
{"id":"train_1295","question":"Did Weiru Liu and Jun H. co-author the paper 'Preface'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijsi/LiuHL12> dblp:authoredBy <https://dblp.org/pid/l/WeiruLiu> . <https://dblp.org/rec/journals/ijsi/LiuHL12> dblp:authoredBy <https://dblp.org/pid/h/JunHong1> }","paraphrases":["Have Weiru L. and Jun H. co-authored the paper 'Preface'?"],"info":{}}
{"id":"train_1297","question":"Did Meihua Q. publish in Comput. Hum. Behav. in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/185/2791> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn 'Comput. Hum. Behav.' }","paraphrases":["Has Meihua Q. published in Comput. Hum. Behav. in the last 5 years?"],"info":{}}
{"id":"train_1298","question":"Has Nidhi Thakur published in ACM Trans. Intell. Syst. Technol. in the last 6 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/278/1554> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn 'ACM Trans. Intell. Syst. Technol.' }","paraphrases":["Did Nidhi T. publish in ACM Trans. Intell. Syst. Technol. in the last six years?"],"info":{}}
{"id":"train_1300","question":"Did Yutong Li publish the paper 'Invariant sliding domains for constrained linear receding horizon tracking control'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ifacjsc/HansenLH17> dblp:authoredBy <https://dblp.org/pid/55/10759> }","paraphrases":["Was the paper 'Invariant sliding domains for constrained linear receding horizon tracking control' published by the person Yutong Li?"],"info":{}}
{"id":"train_1301","question":"Have Wang Yi and Bengt J. co-authored the paper 'Decidability of Timed Language-Inclusion for Networks of Real-Time Communicating Sequential Processes'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fsttcs/YiJ94> dblp:authoredBy <https://dblp.org/pid/y/WangYi> . <https://dblp.org/rec/conf/fsttcs/YiJ94> dblp:authoredBy <https://dblp.org/pid/j/BengtJonsson> }","paraphrases":["Was the paper 'Decidability of Timed Language-Inclusion for Networks of Real-Time Communicating Sequential Processes' co-authored by Wang Yi and Bengt J.?"],"info":{}}
{"id":"train_1303","question":"Did Gry Hasselbalch publish the paper 'A framework for a data interest analysis of artificial intelligence' in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/firstmonday/Hasselbalch21> dblp:authoredBy <https://dblp.org/pid/301/0408> . <https://dblp.org/rec/journals/firstmonday/Hasselbalch21> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did G. Hasselbalch publish the paper 'A framework for a data interest analysis of artificial intelligence' in the last two years?"],"info":{}}
{"id":"train_1304","question":"Did Yongquan Dong publish in IEEE WISA in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/27/5175> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'IEEE WISA' }","paraphrases":["Has Yongquan D. published in IEEE WISA in the last 8 years?"],"info":{}}
{"id":"train_1305","question":"Did Sania Zara publish the paper 'Performance Debugging in SDN Controllers - A Case Study (Short Paper)' in CloudNet?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cloudnet/ZaraHIJI16> dblp:authoredBy <https://dblp.org/pid/191/3516> . <https://dblp.org/rec/conf/cloudnet/ZaraHIJI16> dblp:publishedIn 'CloudNet' }","paraphrases":["Was the paper 'Performance Debugging in SDN Controllers - A Case Study (Short Paper)' published by Sania Zara in CloudNet?"],"info":{}}
{"id":"train_1306","question":"Have U. Heute and Wang, Guangyu co-authored the paper 'Time-varying MMSE modulated lapped transform and its applications to transform coding for speech and audio signals'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigpro/WangH02> dblp:authoredBy <https://dblp.org/pid/88/3638> . <https://dblp.org/rec/journals/sigpro/WangH02> dblp:authoredBy <https://dblp.org/pid/53/35> }","paraphrases":["Was the paper 'Time-varying MMSE modulated lapped transform and its applications to transform coding for speech and audio signals' co-authored by Ulrich Heute and Guangyu Wang?"],"info":{}}
{"id":"train_1308","question":"Was the paper 'Optimal packet scheduling algorithms for token-bucket based rate control' published by A. Karandikar in J. Commun. Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcn/MehtaK05> dblp:authoredBy <https://dblp.org/pid/49/5720> . <https://dblp.org/rec/journals/jcn/MehtaK05> dblp:publishedIn 'J. Commun. Networks' }","paraphrases":["Did A. Karandikar publish the paper 'Optimal packet scheduling algorithms for token-bucket based rate control' in J. Commun. Networks?"],"info":{}}
{"id":"train_1309","question":"Did Liang Ma publish in AIM in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/83/5831> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'AIM' }","paraphrases":["Has Liang Ma published in AIM in the last three years?"],"info":{}}
{"id":"train_1310","question":"Was the paper 'OFDM With Iterative Blind Channel Estimation' published by Rodney G. Vaughan in IEEE Trans. Veh. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tvt/BananiV10> dblp:authoredBy <https://dblp.org/pid/65/1621> . <https://dblp.org/rec/journals/tvt/BananiV10> dblp:publishedIn 'IEEE Trans. Veh. Technol.' }","paraphrases":["Did Vaughan, Rodney G. publish the paper 'OFDM With Iterative Blind Channel Estimation' in IEEE Trans. Veh. Technol.?"],"info":{}}
{"id":"train_1312","question":"Did Hagerup, T. publish the paper 'Guidesort: Simpler Optimal Deterministic Sorting for the Parallel Disk Model' in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1807-11328> dblp:authoredBy <https://dblp.org/pid/h/TorbenHagerup> . <https://dblp.org/rec/journals/corr/abs-1807-11328> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Did Hagerup, T. publish the paper 'Guidesort: Simpler Optimal Deterministic Sorting for the Parallel Disk Model' in the last nine years?"],"info":{}}
{"id":"train_1313","question":"Did Thomas G\\u00F6rzen publish in ECIS in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/153/0980> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'ECIS' }","paraphrases":["Has G\\u00F6rzen, Thomas published in ECIS in the last two years?"],"info":{}}
{"id":"train_1314","question":"Did Chiasson, Mike W. publish the paper 'Taking People out of the Network: A Deconstruction of \\Your Next IT Strategy\\' in Social Inclusion?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ifip8-2/DavidsonCR06> dblp:authoredBy <https://dblp.org/pid/16/2553> . <https://dblp.org/rec/conf/ifip8-2/DavidsonCR06> dblp:publishedIn 'Social Inclusion' }","paraphrases":["Was the paper 'Taking People out of the Network: A Deconstruction of \\Your Next IT Strategy\\' published by Chiasson, Mike W. in Social Inclusion?"],"info":{}}
{"id":"train_1315","question":"Was the paper 'Piloting a National Laboratory Electronic Programme Status Reporting System' published by Deborah K. Glencross in MedInfo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/medinfo/CassimCMMG13> dblp:authoredBy <https://dblp.org/pid/134/2685> . <https://dblp.org/rec/conf/medinfo/CassimCMMG13> dblp:publishedIn 'MedInfo' }","paraphrases":["Did Deborah K. Glencross publish the paper 'Piloting a National Laboratory Electronic Programme Status Reporting System' in MedInfo?"],"info":{}}
{"id":"train_1316","question":"Did G. Dahl publish the paper 'Stable Set Polytopes for a Class of Circulant Graphs' in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamjo/Dahl99> dblp:authoredBy <https://dblp.org/pid/d/GeirDahl> . <https://dblp.org/rec/journals/siamjo/Dahl99> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["Did Geir Dahl publish the paper 'Stable Set Polytopes for a Class of Circulant Graphs' in the last five years?"],"info":{}}
{"id":"train_1317","question":"Did Rod Stephens publish the paper 'Visual Basic' in Encyclopedia of Information Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/reference/ap/Stephens02> dblp:authoredBy <https://dblp.org/pid/263/0394> . <https://dblp.org/rec/reference/ap/Stephens02> dblp:publishedIn 'Encyclopedia of Information Systems' }","paraphrases":["Was the paper 'Visual Basic' published by Stephens, Rod in Encyclopedia of Information Systems?"],"info":{}}
{"id":"train_1318","question":"Did Valentino Constantinou and Mori Kabiri co-author the paper 'Detecting Anomalous line-items by Modeling the Legal Case Lifecycle'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2012-14511> dblp:authoredBy <https://dblp.org/pid/215/3860> . <https://dblp.org/rec/journals/corr/abs-2012-14511> dblp:authoredBy <https://dblp.org/pid/282/4634> }","paraphrases":["Was the paper 'Detecting Anomalous line-items by Modeling the Legal Case Lifecycle' co-authored by Valentino C. and M. Kabiri?"],"info":{}}
{"id":"train_1319","question":"Was the paper 'A Hybrid Approach for Biomedical Relation Extraction Using Finite State Automata and Random Forest-Weighted Fusion' published by Stefanos Vrochidis in International Conference on Intelligent Text Processing and Computational Linguistics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cicling/MavropoulosLSVK17> dblp:authoredBy <https://dblp.org/pid/44/6029> . <https://dblp.org/rec/conf/cicling/MavropoulosLSVK17> dblp:publishedIn 'CICLing (1)' }","paraphrases":["Did Stefanos Vrochidis publish the paper 'A Hybrid Approach for Biomedical Relation Extraction Using Finite State Automata and Random Forest-Weighted Fusion' in CICLing (1)?"],"info":{}}
{"id":"train_1321","question":"Was the paper 'Review of Bolted Connection Monitoring' published by the person Tao Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijdsn/WangSLLX13> dblp:authoredBy <https://dblp.org/pid/12/5838-15> }","paraphrases":["Was the paper 'Review of Bolted Connection Monitoring' published by the person named Tao Wang?"],"info":{}}
{"id":"train_1322","question":"Did Fran\\u00E7oise Baude publish in IEEE International Parallel and Distributed Processing Symposium in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/03/1165> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'IPDPS' }","paraphrases":["Has Baude, Fran\\u00E7oise published in IPDPS in the last eight years?"],"info":{}}
{"id":"train_1323","question":"Did Yun Zhu and Wang, Jianyu co-author the paper 'A Three-tier optimization Method for Congestion Evaluation from Angle of Game Relationship'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icnsc/ZhuTSW19> dblp:authoredBy <https://dblp.org/pid/00/6306> . <https://dblp.org/rec/conf/icnsc/ZhuTSW19> dblp:authoredBy <https://dblp.org/pid/98/6805> }","paraphrases":["Was the paper 'A Three-tier optimization Method for Congestion Evaluation from Angle of Game Relationship' co-authored by Zhu, Yun and Jianyu Wang?"],"info":{}}
{"id":"train_1324","question":"Was the paper 'How can human and design sciences cooperate in CSCW?: Workshop report, ECSCW '93, Milan' published by Yvonne W\\u00E6rn in ACM SIGCHI Bull.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sigchi/Waern94> dblp:authoredBy <https://dblp.org/pid/w/YvonneWarn> . <https://dblp.org/rec/journals/sigchi/Waern94> dblp:publishedIn 'ACM SIGCHI Bull.' }","paraphrases":["Did Yvonne W\\u00E6rn publish the paper 'How can human and design sciences cooperate in CSCW?: Workshop report, ECSCW '93, Milan' in ACM SIGCHI Bull.?"],"info":{}}
{"id":"train_1325","question":"Was the paper 'Belief Contraction in the Context for the General Theory of Rational Choice' published by the person Rott, Hans?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jsyml/Rott93> dblp:authoredBy <https://dblp.org/pid/95/4366> }","paraphrases":["Was the paper 'Belief Contraction in the Context for the General Theory of Rational Choice' published by the author Hans Rott?"],"info":{}}
{"id":"train_1327","question":"Did Dailey, D. J. publish in IEEE Intell. Transp. Syst. Mag. in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/85/1424> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'IEEE Intell. Transp. Syst. Mag.' }","paraphrases":["Has Daniel J. Dailey published in IEEE Intell. Transp. Syst. Mag. in the last 4 years?"],"info":{}}
{"id":"train_1330","question":"Did Madeira, H. publish in LADC in the last 7 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/33/2879> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:publishedIn 'LADC' }","paraphrases":["Has Henrique Madeira published in LADC in the last 7 years?"],"info":{}}
{"id":"train_1331","question":"Did Bj\\u00F6rn W. Schuller publish the paper 'Emotional Expressions and Daily Cognitive Functions'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/series/sist/Schuller15> dblp:authoredBy <https://dblp.org/pid/54/4934> }","paraphrases":["Was the paper 'Emotional Expressions and Daily Cognitive Functions' published by the author Bj\\u00F6rn W. Schuller?"],"info":{}}
{"id":"train_1332","question":"Was the paper 'CLEAR-test: Combining inference for differential expression and variability in microarray data analysis' published by the person named Gabriel Capell\\u00E1?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jbi/VallsGSHMDPCMP08> dblp:authoredBy <https://dblp.org/pid/03/5059> }","paraphrases":["Did Gabriel Capell\\u00E1 publish the paper 'CLEAR-test: Combining inference for differential expression and variability in microarray data analysis'?"],"info":{}}
{"id":"train_1333","question":"Did Schroeder, M. publish the paper 'Old friends in new guise: repositioning of known drugs with structural bioinformatics' in the last 7 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bib/HauptS11> dblp:authoredBy <https://dblp.org/pid/s/MichaelSchroeder> . <https://dblp.org/rec/journals/bib/HauptS11> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Did Michael Schroeder publish the paper 'Old friends in new guise: repositioning of known drugs with structural bioinformatics' in the last seven years?"],"info":{}}
{"id":"train_1334","question":"Was the paper 'Towards the Distributed Implementation of Discrete Event Simulation Languages' co-authored by J. Miguel and Gra\\u00F1a, Manuel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ifip10-3/MiguelG93> dblp:authoredBy <https://dblp.org/pid/83/1223> . <https://dblp.org/rec/conf/ifip10-3/MiguelG93> dblp:authoredBy <https://dblp.org/pid/13/4327> }","paraphrases":["Have J. Miguel and Gra\\u00F1a, Manuel co-authored the paper 'Towards the Distributed Implementation of Discrete Event Simulation Languages'?"],"info":{}}
{"id":"train_1335","question":"Did Yiu-Kai Ng publish the paper 'A Formal Approach for Horizontal Fragmentation in Distributed Deductive Database Design' in the last 4 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dexa/LimN96> dblp:authoredBy <https://dblp.org/pid/08/4453> . <https://dblp.org/rec/conf/dexa/LimN96> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Did Yiu-Kai Ng publish the paper 'A Formal Approach for Horizontal Fragmentation in Distributed Deductive Database Design' in the last four years?"],"info":{}}
{"id":"train_1336","question":"Was the paper 'Zero-Sum Markov Games with Impulse Controls' published by the person named Stettner, Lukasz?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamco/BasuS20> dblp:authoredBy <https://dblp.org/pid/59/7141> }","paraphrases":["Did Lukasz Stettner publish the paper 'Zero-Sum Markov Games with Impulse Controls'?"],"info":{}}
{"id":"train_1337","question":"Did Yu-Lun Huang publish the paper 'Attacks against process control systems: risk assessment, detection, and response' in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccs/CardenasALHHS11> dblp:authoredBy <https://dblp.org/pid/67/1826> . <https://dblp.org/rec/conf/ccs/CardenasALHHS11> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) }","paraphrases":["Did Yu-Lun Huang publish the paper 'Attacks against process control systems: risk assessment, detection, and response' in the last five years?"],"info":{}}
