{"id":"train_5756","question":"Mention the venues in which 'A reappraisal on advanced planning and scheduling systems' and 'Novel microwave bandpass filter with compact size and good out-of-band performance for microwave photonic filter applications' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/imds/LinHW07> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/mwscas/Escobar-PelaezO12> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'A reappraisal on advanced planning and scheduling systems' and 'Novel microwave bandpass filter with compact size and good out-of-band performance for microwave photonic filter applications' published?"],"info":{}}
{"id":"train_5757","question":"List the venues in which 'Modifikationen des Tomita-Parsers f\\u00FCr ID/LP und Feature Grammars' and 'Non-redundant clustering with conditional ensembles' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ldvf/Woch95> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/kdd/GondekH05> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Modifikationen des Tomita-Parsers f\\u00FCr ID/LP und Feature Grammars' and 'Non-redundant clustering with conditional ensembles' published?"],"info":{}}
{"id":"train_5760","question":"List the venues in which 'Optical Fingerprinting to Protect Data: A Proposal' and 'Spectra Restoration of Bone-Conducted Speech via Attention-Based Contextual Information and Spectro-Temporal Structure Constraint' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/computer/Potlapally02> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/ieicet/ZhengCYZS19> dblp:publishedIn ?answer } }","paraphrases":["Mention the venues in which 'Optical Fingerprinting to Protect Data: A Proposal' and 'Spectra Restoration of Bone-Conducted Speech via Attention-Based Contextual Information and Spectro-Temporal Structure Constraint' were published."],"info":{}}
{"id":"train_5761","question":"Mention the venues in which 'A Model of Morphological Productivity' and 'Business Model Application of UML Stereotypes' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jql/WimmerA95> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/books/idea/encyclopedia2005/Brandon05> dblp:publishedIn ?answer } }","paraphrases":["Where were 'A Model of Morphological Productivity' and 'Business Model Application of UML Stereotypes' published?"],"info":{}}
{"id":"train_5762","question":"Who are the authors of 'Case-Based Reasoning for Reuse and Validation of System Development Processes' and 'Speech coding using mixture of gaussians polynomial model'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iccbr/FunkC99> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/iccbr/FunkC99> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Case-Based Reasoning for Reuse and Validation of System Development Processes' and the publication 'Speech coding using mixture of gaussians polynomial model'?"],"info":{}}
{"id":"train_5763","question":"List the venues in which 'On the Maximum Efficiency of Power Amplifiers in OFDM Broadcast Systems with Envelope Following' and 'A Data Mining Architecture for Distributed Environments' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/mobilight/WolfEE10> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/iics/AshrafiTS02> dblp:publishedIn ?answer } }","paraphrases":["Where were 'On the Maximum Efficiency of Power Amplifiers in OFDM Broadcast Systems with Envelope Following' and 'A Data Mining Architecture for Distributed Environments' published?"],"info":{}}
{"id":"train_5767","question":"Mention the venues in which 'Stability of slotted ALOHA with spatial diversity' and 'Development of an Amazon Alexa App for a University Online Search' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/icc/NawareT03> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/hci/RupitzEE22> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Stability of slotted ALOHA with spatial diversity' and 'Development of an Amazon Alexa App for a University Online Search' published?"],"info":{}}
{"id":"train_5769","question":"Name the authors of 'Heartbeat for \\Where we work\\' and 'A Reliability-Based Multi-Algorithm Fusion Technique in Detecting Changes in Land Cover'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/siggraph/Casey97> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/siggraph/Casey97> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Heartbeat for \\Where we work\\' and the publication 'A Reliability-Based Multi-Algorithm Fusion Technique in Detecting Changes in Land Cover'?"],"info":{}}
{"id":"train_5772","question":"Mention the years in which 'Detecting Events in Video Data Using a Formal Ontology of Motion Verbs' and 'ARIS Process Performance Manager' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/spatialCognition/DOdoricoB12> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/mmb/Fischer08> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Detecting Events in Video Data Using a Formal Ontology of Motion Verbs' and 'ARIS Process Performance Manager' published?"],"info":{}}
{"id":"train_5775","question":"Mention the venues in which 'Comparing Repository Types: Challenges and Barriers for Subject-Based Repositories, Research Repositories, National Repository Systems and Institutional Repositories in Serving Scholarly Communication' and 'Changing Models of Library Education to Benefit Rural Communities' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ijdls/ArmbrusterR10> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/plq/PerrymanJ20> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Comparing Repository Types: Challenges and Barriers for Subject-Based Repositories, Research Repositories, National Repository Systems and Institutional Repositories in Serving Scholarly Communication' and 'Changing Models of Library Education to Benefit Rural Communities' published?"],"info":{}}
{"id":"train_5776","question":"Mention the venues in which 'Use and gratification in e-consumers' and 'Not all datasets are born equal: On heterogeneous tabular data and adversarial examples' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/intr/Huang08> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/kbs/MathovLKSE22> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Use and gratification in e-consumers' and 'Not all datasets are born equal: On heterogeneous tabular data and adversarial examples' published?"],"info":{}}
{"id":"train_5778","question":"Mention the venues in which 'Extracting Subjective Object Contours against Complex Background - Is a Zebra Visible? -' and 'Autonomous system for navigation and surveying in underground mines' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/interact/BannoOTS01> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/jfr/BakambuP07> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Extracting Subjective Object Contours against Complex Background - Is a Zebra Visible? -' and 'Autonomous system for navigation and surveying in underground mines' were published."],"info":{}}
{"id":"train_5781","question":"Name the authors of 'Dissecting protein loops with a statistical scalpel suggests a functional implication of some structural motifs' and 'Calibration Method of Multi-Channel based on Steepest Descent'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/bmcbi/RegadMC11> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/bmcbi/RegadMC11> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Dissecting protein loops with a statistical scalpel suggests a functional implication of some structural motifs' and the publication 'Calibration Method of Multi-Channel based on Steepest Descent'?"],"info":{}}
{"id":"train_5782","question":"Mention the years in which 'An inference system for relationships between spatial granularities' and 'Performance evaluation of respite care services through multi-agent based simulation' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/gis/PozzaniC11> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/wsc/BatataAEX17> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'An inference system for relationships between spatial granularities' and 'Performance evaluation of respite care services through multi-agent based simulation' published?"],"info":{}}
{"id":"train_5784","question":"Name the authors of 'Comparing Spoken Language Route Instructions for Robots across Environment Representations' and 'A Gaussian Input Is Not Too Bad'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/sigdial/MargeR10> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/sigdial/MargeR10> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Comparing Spoken Language Route Instructions for Robots across Environment Representations' and the publication 'A Gaussian Input Is Not Too Bad'?"],"info":{}}
{"id":"train_5790","question":"Mention the years in which 'Development of 2-DOF robotic exoskeleton for upper limb rehabilitation after stroke' and 'Self-Control in Cyberspace: Applying Dual Systems Theory to a Review of Digital Self-Control Tools' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/ro-man/ParkPYDJC13> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/chi/LyngsLSBSIKS19> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Development of 2-DOF robotic exoskeleton for upper limb rehabilitation after stroke' and 'Self-Control in Cyberspace: Applying Dual Systems Theory to a Review of Digital Self-Control Tools' published?"],"info":{}}
{"id":"train_5791","question":"List the venues in which 'Object tracking and matting for a class of dynamic image-based representations' and 'The case against data lock-in' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/avss/GanCS05> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/cacm/FitzpatrickL10> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Object tracking and matting for a class of dynamic image-based representations' and 'The case against data lock-in' published?"],"info":{}}
{"id":"train_5793","question":"Name the authors of 'Automating the Development of Chosen Ciphertext Attacks' and 'An adaptive finite-volume method for a model of two-phase pedestrian flow'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/uss/BeckZ020> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/uss/BeckZ020> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Automating the Development of Chosen Ciphertext Attacks' and 'An adaptive finite-volume method for a model of two-phase pedestrian flow'?"],"info":{}}
{"id":"train_5794","question":"Mention the years in which 'SAViR-T: Spatially Attentive Visual Reasoning with Transformers' and 'A Mathematical Approach to Multi-Pass Parsing' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-2206-09265> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/mfcs/HoffmannS80> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'SAViR-T: Spatially Attentive Visual Reasoning with Transformers' and 'A Mathematical Approach to Multi-Pass Parsing' published?"],"info":{}}
{"id":"train_5802","question":"Name the authors of 'Learning Pixel-wise Labeling from the Internet without Human Interaction' and 'Blacklists vs Whitelists'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-1805-07548> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/corr/abs-1805-07548> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Learning Pixel-wise Labeling from the Internet without Human Interaction' and 'Blacklists vs Whitelists'?"],"info":{}}
{"id":"train_5804","question":"Mention the venues in which 'A Dual-Mode Intelligent Shopping Assistant' and 'Convergence of probabilities for the second order monadic properties of a random mapping' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/aiss/Al-Safadi10> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/rsa/LuczakT97> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'A Dual-Mode Intelligent Shopping Assistant' and 'Convergence of probabilities for the second order monadic properties of a random mapping' published?"],"info":{}}
{"id":"train_5805","question":"Who are the authors of 'Mixed-signal implementation of a nonlinear decoder for delta-sigma encoded stream' and 'SINE: Side Information Network Embedding'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iscas/WakeKB06> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/iscas/WakeKB06> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Mixed-signal implementation of a nonlinear decoder for delta-sigma encoded stream' and the publication 'SINE: Side Information Network Embedding'?"],"info":{}}
{"id":"train_5806","question":"Mention the years in which 'Detection and Mitigation of Attacks by Colluding Misbehaving Nodes in MANET' and 'A Database Search Algorithm for Identification of Peptides with Multiple Charges Using Tandem Mass Spectrometry' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/cnsa/GeraGM10> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/pakdd/NingCL06> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Detection and Mitigation of Attacks by Colluding Misbehaving Nodes in MANET' and 'A Database Search Algorithm for Identification of Peptides with Multiple Charges Using Tandem Mass Spectrometry' published?"],"info":{}}
{"id":"train_5810","question":"Mention the venues in which 'Analyzing Immunohistochemically Stained Whole-Slide Images of Ovarian Carcinoma' and 'Efficiently Answering Probability Threshold-Based Shortest Path Queries over Uncertain Graphs' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/bildmed/BugGSFM17> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/dasfaa/YuanCW10> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Analyzing Immunohistochemically Stained Whole-Slide Images of Ovarian Carcinoma' and 'Efficiently Answering Probability Threshold-Based Shortest Path Queries over Uncertain Graphs' were published."],"info":{}}
{"id":"train_5811","question":"Mention the venues in which 'ABCDE: An Agent-Based Cognitive Development Environment' and 'Stability and Evolutionary Trend of Hopf Bifurcations in Double-Input SEPIC DC-DC Converters' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/abs-2206-04909> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/ijbc/0033JDDLM19> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'ABCDE: An Agent-Based Cognitive Development Environment' and 'Stability and Evolutionary Trend of Hopf Bifurcations in Double-Input SEPIC DC-DC Converters' published?"],"info":{}}
{"id":"train_5813","question":"Mention the years in which 'Copula-based Randomized Mechanisms for Truthful Scheduling on Two Unrelated Machines' and 'SwissAlps at SemEval-2017 Task 3: Attention-based Convolutional Neural Network for Community Question Answering' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/ChenDZ13> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/semeval/DeriuC17> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Copula-based Randomized Mechanisms for Truthful Scheduling on Two Unrelated Machines' and 'SwissAlps at SemEval-2017 Task 3: Attention-based Convolutional Neural Network for Community Question Answering' published?"],"info":{}}
{"id":"train_5814","question":"Mention the venues in which 'Multi-models-based engineering of collaborative systems: application to collision avoidance operations for spacecraft' and 'An Auction Mechanism Considering Seat Reservations in Movie Theater Services' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/eics/MartinieBNPFPC14> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/ijoci/NishinoFU11> dblp:publishedIn ?answer } }","paraphrases":["List the venues in which 'Multi-models-based engineering of collaborative systems: application to collision avoidance operations for spacecraft' and 'An Auction Mechanism Considering Seat Reservations in Movie Theater Services' were published."],"info":{}}
{"id":"train_5817","question":"Mention the years in which 'A novel line detection method in space-time images for microvascular blood flow analysis in sublingual microcirculatory videos' and 'A Socratic Tutor for Source Code Comprehension' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/isbi/YouMSE13> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/aied/AlshaikhTR20> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'A novel line detection method in space-time images for microvascular blood flow analysis in sublingual microcirculatory videos' and 'A Socratic Tutor for Source Code Comprehension' published?"],"info":{}}
{"id":"train_5818","question":"Mention the years in which 'Emulating dynamic non-linear simulators using Gaussian processes' and 'Non-linear gradient algorithm for parameter estimation' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/csda/MohammadiCG19> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/cdc/Rueda-EscobedoM15> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Emulating dynamic non-linear simulators using Gaussian processes' and 'Non-linear gradient algorithm for parameter estimation' published?"],"info":{}}
{"id":"train_5819","question":"Mention the venues in which 'Fault-Tolerance of Self-Timed Circuits' and 'Differential phase encoded measurement-device-independent quantum key distribution' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/dessert/StepchenkovKDRD19> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/qip/RanuPM21> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Fault-Tolerance of Self-Timed Circuits' and 'Differential phase encoded measurement-device-independent quantum key distribution' published?"],"info":{}}
{"id":"train_5821","question":"List the venues in which 'Xylem: enhancing vertical thermal conduction in 3D processor-memory stacks' and 'A Novel Adaptive Reclosure Criterion for HV Transmission Lines Based on Wavelet Packet Energy Entropy' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/micro/AgrawalTI17> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/isnn/ZhangGS09> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Xylem: enhancing vertical thermal conduction in 3D processor-memory stacks' and 'A Novel Adaptive Reclosure Criterion for HV Transmission Lines Based on Wavelet Packet Energy Entropy' published?"],"info":{}}
{"id":"train_5822","question":"Name the authors of 'Correcting for Recency Bias in Job Recommendation' and 'Worst case QC-MDPC decoder for McEliece cryptosystem'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/cikm/ChenAJC19> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/cikm/ChenAJC19> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Correcting for Recency Bias in Job Recommendation' and 'Worst case QC-MDPC decoder for McEliece cryptosystem'?"],"info":{}}
{"id":"train_5823","question":"List the venues in which 'The \\meaning\\ of citation in the context of a scientifically peripheral country' and 'Humans use multi-objective control to regulate lateral foot placement when walking' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/scientometrics/Velho86> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/ploscb/DingwellC19> dblp:publishedIn ?answer } }","paraphrases":["Where were 'The \\meaning\\ of citation in the context of a scientifically peripheral country' and 'Humans use multi-objective control to regulate lateral foot placement when walking' published?"],"info":{}}
{"id":"train_5828","question":"Mention the years in which 'Multi-Feature-Based Bilinear CNN for Single Image Dehazing' and 'Relational Databases Watermark Technique Based on Content Characteristic' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/access/FuWS19> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/icicic/ZhangNZLL06> dblp:yearOfPublication ?answer } }","paraphrases":["When were the publications 'Multi-Feature-Based Bilinear CNN for Single Image Dehazing' and 'Relational Databases Watermark Technique Based on Content Characteristic' published?"],"info":{}}
{"id":"train_5829","question":"Name the authors of 'Neuro-Evolution and Robustness: A Case Study' and 'A Generalized Energy Functional for Plane Couette Flow'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/gamesem/WeeksRP18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/gamesem/WeeksRP18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Neuro-Evolution and Robustness: A Case Study' and the publication 'A Generalized Energy Functional for Plane Couette Flow'?"],"info":{}}
{"id":"train_5832","question":"Name the authors of 'Special Issue of selected papers from the 8th Dagstuhl seminar on Geometric Modeling' and 'The perfect groups of order up to two million'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/cvgip/GrandineHPW12> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/cvgip/GrandineHPW12> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Special Issue of selected papers from the 8th Dagstuhl seminar on Geometric Modeling' and 'The perfect groups of order up to two million'?"],"info":{}}
{"id":"train_5835","question":"List the venues in which 'Accurate 2d finite element calculations for hydrogen in magnetic fields of arbitrary strength' and 'Special issue on broadband and wireless computing, communication and applications' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/cphysics/SchimeczekW14> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/jaihc/TangHB13> dblp:publishedIn ?answer } }","paraphrases":["Where were 'Accurate 2d finite element calculations for hydrogen in magnetic fields of arbitrary strength' and 'Special issue on broadband and wireless computing, communication and applications' published?"],"info":{}}
{"id":"train_5836","question":"Name the authors of 'Local and Global Stability Analysis of Dengue Disease with Vaccination and Optimal Control' and 'Movie editing and cognitive event segmentation in virtual reality video'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/symmetry/ChamnanPTW21> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/symmetry/ChamnanPTW21> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Local and Global Stability Analysis of Dengue Disease with Vaccination and Optimal Control' and 'Movie editing and cognitive event segmentation in virtual reality video'?"],"info":{}}
{"id":"train_5837","question":"Name the authors of 'Cascaded Revision Network for Novel Object Captioning' and 'Train rescheduling for minimizing passenger travel time under disruption for metro lines'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tcsv/FengWFYXY20> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/tcsv/FengWFYXY20> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Cascaded Revision Network for Novel Object Captioning' and the publication 'Train rescheduling for minimizing passenger travel time under disruption for metro lines'?"],"info":{}}
{"id":"train_5840","question":"Name the authors of 'Relativized NP Search Problems and Propositional Proof Systems' and 'Trust integrated node potential aware routing for WSNs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/coco/Buresh-OppenheimM04> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/coco/Buresh-OppenheimM04> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Relativized NP Search Problems and Propositional Proof Systems' and 'Trust integrated node potential aware routing for WSNs'?"],"info":{}}
{"id":"train_5841","question":"Mention the years in which 'Combining Data Duplication and Graph Reordering to Accelerate Parallel Graph Processing' and 'Tutorial on \\Switching and routing for spatially and spectrally flexible elastic optical networking\\' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/hpdc/BalajiL19> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/hpsr/Tomkos15> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'Combining Data Duplication and Graph Reordering to Accelerate Parallel Graph Processing' and 'Tutorial on \\Switching and routing for spatially and spectrally flexible elastic optical networking\\' published?"],"info":{}}
{"id":"train_5845","question":"Who are the authors of 'Web-Application Development for Tasks of Prediction in Medical Domain' and 'Knowledge-based Fault Diagnosis of Technical Systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/csit/MazorchukDC18> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/csit/MazorchukDC18> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of the paper 'Web-Application Development for Tasks of Prediction in Medical Domain' and the publication 'Knowledge-based Fault Diagnosis of Technical Systems'?"],"info":{}}
{"id":"train_5849","question":"Mention the venues in which 'Text-independent speaker verification using virtual speaker based cohort normalization' and 'Semantic querying over knowledge in biomedical text corpora annotated with multiple ontologies' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/interspeech/IsobeT99> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/bcb/ChuaK12> dblp:publishedIn ?answer } }","paraphrases":["Where were the publications 'Text-independent speaker verification using virtual speaker based cohort normalization' and 'Semantic querying over knowledge in biomedical text corpora annotated with multiple ontologies' published?"],"info":{}}
{"id":"train_5851","question":"Mention the years in which 'An Exact Closed-Form Expression for the BER of Binary Modulations with Dual-Branch Selection over Generalized-K Fading' and 'Autonomy requirements engineering: a case study on the BepiColombo mission' were published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/vtc/AnsariAYAY11> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/c3s2e/VassevH13> dblp:yearOfPublication ?answer } }","paraphrases":["When were 'An Exact Closed-Form Expression for the BER of Binary Modulations with Dual-Branch Selection over Generalized-K Fading' and 'Autonomy requirements engineering: a case study on the BepiColombo mission' published?"],"info":{}}
{"id":"train_5853","question":"Name the authors of 'Hankel determinants for some common lattice paths' and 'A Type-II Analog PLL with Time-Domain Processing'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/aam/SulankeX08> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/journals/aam/SulankeX08> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Hankel determinants for some common lattice paths' and 'A Type-II Analog PLL with Time-Domain Processing'?"],"info":{}}
{"id":"train_5855","question":"Name the authors of 'Deep Ensemble Learning Model for Long-Term Travel Time Prediction on Highways' and 'Double-entry Accounting Provides Software-Independent Algorithm for Confirming the Integrity of Automated Election Tallies'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/aike/HoCHW21> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/aike/HoCHW21> dblp:authoredBy ?answer } }","paraphrases":["Who are the authors of 'Deep Ensemble Learning Model for Long-Term Travel Time Prediction on Highways' and 'Double-entry Accounting Provides Software-Independent Algorithm for Confirming the Integrity of Automated Election Tallies'?"],"info":{}}
