{"id":"train_6825","question":"Mention the year in which the first papers of the authors of 'The effects of femoral neck cut, cable tension, and muscles forces on the greater trochanter fixation' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/journals/mbec/PetitCDL12> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'The effects of femoral neck cut, cable tension, and muscles forces on the greater trochanter fixation' published?"],"info":{}}
{"id":"train_6829","question":"Which one was published first, 'President's letter to the ACM membership: involvement' or 'North Pole Adventures'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cacm/Galler68c> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/tkl/Boytchev02> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/cacm/Galler68c> , <https://dblp.org/rec/journals/tkl/Boytchev02> ) AS ?answer ) }","paraphrases":["Between 'President's letter to the ACM membership: involvement' and 'North Pole Adventures', which paper was published earlier?"],"info":{}}
{"id":"train_6830","question":"Between 'A Smart Technique to Forecast Karachi Stock Market Share-Values using ARIMA Model' and 'A Study of Phase Noise and Frequency Error of a Fractional-N PLL in the Course of FMCW Chirp Generation', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fit/LatifNRF21> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/tcas/ErgintavHFK19> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/fit/LatifNRF21> , <https://dblp.org/rec/journals/tcas/ErgintavHFK19> ) AS ?answer ) }","paraphrases":["Which one was published first, 'A Smart Technique to Forecast Karachi Stock Market Share-Values using ARIMA Model' or 'A Study of Phase Noise and Frequency Error of a Fractional-N PLL in the Course of FMCW Chirp Generation'?"],"info":{}}
{"id":"train_6831","question":"Mention the year in which the first papers of the authors of 'The Study of the Solution on Multi-objective Linear Programming Problem under Fuzzy' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/apwcs/CuiQPWL10> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["In which year were the first papers of the authors of 'The Study of the Solution on Multi-objective Linear Programming Problem under Fuzzy' published?"],"info":{}}
{"id":"train_6833","question":"Mention the author who has published the most papers among the authors of 'Augmenting processes with decision intelligence: Principles for integrated modelling'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/journals/dss/HasicSV18> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Augmenting processes with decision intelligence: Principles for integrated modelling'?"],"info":{}}
{"id":"train_6836","question":"Between 'Bio-inspired multi-robot communication through behavior recognition' and 'Template-based Recognition of Static Sitting Postures', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/robio/NovitzkyPCBW12> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/cvpr/ZhuMT03> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/robio/NovitzkyPCBW12> , <https://dblp.org/rec/conf/cvpr/ZhuMT03> ) AS ?answer ) }","paraphrases":["Between 'Bio-inspired multi-robot communication through behavior recognition' and 'Template-based Recognition of Static Sitting Postures', which paper has more authors?"],"info":{}}
{"id":"train_6837","question":"Between 'A Generic Improvement to Deep Residual Networks Based on Gradient Flow' and 'Designing a Web Page Considering the Interaction Characteristics of the Hard-of-Hearing', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tnn/SanthanamD20> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/icchp/NamatameNK06> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/tnn/SanthanamD20> , <https://dblp.org/rec/conf/icchp/NamatameNK06> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'A Generic Improvement to Deep Residual Networks Based on Gradient Flow' or 'Designing a Web Page Considering the Interaction Characteristics of the Hard-of-Hearing'?"],"info":{}}
{"id":"train_6840","question":"Between 'Structure properties of min-max systems and existence of global cycle time' and 'Leveraging colour segmentation for upper-body detection', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tac/ZhaoZZ01> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/pr/DuffnerO14> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/tac/ZhaoZZ01> , <https://dblp.org/rec/journals/pr/DuffnerO14> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Structure properties of min-max systems and existence of global cycle time' or 'Leveraging colour segmentation for upper-body detection'?"],"info":{}}
{"id":"train_6841","question":"Between 'Data Bank Design of Current Pests of Wheat and Barely Based on Iranian Environment' and 'High-order compact scheme for solving nonlinear Black-Scholes equation with transaction cost', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icecs/Sadeghi09> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ijcm/LiaoK09> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/icecs/Sadeghi09> , <https://dblp.org/rec/journals/ijcm/LiaoK09> ) AS ?answer ) }","paraphrases":["Which one has more number of authors, 'Data Bank Design of Current Pests of Wheat and Barely Based on Iranian Environment' or 'High-order compact scheme for solving nonlinear Black-Scholes equation with transaction cost'?"],"info":{}}
{"id":"train_6845","question":"Which one was published first, 'Application of Extreme Value Analysis to Extreme Drought Disaster Area in China' or 'LIMOFilling: Local Information Guide Hole-Filling and Sharp Feature Recovery for Manifold Meshes'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/series/crm/XuWC11> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/remotesensing/GouSLPGYH22> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/series/crm/XuWC11> , <https://dblp.org/rec/journals/remotesensing/GouSLPGYH22> ) AS ?answer ) }","paraphrases":["Between 'Application of Extreme Value Analysis to Extreme Drought Disaster Area in China' and 'LIMOFilling: Local Information Guide Hole-Filling and Sharp Feature Recovery for Manifold Meshes', which paper was published earlier?"],"info":{}}
{"id":"train_6849","question":"Mention the author who has published the most papers among the authors of 'DDA\\\\Repository: An Associative, Dynamic and Incremental Repository of Design Diagrams'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/diagrams/DaveJ12> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'DDA\\\\Repository: An Associative, Dynamic and Incremental Repository of Design Diagrams'?"],"info":{}}
{"id":"train_6850","question":"To which institution are the majority of the authors of 'Nonlinear Regularized Reaction-Diffusion Filters for Denoising of Images With Textures' affiliated?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tip/PlonkaM08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Where are most of the authors of 'Nonlinear Regularized Reaction-Diffusion Filters for Denoising of Images With Textures' from?"],"info":{}}
{"id":"train_6852","question":"Which one was published first, 'Evaluating policies and mechanisms to support distributed real-time applications with CORBA' or 'Application of a GIS-Based Slope Unit Method for Landslide Susceptibility Mapping along the Longzi River, Southeastern Tibetan Plateau, China'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/concurrency/ORyanSKSPPL01> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/ijgi/WangXWWJ17> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/concurrency/ORyanSKSPPL01> , <https://dblp.org/rec/journals/ijgi/WangXWWJ17> ) AS ?answer ) }","paraphrases":["Between 'Evaluating policies and mechanisms to support distributed real-time applications with CORBA' and 'Application of a GIS-Based Slope Unit Method for Landslide Susceptibility Mapping along the Longzi River, Southeastern Tibetan Plateau, China', which paper was published earlier?"],"info":{}}
{"id":"train_6854","question":"Between 'Extending ACTS operations through a university-based consortium' and 'Capacity lower bound and energy efficiency of training-based MIMO systems over correlated channels', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/spacecomm/BauerKIK02> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ijcomsys/PangLJ09> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/spacecomm/BauerKIK02> , <https://dblp.org/rec/journals/ijcomsys/PangLJ09> ) AS ?answer ) }","paraphrases":["Between 'Extending ACTS operations through a university-based consortium' and 'Capacity lower bound and energy efficiency of training-based MIMO systems over correlated channels', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6855","question":"Between 'Enhanced position location with UWB in obstructed LOS and NLOS multipath environments' and 'Learning Multiple Categories on Deep Convolution Networks', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eusipco/ShahT05> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/abs-1802-07672> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/eusipco/ShahT05> , <https://dblp.org/rec/journals/corr/abs-1802-07672> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Enhanced position location with UWB in obstructed LOS and NLOS multipath environments' or 'Learning Multiple Categories on Deep Convolution Networks'?"],"info":{}}
{"id":"train_6857","question":"Mention the year in which the first papers of the authors of 'The Dial: Exploring Computational Strangeness' were published.","sparql":"SELECT DISTINCT ?answer MIN(xsd:integer(?y)) AS ?y WHERE { <https://dblp.org/rec/conf/chi/AndersenK16> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#authoredBy> ?answer . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?y }","paraphrases":["When were the first papers of the authors of 'The Dial: Exploring Computational Strangeness' published?"],"info":{}}
{"id":"train_6859","question":"Which one has more number of authors, 'Detect Glaucoma with Image Segmentation and Transfer Learning' or 'Virtual private network for wellness sports information'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ca/WuLSSLBK19a> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/mta/KangKK15a> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/ca/WuLSSLBK19a> , <https://dblp.org/rec/journals/mta/KangKK15a> ) AS ?answer ) }","paraphrases":["Between 'Detect Glaucoma with Image Segmentation and Transfer Learning' and 'Virtual private network for wellness sports information', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6861","question":"Name the primary affiliation of most of the authors of 'An Analysis of Database Workload Performance on Simultaneous Multithreaded Processors'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/isca/LoBEGLP98> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'An Analysis of Database Workload Performance on Simultaneous Multithreaded Processors'?"],"info":{}}
{"id":"train_6864","question":"Which one was published first, 'Super-resolution from learning the enhancement ratio and texture/residual dictionary' or 'Application of fuzzy TOPSIS in evaluating sustainable transportation systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icip/Lin15> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/eswa/AwasthiCO11> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/icip/Lin15> , <https://dblp.org/rec/journals/eswa/AwasthiCO11> ) AS ?answer ) }","paraphrases":["Between 'Super-resolution from learning the enhancement ratio and texture/residual dictionary' and 'Application of fuzzy TOPSIS in evaluating sustainable transportation systems', which paper was published earlier?"],"info":{}}
{"id":"train_6865","question":"Which one was published first, 'Formal Verification Using Edge-Valued Binary Decision Diagrams' or 'Representing Deep Neural Networks Latent Space Geometries with Graphs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tc/LaiPV96> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/abs-2011-07343> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/tc/LaiPV96> , <https://dblp.org/rec/journals/corr/abs-2011-07343> ) AS ?answer ) }","paraphrases":["Between 'Formal Verification Using Edge-Valued Binary Decision Diagrams' and 'Representing Deep Neural Networks Latent Space Geometries with Graphs', which paper was published earlier?"],"info":{}}
{"id":"train_6866","question":"Mention the author who has published the most papers among the authors of 'Mining Multiple Visual Appearances of Semantics for Image Annotation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/mmm/TanN07> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Mining Multiple Visual Appearances of Semantics for Image Annotation'?"],"info":{}}
{"id":"train_6867","question":"Between 'Human crowd detection for physical sensing assisted geo-social multimedia mining' and 'A Display and Analysis Tool for Process-Resource Graphs', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/infocom/FujitaHHYHS15> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/sigops/SamadzadehK96> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/infocom/FujitaHHYHS15> , <https://dblp.org/rec/journals/sigops/SamadzadehK96> ) AS ?answer ) }","paraphrases":["Between 'Human crowd detection for physical sensing assisted geo-social multimedia mining' and 'A Display and Analysis Tool for Process-Resource Graphs', which paper has more authors?"],"info":{}}
{"id":"train_6868","question":"Between 'Security Analysis of SIP Signalling during NASS-IMS bundled Authentication' and 'Closed-form analysis for indirect learning digital pre-distorter for wideband wireless systems', which paper was published earlier?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icns/KostopoulosK07> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/phycomm/ElaskaryMFE22> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/icns/KostopoulosK07> , <https://dblp.org/rec/journals/phycomm/ElaskaryMFE22> ) AS ?answer ) }","paraphrases":["Which one was published first, 'Security Analysis of SIP Signalling during NASS-IMS bundled Authentication' or 'Closed-form analysis for indirect learning digital pre-distorter for wideband wireless systems'?"],"info":{}}
{"id":"train_6869","question":"Mention the primary affiliation of most of the authors of 'Social Auto-Scaling'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/pdp/SmithGC18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["What is the primary affiliation of most of the authors of the paper 'Social Auto-Scaling'?"],"info":{}}
{"id":"train_6871","question":"Which one has more number of authors, 'Effects of digital switching noise on analog circuits performance' or 'Creating value using public big data: comparison of driving factors from the provider's perspective'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ecctd/BoselliTL07> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/itp/ChoL22> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/ecctd/BoselliTL07> , <https://dblp.org/rec/journals/itp/ChoL22> ) AS ?answer ) }","paraphrases":["Between 'Effects of digital switching noise on analog circuits performance' and 'Creating value using public big data: comparison of driving factors from the provider's perspective', which paper has more authors?"],"info":{}}
{"id":"train_6874","question":"Mention the primary affiliation of most of the authors of 'A Time-Interleaved SAR Assisted Pipeline ADC With a Bias-Enhanced Ring Amplifier'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tcas/ChenWHYR18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Name the primary affiliation of most of the authors of 'A Time-Interleaved SAR Assisted Pipeline ADC With a Bias-Enhanced Ring Amplifier'."],"info":{}}
{"id":"train_6875","question":"Between 'Abstractions of Random Finite-State Machines' and 'Generative Kernel PCA', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/fmsd/Oikonomou01> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/esann/SchreursS18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/fmsd/Oikonomou01> , <https://dblp.org/rec/conf/esann/SchreursS18> ) AS ?answer ) }","paraphrases":["Between 'Abstractions of Random Finite-State Machines' and 'Generative Kernel PCA', which paper has more authors?"],"info":{}}
{"id":"train_6876","question":"Who has published the most papers among the authors of 'K\\u00FCnstliche Intelligenz und G\\u00F6del-Theoreme'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ogai/Frey89> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the author who has published the most papers among the authors of 'K\\u00FCnstliche Intelligenz und G\\u00F6del-Theoreme'."],"info":{}}
{"id":"train_6878","question":"Between 'Audio Features, Precomputed for Podcast Retrieval and Information Access Experiments' and 'A Stochastic Beamformed Amplify-and-Forward Scheme in a Multigroup Multicast MIMO Relay Network With Per-Antenna Power Constraints', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/clef/AlexanderMTYBRK21> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/twc/WuLSM16> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/clef/AlexanderMTYBRK21> , <https://dblp.org/rec/journals/twc/WuLSM16> ) AS ?answer ) }","paraphrases":["Between 'Audio Features, Precomputed for Podcast Retrieval and Information Access Experiments' and 'A Stochastic Beamformed Amplify-and-Forward Scheme in a Multigroup Multicast MIMO Relay Network With Per-Antenna Power Constraints', which paper has more authors?"],"info":{}}
{"id":"train_6879","question":"Which one was published first, 'A bridging-based solution for efficient multicast support in wireless mesh networks' or 'On the Optimization of Behavioral Logic Locking for High-Level Synthesis'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/lcn/AoulMM09> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/corr/abs-2105-09666> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/lcn/AoulMM09> , <https://dblp.org/rec/journals/corr/abs-2105-09666> ) AS ?answer ) }","paraphrases":["Between 'A bridging-based solution for efficient multicast support in wireless mesh networks' and 'On the Optimization of Behavioral Logic Locking for High-Level Synthesis', which paper was published earlier?"],"info":{}}
{"id":"train_6881","question":"Between 'Neuronal Gaussian Process Regression' and 'Communities of attention networks: introducing qualitative and conversational perspectives for altmetrics', which paper has more authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/nips/Friedrich20> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/corr/abs-2006-07937> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/nips/Friedrich20> , <https://dblp.org/rec/journals/corr/abs-2006-07937> ) AS ?answer ) }","paraphrases":["Between 'Neuronal Gaussian Process Regression' and 'Communities of attention networks: introducing qualitative and conversational perspectives for altmetrics', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6884","question":"Which one was published first, 'Colonic Content Assessment from MRI Imaging Using a Semi-automatic Approach' or 'A Risk Assessment Model of Stampede Accidents in Primary and Secondary School Teaching Buildings Based on Bayesian Network'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vcbm/CeballosMVBMMAN19> dblp:yearOfPublication ?x . <https://dblp.org/rec/conf/IEEEicci/ZouZZL19> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/vcbm/CeballosMVBMMAN19> , <https://dblp.org/rec/conf/IEEEicci/ZouZZL19> ) AS ?answer ) }","paraphrases":["Between 'Colonic Content Assessment from MRI Imaging Using a Semi-automatic Approach' and 'A Risk Assessment Model of Stampede Accidents in Primary and Secondary School Teaching Buildings Based on Bayesian Network', which paper was published earlier?"],"info":{}}
{"id":"train_6885","question":"Which one was published first, 'On Control Lyapunov-Razumikhin Functions, Nonconstant Delays, Nonsmooth Feedbacks, and Nonlinear Sampled-Data Stabilization' or 'EXIT charts analysis of a root-like bit mapping for LDPC-coded QAM systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tac/Pepe17> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/dsp/SmithPU17> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/journals/tac/Pepe17> , <https://dblp.org/rec/journals/dsp/SmithPU17> ) AS ?answer ) }","paraphrases":["Between 'On Control Lyapunov-Razumikhin Functions, Nonconstant Delays, Nonsmooth Feedbacks, and Nonlinear Sampled-Data Stabilization' and 'EXIT charts analysis of a root-like bit mapping for LDPC-coded QAM systems', which paper was published earlier?"],"info":{}}
{"id":"train_6886","question":"Name the primary affiliation of most of the authors of 'A Counterexample for the Validity of Using Nuclear Norm as a Convex Surrogate of Rank'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/pkdd/ZhangLZ13> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["To which institution are the majority of the authors of 'A Counterexample for the Validity of Using Nuclear Norm as a Convex Surrogate of Rank' affiliated?"],"info":{}}
{"id":"train_6887","question":"Which one has more number of authors, 'Practical undergraduate projects within the BRSU race academy: An example for conducting a new tutored peer-teaching learning approach' or 'A cost estimation framework to support increased value recovery from end-of-life vehicles'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/educon/ReithHSLGG17> dblp:numberOfCreators ?x . <https://dblp.org/rec/journals/ijcim/CoatesR08> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/conf/educon/ReithHSLGG17> , <https://dblp.org/rec/journals/ijcim/CoatesR08> ) AS ?answer ) }","paraphrases":["Between 'Practical undergraduate projects within the BRSU race academy: An example for conducting a new tutored peer-teaching learning approach' and 'A cost estimation framework to support increased value recovery from end-of-life vehicles', which paper has more number of co-authors?"],"info":{}}
{"id":"train_6888","question":"Which one was published first, 'Finite State Automata as a Data Storage' or 'Scalable Problems and Memory-Bounded Speedup'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dateso/MindekH05> dblp:yearOfPublication ?x . <https://dblp.org/rec/journals/jpdc/SunN93> dblp:yearOfPublication ?y . BIND ( IF ( ?x < ?y , <https://dblp.org/rec/conf/dateso/MindekH05> , <https://dblp.org/rec/journals/jpdc/SunN93> ) AS ?answer ) }","paraphrases":["Between 'Finite State Automata as a Data Storage' and 'Scalable Problems and Memory-Bounded Speedup', which paper was published earlier?"],"info":{}}
{"id":"train_6889","question":"Mention the author who has published the most papers among the authors of 'Effects of PWM excitations on iron loss in electrical steels and machines'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iasam/HussainMSL17> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'Effects of PWM excitations on iron loss in electrical steels and machines'?"],"info":{}}
{"id":"train_6890","question":"Mention the author who has published the most papers among the authors of 'MDC-DFA: A multi-dimensional cube deterministic finite automata-based feature matching algorithm'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?x ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ictc/LiLSW15a> dblp:authoredBy ?answer . ?x dblp:authoredBy ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who has published the most papers among the authors of 'MDC-DFA: A multi-dimensional cube deterministic finite automata-based feature matching algorithm'?"],"info":{}}
{"id":"train_6891","question":"Between 'Preface to advances in numerical simulation of plasmas' and 'Verification of Uncurated Protein Annotations', which paper has more number of co-authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcphy/ParkerC16> dblp:numberOfCreators ?x . <https://dblp.org/rec/books/igi/09/CoutoSLDCA09> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/jcphy/ParkerC16> , <https://dblp.org/rec/books/igi/09/CoutoSLDCA09> ) AS ?answer ) }","paraphrases":["Between 'Preface to advances in numerical simulation of plasmas' and 'Verification of Uncurated Protein Annotations', which paper has more authors?"],"info":{}}
{"id":"train_6892","question":"Which one has more number of authors, 'The Design and Implementation of an Easy-to-Use Object-Oriented Database' or '2D-3D CNN Based Architectures for Spectral Reconstruction From RGB Images'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jise/PanY97> dblp:numberOfCreators ?x . <https://dblp.org/rec/conf/cvpr/KoundinyaSSUMMK18> dblp:numberOfCreators ?y . BIND ( IF ( ?x > ?y , <https://dblp.org/rec/journals/jise/PanY97> , <https://dblp.org/rec/conf/cvpr/KoundinyaSSUMMK18> ) AS ?answer ) }","paraphrases":["Between 'The Design and Implementation of an Easy-to-Use Object-Oriented Database' and '2D-3D CNN Based Architectures for Spectral Reconstruction From RGB Images', which paper has more number of co-authors?"],"info":{}}
