{"id":"train_6392","question":"Mention the count of papers published by the authors of 'Intermittent spike-wave dynamics in a heterogeneous, spatially extended neural mass model' in NeuroImage.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/neuroimage/GoodfellowSB11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'NeuroImage' }","paraphrases":["Count the papers published by the authors of 'Intermittent spike-wave dynamics in a heterogeneous, spatially extended neural mass model' in NeuroImage."],"info":{}}
{"id":"train_6393","question":"Mention the count of papers published by the authors of 'Compact separator decompositions in dynamic trees and applications to labeling schemes' in Distributed Comput..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/dc/KormanP08> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Distributed Comput.' }","paraphrases":["Count the papers published by the authors of 'Compact separator decompositions in dynamic trees and applications to labeling schemes' in Distributed Comput.."],"info":{}}
{"id":"train_6394","question":"Count the different affiliations of the authors of 'SemAxis: A Lightweight Framework to Characterize Domain-Specific Word Semantics Beyond Sentiment'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-1806-05521> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'SemAxis: A Lightweight Framework to Characterize Domain-Specific Word Semantics Beyond Sentiment' have?"],"info":{}}
{"id":"train_6395","question":"In 2013, how many papers did the authors of 'On the rainbow vertex-connection' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/dmgt/LiS13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2013' }","paraphrases":["How many papers did the authors of 'On the rainbow vertex-connection' publish in 2013?"],"info":{}}
{"id":"train_6396","question":"Count the papers published by the authors of 'Partitioned Least Squares' in 2019.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/aiia/EspositoC019> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["In 2019, how many papers did the authors of 'Partitioned Least Squares' publish?"],"info":{}}
{"id":"train_6397","question":"Count the different affiliations of the authors of 'Who are \\stinkybug\\ and \\Packerfan4\\? Email Pseudonyms and Participants' Perceptions of Demography, Productivity, and Personality'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jcmc/HeislerC06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Who are \\stinkybug\\ and \\Packerfan4\\? Email Pseudonyms and Participants' Perceptions of Demography, Productivity, and Personality' have?"],"info":{}}
{"id":"train_6398","question":"Count the different affiliations of the authors of 'Joint-modal Distribution-based Similarity Hashing for Large-scale Unsupervised Deep Cross-modal Retrieval'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sigir/LiuQGZY20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Joint-modal Distribution-based Similarity Hashing for Large-scale Unsupervised Deep Cross-modal Retrieval' have?"],"info":{}}
{"id":"train_6399","question":"Count the papers published by the authors of 'Integration of social and IoT technologies: architectural framework for digital transformation and cyber security challenges' in 2021.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/eis/MendhurwarM21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2021' }","paraphrases":["In 2021, how many papers did the authors of 'Integration of social and IoT technologies: architectural framework for digital transformation and cyber security challenges' publish?"],"info":{}}
{"id":"train_6400","question":"Count the different affiliations of the authors of 'Transient crosslinking kinetics optimize gene cluster interactions'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ploscb/WalkerTLHABF19> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Transient crosslinking kinetics optimize gene cluster interactions' have?"],"info":{}}
{"id":"train_6401","question":"Count the different affiliations of the authors of 'Robust adaptive fault-tolerant control for uncertain nonlinear system with unmodeled dynamics based on fuzzy approximation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijon/YangW16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Robust adaptive fault-tolerant control for uncertain nonlinear system with unmodeled dynamics based on fuzzy approximation' have?"],"info":{}}
{"id":"train_6403","question":"Count the different affiliations of the authors of 'The Entity Registry System From concept to deployment'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/Gramada16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'The Entity Registry System From concept to deployment' have?"],"info":{}}
{"id":"train_6404","question":"Count the different affiliations of the authors of 'Computational Urban Modeling: From Mainframes to Data Streams'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/aaai/Moosavi15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Computational Urban Modeling: From Mainframes to Data Streams' have?"],"info":{}}
{"id":"train_6406","question":"Count the papers published by the authors of 'A Data-Compressive Wired-OR Readout for Massively Parallel Neural Recording' in 2019.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iscas/MuratoreTWCMM19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["In 2019, how many papers did the authors of 'A Data-Compressive Wired-OR Readout for Massively Parallel Neural Recording' publish?"],"info":{}}
{"id":"train_6407","question":"How many authors of 'Direct meshless kernel techniques for time-dependent equations' have University of G\\u00F6ttingen, Germany as their primary affiliation?","sparql":"SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/amc/HonS15> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?answer <https://dblp.org/rdf/schema#primaryAffiliation> 'University of G\\u00F6ttingen, Germany' }","paraphrases":["What is the count of authors of 'Direct meshless kernel techniques for time-dependent equations' who have University of G\\u00F6ttingen as their primary affiliation?"],"info":{}}
{"id":"train_6408","question":"Count the different affiliations of the authors of 'A New Point Access Method Based on Wavelet Trees'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/er/BrisaboaLNS09> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'A New Point Access Method Based on Wavelet Trees' have?"],"info":{}}
{"id":"train_6409","question":"Count the papers published by the authors of 'Influence of community ideology of free software on the formation of moral and ethical culture, life and personal self-determination of the trained' in 2020.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ims2/FedosovM20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2020' }","paraphrases":["How many papers did the authors of 'Influence of community ideology of free software on the formation of moral and ethical culture, life and personal self-determination of the trained' publish in 2020?"],"info":{}}
{"id":"train_6410","question":"How many papers did the authors of 'Polynomial-Time Amoeba Neighborhood Membership and Faster Localized Solving' publish in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/books/daglib/p/AnthonyGGR15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2015' }","paraphrases":["In 2015, how many papers did the authors of 'Polynomial-Time Amoeba Neighborhood Membership and Faster Localized Solving' publish?"],"info":{}}
{"id":"train_6412","question":"Count the papers published by the authors of 'Development of multifunctional system for controlling user access to the Internet' in 2020.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icfnds/ProsvirinDM20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2020' }","paraphrases":["In 2020, how many papers did the authors of 'Development of multifunctional system for controlling user access to the Internet' publish?"],"info":{}}
{"id":"train_6413","question":"Count the different affiliations of the authors of 'Optimal determination of island boundaries besides the optimal placement of D-STATCOM devices and DG units'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/elektrik/RabieA17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Optimal determination of island boundaries besides the optimal placement of D-STATCOM devices and DG units' have?"],"info":{}}
{"id":"train_6414","question":"How many authors of 'Leichtgewichtiges Security Incident und Event Management im Hochschulumfeld' have Leibniz Supercomputing Centre (LRZ) as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/dfn/ZieglerKBS17> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Leibniz Supercomputing Centre (LRZ), Munich, Germany' }","paraphrases":["What is the count of authors of 'Leichtgewichtiges Security Incident und Event Management im Hochschulumfeld' who have Leibniz Supercomputing Centre (LRZ), Munich, Germany as their primary affiliation?"],"info":{}}
{"id":"train_6416","question":"Count the different affiliations of the authors of 'Designing an Intelligent Virtual Agent for Social Communication in Autism'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/aiide/BernardiniPS13> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Designing an Intelligent Virtual Agent for Social Communication in Autism' have?"],"info":{}}
{"id":"train_6419","question":"Mention the count of papers published by the authors of 'Independent Collections of Translates of Boxes and a Conjecture due to Gr\\u00FCbaum' in Discret. Comput. Geom..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/dcg/NaimanW93> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Discret. Comput. Geom.' }","paraphrases":["Count the papers published by the authors of 'Independent Collections of Translates of Boxes and a Conjecture due to Gr\\u00FCbaum' in Discret. Comput. Geom.."],"info":{}}
{"id":"train_6420","question":"Mention the count of papers published by the authors of 'Communication-Aware Hierarchical Online-Placement in Heterogeneous Reconfigurable Systems' in IEEE International Workshop on Rapid System Prototyping.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/rsp/SchneiderMH09> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE International Workshop on Rapid System Prototyping' }","paraphrases":["Count the papers published by the authors of 'Communication-Aware Hierarchical Online-Placement in Heterogeneous Reconfigurable Systems' in IEEE International Workshop on Rapid System Prototyping."],"info":{}}
{"id":"train_6421","question":"In 2011, how many papers did the authors of 'Semantics in Knowledge Management' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/birthday/AbeckerBBHZ11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2011' }","paraphrases":["How many papers did the authors of 'Semantics in Knowledge Management' publish in 2011?"],"info":{}}
{"id":"train_6423","question":"In 2009, how many papers did the authors of 'Colored Pebble Motion on Graphs (Extended Abstract)' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/endm/FujitaNS09> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2009' }","paraphrases":["How many papers did the authors of 'Colored Pebble Motion on Graphs (Extended Abstract)' publish in 2009?"],"info":{}}
{"id":"train_6424","question":"Mention the count of papers published by the authors of 'A Performance Model and Scalability Analysis of the HYCOM Ocean Simulation Application' in IASTED PDCS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/pdcs/BarkerK05> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IASTED PDCS' }","paraphrases":["Count the papers published by the authors of 'A Performance Model and Scalability Analysis of the HYCOM Ocean Simulation Application' in IASTED PDCS."],"info":{}}
{"id":"train_6425","question":"Count the papers published by the authors of 'Generating Proof Obligations for Circuits' in 1993.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/larch/MellergaardS92> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1993' }","paraphrases":["How many papers did the authors of 'Generating Proof Obligations for Circuits' publish in 1993?"],"info":{}}
{"id":"train_6426","question":"Count the papers published by the authors of 'BA-TLS: Blockchain Authentication for Transport Layer Security in Internet of Things' in 2020.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iotsms/BeckwithT20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2020' }","paraphrases":["How many papers did the authors of 'BA-TLS: Blockchain Authentication for Transport Layer Security in Internet of Things' publish in 2020?"],"info":{}}
{"id":"train_6428","question":"Count the different affiliations of the authors of 'Co-designing patient-centered health communication tools for cancer care'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ph/GonzalesR13> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Co-designing patient-centered health communication tools for cancer care' have?"],"info":{}}
{"id":"train_6429","question":"Mention the count of papers published by the authors of 'Complete subdivision algorithms, I: intersection of Bezier curves' in SCG.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/compgeom/Yap06> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'SCG' }","paraphrases":["How many publications did the authors of the paper 'Complete subdivision algorithms, I: intersection of Bezier curves' publish in SCG?"],"info":{}}
{"id":"train_6431","question":"Mention the count of papers published by the authors of 'Improving Relation Classification by Entity Pair Graph' in ACML.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/acml/ZhaoWGL19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ACML' }","paraphrases":["How many publications did the authors of the paper 'Improving Relation Classification by Entity Pair Graph' publish in Asian Conference on Machine Learning?"],"info":{}}
{"id":"train_6433","question":"Count the papers published by the authors of 'On Finite Semi-regular Continued Fractions' in Integers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/int/SarmaK16> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Integers' }","paraphrases":["How many publications did the authors of the paper 'On Finite Semi-regular Continued Fractions' publish in Integers?"],"info":{}}
{"id":"train_6434","question":"Count the papers published by the authors of 'Linear Relaying Design for Spectrum Sharing Non-regenerative MIMO Cognitive Multiple-Relay Systems' in 2015.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/wpc/LiFQ15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2015' }","paraphrases":["In 2015, how many papers did the authors of 'Linear Relaying Design for Spectrum Sharing Non-regenerative MIMO Cognitive Multiple-Relay Systems' publish?"],"info":{}}
{"id":"train_6435","question":"How many papers did the authors of 'A Copyright Protection Scheme of Visual Media in Big Data Environment' publish in ICAIS (1)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icccsec/WangQJG21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICAIS (1)' }","paraphrases":["How many publications did the authors of the paper 'A Copyright Protection Scheme of Visual Media in Big Data Environment' publish in ICAIS?"],"info":{}}
{"id":"train_6436","question":"Count the different affiliations of the authors of 'Linear Compositional Delay Model for the Timing Analysis of Sub-Powered Combinational Circuits'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/isvlsi/ChenSGPCA14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Linear Compositional Delay Model for the Timing Analysis of Sub-Powered Combinational Circuits' have?"],"info":{}}
{"id":"train_6437","question":"In 2008, how many papers did the authors of 'The Effect of Cooperation on Localization Systems Using UWB Experimental Data' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ejasp/DardariCLW08> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2008' }","paraphrases":["How many papers did the authors of 'The Effect of Cooperation on Localization Systems Using UWB Experimental Data' publish in 2008?"],"info":{}}
{"id":"train_6438","question":"Mention the count of papers published by the authors of 'Zero dynamics stabilisation and adaptive trajectory tracking for WIP vehicles through feedback linearisation and LQR technique' in Int. J. Control.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijcon/YueAS16> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Int. J. Control' }","paraphrases":["How many papers did the authors of 'Zero dynamics stabilisation and adaptive trajectory tracking for WIP vehicles through feedback linearisation and LQR technique' publish in Int. J. Control?"],"info":{}}
{"id":"train_6440","question":"How many papers did the authors of 'Accurate lumen diameter measurement in curved vessels in carotid ultrasound: an iterative scale-space and spatial transformation approach' publish in 2017?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/mbec/KumarARSLISSNLG17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2017' }","paraphrases":["In 2017, how many papers did the authors of 'Accurate lumen diameter measurement in curved vessels in carotid ultrasound: an iterative scale-space and spatial transformation approach' publish?"],"info":{}}
{"id":"train_6442","question":"Count the papers published by the authors of 'Towards Robust Image Classification Using Sequential Attention Models' in 2020.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cvpr/ZoranCHGMK20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2020' }","paraphrases":["How many papers did the authors of 'Towards Robust Image Classification Using Sequential Attention Models' publish in 2020?"],"info":{}}
{"id":"train_6443","question":"Count the papers published by the authors of 'Channel Estimation Based on Machine Learning Paradigm for Spatial Modulation OFDM' in CoRR.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2109-07208> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CoRR' }","paraphrases":["How many papers did the authors of 'Channel Estimation Based on Machine Learning Paradigm for Spatial Modulation OFDM' publish in CoRR?"],"info":{}}
{"id":"train_6444","question":"Mention the count of papers published by the authors of 'Special issue on machine learning for nonlinear processing' in Neurocomputing.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijon/TraviesoA14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Neurocomputing' }","paraphrases":["How many papers did the authors of 'Special issue on machine learning for nonlinear processing' publish in Neurocomputing?"],"info":{}}
{"id":"train_6445","question":"Count the papers published by the authors of 'Dissipativity of the Quantum Measurement Model' in ASMTA.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/asmta/ZorinST19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ASMTA' }","paraphrases":["How many publications did the authors of the paper 'Dissipativity of the Quantum Measurement Model' publish in ASMTA?"],"info":{}}
{"id":"train_6446","question":"Count the papers published by the authors of 'Moving Object Localization in Thermal Imagery by Forward-backward MHI' in 2006.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cvpr/YinC06a> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2006' }","paraphrases":["How many papers did the authors of 'Moving Object Localization in Thermal Imagery by Forward-backward MHI' publish in 2006?"],"info":{}}
{"id":"train_6447","question":"Count the different affiliations of the authors of 'Parzen windows for multi-class classification'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jc/PanXXZ08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Parzen windows for multi-class classification' have?"],"info":{}}
{"id":"train_6449","question":"In 2012, how many papers did the authors of 'Improvement in the image transmission of the mobile digital C-arm X-ray system in the operating room' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/bmei/ParkJH12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2012' }","paraphrases":["How many papers did the authors of 'Improvement in the image transmission of the mobile digital C-arm X-ray system in the operating room' publish in 2012?"],"info":{}}
{"id":"train_6453","question":"Count the different affiliations of the authors of 'The subset sum game revisited'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/mst/PieterseW21> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'The subset sum game revisited' have?"],"info":{}}
{"id":"train_6454","question":"Mention the count of papers published by the authors of 'The Distance between the Endpoints of a Longest Path: 10811' in Am. Math. Mon..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tamm/Tracya02> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Am. Math. Mon.' }","paraphrases":["How many papers did the authors of 'The Distance between the Endpoints of a Longest Path: 10811' publish in Am. Math. Mon.?"],"info":{}}
{"id":"train_6457","question":"Count the papers published by the authors of 'An authorization system for digital libraries' in 2002.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/vldb/FerrariAABC02> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2002' }","paraphrases":["How many papers did the authors of 'An authorization system for digital libraries' publish in 2002?"],"info":{}}
{"id":"train_6459","question":"Count the different affiliations of the authors of 'Data-driven algorithms for dimension reduction in causal inference'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/csda/PerssonHWL17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Data-driven algorithms for dimension reduction in causal inference' have?"],"info":{}}
{"id":"train_6460","question":"Count the papers published by the authors of 'Encode the \\STOP\\ command by photo-stimulation for precise control of rat-robot' in 2013.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/embc/ChenQGSXZ13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2013' }","paraphrases":["How many papers did the authors of 'Encode the \\STOP\\ command by photo-stimulation for precise control of rat-robot' publish in 2013?"],"info":{}}
{"id":"train_6461","question":"How many papers did the authors of 'Encoding in the Dark Grand Challenge: an Overview' publish in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icmcs/Anantrasirichai20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2020' }","paraphrases":["In 2020, how many papers did the authors of 'Encoding in the Dark Grand Challenge: an Overview' publish?"],"info":{}}
{"id":"train_6465","question":"Count the different affiliations of the authors of 'Combining sketch and tone for pencil drawing production'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/npar/LuXJ12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Combining sketch and tone for pencil drawing production' have?"],"info":{}}
{"id":"train_6466","question":"Count the papers published by the authors of 'Classifying Smart Objects using capabilities' in 2014.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/smartcomp/HernandezR14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2014' }","paraphrases":["In 2014, how many papers did the authors of 'Classifying Smart Objects using capabilities' publish?"],"info":{}}
{"id":"train_6467","question":"Count the papers published by the authors of 'Optimal multisensor integrated navigation through information space approach' in Phys. Commun..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/phycomm/Li14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Phys. Commun.' }","paraphrases":["Mention the count of papers published by the authors of 'Optimal multisensor integrated navigation through information space approach' in Phys. Commun.."],"info":{}}
{"id":"train_6468","question":"In 2019, how many papers did the authors of 'An Improved Multi-Objective Finite Control Set Model Predictive Control for Grid Connected Three-Level Neutral-Point Clamped Inverter' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/commnet/KatkoutEN19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["How many papers did the authors of 'An Improved Multi-Objective Finite Control Set Model Predictive Control for Grid Connected Three-Level Neutral-Point Clamped Inverter' publish in 2019?"],"info":{}}
