{"id":"train_3198","question":"Find the year in which Marc Hassenzahl published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/78/80> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Marc Hassenzahl published?"],"info":{}}
{"id":"train_3199","question":"When was the first paper by Marco Pavone published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/91/3382> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Pavone, M. published their first paper."],"info":{}}
{"id":"train_3200","question":"With which author does Xuping Zhang has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/1125> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/16/1125> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of X. Zhang and how many papers do they have together?"],"info":{}}
{"id":"train_3201","question":"In which year did the author Prakken, Henry publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/5549> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Henry Prakken in which year?"],"info":{}}
{"id":"train_3202","question":"Find the year in which Blevins, Alan published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/68/2299> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Blevins, Alan published?"],"info":{}}
{"id":"train_3203","question":"When was the last paper by Iber, D. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/35/529> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Dagmar Iber published?"],"info":{}}
{"id":"train_3204","question":"Report the most frequent co-author of Pan, F. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/170/4031> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/170/4031> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Fuquan Pan has the most papers and how many?"],"info":{}}
{"id":"train_3206","question":"Mention the year in which D. Venkata Vara Prasad published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/256/9793> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did D. Venkata Vara Prasad publish the most papers?"],"info":{}}
{"id":"train_3207","question":"Who is the most frequent co-author of Sang Cheol Park and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/21/9151> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/21/9151> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Sang Cheol Park has the most papers and how many?"],"info":{}}
{"id":"train_3208","question":"Report the year in which E. Herring published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/38/9847> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Eva-Maria Herring published?"],"info":{}}
{"id":"train_3209","question":"Mention the year in which Dino Pedreschi published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/p/DPedreschi> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Dino Pedreschi publish the most papers?"],"info":{}}
{"id":"train_3210","question":"In which year was the first paper by Neal R. Harvey published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/60/1220> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Harvey, Neal R. published?"],"info":{}}
{"id":"train_3211","question":"In which year did the author Sun, Hairong publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/54/4808> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Sun, Hairong publish the least papers and how many?"],"info":{}}
{"id":"train_3212","question":"Who is the most frequent co-author of Guo, Y. and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/92/4275> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/92/4275> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Yuan Guo and how many papers do they have together?"],"info":{}}
{"id":"train_3213","question":"In which year did Torsten Hoefler publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/16/3869> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Torsten Hoefler publish the least publications?"],"info":{}}
{"id":"train_3214","question":"Report the year in which Qingqiang Guo published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/43/6811> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Qingqiang Guo published?"],"info":{}}
{"id":"train_3215","question":"In which year was the first paper by S. K\\u00F6pr\\u00FC published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/47/5881> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Sel\\u00E7uk K\\u00F6pr\\u00FC published their first paper."],"info":{}}
{"id":"train_3216","question":"Report the year in which M. Jimbo published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/23/1403> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Masakazu Jimbo published?"],"info":{}}
{"id":"train_3217","question":"Find the year in which Duan, Ye published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/35/1832> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Ye Duan published?"],"info":{}}
{"id":"train_3218","question":"Who is the most frequent co-author of Ankit Saini and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/307/0815> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/307/0815> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Ankit Saini has the most papers and how many?"],"info":{}}
{"id":"train_3219","question":"In which year was the first paper by Nuno Cardoso published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/64/2046> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Cardoso, Nuno published?"],"info":{}}
{"id":"train_3220","question":"Mention the year in which Paul Liu published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/75/8054> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Liu, P. publish the most research papers?"],"info":{}}
{"id":"train_3221","question":"When was the last paper by Mikael Brunila published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/288/1698> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Brunila, Mikael published?"],"info":{}}
{"id":"train_3222","question":"Who is the most frequent co-author of Musial, K. and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/11/5835> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/11/5835> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Katarzyna Musial and how many papers do they have together?"],"info":{}}
{"id":"train_3224","question":"Mention the year in which Cooper, J. published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/237/9929> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Cooper, J. publish the most papers?"],"info":{}}
{"id":"train_3225","question":"In which year did Qiong Wang publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/65/3144> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which Qiong Wang published the most papers."],"info":{}}
{"id":"train_3226","question":"Report the year in which Sylker Teles published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/156/8644> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Sylker Teles published?"],"info":{}}
{"id":"train_3227","question":"With which author does Philippas T. has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/t/PhilippasTsigas> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/t/PhilippasTsigas> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Philippas Tsigas and how many papers do they have together?"],"info":{}}
{"id":"train_3229","question":"Report the most frequent co-author of Satoshi K. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/89/9962> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/89/9962> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Satoshi Kikuchi has the most papers and how many?"],"info":{}}
{"id":"train_3230","question":"With which author does Sebastian Rudolph has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/79/6633> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/79/6633> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Sebastian R. and how many papers do they have together?"],"info":{}}
{"id":"train_3231","question":"With which author does Kai Sachs has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/1395> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/64/1395> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of K. Sachs and how many publications do they have together?"],"info":{}}
{"id":"train_3232","question":"When was the last paper by G. Yin published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/152/6192> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which G. Yin published their last paper."],"info":{}}
{"id":"train_3233","question":"In which year was the first paper by Yongdong Zhang published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/z/YongdongZhang> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Yongdong Z. published?"],"info":{}}
{"id":"train_3234","question":"In which year did the author Stephen S. Bullock publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/1779> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Stephen S. Bullock in which year?"],"info":{}}
{"id":"train_3235","question":"When was the last paper by Lei Xu published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/19/360-7> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Lei Xu published?"],"info":{}}
{"id":"train_3236","question":"In which year did the author Chun-Shu Wei publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/09/9826> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did C. Wei publish the least papers and how many?"],"info":{}}
{"id":"train_3237","question":"When was the last paper by Tommaso Empler published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/179/0251> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which Tommaso Empler published their last paper."],"info":{}}
{"id":"train_3238","question":"In which year did Nora Izri publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/03/7273> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Nora I. published the least papers."],"info":{}}
{"id":"train_3239","question":"Report the year in which Parkinson, Simon published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/03/6831> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Parkinson, Simon published?"],"info":{}}
{"id":"train_3240","question":"Who is the most frequent co-author of C. Ancuti and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/3581> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/82/3581> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Cosmin Ancuti and how many papers do they have together?"],"info":{}}
{"id":"train_3241","question":"Who is the most frequent co-author of Silke Schmitt and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/201/1329> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/201/1329> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does S. Schmitt has the most papers and how many?"],"info":{}}
{"id":"train_3243","question":"With which author does Milija S. has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/21/6877> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/21/6877> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Milija Suknovic and how many publications do they have together?"],"info":{}}
{"id":"train_3244","question":"Mention the year in which Prasad S. Gudem published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/48/10288> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Prasad S. Gudem publish the most research papers?"],"info":{}}
{"id":"train_3245","question":"Find the year in which Drummond, Andr\\u00E9 C. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/72/6853> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Andr\\u00E9 C. Drummond published?"],"info":{}}
{"id":"train_3246","question":"In which year did the author Artem Polyvyanyy publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/17/4121> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by A. Polyvyanyy in which year?"],"info":{}}
{"id":"train_3247","question":"In which year did Venkarteswarlu Ronda publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/183/3162> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Venkarteswarlu Ronda publish the most research papers?"],"info":{}}
{"id":"train_3248","question":"In which year did the author Yuki U. publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/00/7321> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which Yuki Ueno published the most papers."],"info":{}}
{"id":"train_3249","question":"Report the most frequent co-author of J. Gr\\u00FCbel and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/208/8403> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/208/8403> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Jascha Gr\\u00FCbel has the most papers and how many?"],"info":{}}
{"id":"train_3250","question":"In which year was the last paper by Mariana Ivanova published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/170/6650> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Mariana Ivanova published?"],"info":{}}
{"id":"train_3251","question":"In which year did Xabier Rey-Barreiro publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/324/4870> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Xabier R. publish the least publications?"],"info":{}}
{"id":"train_3252","question":"When was the first paper by Dongseong Seon published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/194/2472> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Dongseong Seon published their first paper."],"info":{}}
{"id":"train_3253","question":"Report the year in which Iqbal Jamal published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/08/9865> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Iqbal Jamal published?"],"info":{}}
{"id":"train_3254","question":"Who is the most frequent co-author of G. J. F. Jones and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/81/4050> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/81/4050> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of G. J. F. Jones and how many papers do they have together?"],"info":{}}
{"id":"train_3255","question":"In which year did Vaquero, Carlos publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/127/4687> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Vaquero, Carlos publish the least publications?"],"info":{}}
{"id":"train_3256","question":"Report the most frequent co-author of Christopher J. Taylor and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/37/6755> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/37/6755> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Taylor, Christopher J. and how many publications do they have together?"],"info":{}}
{"id":"train_3257","question":"When was the last paper by Thomas Schneider published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/06/3872-3> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Thomas Schneider published?"],"info":{}}
{"id":"train_3258","question":"In which year was the last paper by Hae-Chang R. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/61/4583> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which Hae-Chang Rim published their last paper."],"info":{}}
{"id":"train_3259","question":"In which year was the last paper by Xiao W. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/181/2867-2> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which Xiao Wei published their last paper."],"info":{}}
{"id":"train_3260","question":"Mention the year in which Xulin Liu published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/211/2518> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Xulin Liu publish the most research papers?"],"info":{}}
{"id":"train_3261","question":"Least number of papers were published by Shang-Chih Tsai in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/122/1570> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Shang-Chih Tsai publish the least publications?"],"info":{}}
{"id":"train_3262","question":"In which year did L. Szczecinski publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/7026> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author L. Szczecinski publish the most research papers?"],"info":{}}
{"id":"train_3263","question":"Report the most frequent co-author of Paterakis, N. G. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/143/8610> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/143/8610> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Nikolaos G. Paterakis has the most papers and how many?"],"info":{}}
{"id":"train_3264","question":"Report the most frequent co-author of Vishal Kathuria and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/1415> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/82/1415> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Kathuria, V. has the most papers and how many?"],"info":{}}
