{"id":"train_3786","question":"'Haptic shared control for backward parking and its effect on skill increase in novice drivers' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sii/TadaW15> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Haptic shared control for backward parking and its effect on skill increase in novice drivers'?"],"info":{}}
{"id":"train_3787","question":"In which venue was the paper 'A Document Retrieval System for the Personal Computer' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/ReynoldsC93> dblp:publishedIn ?answer }","paraphrases":["The paper 'A Document Retrieval System for the Personal Computer' was published in which venue?"],"info":{}}
{"id":"train_3788","question":"Who wrote the paper 'Improving the Chilean College Admissions System'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ior/RiosLPC21> dblp:authoredBy ?answer }","paraphrases":["'Improving the Chilean College Admissions System' was authored by which authors?"],"info":{}}
{"id":"train_3789","question":"Name the authors of the paper 'Correlation of Gene Expression as Measured by Different Assays'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gcb/MollerBGKLT01> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Correlation of Gene Expression as Measured by Different Assays'?"],"info":{}}
{"id":"train_3790","question":"'A Training Experience with Aptterns' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cacm/GoldfedderR96> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'A Training Experience with Aptterns'?"],"info":{}}
{"id":"train_3792","question":"Mention the venue in which 'Evaluation of a rule-based control strategy for an equalization facility with technical/physical constraints' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eucc/ClercqVHV99> dblp:publishedIn ?answer }","paraphrases":["Find the venue in which the paper 'Evaluation of a rule-based control strategy for an equalization facility with technical/physical constraints' was published."],"info":{}}
{"id":"train_3793","question":"Who wrote the paper 'Validating Autofocus Algorithms with Automated Tests'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/robotics/WernerC18> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Validating Autofocus Algorithms with Automated Tests'?"],"info":{}}
{"id":"train_3794","question":"Find the number of authors of the paper 'Energy-Efficient Baseband Unit Placement in a Fixed/Mobile Converged WDM Aggregation Network'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/jsac/CarapelleseTP14> dblp:numberOfCreators ?answer }","paraphrases":["Mention the number of authors of the paper 'Energy-Efficient Baseband Unit Placement in a Fixed/Mobile Converged WDM Aggregation Network'."],"info":{}}
{"id":"train_3796","question":"The paper 'Asymptotics of determinants of Hankel matrices via non-linear difference equations' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jat/BasorCH15> dblp:publishedIn ?answer }","paraphrases":["Where was 'Asymptotics of determinants of Hankel matrices via non-linear difference equations' published?"],"info":{}}
{"id":"train_3797","question":"Name the authors of the paper 'Periodic hidden Markov model-based workload clustering and characterization'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/IEEEcit/LiY08> dblp:authoredBy ?answer }","paraphrases":["'Periodic hidden Markov model-based workload clustering and characterization' was authored by which authors?"],"info":{}}
{"id":"train_3801","question":"The paper 'SINMEF - A Decomposition Based Synthesis Tool for Large FSMs' was published in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/glvlsi/QuinteroS99> dblp:publishedIn ?answer }","paraphrases":["Where was 'SINMEF - A Decomposition Based Synthesis Tool for Large FSMs' published?"],"info":{}}
{"id":"train_3802","question":"Name the authors of the paper 'Elastic Smart Contracts in Blockchains'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ieeejas/DustdarFGR21> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'Elastic Smart Contracts in Blockchains'."],"info":{}}
{"id":"train_3803","question":"List the authors of the paper 'Impacts of Web Systems on their Domain'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jwe/YusopLZ05> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Impacts of Web Systems on their Domain'?"],"info":{}}
{"id":"train_3804","question":"How many authors does the publication 'Graph Attention Neural Network for Image Restoration' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/icmcs/MouZ21> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Graph Attention Neural Network for Image Restoration' have?"],"info":{}}
{"id":"train_3806","question":"Mention the number of authors of the paper 'Ontology Mapping: The Case of the CINeSPACE Project'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/smap/LinazaSCBI09> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Ontology Mapping: The Case of the CINeSPACE Project' have?"],"info":{}}
{"id":"train_3810","question":"Where was 'The Paper Enigma Machine' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cryptologia/Koss04> dblp:publishedIn ?answer }","paraphrases":["Find the venue in which the paper 'The Paper Enigma Machine' was published."],"info":{}}
{"id":"train_3811","question":"Mention the year in which 'A little personalization goes a long way' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/interactions/Pemberton04c> dblp:yearOfPublication ?answer }","paraphrases":["When was 'A little personalization goes a long way' published?"],"info":{}}
{"id":"train_3812","question":"Mention the number of authors of the paper 'Combining tactile sensing and vision for rapid haptic mapping'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/iros/BhattacharjeeSP15> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does the publication 'Combining tactile sensing and vision for rapid haptic mapping' have?"],"info":{}}
{"id":"train_3813","question":"Find the venue in which the paper 'Design and Development of LIS Subject Portal using Bluevoda' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijicthd/KumarSSV13> dblp:publishedIn ?answer }","paraphrases":["Mention the venue in which 'Design and Development of LIS Subject Portal using Bluevoda' was published."],"info":{}}
{"id":"train_3814","question":"What year was 'System Design of a Hand-Held Mobile Robot for Craniotomy' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/miccai/KaneEBRWMM09> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'System Design of a Hand-Held Mobile Robot for Craniotomy' was published in which year?"],"info":{}}
{"id":"train_3815","question":"How many authors does the publication 'Invited Talks' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/flairs/AlevenFGPW09> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Invited Talks' have?"],"info":{}}
{"id":"train_3816","question":"List the authors of the paper 'Small white matter lesion detection in cerebral small vessel disease'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/micad/GhafoorianKULHM15> dblp:authoredBy ?answer }","paraphrases":["Name the authors of the paper 'Small white matter lesion detection in cerebral small vessel disease'."],"info":{}}
{"id":"train_3818","question":"What year was 'EEG-based visual deviance detection in freely behaving mice' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/neuroimage/KatBPSMBTK21> dblp:yearOfPublication ?answer }","paraphrases":["The paper 'EEG-based visual deviance detection in freely behaving mice' was published in which year?"],"info":{}}
{"id":"train_3820","question":"List the authors of the paper 'Analysis of symbolic models of biometrie data and their use for action and user identification'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cibcb/HughesBKKD18> dblp:authoredBy ?answer }","paraphrases":["Who is the author of the paper 'Analysis of symbolic models of biometrie data and their use for action and user identification'?"],"info":{}}
{"id":"train_3821","question":"The paper 'Speaking Rate Changes Affect Phone Durations Differently for Neutral and Emotional Speech' was published in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eusipco/GaoB18> dblp:yearOfPublication ?answer }","paraphrases":["What year was 'Speaking Rate Changes Affect Phone Durations Differently for Neutral and Emotional Speech' published?"],"info":{}}
{"id":"train_3823","question":"Name the authors of the paper 'Highly Efficient Computational Methods for Two Dimensional Coupled Nonlinear Unsteady Convection-Diffusion Problems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/access/SaqibHM17> dblp:authoredBy ?answer }","paraphrases":["'Highly Efficient Computational Methods for Two Dimensional Coupled Nonlinear Unsteady Convection-Diffusion Problems' was authored by which authors?"],"info":{}}
{"id":"train_3825","question":"Find the number of authors of the paper 'Distributed Algorithms for Dynamic Bandwidth Provisioning in Communication Networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/jcm/EliasMCP06> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Distributed Algorithms for Dynamic Bandwidth Provisioning in Communication Networks' have?"],"info":{}}
{"id":"train_3826","question":"Find the number of authors of the paper 'Overview of the TREC-9 Web Track'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/trec/Hawking00> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Overview of the TREC-9 Web Track' have?"],"info":{}}
{"id":"train_3827","question":"How many authors does 'C5' have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/slt/SuendermannLEDP08> dblp:numberOfCreators ?answer }","paraphrases":["Find the number of authors of the paper 'C5'."],"info":{}}
{"id":"train_3829","question":"Find the number of authors of the paper 'Designing and building powerful, inexpensive robots for evolutionary research'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/gecco/Soule13> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Designing and building powerful, inexpensive robots for evolutionary research' have?"],"info":{}}
{"id":"train_3830","question":"Where was 'Combiform: a combinable social gaming platform' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/siggraph/YeeJDU12> dblp:publishedIn ?answer }","paraphrases":["In which venue was the paper 'Combiform: a combinable social gaming platform' published?"],"info":{}}
{"id":"train_3831","question":"In which venue was the paper 'Monolithic 3-D Integration' published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/micro/BishopWMS19> dblp:publishedIn ?answer }","paraphrases":["Mention the venue in which 'Monolithic 3-D Integration' was published."],"info":{}}
{"id":"train_3832","question":"Mention the number of authors of the paper 'A File System Abstraction for Sense and Respond Systems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/mobisys/TilakPCBA13> dblp:numberOfCreators ?answer }","paraphrases":["Find the number of authors of the paper 'A File System Abstraction for Sense and Respond Systems'."],"info":{}}
{"id":"train_3833","question":"List the authors of the paper 'Weighted and Class-Specific Maximum Mean Discrepancy for Unsupervised Domain Adaptation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tmm/YanLWLXZ20> dblp:authoredBy ?answer }","paraphrases":["Name the authors of the paper 'Weighted and Class-Specific Maximum Mean Discrepancy for Unsupervised Domain Adaptation'."],"info":{}}
{"id":"train_3835","question":"Find the number of authors of the paper 'Common datum'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/siggraph/KleinP21> dblp:numberOfCreators ?answer }","paraphrases":["Mention the number of authors of the paper 'Common datum'."],"info":{}}
{"id":"train_3837","question":"'Image morphing with conformal welding' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/vc/FanFCGL16> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Image morphing with conformal welding'?"],"info":{}}
{"id":"train_3839","question":"Who is the author of the paper 'Storage Optimization of Tree Structured Files'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigmod/MaineR71> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'Storage Optimization of Tree Structured Files'?"],"info":{}}
{"id":"train_3841","question":"Find the venue in which the paper 'A Consensus Clustering Algorithm for Multitask Multiview Learning' was published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iske/ZhangYZOZ19> dblp:publishedIn ?answer }","paraphrases":["Mention the venue in which 'A Consensus Clustering Algorithm for Multitask Multiview Learning' was published."],"info":{}}
{"id":"train_3842","question":"The paper 'Quadrotor trajectory tracking and obstacle avoidance by chaotic grey wolf optimization- based backstepping control with sliding mode extended state observer' has how many authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/journals/tinstmc/WangMCZ20> dblp:numberOfCreators ?answer }","paraphrases":["How many authors does 'Quadrotor trajectory tracking and obstacle avoidance by chaotic grey wolf optimization- based backstepping control with sliding mode extended state observer' have?"],"info":{}}
{"id":"train_3843","question":"Mention the number of authors of the paper 'Analyzing Parallelism and Domain Similarities in the MAREC Patent Corpus'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/irfc/WaschleR12> dblp:numberOfCreators ?answer }","paraphrases":["Find the number of authors of the paper 'Analyzing Parallelism and Domain Similarities in the MAREC Patent Corpus'."],"info":{}}
{"id":"train_3844","question":"Mention the number of authors of the paper 'Network traffic analyzing and monitoring locations in the IP Multimedia Subsystem'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ?answer WHERE { <https://dblp.org/rec/conf/euromicro/RatySS05> dblp:numberOfCreators ?answer }","paraphrases":["Find the number of authors of the paper 'Network traffic analyzing and monitoring locations in the IP Multimedia Subsystem'."],"info":{}}
{"id":"train_3846","question":"Who wrote the paper 'PAL: Exploiting Java Annotations for Parallelism'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/coregrid/DaneluttoPVDLP06> dblp:authoredBy ?answer }","paraphrases":["List the authors of the paper 'PAL: Exploiting Java Annotations for Parallelism'."],"info":{}}
{"id":"train_3847","question":"Who wrote the paper 'Control of a Chain Pendulum: A fuzzy logic approach'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijcisys/Aranda-Escolastico16> dblp:authoredBy ?answer }","paraphrases":["'Control of a Chain Pendulum: A fuzzy logic approach' was authored by which authors?"],"info":{}}
{"id":"train_3848","question":"'VPriv: Protecting Privacy in Location-Based Vehicular Services' was authored by which authors?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/uss/PopaBB09> dblp:authoredBy ?answer }","paraphrases":["Who wrote the paper 'VPriv: Protecting Privacy in Location-Based Vehicular Services'?"],"info":{}}
{"id":"train_3852","question":"List the other publications published by the authors of 'A one-class classification decision tree based on kernel density estimation'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/asc/ItaniLF20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/asc/ItaniLF20> ) }","paraphrases":["Name the other publications published by the authors of 'A one-class classification decision tree based on kernel density estimation'."],"info":{}}
{"id":"train_3853","question":"Name the other publications published by the authors of 'Fidelity of the representation of value in decision-making'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ploscb/BaysD17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/ploscb/BaysD17> ) }","paraphrases":["List the other publications published by the authors of 'Fidelity of the representation of value in decision-making'."],"info":{}}
{"id":"train_3854","question":"The authors of 'Visual Exploration of Semantic Relationships in Neural Word Embeddings' have which webpages?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvcg/LiuBTSWLP18> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Visual Exploration of Semantic Relationships in Neural Word Embeddings'?"],"info":{}}
{"id":"train_3855","question":"List the other publications published by the authors of 'Optimized-motion planning - theory and implementation by Cherif Ahrikencheikh and Ali Seireg : John Wiley & Sons Inc, Chichester (1994) 366 pp, ISBN 0-471-01903-8'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cad/Sharir97> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/cad/Sharir97> ) }","paraphrases":["Which other papers were written by the authors of 'Optimized-motion planning - theory and implementation by Cherif Ahrikencheikh and Ali Seireg : John Wiley & Sons Inc, Chichester (1994) 366 pp, ISBN 0-471-01903-8'?"],"info":{}}
{"id":"train_3857","question":"Name the other publications published by the authors of 'Graceful Degradation for Component-Based Embedded Software'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iasse/Saridakis04> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/iasse/Saridakis04> ) }","paraphrases":["Which other papers were written by the authors of 'Graceful Degradation for Component-Based Embedded Software'?"],"info":{}}
{"id":"train_3860","question":"Find the venue of the paper 'A data representation code for text processing systems' authored by Lawrence W. Hunter.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijpp/Hunter72> dblp:authoredBy <https://dblp.org/pid/77/5249> . <https://dblp.org/rec/journals/ijpp/Hunter72> dblp:publishedIn ?answer }","paraphrases":["Lawrence W. Hunter published the paper 'A data representation code for text processing systems' in which venue?"],"info":{}}
{"id":"train_3861","question":"List the other publications published by the authors of 'Semantics for the Specification of Asynchronous Communicating Systems (SACS)'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cisse/RajanBA07> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/cisse/RajanBA07> ) }","paraphrases":["Name the other publications published by the authors of 'Semantics for the Specification of Asynchronous Communicating Systems (SACS)'."],"info":{}}
{"id":"train_3867","question":"Yair C. published the paper 'On The Behavior of Subgradient Projections Methods for Convex Feasibility Problems in Euclidean Spaces' in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/siamjo/ButnariuCGH08> dblp:authoredBy <https://dblp.org/pid/33/2148> . <https://dblp.org/rec/journals/siamjo/ButnariuCGH08> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'On The Behavior of Subgradient Projections Methods for Convex Feasibility Problems in Euclidean Spaces' authored by Yair C. published?"],"info":{}}
{"id":"train_3871","question":"In which other years were the authors of 'On critical stability of discrete-time adaptive nonlinear control' publishing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tac/Guo97> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tac/Guo97> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'On critical stability of discrete-time adaptive nonlinear control' published in which other years?"],"info":{}}
{"id":"train_3876","question":"Name the other publications published by the authors of 'PDE-based Simulation of Thermal Distributions in Teeth by Conformal Parametrization'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/simeuro/HolzingerS21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/simeuro/HolzingerS21> ) }","paraphrases":["List the other publications published by the authors of 'PDE-based Simulation of Thermal Distributions in Teeth by Conformal Parametrization'."],"info":{}}
{"id":"train_3877","question":"Find the venue of the paper 'A Process-Variation-Tolerant Floating-Point Unit with Voltage Interpolation and Variable Latency' authored by Xiaoyao Liang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isscc/LiangBW08> dblp:authoredBy <https://dblp.org/pid/88/6436> . <https://dblp.org/rec/conf/isscc/LiangBW08> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'A Process-Variation-Tolerant Floating-Point Unit with Voltage Interpolation and Variable Latency' authored by Xiaoyao Liang."],"info":{}}
{"id":"train_3881","question":"Name the other publications published by the authors of 'Separating Concerns with Domain Specific Languages'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/jmlc/Cook06> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/jmlc/Cook06> ) }","paraphrases":["Which other papers were written by the authors of 'Separating Concerns with Domain Specific Languages'?"],"info":{}}
{"id":"train_3882","question":"List the venues of the other papers published by the authors of 'A Validated Educational Format in Software Engineering Targeting Students' Collaboration Skills'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/Gold-VeerkampKK16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/hci/Gold-VeerkampKK16> ) }","paraphrases":["What are the venues of the other papers published by the authors of 'A Validated Educational Format in Software Engineering Targeting Students' Collaboration Skills'?"],"info":{}}
{"id":"train_3885","question":"Mention the venues of the other papers published by the authors of 'Online allocation for contention-free-routing NoCs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hipeac/StefanNG12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/hipeac/StefanNG12> ) }","paraphrases":["List the venues of the other papers published by the authors of 'Online allocation for contention-free-routing NoCs'."],"info":{}}
{"id":"train_3886","question":"Name the other publications published by the authors of 'SPI - Structure predictability index for protein sequences'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/isb/BrylinskiKR04> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/isb/BrylinskiKR04> ) }","paraphrases":["Which other papers were written by the authors of 'SPI - Structure predictability index for protein sequences'?"],"info":{}}
{"id":"train_3887","question":"Mention the venue of the paper 'Experimental Validation of a State Model for PEMFC Auxiliaries Control' authored by K. Pelope Adzakpa.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iasam/AdzakpaRADHZ08> dblp:authoredBy <https://dblp.org/pid/159/5093> . <https://dblp.org/rec/conf/iasam/AdzakpaRADHZ08> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Experimental Validation of a State Model for PEMFC Auxiliaries Control' authored by K. Pelope Adzakpa published?"],"info":{}}
{"id":"train_3888","question":"List the venues of the other papers published by the authors of 'Parametric maps of the knee cartilage'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ipas2/MokhtarZBL14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/ipas2/MokhtarZBL14> ) }","paraphrases":["In which venues were the other papers published by the authors of 'Parametric maps of the knee cartilage'?"],"info":{}}
{"id":"train_3890","question":"List the other publications published by the authors of 'Eyes of the Swarm: Streamers' Detection in BT'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icdcs/SilvaR17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/icdcs/SilvaR17> ) }","paraphrases":["Which other papers were written by the authors of 'Eyes of the Swarm: Streamers' Detection in BT'?"],"info":{}}
{"id":"train_3891","question":"Mention the venue of the paper 'A Method for Conceptual Modeling of Semantically Integrated Use-Case Scenarios' authored by Prima Gustien\\u00E9.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/i3e/GustasG11> dblp:authoredBy <https://dblp.org/pid/04/3170> . <https://dblp.org/rec/conf/i3e/GustasG11> dblp:publishedIn ?answer }","paraphrases":["Prima Gustien\\u00E9 published the paper 'A Method for Conceptual Modeling of Semantically Integrated Use-Case Scenarios' in which venue?"],"info":{}}
{"id":"train_3892","question":"The authors of 't-copula from the viewpoint of tail dependence matrices' published in which other years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ma/ShyamalkumarT22> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ma/ShyamalkumarT22> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 't-copula from the viewpoint of tail dependence matrices' publishing?"],"info":{}}
{"id":"train_3893","question":"List the venues of the other papers published by the authors of 'A Novel Polypyrrole-Based Sensor for Robotics Applications'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/syroco/TjahyonoAT12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/syroco/TjahyonoAT12> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'A Novel Polypyrrole-Based Sensor for Robotics Applications'."],"info":{}}
{"id":"train_3894","question":"Mention the venue of the paper 'Can Multimedia Respond to the Critics? a Report From the History Classroom' authored by Peter H..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/hac/Hillis01> dblp:authoredBy <https://dblp.org/pid/126/0296> . <https://dblp.org/rec/journals/hac/Hillis01> dblp:publishedIn ?answer }","paraphrases":["Peter H. published the paper 'Can Multimedia Respond to the Critics? a Report From the History Classroom' in which venue?"],"info":{}}
{"id":"train_3898","question":"List the years in which the authors of 'Fairly Dividing a Cake after Some Parts Were Burnt in the Oven' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/atal/Segal-Halevi18a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/atal/Segal-Halevi18a> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Fairly Dividing a Cake after Some Parts Were Burnt in the Oven' publishing?"],"info":{}}
