{"id":"train_3983","question":"Mention the venue of the paper 'Typical Snapshots Selection for Shortest Path Query in Dynamic Road Networks' authored by Hua, W..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1910-12261> dblp:authoredBy <https://dblp.org/pid/68/11145> . <https://dblp.org/rec/journals/corr/abs-1910-12261> dblp:publishedIn ?answer }","paraphrases":["Wen Hua published the paper 'Typical Snapshots Selection for Shortest Path Query in Dynamic Road Networks' in which venue?"],"info":{}}
{"id":"train_3985","question":"List the years in which the authors of 'Welchen Beitrag kann die Geoinformationsverarbeitung zur Entwicklung des Digitalen Zeitalters leisten? / What Contribution Can Geoinformation Processing Make to the Development of the Digital Age?' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/agit/Mandl20> dblp:authoredBy ?x . <https://dblp.org/rec/journals/agit/Mandl20> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Welchen Beitrag kann die Geoinformationsverarbeitung zur Entwicklung des Digitalen Zeitalters leisten? / What Contribution Can Geoinformation Processing Make to the Development of the Digital Age?' publishing?"],"info":{}}
{"id":"train_3987","question":"Name the other publications published by the authors of 'Incorporating Network Structure with Node Information for Semi-supervised Anomaly Detection on Attributed Graphs'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wise/ChenLLSWZ21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/wise/ChenLLSWZ21> ) }","paraphrases":["Which other papers were written by the authors of 'Incorporating Network Structure with Node Information for Semi-supervised Anomaly Detection on Attributed Graphs'?"],"info":{}}
{"id":"train_3988","question":"List the years in which the authors of 'Decision Making By Variable Contribution In Discriminant, Logit, And Regression Analyses' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijitdm/LipovetskyC04> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijitdm/LipovetskyC04> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Decision Making By Variable Contribution In Discriminant, Logit, And Regression Analyses' published in which other years?"],"info":{}}
{"id":"train_3989","question":"Find the years in which the authors of 'Nonlinear dynamics analysis of electrocardiograms for detection of coronary artery disease' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cmpb/AntanaviciusBBGKUV08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/cmpb/AntanaviciusBBGKUV08> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Nonlinear dynamics analysis of electrocardiograms for detection of coronary artery disease' published other papers."],"info":{}}
{"id":"train_3990","question":"List the years in which the authors of 'Adaptive filtering of microarray gene expression data based on Gaussian mixture decomposition' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/bmcbi/MarczykJPP13> dblp:authoredBy ?x . <https://dblp.org/rec/journals/bmcbi/MarczykJPP13> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Adaptive filtering of microarray gene expression data based on Gaussian mixture decomposition' published in which other years?"],"info":{}}
{"id":"train_3991","question":"Find the years in which the authors of 'Enhancement of digital reading performance by using a novel web-based collaborative reading annotation system with two quality annotation filtering mechanisms' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijmms/JanCH16> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijmms/JanCH16> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Enhancement of digital reading performance by using a novel web-based collaborative reading annotation system with two quality annotation filtering mechanisms' published in which other years?"],"info":{}}
{"id":"train_3993","question":"Mention the venue of the paper 'Jackit: power generating jacket' authored by Fazzi Maria Adelaide.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iswc/DavideGLA14> dblp:authoredBy <https://dblp.org/pid/151/0055> . <https://dblp.org/rec/conf/iswc/DavideGLA14> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Jackit: power generating jacket' authored by Fazzi Maria Adelaide."],"info":{}}
{"id":"train_3994","question":"Find the venue of the paper 'Decision Making Based on Cohort Scores for Speaker Verification' authored by Thomas F. Zheng.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/LiWWWZ16> dblp:authoredBy <https://dblp.org/pid/53/2843> . <https://dblp.org/rec/journals/corr/LiWWWZ16> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'Decision Making Based on Cohort Scores for Speaker Verification' authored by Thomas F. Zheng."],"info":{}}
{"id":"train_3996","question":"Show the webpages of authors of 'k-anonymity Chord for Anonymous Query Response'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijngc/CanB14> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'k-anonymity Chord for Anonymous Query Response'?"],"info":{}}
{"id":"train_3998","question":"Name the other publications published by the authors of 'Explainable Artificial Intelligence in Meteorology and Climate Science: Model Fine-Tuning, Calibrating Trust and Learning New Science'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icml/MamalakisEB20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/icml/MamalakisEB20> ) }","paraphrases":["Which other papers were written by the authors of 'Explainable Artificial Intelligence in Meteorology and Climate Science: Model Fine-Tuning, Calibrating Trust and Learning New Science'?"],"info":{}}
{"id":"train_4001","question":"List the years in which the authors of 'Towards Recommender Systems for Police Photo Lineup' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/recsys/PeskaT17> dblp:authoredBy ?x . <https://dblp.org/rec/conf/recsys/PeskaT17> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Towards Recommender Systems for Police Photo Lineup' publishing?"],"info":{}}
{"id":"train_4003","question":"List the years in which the authors of 'Application of Agile Development Methodology and User-Centered Design for the Interdisciplinary Project Zuku' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/VilcapomaP18> dblp:authoredBy ?x . <https://dblp.org/rec/conf/hci/VilcapomaP18> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Application of Agile Development Methodology and User-Centered Design for the Interdisciplinary Project Zuku' published in which other years?"],"info":{}}
{"id":"train_4004","question":"What are the webpages of authors of 'Method of Statistical Spline Functions for Solving Problems of Data Approximation and Prediction of Objects State'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cmis/BabakBZS19> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Method of Statistical Spline Functions for Solving Problems of Data Approximation and Prediction of Objects State' have which webpages?"],"info":{}}
{"id":"train_4005","question":"List the other publications published by the authors of 'Evolving Teams of Predictors with Linear Genetic Programming'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/gpem/BrameierB01> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/gpem/BrameierB01> ) }","paraphrases":["Name the other publications published by the authors of 'Evolving Teams of Predictors with Linear Genetic Programming'."],"info":{}}
{"id":"train_4007","question":"List the other publications published by the authors of 'Robust error concealment for visual communications in burst-packet-loss networks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tce/PyunLJJK03> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/tce/PyunLJJK03> ) }","paraphrases":["Name the other publications published by the authors of 'Robust error concealment for visual communications in burst-packet-loss networks'."],"info":{}}
{"id":"train_4008","question":"Find the years in which the authors of 'Fetal Electrocardiogram Recognition Using Multilayer Perceptron Neural Network' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eit/WangS18> dblp:authoredBy ?x . <https://dblp.org/rec/conf/eit/WangS18> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Fetal Electrocardiogram Recognition Using Multilayer Perceptron Neural Network' published other papers."],"info":{}}
{"id":"train_4009","question":"Find the years in which the authors of 'Control of Interaction Force of Twin Direct-Drive Motor System Using Variable Wire Rope Tension With Multisensor Integration' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tie/MitsantisukOK12> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tie/MitsantisukOK12> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Control of Interaction Force of Twin Direct-Drive Motor System Using Variable Wire Rope Tension With Multisensor Integration' publishing?"],"info":{}}
{"id":"train_4010","question":"Name the other publications published by the authors of 'The Recurrent Neural Tangent Kernel'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iclr/Alemohammad0BB21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/iclr/Alemohammad0BB21> ) }","paraphrases":["Which other papers were written by the authors of 'The Recurrent Neural Tangent Kernel'?"],"info":{}}
{"id":"train_4012","question":"Where was the paper 'Video from Stills: Lensless Imaging with Rolling Shutter' authored by Patrick Oare published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1905-13221> dblp:authoredBy <https://dblp.org/pid/241/9817> . <https://dblp.org/rec/journals/corr/abs-1905-13221> dblp:publishedIn ?answer }","paraphrases":["Patrick Oare published the paper 'Video from Stills: Lensless Imaging with Rolling Shutter' in which venue?"],"info":{}}
{"id":"train_4013","question":"In which other years were the authors of 'Paraconsistent sequential linear-time temporal logic: Combining paraconsistency and sequentiality in temporal reasoning' publishing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/rml/Kamide17> dblp:authoredBy ?x . <https://dblp.org/rec/journals/rml/Kamide17> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Paraconsistent sequential linear-time temporal logic: Combining paraconsistency and sequentiality in temporal reasoning' published in which other years?"],"info":{}}
{"id":"train_4014","question":"List the other publications published by the authors of 'Prototyping Multiprocessor System-on-Chip Applications: A Platform-Based Approach'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/dsonline/SenouciBRPJ07> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/dsonline/SenouciBRPJ07> ) }","paraphrases":["Which other publications were published by the authors of 'Prototyping Multiprocessor System-on-Chip Applications: A Platform-Based Approach'?"],"info":{}}
{"id":"train_4015","question":"Find the years in which the authors of 'Framework for Conceptual Modeling on Natural Language Texts' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cla/BogatyrevS16> dblp:authoredBy ?x . <https://dblp.org/rec/conf/cla/BogatyrevS16> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Framework for Conceptual Modeling on Natural Language Texts' published in which other years?"],"info":{}}
{"id":"train_4016","question":"I. Ramos published the paper 'Are Forward Designed or Reverse-Engineered UML diagrams more helpful for code maintenance?: A family of experiments' in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/infsof/Fernandez-SaezGCCR15> dblp:authoredBy <https://dblp.org/pid/62/2932-2> . <https://dblp.org/rec/journals/infsof/Fernandez-SaezGCCR15> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Are Forward Designed or Reverse-Engineered UML diagrams more helpful for code maintenance?: A family of experiments' authored by I. Ramos published?"],"info":{}}
{"id":"train_4017","question":"Name the other publications published by the authors of 'Multiple Structured Light-Based Depth Sensors for Human Motion Analysis: A Review'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iwaal/EssmaeelGDPD12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/iwaal/EssmaeelGDPD12> ) }","paraphrases":["Which other papers were written by the authors of 'Multiple Structured Light-Based Depth Sensors for Human Motion Analysis: A Review'?"],"info":{}}
{"id":"train_4018","question":"Mention the venue of the paper 'Recovery planning for resilience in integrated disaster risk management' authored by David N. Bristow.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/smc/BristowB17> dblp:authoredBy <https://dblp.org/pid/210/2755> . <https://dblp.org/rec/conf/smc/BristowB17> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Recovery planning for resilience in integrated disaster risk management' authored by David N. Bristow."],"info":{}}
{"id":"train_4019","question":"Show the webpages of authors of 'Robust Multi-Agent Multi-Armed Bandits'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2007-03812> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["What are the webpages of authors of 'Robust Multi-Agent Multi-Armed Bandits'?"],"info":{}}
{"id":"train_4021","question":"Find the years in which the authors of 'Some Research Problems in Automatic Information Retrieval' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigir/Salton83> dblp:authoredBy ?x . <https://dblp.org/rec/conf/sigir/Salton83> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["List the years in which the authors of 'Some Research Problems in Automatic Information Retrieval' published other papers."],"info":{}}
{"id":"train_4022","question":"Find the years in which the authors of 'Sound Event Detection and Time-Frequency Segmentation from Weakly Labelled Data' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/taslp/KongXSWP19> dblp:authoredBy ?x . <https://dblp.org/rec/journals/taslp/KongXSWP19> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Sound Event Detection and Time-Frequency Segmentation from Weakly Labelled Data' publishing?"],"info":{}}
{"id":"train_4024","question":"Mention the venue of the paper 'Algorithms for Average Regret Minimization' authored by Stefan F..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/aaai/StorandtF19> dblp:authoredBy <https://dblp.org/pid/f/StefanFunke> . <https://dblp.org/rec/conf/aaai/StorandtF19> dblp:publishedIn ?answer }","paraphrases":["Find the venue of the paper 'Algorithms for Average Regret Minimization' authored by Stefan F.."],"info":{}}
{"id":"train_4026","question":"List the venues of the other papers published by the authors of 'Creating DEMO Presentations on the Base of Visualization Model'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hpcn/ZudilovaS00> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/hpcn/ZudilovaS00> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'Creating DEMO Presentations on the Base of Visualization Model'."],"info":{}}
{"id":"train_4027","question":"Find the venue of the paper 'Planar Drawings of Fixed-Mobile Bigraphs' authored by Michael A. Bekos.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gd/BekosLDMNST17> dblp:authoredBy <https://dblp.org/pid/06/1457> . <https://dblp.org/rec/conf/gd/BekosLDMNST17> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'Planar Drawings of Fixed-Mobile Bigraphs' authored by Michael A. Bekos."],"info":{}}
{"id":"train_4029","question":"List the other publications published by the authors of 'Template-Based Question Answering over Linked Geospatial Data'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2007-07060> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/journals/corr/abs-2007-07060> ) }","paraphrases":["Name the other publications published by the authors of 'Template-Based Question Answering over Linked Geospatial Data'."],"info":{}}
{"id":"train_4032","question":"What are the webpages of authors of 'High Resolution Application Specific Fault Diagnosis of FPGAs'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tvlsi/Tahoori11> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'High Resolution Application Specific Fault Diagnosis of FPGAs' have which webpages?"],"info":{}}
{"id":"train_4033","question":"Mention the venues of the other papers published by the authors of 'This Sample seems to be good enough! Assessing Coverage and Temporal Reliability of Twitter's Academic API'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2204-02290> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2204-02290> ) }","paraphrases":["List the venues of the other papers published by the authors of 'This Sample seems to be good enough! Assessing Coverage and Temporal Reliability of Twitter's Academic API'."],"info":{}}
{"id":"train_4036","question":"List the years in which the authors of 'Quantization Bounds on Grassmann Manifolds and Applications to MIMO Communications' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tit/DaiLR08> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tit/DaiLR08> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["Find the years in which the authors of 'Quantization Bounds on Grassmann Manifolds and Applications to MIMO Communications' published other papers."],"info":{}}
{"id":"train_4037","question":"Find the years in which the authors of 'The Digital Approximation of Contours' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jacm/Mason56> dblp:authoredBy ?x . <https://dblp.org/rec/journals/jacm/Mason56> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'The Digital Approximation of Contours' published in which other years?"],"info":{}}
{"id":"train_4038","question":"Find the years in which the authors of 'Three-dimensional matching is NP-Hard' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2003-00336> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-2003-00336> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["The authors of 'Three-dimensional matching is NP-Hard' published in which other years?"],"info":{}}
{"id":"train_4039","question":"In which venues were the other papers published by the authors of 'Information on the International Conference \\Perspectives of System Informatics\\'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/pcs/Zamulin02> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/journals/pcs/Zamulin02> ) }","paraphrases":["List the venues of the other papers published by the authors of 'Information on the International Conference \\Perspectives of System Informatics\\'."],"info":{}}
{"id":"train_4041","question":"Where was the paper 'Embodied Visual Recognition' authored by Jianwei Yang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1904-04404> dblp:authoredBy <https://dblp.org/pid/62/1791> . <https://dblp.org/rec/journals/corr/abs-1904-04404> dblp:publishedIn ?answer }","paraphrases":["Yang, J. published the paper 'Embodied Visual Recognition' in which venue?"],"info":{}}
{"id":"train_4043","question":"List the years in which the authors of 'A new correlation-based information diffusion prediction' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/www/LeeC14a> dblp:authoredBy ?x . <https://dblp.org/rec/conf/www/LeeC14a> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'A new correlation-based information diffusion prediction' publishing?"],"info":{}}
{"id":"train_4044","question":"Where was the paper 'An Implementation Technique for the Abstract Interpretation of Prolog' authored by Annika W\\u00E6rn published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iclp/Waern88> dblp:authoredBy <https://dblp.org/pid/w/AnnikaWarn> . <https://dblp.org/rec/conf/iclp/Waern88> dblp:publishedIn ?answer }","paraphrases":["Mention the venue of the paper 'An Implementation Technique for the Abstract Interpretation of Prolog' authored by Annika W\\u00E6rn."],"info":{}}
{"id":"train_4045","question":"List the venues of the other papers published by the authors of 'A Deep Reinforcement Learning Approach for Path Following on a Quadrotor'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eucc/RubiMP20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/eucc/RubiMP20> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'A Deep Reinforcement Learning Approach for Path Following on a Quadrotor'."],"info":{}}
{"id":"train_4046","question":"Name the other publications published by the authors of 'Mobile Ad-Hoc Networks and Delay-Tolerant Networks With Wireless Energy Harvesting'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/books/cu/p/Niyato16> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/books/cu/p/Niyato16> ) }","paraphrases":["List the other publications published by the authors of 'Mobile Ad-Hoc Networks and Delay-Tolerant Networks With Wireless Energy Harvesting'."],"info":{}}
{"id":"train_4050","question":"Sergey P. Kuznetsov published the paper 'Robust Hyperbolic Chaos in Froude Pendulum with Delayed Feedback and Periodic Braking' in which venue?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijbc/KuznetsovS19> dblp:authoredBy <https://dblp.org/pid/21/10960> . <https://dblp.org/rec/journals/ijbc/KuznetsovS19> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Robust Hyperbolic Chaos in Froude Pendulum with Delayed Feedback and Periodic Braking' authored by S. P. Kuznetsov published?"],"info":{}}
{"id":"train_4052","question":"List the other publications published by the authors of 'Management of NASA's Earth Venture-1 (EV-1) airborne science selections'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/igarss/AllenDKW10> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/igarss/AllenDKW10> ) }","paraphrases":["Which other publications were published by the authors of 'Management of NASA's Earth Venture-1 (EV-1) airborne science selections'?"],"info":{}}
{"id":"train_4053","question":"List the venues of the other papers published by the authors of 'Handling continuous attributes in Ant Colony Classification algorithms'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cidm/OteroFJ09> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER ( ?y != <https://dblp.org/rec/conf/cidm/OteroFJ09> ) }","paraphrases":["Mention the venues of the other papers published by the authors of 'Handling continuous attributes in Ant Colony Classification algorithms'."],"info":{}}
{"id":"train_4054","question":"Find the venue of the paper 'Design, Ground Testing and On-Orbit Performance of a Sun Sensor Based on COTS Photodiodes for the UPMSat-2 Satellite' authored by J. P\\u00E9rez-\\u00C1lvarez.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/Porras-HermosoA21> dblp:authoredBy <https://dblp.org/pid/298/6506> . <https://dblp.org/rec/journals/sensors/Porras-HermosoA21> dblp:publishedIn ?answer }","paraphrases":["Javier P\\u00E9rez-\\u00C1lvarez published the paper 'Design, Ground Testing and On-Orbit Performance of a Sun Sensor Based on COTS Photodiodes for the UPMSat-2 Satellite' in which venue?"],"info":{}}
{"id":"train_4058","question":"Find the venue of the paper 'Clothes Change Detection Using the Kinect Sensor' authored by Giannakopoulos, Theodoros.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigmap/SgouropoulosGPPK14> dblp:authoredBy <https://dblp.org/pid/64/1130> . <https://dblp.org/rec/conf/sigmap/SgouropoulosGPPK14> dblp:publishedIn ?answer }","paraphrases":["Where was the paper 'Clothes Change Detection Using the Kinect Sensor' authored by Giannakopoulos, Theodoros published?"],"info":{}}
{"id":"train_4060","question":"List the other publications published by the authors of 'Exact and approximation algorithms for sensor placement against DDoS attacks'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fedcsis/NogalskiJW20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER ( ?answer != <https://dblp.org/rec/conf/fedcsis/NogalskiJW20> ) }","paraphrases":["Name the other publications published by the authors of 'Exact and approximation algorithms for sensor placement against DDoS attacks'."],"info":{}}
{"id":"train_4061","question":"What are the webpages of authors of 'Minimizing Response Times in Real Time Planning and Search'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ijcai/ShekharD89> dblp:authoredBy ?x . ?x dblp:webpage ?answer }","paraphrases":["The authors of 'Minimizing Response Times in Real Time Planning and Search' have which webpages?"],"info":{}}
{"id":"train_4065","question":"List the years in which the authors of 'Interference Alignment in Multi-user MIMO Systems' published other papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ict-express/ZhangGSZZ15> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ict-express/ZhangGSZZ15> dblp:yearOfPublication ?y . ?z dblp:authoredBy ?x . ?z dblp:yearOfPublication ?answer FILTER ( ?answer != ?y ) }","paraphrases":["In which other years were the authors of 'Interference Alignment in Multi-user MIMO Systems' publishing?"],"info":{}}
