{"id":"train_5185","question":"Did the authors of the publication 'Gaussian Bounds for the Inhomogeneous Landau Equation with Hard Potentials' not publish a paper in SIAM J. Math. Anal.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamma/Snelson20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/siamma/Snelson20> ) . ?y dblp:publishedIn 'SIAM J. Math. Anal.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/siamma/Snelson20> dblp:publishedIn 'SIAM J. Math. Anal.' } }","paraphrases":["Have the authors of the paper 'Gaussian Bounds for the Inhomogeneous Landau Equation with Hard Potentials' not published a publication in SIAM J. Math. Anal.?"],"info":{}}
{"id":"train_5187","question":"Wasn't the paper 'At the gates 2' published in the year 1997?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/siggraph/Chupa97d> dblp:yearOfPublication '1997' FILTER NOT EXISTS { <https://dblp.org/rec/conf/siggraph/Chupa97d> dblp:yearOfPublication '1997' } }","paraphrases":["Wasn't the publication 'At the gates 2' published in 1997?"],"info":{}}
{"id":"train_5188","question":"Wasn't the publication 'Using blockchain in the follow-up of emergency situations related to events' published in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/spe/Rivero-GarciaSH21> dblp:yearOfPublication '2021' FILTER NOT EXISTS { <https://dblp.org/rec/journals/spe/Rivero-GarciaSH21> dblp:yearOfPublication '2021' } }","paraphrases":["Wasn't the paper 'Using blockchain in the follow-up of emergency situations related to events' published in the year 2021?"],"info":{}}
{"id":"train_5189","question":"Was 'Improved Visual Preference Authentication' not published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/stast/JakobssonS12a> dblp:yearOfPublication '2012' FILTER NOT EXISTS { <https://dblp.org/rec/conf/stast/JakobssonS12a> dblp:yearOfPublication '2012' } }","paraphrases":["Wasn't the publication 'Improved Visual Preference Authentication' published in 2012?"],"info":{}}
{"id":"train_5190","question":"Have the authors of the paper 'Approximation algorithms on 0-1 linear knapsack problem with a single continuous variable' not published the paper 'Periodic interpolation and wavelets on sparse grids'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jco/ZhaoL14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/na/Sprengel98> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/na/Sprengel98> != <https://dblp.org/rec/journals/jco/ZhaoL14> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/jco/ZhaoL14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/na/Sprengel98> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/na/Sprengel98> != <https://dblp.org/rec/journals/jco/ZhaoL14> ) } }","paraphrases":["Did the authors of 'Approximation algorithms on 0-1 linear knapsack problem with a single continuous variable' not publish 'Periodic interpolation and wavelets on sparse grids'?"],"info":{}}
{"id":"train_5191","question":"Wasn't the paper 'Caracteriza\\u00E7\\u00E3o do Estado da Pr\\u00E1tica das Atividades de Teste em um Cen\\u00E1rio de Desenvolvimento de Software Brasileiro' published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sbqs/NetoNRT06> dblp:yearOfPublication '2006' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sbqs/NetoNRT06> dblp:yearOfPublication '2006' } }","paraphrases":["Wasn't the publication 'Caracteriza\\u00E7\\u00E3o do Estado da Pr\\u00E1tica das Atividades de Teste em um Cen\\u00E1rio de Desenvolvimento de Software Brasileiro' published in 2006?"],"info":{}}
{"id":"train_5192","question":"Have the authors of the paper 'Bridging deep and kernel methods' not published a publication in European Symposium on Artificial Neural Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esann/BelancheC17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/esann/BelancheC17> ) . ?y dblp:publishedIn 'ESANN' FILTER NOT EXISTS { <https://dblp.org/rec/conf/esann/BelancheC17> dblp:publishedIn 'ESANN' } }","paraphrases":["Did the authors of the publication 'Bridging deep and kernel methods' not publish a paper in European Symposium on Artificial Neural Networks?"],"info":{}}
{"id":"train_5193","question":"Did the authors of the publication 'UMLintr: A UML Profile for Specifying Intrusions' not publish a paper in ECBS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecbs/HusseinZ06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ecbs/HusseinZ06> ) . ?y dblp:publishedIn 'ECBS' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ecbs/HusseinZ06> dblp:publishedIn 'ECBS' } }","paraphrases":["Have the authors of the paper 'UMLintr: A UML Profile for Specifying Intrusions' not published a publication in ECBS?"],"info":{}}
{"id":"train_5194","question":"Did the authors of 'The uncertainty principle and its theory and applications in advanced television' not publish 'On MILS I/O Sharing Targeting Avionic Systems'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/SablatashM91> dblp:authoredBy ?x . <https://dblp.org/rec/conf/edcc/MuellerSTP14> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/edcc/MuellerSTP14> != <https://dblp.org/rec/conf/icassp/SablatashM91> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/icassp/SablatashM91> dblp:authoredBy ?x . <https://dblp.org/rec/conf/edcc/MuellerSTP14> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/edcc/MuellerSTP14> != <https://dblp.org/rec/conf/icassp/SablatashM91> ) } }","paraphrases":["Have the authors of the paper 'The uncertainty principle and its theory and applications in advanced television' not published the paper 'On MILS I/O Sharing Targeting Avionic Systems'?"],"info":{}}
{"id":"train_5197","question":"Wasn't the publication 'Qualitative Interviews online stellen' published in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/dud/SchreinermacherB13> dblp:yearOfPublication '2013' FILTER NOT EXISTS { <https://dblp.org/rec/journals/dud/SchreinermacherB13> dblp:yearOfPublication '2013' } }","paraphrases":["Was 'Qualitative Interviews online stellen' not published in 2013?"],"info":{}}
{"id":"train_5198","question":"Haven't the authors of the publication 'Separation of P and NP' published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2108-09269> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2108-09269> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2108-09269> dblp:publishedIn 'CoRR' } }","paraphrases":["Did the authors of 'Separation of P and NP' not publish a paper in CoRR?"],"info":{}}
{"id":"train_5202","question":"Have the authors of the paper 'Additive Gaussian Processes' not published a publication in NIPS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/nips/DuvenaudNR11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/nips/DuvenaudNR11> ) . ?y dblp:publishedIn 'NIPS' FILTER NOT EXISTS { <https://dblp.org/rec/conf/nips/DuvenaudNR11> dblp:publishedIn 'NIPS' } }","paraphrases":["Did the authors of 'Additive Gaussian Processes' not publish a paper in NIPS?"],"info":{}}
{"id":"train_5204","question":"Have the authors of the paper 'Loss of Hyperbolicity in Elastic-Plastic Material at Finite Strains' not published a publication in SIAM J. Appl. Math.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamam/An93> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/siamam/An93> ) . ?y dblp:publishedIn 'SIAM J. Appl. Math.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/siamam/An93> dblp:publishedIn 'SIAM J. Appl. Math.' } }","paraphrases":["Haven't the authors of the publication 'Loss of Hyperbolicity in Elastic-Plastic Material at Finite Strains' published a publication in SIAM J. Appl. Math.?"],"info":{}}
{"id":"train_5205","question":"Wasn't the paper 'Geometry features measurement of traffic accident for reconstruction based on close-range photogrammetry' published in the year 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/aes/DuJZSH09> dblp:yearOfPublication '2009' FILTER NOT EXISTS { <https://dblp.org/rec/journals/aes/DuJZSH09> dblp:yearOfPublication '2009' } }","paraphrases":["Wasn't the publication 'Geometry features measurement of traffic accident for reconstruction based on close-range photogrammetry' published in 2009?"],"info":{}}
{"id":"train_5207","question":"Wasn't the paper 'Text mining in computational advertising' published in the year 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sadm/SorianoAB13> dblp:yearOfPublication '2013' FILTER NOT EXISTS { <https://dblp.org/rec/journals/sadm/SorianoAB13> dblp:yearOfPublication '2013' } }","paraphrases":["Wasn't the publication 'Text mining in computational advertising' published in 2013?"],"info":{}}
{"id":"train_5208","question":"Was 'A Digital Image Stabilization Method Based on the Hilbert-Huang Transform' not published in 2012?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tim/IoannidisA12> dblp:yearOfPublication '2012' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tim/IoannidisA12> dblp:yearOfPublication '2012' } }","paraphrases":["Wasn't the paper 'A Digital Image Stabilization Method Based on the Hilbert-Huang Transform' published in the year 2012?"],"info":{}}
{"id":"train_5209","question":"Did the authors of the publication 'Language and Paradigms for Scientific Programming' not publish a paper in Sci. Program.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sp/McGraw92> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/sp/McGraw92> ) . ?y dblp:publishedIn 'Sci. Program.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/sp/McGraw92> dblp:publishedIn 'Sci. Program.' } }","paraphrases":["Haven't the authors of the publication 'Language and Paradigms for Scientific Programming' published a publication in Sci. Program.?"],"info":{}}
{"id":"train_5210","question":"Was 'Generalized Non-uniform Time Scaling Distribution Method for Natural-Sounding Speech Rate Change' not published in 2011?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/tsd/TihelkaM11> dblp:yearOfPublication '2011' FILTER NOT EXISTS { <https://dblp.org/rec/conf/tsd/TihelkaM11> dblp:yearOfPublication '2011' } }","paraphrases":["Wasn't the paper 'Generalized Non-uniform Time Scaling Distribution Method for Natural-Sounding Speech Rate Change' published in the year 2011?"],"info":{}}
{"id":"train_5211","question":"Wasn't the publication 'Principles of computer system organization' published in 1970?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigcse/Denning70> dblp:yearOfPublication '1970' FILTER NOT EXISTS { <https://dblp.org/rec/conf/sigcse/Denning70> dblp:yearOfPublication '1970' } }","paraphrases":["Wasn't the paper 'Principles of computer system organization' published in the year 1970?"],"info":{}}
{"id":"train_5212","question":"Was 'Comparing LS FIR filtering and l-step ahead linear prediction' not published in 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsp/PapaodysseusCKK93> dblp:yearOfPublication '1993' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tsp/PapaodysseusCKK93> dblp:yearOfPublication '1993' } }","paraphrases":["Wasn't the publication 'Comparing LS FIR filtering and l-step ahead linear prediction' published in 1993?"],"info":{}}
{"id":"train_5213","question":"Haven't the authors of the publication 'Revenue, Relevance, Arbitrage and More: Joint Optimization Framework for Search Experiences in Two-Sided Marketplaces' published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1905-06452> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-1905-06452> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1905-06452> dblp:publishedIn 'CoRR' } }","paraphrases":["Did the authors of the publication 'Revenue, Relevance, Arbitrage and More: Joint Optimization Framework for Search Experiences in Two-Sided Marketplaces' not publish a paper in CoRR?"],"info":{}}
{"id":"train_5214","question":"Have the authors of the paper 'Proposal and Comparison of an Idea Generation Support System Presenting Words for the Use of Scarce Knowledge People' not published the paper 'Bit-shuffled trie: a new approach for IP address lookup'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kes/ItouHM15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ancs/PaoL10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ancs/PaoL10> != <https://dblp.org/rec/conf/kes/ItouHM15> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/kes/ItouHM15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ancs/PaoL10> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ancs/PaoL10> != <https://dblp.org/rec/conf/kes/ItouHM15> ) } }","paraphrases":["Did the authors of the publication 'Proposal and Comparison of an Idea Generation Support System Presenting Words for the Use of Scarce Knowledge People' not publish 'Bit-shuffled trie: a new approach for IP address lookup'?"],"info":{}}
{"id":"train_5216","question":"Did the authors of the publication 'Investigation of fault lines in Iskenderun Gulf using Markov Random Fields' not publish a paper in SIU?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/siu/Albora16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/siu/Albora16> ) . ?y dblp:publishedIn 'SIU' FILTER NOT EXISTS { <https://dblp.org/rec/conf/siu/Albora16> dblp:publishedIn 'SIU' } }","paraphrases":["Have the authors of the paper 'Investigation of fault lines in Iskenderun Gulf using Markov Random Fields' not published a publication in SIU?"],"info":{}}
{"id":"train_5218","question":"Haven't the authors of the publication 'Fast, Convexified Stochastic Optimal Open-Loop Control for Linear Systems Using Empirical Characteristic Functions' published a publication in IEEE Control. Syst. Lett.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/csysl/Sivaramakrishnan20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/csysl/Sivaramakrishnan20> ) . ?y dblp:publishedIn 'IEEE Control. Syst. Lett.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/csysl/Sivaramakrishnan20> dblp:publishedIn 'IEEE Control. Syst. Lett.' } }","paraphrases":["Did the authors of 'Fast, Convexified Stochastic Optimal Open-Loop Control for Linear Systems Using Empirical Characteristic Functions' not publish a paper in IEEE Control. Syst. Lett.?"],"info":{}}
{"id":"train_5221","question":"Have the authors of the paper 'Method of application driven QoS service in open service platform based on RESTful web services' not published the paper 'Distance Bounding based on PUF'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ictc/LimK14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/iacr/IgierV16> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/iacr/IgierV16> != <https://dblp.org/rec/conf/ictc/LimK14> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/ictc/LimK14> dblp:authoredBy ?x . <https://dblp.org/rec/journals/iacr/IgierV16> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/iacr/IgierV16> != <https://dblp.org/rec/conf/ictc/LimK14> ) } }","paraphrases":["Did the authors of 'Method of application driven QoS service in open service platform based on RESTful web services' not publish 'Distance Bounding based on PUF'?"],"info":{}}
{"id":"train_5225","question":"Did the authors of 'Communication Fault Maintenance Decision of Information System Based on Inverse Symmetry Algorithm' not publish a paper in Symmetry?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/symmetry/LiSL20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/symmetry/LiSL20> ) . ?y dblp:publishedIn 'Symmetry' FILTER NOT EXISTS { <https://dblp.org/rec/journals/symmetry/LiSL20> dblp:publishedIn 'Symmetry' } }","paraphrases":["Have the authors of the paper 'Communication Fault Maintenance Decision of Information System Based on Inverse Symmetry Algorithm' not published a publication in Symmetry?"],"info":{}}
{"id":"train_5226","question":"Did the authors of 'Object Manipulation in Virtual Environments: Relative Size Matters' not publish a paper in CHI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/WangM99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/chi/WangM99> ) . ?y dblp:publishedIn 'CHI' FILTER NOT EXISTS { <https://dblp.org/rec/conf/chi/WangM99> dblp:publishedIn 'CHI' } }","paraphrases":["Have the authors of the paper 'Object Manipulation in Virtual Environments: Relative Size Matters' not published a publication in CHI?"],"info":{}}
{"id":"train_5227","question":"Have the authors of the paper 'User Interface Requirements in Educational Multimedia' not published a publication in WebNet?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/webnet/Fenley99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/webnet/Fenley99> ) . ?y dblp:publishedIn 'WebNet' FILTER NOT EXISTS { <https://dblp.org/rec/conf/webnet/Fenley99> dblp:publishedIn 'WebNet' } }","paraphrases":["Did the authors of the publication 'User Interface Requirements in Educational Multimedia' not publish a paper in WebNet?"],"info":{}}
{"id":"train_5228","question":"Wasn't the paper 'Modeling, Simulation, and Validation of An Electric Scooter Energy Consumption Model: A Case Study of Indonesian Electric Scooter' published in the year 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/access/YuniartoWNSN22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/journals/access/YuniartoWNSN22> dblp:yearOfPublication '2022' } }","paraphrases":["Was 'Modeling, Simulation, and Validation of An Electric Scooter Energy Consumption Model: A Case Study of Indonesian Electric Scooter' not published in 2022?"],"info":{}}
{"id":"train_5229","question":"Haven't the authors of the publication 'Linked Death - representing, publishing, and using Second World War death records as Linked Open Data' published a publication in WHiSe@ESWC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esws/KohoHHTLM16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/esws/KohoHHTLM16> ) . ?y dblp:publishedIn 'WHiSe@ESWC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/esws/KohoHHTLM16> dblp:publishedIn 'WHiSe@ESWC' } }","paraphrases":["Did the authors of the publication 'Linked Death - representing, publishing, and using Second World War death records as Linked Open Data' not publish a paper in WHiSe@ESWC?"],"info":{}}
{"id":"train_5232","question":"Wasn't the publication 'Deep Reinforcement Learning Techniques For Solving Hybrid Flow Shop Scheduling Problems: Proximal Policy Optimization (PPO) and Asynchronous Advantage Actor-Critic (A3C)' published in 2022?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hicss/NahhasKT22> dblp:yearOfPublication '2022' FILTER NOT EXISTS { <https://dblp.org/rec/conf/hicss/NahhasKT22> dblp:yearOfPublication '2022' } }","paraphrases":["Wasn't the paper 'Deep Reinforcement Learning Techniques For Solving Hybrid Flow Shop Scheduling Problems: Proximal Policy Optimization (PPO) and Asynchronous Advantage Actor-Critic (A3C)' published in the year 2022?"],"info":{}}
{"id":"train_5234","question":"Was 'How Case Based Reasoning Explained Neural Networks: An XAI Survey of Post-Hoc Explanation-by-Example in ANN-CBR Twins' not published in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1905-07186> dblp:yearOfPublication '2019' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1905-07186> dblp:yearOfPublication '2019' } }","paraphrases":["Wasn't the publication 'How Case Based Reasoning Explained Neural Networks: An XAI Survey of Post-Hoc Explanation-by-Example in ANN-CBR Twins' published in 2019?"],"info":{}}
{"id":"train_5235","question":"Wasn't the paper 'RemoteBob: Support of On-site Workers via a Telepresence Remote Expert System' published in the year 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iot/KritzlerMM16> dblp:yearOfPublication '2016' FILTER NOT EXISTS { <https://dblp.org/rec/conf/iot/KritzlerMM16> dblp:yearOfPublication '2016' } }","paraphrases":["Wasn't the publication 'RemoteBob: Support of On-site Workers via a Telepresence Remote Expert System' published in 2016?"],"info":{}}
{"id":"train_5236","question":"Have the authors of the paper 'How does homophily shape the topology of a dynamic network?' not published a publication in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2106-15963> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/corr/abs-2106-15963> ) . ?y dblp:publishedIn 'CoRR' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2106-15963> dblp:publishedIn 'CoRR' } }","paraphrases":["Haven't the authors of the publication 'How does homophily shape the topology of a dynamic network?' published a publication in CoRR?"],"info":{}}
{"id":"train_5237","question":"Was 'Musical pitch tracking using internal model control based frequency cancellation' not published in 2003?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/ZhaoB03a> dblp:yearOfPublication '2003' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cdc/ZhaoB03a> dblp:yearOfPublication '2003' } }","paraphrases":["Wasn't the paper 'Musical pitch tracking using internal model control based frequency cancellation' published in the year 2003?"],"info":{}}
{"id":"train_5239","question":"Have the authors of the paper 'Managing System Architecture for Multi-Rotor Autonomous Flying Platform-Practical Aspects' not published a publication in ICMMI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icmmi/SzafranskiJC13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icmmi/SzafranskiJC13> ) . ?y dblp:publishedIn 'ICMMI' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icmmi/SzafranskiJC13> dblp:publishedIn 'ICMMI' } }","paraphrases":["Did the authors of the publication 'Managing System Architecture for Multi-Rotor Autonomous Flying Platform-Practical Aspects' not publish a paper in ICMMI?"],"info":{}}
{"id":"train_5240","question":"Did the authors of the publication 'Robust Face Recognition with Deeply Normalized Depth Images' not publish a paper in CCBR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ccbr/FengZ18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ccbr/FengZ18> ) . ?y dblp:publishedIn 'CCBR' FILTER NOT EXISTS { <https://dblp.org/rec/conf/ccbr/FengZ18> dblp:publishedIn 'CCBR' } }","paraphrases":["Have the authors of the paper 'Robust Face Recognition with Deeply Normalized Depth Images' not published a publication in CCBR?"],"info":{}}
{"id":"train_5241","question":"Have the authors of the paper 'India's Contribution and Research Impact Leishmaniasis Research: A Bibliometric Analysis' not published a publication in J. Sci. Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jscires/Ram18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jscires/Ram18> ) . ?y dblp:publishedIn 'J. Sci. Res.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jscires/Ram18> dblp:publishedIn 'J. Sci. Res.' } }","paraphrases":["Did the authors of 'India's Contribution and Research Impact Leishmaniasis Research: A Bibliometric Analysis' not publish a paper in J. Sci. Res.?"],"info":{}}
{"id":"train_5243","question":"Haven't the authors of the publication 'A model based simulation toolkit for evaluating renal replacement policies' published a publication in Winter Simulation Conference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wsc/CelikGSRWW17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/wsc/CelikGSRWW17> ) . ?y dblp:publishedIn 'WSC' FILTER NOT EXISTS { <https://dblp.org/rec/conf/wsc/CelikGSRWW17> dblp:publishedIn 'WSC' } }","paraphrases":["Have the authors of the paper 'A model based simulation toolkit for evaluating renal replacement policies' not published a publication in Winter Simulation Conference?"],"info":{}}
{"id":"train_5244","question":"Did the authors of the publication 'PreTrans: Reducing TLB CAM-search via page number prediction and speculative pre-translation' not publish 'On one asymptotic formula for the Euler constant'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/islped/XueT13> dblp:authoredBy ?x . <https://dblp.org/rec/journals/poit/Karatsuba12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/poit/Karatsuba12> != <https://dblp.org/rec/conf/islped/XueT13> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/islped/XueT13> dblp:authoredBy ?x . <https://dblp.org/rec/journals/poit/Karatsuba12> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/poit/Karatsuba12> != <https://dblp.org/rec/conf/islped/XueT13> ) } }","paraphrases":["Haven't the authors of the publication 'PreTrans: Reducing TLB CAM-search via page number prediction and speculative pre-translation' published the paper 'On one asymptotic formula for the Euler constant'?"],"info":{}}
{"id":"train_5245","question":"Did the authors of the publication 'Modified two-dimensional compressed sensing scheme for massive MIMO channel estimation' not publish a paper in WCSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wcsp/WangWF16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/wcsp/WangWF16> ) . ?y dblp:publishedIn 'WCSP' FILTER NOT EXISTS { <https://dblp.org/rec/conf/wcsp/WangWF16> dblp:publishedIn 'WCSP' } }","paraphrases":["Haven't the authors of the publication 'Modified two-dimensional compressed sensing scheme for massive MIMO channel estimation' published a publication in WCSP?"],"info":{}}
{"id":"train_5246","question":"Did the authors of the publication 'Combining RCC-8 with Qualitative Direction Calculi: Algorithms and Complexity' not publish 'Emotion Recognition from EEG Signals by Leveraging Stimulus Videos'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ijcai/LiuLR09> dblp:authoredBy ?x . <https://dblp.org/rec/conf/pcm/GaoW15> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/pcm/GaoW15> != <https://dblp.org/rec/conf/ijcai/LiuLR09> ) FILTER NOT EXISTS { <https://dblp.org/rec/conf/ijcai/LiuLR09> dblp:authoredBy ?x . <https://dblp.org/rec/conf/pcm/GaoW15> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/pcm/GaoW15> != <https://dblp.org/rec/conf/ijcai/LiuLR09> ) } }","paraphrases":["Haven't the authors of the publication 'Combining RCC-8 with Qualitative Direction Calculi: Algorithms and Complexity' published the paper 'Emotion Recognition from EEG Signals by Leveraging Stimulus Videos'?"],"info":{}}
{"id":"train_5248","question":"Did the authors of the publication 'Improving Imaging Quality of Real-time Fourier Single-pixel Imaging via Deep Learning' not publish 'Open Distributed Processing'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/RizviCZH19> dblp:authoredBy ?x . <https://dblp.org/rec/conf/pstv/Griethuysen89> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/pstv/Griethuysen89> != <https://dblp.org/rec/journals/sensors/RizviCZH19> ) FILTER NOT EXISTS { <https://dblp.org/rec/journals/sensors/RizviCZH19> dblp:authoredBy ?x . <https://dblp.org/rec/conf/pstv/Griethuysen89> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/pstv/Griethuysen89> != <https://dblp.org/rec/journals/sensors/RizviCZH19> ) } }","paraphrases":["Have the authors of the paper 'Improving Imaging Quality of Real-time Fourier Single-pixel Imaging via Deep Learning' not published the paper 'Open Distributed Processing'?"],"info":{}}
{"id":"train_5249","question":"Wasn't the publication 'Multiple target tracking using maximum likelihood principle' published in 1995?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsp/SatishK95> dblp:yearOfPublication '1995' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tsp/SatishK95> dblp:yearOfPublication '1995' } }","paraphrases":["Was 'Multiple target tracking using maximum likelihood principle' not published in 1995?"],"info":{}}
{"id":"train_5250","question":"Did the authors of the publication 'Effective Community Search Over Location-Based Social Networks: Conceptual Framework with Preliminary Result' not not publish a paper in Australasian Database Conference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/adc/AlaqtaWA19> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/adc/AlaqtaWA19> ) . ?y dblp:publishedIn 'ADC' }","paraphrases":["Have the authors of the paper 'Effective Community Search Over Location-Based Social Networks: Conceptual Framework with Preliminary Result' not not published a publication in Australasian Database Conference?"],"info":{}}
{"id":"train_5251","question":"Was the paper 'Decentralised Multi-intersection Congestion Control for Connected Autonomous Vehicles' not not published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eumas/VuARF20> dblp:yearOfPublication '2020' }","paraphrases":["Was 'Decentralised Multi-intersection Congestion Control for Connected Autonomous Vehicles' not not published in 2020?"],"info":{}}
{"id":"train_5252","question":"Haven't the authors of the publication 'Analysis of Reversible and Quantum Finite State Machines Using Homing, Synchronizing and Distinguishing Input Sequences' not published a publication in ISMVL?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ismvl/LukacKPK13> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ismvl/LukacKPK13> ) . ?y dblp:publishedIn 'ISMVL' }","paraphrases":["Have the authors of the paper 'Analysis of Reversible and Quantum Finite State Machines Using Homing, Synchronizing and Distinguishing Input Sequences' not not published a publication in ISMVL?"],"info":{}}
