{"id":"train_1853","question":"Was a paper not not co-authored by M. A. Nacenta and Haber, J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/10/6760> . ?x dblp:authoredBy <https://dblp.org/pid/07/10404> }","paraphrases":["Didn't Miguel A. Nacenta and Haber, J. not co-author a paper?"],"info":{}}
{"id":"train_1854","question":"Was a paper not not co-authored by Andr\\u00E9 Seznec and Joshua San Miguel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/08/6044> . ?x dblp:authoredBy <https://dblp.org/pid/157/2774> }","paraphrases":["Didn't Andr\\u00E9 Seznec and Joshua San Miguel not co-author a paper?"],"info":{}}
{"id":"train_1855","question":"Has Lin, Chin-Han not not published the paper 'An optimization of UWB antenna location'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscc/ChenCL09> dblp:authoredBy <https://dblp.org/pid/15/7380> }","paraphrases":["Wasn't the paper 'An optimization of UWB antenna location' not not published by the author Lin, Chin-Han?"],"info":{}}
{"id":"train_1856","question":"Was a paper not not co-authored by S. K. Burley and Westbrook, J. D.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/65/9439> . ?x dblp:authoredBy <https://dblp.org/pid/91/3788> }","paraphrases":["Didn't Stephen K. Burley and John D. Westbrook not co-author a paper?"],"info":{}}
{"id":"train_1857","question":"Was a paper not not co-authored by Valiant, L. G. and Samuel Henrique Bucke Brito?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/v/LeslieGValiant> . ?x dblp:authoredBy <https://dblp.org/pid/170/5662> }","paraphrases":["Didn't Leslie G. Valiant and Samuel H. Bucke Brito not co-author a paper?"],"info":{}}
{"id":"train_1858","question":"Didn't Nicolas Trotignon and Vuskovic, K. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/91/4388> . ?x dblp:authoredBy <https://dblp.org/pid/00/2530> }","paraphrases":["Was a paper not not co-authored by Nicolas Trotignon and Vuskovic, K.?"],"info":{}}
{"id":"train_1859","question":"Was a paper not not co-authored by Baby, Y. Rajan and Sumathy, Vinod Kumar Ramayyan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/264/5330> . ?x dblp:authoredBy <https://dblp.org/pid/264/5379> }","paraphrases":["Didn't Baby, Y. Rajan and Vinod Kumar Ramayyan Sumathy not co-author a paper?"],"info":{}}
{"id":"train_1860","question":"Was a paper not not co-authored by M. Borkar and Arthur J. Redfern?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/85/4383> . ?x dblp:authoredBy <https://dblp.org/pid/46/4256> }","paraphrases":["Didn't M. Borkar and Arthur J. Redfern not co-author a paper?"],"info":{}}
{"id":"train_1861","question":"Was a paper not not co-authored by Lang, W. and Javier Palafox-Albarr\\u00E1n?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/39/6717> . ?x dblp:authoredBy <https://dblp.org/pid/07/8924> }","paraphrases":["Didn't Lang, W. and Javier Palafox-Albarr\\u00E1n not co-author a paper?"],"info":{}}
{"id":"train_1862","question":"Doesn't J. Antonio Lozano not work at University of the Basque Country, Department of Computer Science and Artificial Intelligence?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/l/JoseAntonioLozano> dblp:primaryAffiliation 'University of the Basque Country, Department of Computer Science and Artificial Intelligence' }","paraphrases":["Isn't J. Antonio Lozano not affiliated with University of the Basque Country?"],"info":{}}
{"id":"train_1863","question":"Didn't Josu D. not publish the paper 'Age-Oriented Scheduling of Correlated Sources in Multi-server System'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iswcs/LyDA21> dblp:authoredBy <https://dblp.org/pid/119/4786> }","paraphrases":["Was the paper 'Age-Oriented Scheduling of Correlated Sources in Multi-server System' not not published by the person Josu D.?"],"info":{}}
{"id":"train_1864","question":"Didn't Korayem, M. and W. Shalaby not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/85/8980> . ?x dblp:authoredBy <https://dblp.org/pid/156/0091> }","paraphrases":["Was a paper not not co-authored by Mohammed Korayem and W. Shalaby?"],"info":{}}
{"id":"train_1865","question":"Wasn't the paper 'The KnowledgeMap Project: Development of a Concept-Based Medical School Curriculum Database' not not published by the person named Irani, Plomarz R.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/amia/DennyIWSS03> dblp:authoredBy <https://dblp.org/pid/149/3566> }","paraphrases":["Wasn't the paper 'The KnowledgeMap Project: Development of a Concept-Based Medical School Curriculum Database' not not published by the author Irani, Plomarz R.?"],"info":{}}
{"id":"train_1866","question":"Wasn't the paper 'Cumulative culture spontaneously emerges in artificial navigators who are social and memory-guided' not not published by the author Edwin S. Dalmaijer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2206-06281> dblp:authoredBy <https://dblp.org/pid/285/5312> }","paraphrases":["Has Dalmaijer, E. S. not not published the paper 'Cumulative culture spontaneously emerges in artificial navigators who are social and memory-guided'?"],"info":{}}
{"id":"train_1867","question":"Isn't Jae-Hoon Kim not affiliated with Pusan University of Foreign Studies, Busan, Korea?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/k/JaeHoonKim> dblp:primaryAffiliation 'Pusan University of Foreign Studies, Busan, Korea' }","paraphrases":["Doesn't Jae-Hoon Kim not work at Pusan University of Foreign Studies?"],"info":{}}
{"id":"train_1868","question":"Didn't Ismail B. Sik Ali and Basile L. Agba not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/210/9325> . ?x dblp:authoredBy <https://dblp.org/pid/80/2641> }","paraphrases":["Was a paper not not co-authored by Ismail Ben Sik Ali and Basile L. Agba?"],"info":{}}
{"id":"train_1869","question":"Wasn't the paper 'Improving navigation-based file retrieval' not not published by the author Andy Cockburn?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/chi/FitchettCG13> dblp:authoredBy <https://dblp.org/pid/c/AndyCockburn> }","paraphrases":["Didn't Cockburn, A. not publish the paper 'Improving navigation-based file retrieval'?"],"info":{}}
{"id":"train_1870","question":"Was the paper 'A Switchable Deep Learning Approach for In-Loop Filtering in Video Coding' not not published by the person Dandan Ding?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcsv/DingKCLF20> dblp:authoredBy <https://dblp.org/pid/71/7248> }","paraphrases":["Wasn't the paper 'A Switchable Deep Learning Approach for In-Loop Filtering in Video Coding' not not published by the author Dandan Ding?"],"info":{}}
{"id":"train_1871","question":"Wasn't the paper 'Dynamic test data transformations for average and peak power reductions' not not published by the person named Alex Orailoglu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ets/SinanogluBO02> dblp:authoredBy <https://dblp.org/pid/o/AlexOrailoglu> }","paraphrases":["Wasn't the paper 'Dynamic test data transformations for average and peak power reductions' not not published by the author Orailoglu, Alex?"],"info":{}}
{"id":"train_1872","question":"Wasn't the paper 'The Appropriate Hidden Layers of Deep Belief Networks for Speech Recognition' not not published by the person named Xianzhong Zhou?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iske/WeiLZ15> dblp:authoredBy <https://dblp.org/pid/66/6684> }","paraphrases":["Didn't Xianzhong Zhou not publish the paper 'The Appropriate Hidden Layers of Deep Belief Networks for Speech Recognition'?"],"info":{}}
{"id":"train_1873","question":"Was a paper not not co-authored by M\\u00E1rio S\\u00E9rgio Teixeira and Gon\\u00E7alves, R.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/146/6451> . ?x dblp:authoredBy <https://dblp.org/pid/18/5476> }","paraphrases":["Didn't M\\u00E1rio S\\u00E9rgio Teixeira and Ramiro Gon\\u00E7alves not co-author a paper?"],"info":{}}
{"id":"train_1874","question":"Was a paper not not co-authored by Wu, J. and Albert C. S. Chung?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/89/2125> . ?x dblp:authoredBy <https://dblp.org/pid/45/6335> }","paraphrases":["Didn't Jue Wu and Albert C. S. Chung not co-author a paper?"],"info":{}}
{"id":"train_1875","question":"Didn't Feng Zhou and Gang Q. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/21/6430> . ?x dblp:authoredBy <https://dblp.org/pid/121/1346> }","paraphrases":["Was a paper not not co-authored by F. Zhou and Gang Q.?"],"info":{}}
{"id":"train_1876","question":"Was a paper not not co-authored by Zwieback, S. and Marina Leibman?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/117/7182> . ?x dblp:authoredBy <https://dblp.org/pid/210/0174> }","paraphrases":["Didn't Zwieback, S. and Marina L. not co-author a paper?"],"info":{}}
{"id":"train_1878","question":"Didn't Khaled S. and Naim B. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/47/1159> . ?x dblp:authoredBy <https://dblp.org/pid/94/2344> }","paraphrases":["Was a paper not not co-authored by Khaled S. and Naim B.?"],"info":{}}
{"id":"train_1879","question":"Isn't J\\u00FCrgen L. not affiliated with Bosch Corporate Research?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/18/3475> dblp:primaryAffiliation 'Bosch Corporate Research, Renningen, Germany' }","paraphrases":["Doesn't J\\u00FCrgen L. not work at Bosch Corporate Research?"],"info":{}}
{"id":"train_1880","question":"Was the paper 'Model-based Optimization of a Low-dimensional Modulation Filter Bank for DRR and T60 Estimation' not not published by the person Semih A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/eusipco/AgcaerM19> dblp:authoredBy <https://dblp.org/pid/173/7002> }","paraphrases":["Wasn't the paper 'Model-based Optimization of a Low-dimensional Modulation Filter Bank for DRR and T60 Estimation' not not published by the person named Semih A.?"],"info":{}}
{"id":"train_1881","question":"Was a paper not not co-authored by L. Yin and X.-M. Zhu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/66/729> . ?x dblp:authoredBy <https://dblp.org/pid/21/6775> }","paraphrases":["Didn't L. Yin and Zhu, X.-M. not co-author a paper?"],"info":{}}
{"id":"train_1883","question":"Wasn't the paper 'EPIC: Explicititly Parallel Instruction Computing' not not published by the author Schlansker, M.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/computer/SchlanskerR00> dblp:authoredBy <https://dblp.org/pid/00/8857> }","paraphrases":["Didn't Schlansker, M. not publish the paper 'EPIC: Explicititly Parallel Instruction Computing'?"],"info":{}}
{"id":"train_1884","question":"Didn't Ioanna Chouvarda and Carvalho, Paulo not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/33/1080> . ?x dblp:authoredBy <https://dblp.org/pid/52/5239-1> }","paraphrases":["Was a paper not not co-authored by Chouvarda, Ioanna and Paulo Carvalho?"],"info":{}}
{"id":"train_1885","question":"Was the paper 'A recursive do for Haskell' not not published by the person Levent Erk\\u00F6k?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/haskell/ErkokL02> dblp:authoredBy <https://dblp.org/pid/00/5157> }","paraphrases":["Wasn't the paper 'A recursive do for Haskell' not not published by the author Erk\\u00F6k, L.?"],"info":{}}
{"id":"train_1886","question":"Wasn't the paper 'Superiorities of Deep Extreme Learning Machines against Convolutional Neural Networks' not not published by the author Gokhan A.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2101-10265> dblp:authoredBy <https://dblp.org/pid/86/10160> }","paraphrases":["Has Gokhan Altan not not published the paper 'Superiorities of Deep Extreme Learning Machines against Convolutional Neural Networks'?"],"info":{}}
{"id":"train_1887","question":"Was a paper not not co-authored by Serena Doria and Thomas Augustin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/14/5166> . ?x dblp:authoredBy <https://dblp.org/pid/34/2415> }","paraphrases":["Didn't Serena Doria and Thomas Augustin not co-author a paper?"],"info":{}}
{"id":"train_1888","question":"Was a paper not not co-authored by Amit A. Levy and Boneh, Dan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/68/8881> . ?x dblp:authoredBy <https://dblp.org/pid/b/DanBoneh> }","paraphrases":["Didn't Amit A. Levy and Boneh, Dan not co-author a paper?"],"info":{}}
{"id":"train_1889","question":"Didn't Luke Pfister and Bresler, Y. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/148/9662> . ?x dblp:authoredBy <https://dblp.org/pid/33/5971> }","paraphrases":["Was a paper not not co-authored by Luke Pfister and Yoram Bresler?"],"info":{}}
{"id":"train_1890","question":"Didn't Takeshi I. and Huang, Yiqing not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/10/155> . ?x dblp:authoredBy <https://dblp.org/pid/39/6548-2> }","paraphrases":["Was a paper not not co-authored by Takeshi I. and Huang, Yiqing?"],"info":{}}
{"id":"train_1891","question":"Has A. DasGupta not not published the paper 'The effect of perturbed advection on a class of solutions of a non-linear reaction-diffusion equation'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/VaratharajanD16> dblp:authoredBy <https://dblp.org/pid/192/0657> }","paraphrases":["Was the paper 'The effect of perturbed advection on a class of solutions of a non-linear reaction-diffusion equation' not not published by the person Anirvan DasGupta?"],"info":{}}
{"id":"train_1892","question":"Didn't Juanjo Noguera and Daniel J. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/24/6502> . ?x dblp:authoredBy <https://dblp.org/pid/59/1032> }","paraphrases":["Was a paper not not co-authored by Juanjo Noguera and Daniel Jim\\u00E9nez-Gonz\\u00E1lez?"],"info":{}}
{"id":"train_1893","question":"Doesn't Alfons L. not work at Leiden University, The Netherlands?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/05/7913> dblp:primaryAffiliation 'Leiden University, The Netherlands' }","paraphrases":["Isn't Alfons L. not affiliated with Leiden University?"],"info":{}}
{"id":"train_1894","question":"Isn't Francisco Javier Caminero Gil not affiliated with Telef\\u00F3nica R&D?","sparql":"ASK { <https://dblp.org/pid/53/9348> <https://dblp.org/rdf/schema#primaryAffiliation> 'Telef\\u00F3nica R&D' }","paraphrases":["Doesn't F. Javier Caminero Gil not work at Telef\\u00F3nica R&D?"],"info":{}}
{"id":"train_1895","question":"Was the paper 'Estimation of Regional Electrical Properties of the Heart from 12-Lead ECG and Images' not not published by the person Ali Kamen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/miccai/SeegererMJNGKKASHKMC14> dblp:authoredBy <https://dblp.org/pid/38/8280> }","paraphrases":["Has A. Kamen not not published the paper 'Estimation of Regional Electrical Properties of the Heart from 12-Lead ECG and Images'?"],"info":{}}
{"id":"train_1896","question":"Was a paper not not co-authored by W. Supsi and Winai Chonnaparamutt?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/305/1537> . ?x dblp:authoredBy <https://dblp.org/pid/33/6311> }","paraphrases":["Didn't Witsarut Supsi and Winai Chonnaparamutt not co-author a paper?"],"info":{}}
{"id":"train_1897","question":"Wasn't the paper 'UStore: A Distributed Storage With Rich Semantics' not not published by the person named Wang, Ji?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/DinhWWCCLORTXZZ17> dblp:authoredBy <https://dblp.org/pid/64/856> }","paraphrases":["Didn't Ji Wang not publish the paper 'UStore: A Distributed Storage With Rich Semantics'?"],"info":{}}
{"id":"train_1899","question":"Doesn't Ming Zhou not work at Microsoft Research Asia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/16/1161-1> dblp:primaryAffiliation 'Microsoft Research Asia, Beijing, China' }","paraphrases":["Isn't Ming Zhou not affiliated with Microsoft Research Asia, Beijing, China?"],"info":{}}
{"id":"train_1900","question":"Was a paper not not co-authored by Joshi, M. V. and Kamal M. Captain?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/36/6018> . ?x dblp:authoredBy <https://dblp.org/pid/177/8040> }","paraphrases":["Didn't Joshi, M. V. and Captain, K. M. not co-author a paper?"],"info":{}}
{"id":"train_1902","question":"Was a paper not not co-authored by Christine L. Lisetti and Piotr J. Gmytrasiewicz?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/91/1021> . ?x dblp:authoredBy <https://dblp.org/pid/50/887> }","paraphrases":["Didn't Christine L. Lisetti and Piotr J. Gmytrasiewicz not co-author a paper?"],"info":{}}
{"id":"train_1903","question":"Was a paper not not co-authored by Rubin A. Parekhji and K. Nikila?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/23/3304> . ?x dblp:authoredBy <https://dblp.org/pid/35/3812> }","paraphrases":["Didn't Rubin A. Parekhji and K. Nikila not co-author a paper?"],"info":{}}
{"id":"train_1904","question":"Has Schatz, T. not not published the paper 'The zero resource speech challenge 2015'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/interspeech/VersteeghTSCAJD15> dblp:authoredBy <https://dblp.org/pid/136/5238> }","paraphrases":["Wasn't the paper 'The zero resource speech challenge 2015' not not published by the author Schatz, T.?"],"info":{}}
{"id":"train_1905","question":"Was the paper 'Approximation Algorithms for the Selection of Robust Tag SNPs' not not published by the person Yao-Ting Huang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wabi/HuangZCC04> dblp:authoredBy <https://dblp.org/pid/65/213> }","paraphrases":["Didn't Huang, Yao-Ting not publish the paper 'Approximation Algorithms for the Selection of Robust Tag SNPs'?"],"info":{}}
{"id":"train_1906","question":"Was a paper not not co-authored by J\\u00E1n P. and John Simpson?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/56/2142> . ?x dblp:authoredBy <https://dblp.org/pid/222/1090> }","paraphrases":["Didn't J\\u00E1n P. and Simpson, John not co-author a paper?"],"info":{}}
{"id":"train_1907","question":"Wasn't the paper 'Ad-Hoc Translations to Close Verilog Semantics Gap' not not published by the person named Christian H.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ddecs/HaufeR08> dblp:authoredBy <https://dblp.org/pid/82/2939> }","paraphrases":["Has Christian Haufe not not published the paper 'Ad-Hoc Translations to Close Verilog Semantics Gap'?"],"info":{}}
{"id":"train_1908","question":"Didn't Karaata, Mehmet Hakan not publish the paper 'An optimal inherently stabilizing routing algorithm for star P2P overlay networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/concurrency/KaraataA16> dblp:authoredBy <https://dblp.org/pid/59/6610> }","paraphrases":["Wasn't the paper 'An optimal inherently stabilizing routing algorithm for star P2P overlay networks' not not published by the author Mehmet Hakan Karaata?"],"info":{}}
{"id":"train_1909","question":"Was the paper 'Neurophysiological Predictors of Team Performance' not not published by the person C. Berka?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/JohnsonBWBPM13> dblp:authoredBy <https://dblp.org/pid/68/1510> }","paraphrases":["Wasn't the paper 'Neurophysiological Predictors of Team Performance' not not published by the person named Chris Berka?"],"info":{}}
{"id":"train_1910","question":"Was a paper not not co-authored by Efthymios Alepis and Maria Virvou?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/27/4432> . ?x dblp:authoredBy <https://dblp.org/pid/35/2047> }","paraphrases":["Didn't Efthymios Alepis and Maria V. not co-author a paper?"],"info":{}}
{"id":"train_1911","question":"Has X. Zhang not not published the paper 'The conjugate gradient method with various viewpoints'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1910-03293> dblp:authoredBy <https://dblp.org/pid/16/1125> }","paraphrases":["Wasn't the paper 'The conjugate gradient method with various viewpoints' not not published by the person named X. Zhang?"],"info":{}}
{"id":"train_1912","question":"Didn't Sylvia Beyer not publish the paper 'Gender Differences and Intra-Gender Differences amongst Management Information Systems Students'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jisedu/Beyer08> dblp:authoredBy <https://dblp.org/pid/49/1971> }","paraphrases":["Was the paper 'Gender Differences and Intra-Gender Differences amongst Management Information Systems Students' not not published by the person Beyer, S.?"],"info":{}}
{"id":"train_1913","question":"Didn't Jinghong Zheng and Chau, L. not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/54/5344> . ?x dblp:authoredBy <https://dblp.org/pid/03/5597> }","paraphrases":["Was a paper not not co-authored by Jinghong Zheng and Lap-Pui Chau?"],"info":{}}
{"id":"train_1914","question":"Wasn't the paper 'On the Intersection Graphs of Orthogonal Line Segments in the Plane: Characterizations of Some Subclasses of Chordal Graphs' not not published by the author Martin Charles Golumbic?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/gc/GolumbicR13> dblp:authoredBy <https://dblp.org/pid/g/MCGolumbic> }","paraphrases":["Has Martin Charles Golumbic not not published the paper 'On the Intersection Graphs of Orthogonal Line Segments in the Plane: Characterizations of Some Subclasses of Chordal Graphs'?"],"info":{}}
{"id":"train_1915","question":"Was a paper not not co-authored by Wu, Y. and Gao, L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/11/10388> . ?x dblp:authoredBy <https://dblp.org/pid/183/2784> }","paraphrases":["Didn't Yichen Wu and Lisheng Gao not co-author a paper?"],"info":{}}
{"id":"train_1916","question":"Didn't Pengfeng Li and Zheng Lu not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/67/8714> . ?x dblp:authoredBy <https://dblp.org/pid/15/2402> }","paraphrases":["Was a paper not not co-authored by Pengfeng Li and Lu, Z.?"],"info":{}}
{"id":"train_1917","question":"Didn't Maura Mengoni not publish the paper 'Platform to support dynamic collaborative design processes in virtual enterprises'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijcim/GermaniMMP13> dblp:authoredBy <https://dblp.org/pid/69/6188> }","paraphrases":["Wasn't the paper 'Platform to support dynamic collaborative design processes in virtual enterprises' not not published by the author Maura Mengoni?"],"info":{}}
{"id":"train_1918","question":"Didn't Xiang Xiao and Pranav Vaidya not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/19/5983> . ?x dblp:authoredBy <https://dblp.org/pid/18/1669> }","paraphrases":["Was a paper not not co-authored by Xiao, Xiang and Vaidya, Pranav?"],"info":{}}
{"id":"train_1919","question":"Wasn't the paper 'Extracting analytic proofs from numerically solved Shannon-type Inequalities' not not published by the author Ido B. Gattegno?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/GattegnoP17> dblp:authoredBy <https://dblp.org/pid/188/6120> }","paraphrases":["Wasn't the paper 'Extracting analytic proofs from numerically solved Shannon-type Inequalities' not not published by the person named Ido B. Gattegno?"],"info":{}}
{"id":"train_1920","question":"Didn't H. C. Ratz and Giordano B. Ferreira not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/78/4801> . ?x dblp:authoredBy <https://dblp.org/pid/43/8506> }","paraphrases":["Was a paper not not co-authored by Ratz, H. C. and G. B. Ferreira?"],"info":{}}
{"id":"train_1921","question":"Didn't M. Yamada and Kikuchi, Hiroaki not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/25/2929> . ?x dblp:authoredBy <https://dblp.org/pid/90/4508> }","paraphrases":["Was a paper not not co-authored by M. Yamada and Kikuchi, Hiroaki?"],"info":{}}
{"id":"train_1922","question":"Was a paper not not co-authored by Barra, Adriano and Alemanno, Francesco?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/49/8910> . ?x dblp:authoredBy <https://dblp.org/pid/232/3905> }","paraphrases":["Didn't Adriano Barra and Alemanno, Francesco not co-author a paper?"],"info":{}}
{"id":"train_1923","question":"Wasn't the paper 'A physical approach to mismatch modelling and parameter correlations' not not published by the author Klaus Schumacher?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscas/OelunGS00> dblp:authoredBy <https://dblp.org/pid/158/2471> }","paraphrases":["Was the paper 'A physical approach to mismatch modelling and parameter correlations' not not published by the person Klaus Schumacher?"],"info":{}}
{"id":"train_1924","question":"Isn't Miksch, S. not affiliated with TU Wien, Vienna, Autria?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/48/4040> dblp:primaryAffiliation 'TU Wien, Vienna, Autria' }","paraphrases":["Doesn't Miksch, S. not work at TU Wien, Vienna, Autria?"],"info":{}}
{"id":"train_1925","question":"Didn't Phillip Shvartsman and Xinmiao Zhang not co-author a paper?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/244/7559> . ?x dblp:authoredBy <https://dblp.org/pid/80/3657> }","paraphrases":["Was a paper not not co-authored by Phillip Shvartsman and Xinmiao Z.?"],"info":{}}
{"id":"train_1926","question":"Has J. M. Navarro not not published the paper 'FutureHome: An integrated construction automation approach'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ram/BalaguerANBAKSSBWA02> dblp:authoredBy <https://dblp.org/pid/120/3763> }","paraphrases":["Wasn't the paper 'FutureHome: An integrated construction automation approach' not not published by the author J. M. Navarro?"],"info":{}}
{"id":"train_1927","question":"Wasn't the paper 'Knowledge Scientists: Unlocking the data-driven organization' not not published by the person named George Fletcher?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2004-07917> dblp:authoredBy <https://dblp.org/pid/f/GeorgeHLFletcher> }","paraphrases":["Has George F. not not published the paper 'Knowledge Scientists: Unlocking the data-driven organization'?"],"info":{}}
{"id":"train_1928","question":"Was the paper 'Make It Easy: An Effective End-to-End Entity Alignment Framework' not not published by the person Xiaoze Liu?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sigir/GeLCZG21> dblp:authoredBy <https://dblp.org/pid/239/4537> }","paraphrases":["Has Xiaoze Liu not not published the paper 'Make It Easy: An Effective End-to-End Entity Alignment Framework'?"],"info":{}}
{"id":"train_1929","question":"Doesn't Zhang, P. not work at Beijing University of Posts and Telecommunications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/77/2428-3> dblp:primaryAffiliation 'Beijing University of Posts and Telecommunications, State Key Laboratory of Networking and Switching Technology, China' }","paraphrases":["Isn't Ping Zhang not affiliated with Beijing University of Posts and Telecommunications?"],"info":{}}
{"id":"train_1930","question":"Was a paper not not co-authored by J. A. Smith and Santosh K. Shrivastava?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/02/6985> . ?x dblp:authoredBy <https://dblp.org/pid/37/5945> }","paraphrases":["Didn't J. A. Smith and Shrivastava, Santosh K. not co-author a paper?"],"info":{}}
{"id":"train_1931","question":"Was the paper 'An efficient cross layer design for OFDMA-based wireless networks with channel reuse' not not published by the person Ramy H. Gohary?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/RashtchiGY13> dblp:authoredBy <https://dblp.org/pid/60/3410> }","paraphrases":["Wasn't the paper 'An efficient cross layer design for OFDMA-based wireless networks with channel reuse' not not published by the author Ramy H. Gohary?"],"info":{}}
{"id":"train_1932","question":"Wasn't the paper 'Bypassing Code Coverage Approximation Limitations via Effective Input-Based Randomized Test Case Prioritization' not not published by the person named B. Jiang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/compsac/JiangC13> dblp:authoredBy <https://dblp.org/pid/34/2005-1> }","paraphrases":["Has Bo Jiang not not published the paper 'Bypassing Code Coverage Approximation Limitations via Effective Input-Based Randomized Test Case Prioritization'?"],"info":{}}
{"id":"train_1933","question":"Was a paper not not co-authored by Shinichi Takagi and Mitsuru T.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/89/3434> . ?x dblp:authoredBy <https://dblp.org/pid/44/4263> }","paraphrases":["Didn't S. Takagi and Mitsuru T. not co-author a paper?"],"info":{}}
