{"id":"train_2357","question":"In Int. J. Prod. Res. and Microelectron. Reliab., what papers did Claudio Vitari publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/60/5280> { ?answer dblp:publishedIn 'Int. J. Prod. Res.' } UNION { ?answer dblp:publishedIn 'Microelectron. Reliab.' } }","paraphrases":["What papers did Claudio Vitari publish in Int. J. Prod. Res. and Microelectron. Reliab.?"],"info":{}}
{"id":"train_2358","question":"What papers did Wenbo Jiang publish in J. Frankl. Inst. and PWC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/34/10703> { ?answer dblp:publishedIn 'J. Frankl. Inst.' } UNION { ?answer dblp:publishedIn 'PWC' } }","paraphrases":["In J. Frankl. Inst. and PWC, what papers did Wenbo Jiang publish?"],"info":{}}
{"id":"train_2361","question":"List all the papers that Raab, C. D. and Marcin Copik published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/06/327> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/187/2708> } }","paraphrases":["What are the papers that Raab, C. D. and Marcin C. published?"],"info":{}}
{"id":"train_2362","question":"List all the papers that Xin Du and Zhao, J. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/18/4833> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/47/2026> } }","paraphrases":["What are the papers that Xin Du and Zhao, J. published?"],"info":{}}
{"id":"train_2363","question":"List all the papers that Derek R. Boughner and Gregory R. Mills published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/69/1563> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/87/5089> } }","paraphrases":["What are the papers that Derek R. Boughner and Gregory R. Mills published?"],"info":{}}
{"id":"train_2364","question":"List all the papers that Chi-Hsiang Yeh and Mollah R. Alam published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/17/448> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/286/2310> } }","paraphrases":["What are the papers that Chi-Hsiang Yeh and Mollah R. Alam published?"],"info":{}}
{"id":"train_2365","question":"List all the papers that K. Chen and Adrian Dumitrescu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/47/6529-11> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/69/5787> } }","paraphrases":["What are the papers that K. Chen and Adrian Dumitrescu published?"],"info":{}}
{"id":"train_2366","question":"List all the primary affiliations of Widmayer, P. and Brian Hu Zhang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/w/PeterWidmayer> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/213/8211> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Widmayer, P. and Brian Hu Zhang?"],"info":{}}
{"id":"train_2368","question":"What papers did Zammit, Paul publish in ICECS and Comput. Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/137/5530> { ?answer dblp:publishedIn 'ICECS' } UNION { ?answer dblp:publishedIn 'Comput. Networks' } }","paraphrases":["In ICECS and Comput. Networks, what papers did Paul Zammit publish?"],"info":{}}
{"id":"train_2369","question":"List all the papers that Qin, S. Joe and Rochelle, Gary T. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/17/4222> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/03/11049> } }","paraphrases":["What are the papers that Qin, S. Joe and Rochelle, Gary T. published?"],"info":{}}
{"id":"train_2370","question":"List all the papers that Kalantar, Bahareh and Naonori Ueda published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/205/2008> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/87/2491> } }","paraphrases":["What are the papers that Kalantar, Bahareh and Ueda, Naonori published?"],"info":{}}
{"id":"train_2371","question":"What papers did Foerster, J. N. publish in Advances in Neural Information Processing Systems and WOMPAT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/176/5095> { ?answer dblp:publishedIn 'NeurIPS' } UNION { ?answer dblp:publishedIn 'WOMPAT' } }","paraphrases":["In Advances in Neural Information Processing Systems and WOMPAT, what papers did Jakob N. Foerster publish?"],"info":{}}
{"id":"train_2372","question":"In Angew. Inform. and AMCIS, what papers did Eggensperger, R. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/4150> { ?answer dblp:publishedIn 'Angew. Inform.' } UNION { ?answer dblp:publishedIn 'AMCIS' } }","paraphrases":["What papers did Eggensperger, R. publish in Angew. Inform. and AMCIS?"],"info":{}}
{"id":"train_2373","question":"List all the primary affiliations of Joseph Sgro and Przemyslaw Herman.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/95/2251> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/10/743> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Joseph Sgro and Przemyslaw Herman?"],"info":{}}
{"id":"train_2374","question":"In Math. Comput. and NeuroImage, what papers did Keicher, Simon publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/124/0003> { ?answer dblp:publishedIn 'Math. Comput.' } UNION { ?answer dblp:publishedIn 'NeuroImage' } }","paraphrases":["What papers did Keicher, Simon publish in Math. Comput. and NeuroImage?"],"info":{}}
{"id":"train_2375","question":"List all the papers that Gisle Ytrest\\u00F8l and Zhou, B. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/26/8158> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/04/3362> } }","paraphrases":["What are the papers that Gisle Ytrest\\u00F8l and Bai-Tao Zhou published?"],"info":{}}
{"id":"train_2376","question":"What papers did Satish Kumar publish in Cogn. Comput. and HICSS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/32/2367> { ?answer dblp:publishedIn 'Cogn. Comput.' } UNION { ?answer dblp:publishedIn 'HICSS' } }","paraphrases":["In Cogn. Comput. and HICSS, what papers did Kumar, Satish publish?"],"info":{}}
{"id":"train_2377","question":"List all the papers that Martin Kouteck\\u00FD and Kolman, Petr published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/159/1762> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/58/4155> } }","paraphrases":["What are the papers that Martin Kouteck\\u00FD and Kolman, Petr published?"],"info":{}}
{"id":"train_2379","question":"What are the papers that V\\u00E1zquez, Guillermo and Mart\\u00EDnez, Eduardo Ju\\u00E1rez published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/131/3343> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/41/1797> } }","paraphrases":["List all the papers that V\\u00E1zquez, Guillermo and Mart\\u00EDnez, Eduardo Ju\\u00E1rez published."],"info":{}}
{"id":"train_2381","question":"What papers did Riku Kreula publish in ICC and CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/5657> { ?answer dblp:publishedIn 'ICC (1)' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["In ICC (1) and CoRR, what papers did Riku K. publish?"],"info":{}}
{"id":"train_2382","question":"List all the papers that Byung S. Son and Yong Serk Kim published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/06/6373> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/82/3769> } }","paraphrases":["What are the papers that Byung S. Son and Kim, Y. Serk published?"],"info":{}}
{"id":"train_2383","question":"In I2MTC and ERCIM News, what papers did Franco Ferraris publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/62/9518> { ?answer dblp:publishedIn 'I2MTC' } UNION { ?answer dblp:publishedIn 'ERCIM News' } }","paraphrases":["What papers did Ferraris, Franco publish in I2MTC and ERCIM News?"],"info":{}}
{"id":"train_2384","question":"List all the papers that Judith A. Blake and Jamie A. Lee published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/35/5736> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/45/5302> } }","paraphrases":["What are the papers that Judith A. Blake and Jamie A. Lee published?"],"info":{}}
{"id":"train_2385","question":"What are the papers that John C. Price and Stefanos D. Kollias published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/116/5754> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/k/StefanosDKollias> } }","paraphrases":["List all the papers that John C. Price and Stefanos D. Kollias published."],"info":{}}
{"id":"train_2387","question":"In J. Comput. Secur. and Web Intelligence, what papers did Riccardo Focardi publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/f/RiccardoFocardi> { ?answer dblp:publishedIn 'J. Comput. Secur.' } UNION { ?answer dblp:publishedIn 'Web Intelligence' } }","paraphrases":["What papers did Riccardo Focardi publish in J. Comput. Secur. and Web Intelligence?"],"info":{}}
{"id":"train_2388","question":"What papers did Heinz D. publish in Struct. Program. and SERE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/52/587> { ?answer dblp:publishedIn 'Struct. Program.' } UNION { ?answer dblp:publishedIn 'SERE (Companion)' } }","paraphrases":["In Struct. Program. and SERE, what papers did Heinz D. publish?"],"info":{}}
{"id":"train_2390","question":"What papers did Zhengyu Yang publish in Scalable Comput. Pract. Exp. and J. Oper. Res. Soc.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/159/1188> { ?answer dblp:publishedIn 'Scalable Comput. Pract. Exp.' } UNION { ?answer dblp:publishedIn 'J. Oper. Res. Soc.' } }","paraphrases":["In Scalable Comput. Pract. Exp. and J. Oper. Res. Soc., what papers did Zhengyu Y. publish?"],"info":{}}
{"id":"train_2391","question":"What papers did J. F. Peters publish in RSKT and IEEE Trans. Consumer Electron.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/12/6268> { ?answer dblp:publishedIn 'RSKT' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Consumer Electron.' } }","paraphrases":["In RSKT and IEEE Trans. Consumer Electron., what papers did James F. Peters publish?"],"info":{}}
{"id":"train_2392","question":"What papers did Lynda Mokdad publish in J. Parallel Distributed Comput. and Intelligent Information Processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/5508> { ?answer dblp:publishedIn 'J. Parallel Distributed Comput.' } UNION { ?answer dblp:publishedIn 'Intelligent Information Processing' } }","paraphrases":["In J. Parallel Distributed Comput. and Intelligent Information Processing, what papers did Lynda Mokdad publish?"],"info":{}}
{"id":"train_2393","question":"List all the papers that K. Wong and Kiyoshi Tanaka published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/19/6841> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/57/5748> } }","paraphrases":["What are the papers that KokSheik Wong and Kiyoshi Tanaka published?"],"info":{}}
{"id":"train_2395","question":"What are the papers that Susan Prejawa and Mohamed L. Seghier published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/174/5237> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/28/7494> } }","paraphrases":["List all the papers that Susan Prejawa and Mohamed L. Seghier published."],"info":{}}
{"id":"train_2396","question":"List all the primary affiliations of Lunke Fei and Bob Zhang.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/157/4083> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/24/7465> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Fei, L. and Bob Zhang?"],"info":{}}
{"id":"train_2397","question":"In Arch. Math. Log. and IEEE Trans. Inf. Theory, what papers did Gareth O. Jones publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/18/9207> { ?answer dblp:publishedIn 'Arch. Math. Log.' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Inf. Theory' } }","paraphrases":["What papers did Gareth O. Jones publish in Arch. Math. Log. and IEEE Trans. Inf. Theory?"],"info":{}}
{"id":"train_2398","question":"In Sci. Program. and ICASSP (1), what papers did Xiang-Wen Xie publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/286/9559> { ?answer dblp:publishedIn 'Sci. Program.' } UNION { ?answer dblp:publishedIn 'ICASSP (1)' } }","paraphrases":["What papers did Xiang-Wen Xie publish in Sci. Program. and ICASSP (1)?"],"info":{}}
{"id":"train_2400","question":"What papers did Ryan Kastner publish in IEEE Symposium on Field Programmable Custom Computing Machines and Eur. J. Oper. Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/15/3231> { ?answer dblp:publishedIn 'FCCM' } UNION { ?answer dblp:publishedIn 'Eur. J. Oper. Res.' } }","paraphrases":["In IEEE Symposium on Field Programmable Custom Computing Machines and Eur. J. Oper. Res., what papers did R. Kastner publish?"],"info":{}}
{"id":"train_2401","question":"What papers did Saranyan A. Vigraham publish in Int. J. Artif. Intell. Tools and GEOINFO?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/72/1906> { ?answer dblp:publishedIn 'Int. J. Artif. Intell. Tools' } UNION { ?answer dblp:publishedIn 'GEOINFO' } }","paraphrases":["In Int. J. Artif. Intell. Tools and GEOINFO, what papers did Vigraham, Saranyan A. publish?"],"info":{}}
{"id":"train_2402","question":"In ICASSP and FDL, what papers did Velipasalar, S. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/85/6636> { ?answer dblp:publishedIn 'ICASSP' } UNION { ?answer dblp:publishedIn 'FDL' } }","paraphrases":["What papers did Senem Velipasalar publish in ICASSP and FDL?"],"info":{}}
{"id":"train_2404","question":"What are the papers that Maheshwar Prasad Sah and H. Kim published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/27/10829> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/93/4751> } }","paraphrases":["List all the papers that Sah, Maheshwar Prasad and Hyongsuk Kim published."],"info":{}}
{"id":"train_2405","question":"In CSCW Companion and CoRR, what papers did Yarosh, Svetlana publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/82/5446> { ?answer dblp:publishedIn 'CSCW Companion' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["What papers did Yarosh, Svetlana publish in CSCW Companion and CoRR?"],"info":{}}
{"id":"train_2406","question":"List all the papers that Habib, Johanna and C. Rochet published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/125/0927> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/62/3082> } }","paraphrases":["What are the papers that Johanna Habib and Claude Rochet published?"],"info":{}}
{"id":"train_2407","question":"List all the primary affiliations of D. Yang and Wanjiun Liao.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/85/318> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/10/3222> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of D. Yang and Wanjiun L.?"],"info":{}}
{"id":"train_2408","question":"List all the papers that Khalid Saleem and V. Hristidis published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/13/317> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/42/5855> } }","paraphrases":["What are the papers that Khalid Saleem and V. Hristidis published?"],"info":{}}
{"id":"train_2409","question":"List all the papers that Yutao Xie and Xiantao C. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/317/0357> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/41/6589> } }","paraphrases":["What are the papers that Yutao X. and Xiantao Cai published?"],"info":{}}
{"id":"train_2411","question":"List all the primary affiliations of G. Hu and C. Sun.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/23/4567-1> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/54/3957-3> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of G. Hu and C. Sun?"],"info":{}}
{"id":"train_2412","question":"What are the primary affiliations of Rafael Bello and Lorenzo, M. Matilde Garc\\u00EDa?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/38/5311> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/88/4726> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Rafael Bello and Lorenzo, M. Matilde Garc\\u00EDa."],"info":{}}
{"id":"train_2414","question":"List all the papers that Gary Lee Downey and Kyonghee H. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/115/5322> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/153/4251> } }","paraphrases":["What are the papers that Downey, Gary Lee and Kyonghee Han published?"],"info":{}}
{"id":"train_2415","question":"What papers did Cilleruelo, J. publish in Electron. Notes Discret. Math. and VCBM/MedViz?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/08/1936> { ?answer dblp:publishedIn 'Electron. Notes Discret. Math.' } UNION { ?answer dblp:publishedIn 'VCBM/MedViz' } }","paraphrases":["In Electron. Notes Discret. Math. and VCBM/MedViz, what papers did Cilleruelo, J. publish?"],"info":{}}
{"id":"train_2416","question":"In ISPRS Int. J. Geo Inf. and IEEE Trans. Wirel. Commun., what papers did Jie Zhao publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/23/3168> { ?answer dblp:publishedIn 'ISPRS Int. J. Geo Inf.' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Wirel. Commun.' } }","paraphrases":["What papers did Jie Zhao publish in ISPRS Int. J. Geo Inf. and IEEE Trans. Wirel. Commun.?"],"info":{}}
{"id":"train_2417","question":"What papers did Luis Fernando D'Haro publish in IWSDS and ICDAR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/57/1419> { ?answer dblp:publishedIn 'IWSDS' } UNION { ?answer dblp:publishedIn 'ICDAR' } }","paraphrases":["In IWSDS and IEEE International Conference on Document Analysis and Recognition, what papers did D'Haro, Luis Fernando publish?"],"info":{}}
{"id":"train_2418","question":"What papers did D. A. Ralescu publish in IEEE Trans. Syst. Man Cybern. and Stud. Inform. Univ.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/67/3952> { ?answer dblp:publishedIn 'IEEE Trans. Syst. Man Cybern.' } UNION { ?answer dblp:publishedIn 'Stud. Inform. Univ.' } }","paraphrases":["In IEEE Trans. Syst. Man Cybern. and Stud. Inform. Univ., what papers did Dan A. Ralescu publish?"],"info":{}}
{"id":"train_2419","question":"What are the primary affiliations of Leonid Andreev and Thomas Eiter?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/82/1613> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/e/TEiter> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Leonid Andreev and T. Eiter."],"info":{}}
{"id":"train_2420","question":"In ISSCC and SBESC, what papers did Taejung Lee publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/196/1559> { ?answer dblp:publishedIn 'ISSCC' } UNION { ?answer dblp:publishedIn 'SBESC' } }","paraphrases":["What papers did Taejung Lee publish in ISSCC and SBESC?"],"info":{}}
{"id":"train_2421","question":"In CoRR and EUSIPCO, what papers did Hsu, A. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/161/9400> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'EUSIPCO' } }","paraphrases":["What papers did Hsu, A. publish in CoRR and EUSIPCO?"],"info":{}}
{"id":"train_2422","question":"What papers did Debarun B. publish in Decis. Anal. and Australas. J. Inf. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/98/5604> { ?answer dblp:publishedIn 'Decis. Anal.' } UNION { ?answer dblp:publishedIn 'Australas. J. Inf. Syst.' } }","paraphrases":["In Decis. Anal. and Australas. J. Inf. Syst., what papers did Debarun Bhattacharjya publish?"],"info":{}}
{"id":"train_2423","question":"What papers did Chi, Hua-Wei publish in Robotica and INFORMS J. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/78/4049> { ?answer dblp:publishedIn 'Robotica' } UNION { ?answer dblp:publishedIn 'INFORMS J. Comput.' } }","paraphrases":["In Robotica and INFORMS J. Comput., what papers did Chi, Hua-Wei publish?"],"info":{}}
{"id":"train_2424","question":"List all the primary affiliations of Alois C. Knoll and Giuliani, M..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/k/AloisKnoll> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/91/7000> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Alois C. Knoll and Manuel Giuliani?"],"info":{}}
{"id":"train_2425","question":"In NCA and CoRR, what papers did Xiaokang Xiong publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/20/7868> { ?answer dblp:publishedIn 'NCA' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["What papers did Xiong, X. publish in NCA and CoRR?"],"info":{}}
{"id":"train_2426","question":"List all the papers that Yazhao Lv and R. Zhang published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/97/8554> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/70/6448> } }","paraphrases":["What are the papers that Lv, Yazhao and R. Zhang published?"],"info":{}}
{"id":"train_2427","question":"List all the papers that Shi, J. and Kamran P. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/76/3568> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/45/7817> } }","paraphrases":["What are the papers that Jianjun Shi and Kamran Paynabar published?"],"info":{}}
{"id":"train_2428","question":"What papers did Patrice Godefroid publish in IEEE Symposium on Logic in Computer Science and EACL?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/20/1639> { ?answer dblp:publishedIn 'LICS' } UNION { ?answer dblp:publishedIn 'EACL' } }","paraphrases":["In LICS and EACL, what papers did Patrice G. publish?"],"info":{}}
{"id":"train_2430","question":"List all the papers that R. Yamanaka and Masami Iwatsuki published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/121/1444> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/07/5963> } }","paraphrases":["What are the papers that R. Yamanaka and M. Iwatsuki published?"],"info":{}}
{"id":"train_2431","question":"List all the papers that A. S. N. Chakravarthy and A. S. S. D. Toyaza published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/96/10044> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/67/10359> } }","paraphrases":["What are the papers that A. S. N. Chakravarthy and A. S. S. D. Toyaza published?"],"info":{}}
{"id":"train_2432","question":"What papers did Kormann, K. publish in CoRR and IEEE Trans. Intell. Transp. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/85/8754> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Intell. Transp. Syst.' } }","paraphrases":["In CoRR and IEEE Trans. Intell. Transp. Syst., what papers did Kormann, K. publish?"],"info":{}}
{"id":"train_2433","question":"List all the primary affiliations of Xiao Z. Gao and Ramesh Chandra Poonia.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/72/371> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/205/5647> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Xiao Z. Gao and Ramesh Chandra Poonia?"],"info":{}}
{"id":"train_2435","question":"What are the primary affiliations of Binxing Fang and Hongli Zhang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/87/254> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/z/HongliZhang> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Fang, Binxing and Zhang, H.."],"info":{}}
{"id":"train_2436","question":"What papers did R. Wcislo publish in Comput. Sci. and Wirtschaftsinformatik Manag.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/06/2498> { ?answer dblp:publishedIn 'Comput. Sci.' } UNION { ?answer dblp:publishedIn 'Wirtschaftsinformatik Manag.' } }","paraphrases":["In Comput. Sci. and Wirtschaftsinformatik Manag., what papers did R. Wcislo publish?"],"info":{}}
{"id":"train_2438","question":"What are the papers that Fengqiao L. and Lianjun Song published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/250/0277> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/250/0282> } }","paraphrases":["List all the papers that Fengqiao Li and Song, L. published."],"info":{}}
{"id":"train_2439","question":"List all the papers that Fogli, D. and Piero Mussio published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/43/1888> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/85/7020> } }","paraphrases":["What are the papers that Daniela Fogli and Piero Mussio published?"],"info":{}}
{"id":"train_2440","question":"What papers did Z. Li publish in J. Comput. Aided Mol. Des. and Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/6527-9> { ?answer dblp:publishedIn 'J. Comput. Aided Mol. Des.' } UNION { ?answer dblp:publishedIn 'Remote. Sens.' } }","paraphrases":["In J. Comput. Aided Mol. Des. and Remote. Sens., what papers did Z. Li publish?"],"info":{}}
{"id":"train_2441","question":"What papers did Brudno, Michael publish in Bioinform. and MSAN?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/10/6530> { ?answer dblp:publishedIn 'Bioinform.' } UNION { ?answer dblp:publishedIn 'MSAN' } }","paraphrases":["In Bioinform. and MSAN, what papers did Brudno, Michael publish?"],"info":{}}
{"id":"train_2442","question":"What papers did Lin, Chih-Wei publish in ICKII and Expert Syst. Appl.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/40/5707> { ?answer dblp:publishedIn 'ICKII' } UNION { ?answer dblp:publishedIn 'Expert Syst. Appl.' } }","paraphrases":["In ICKII and Expert Syst. Appl., what papers did Chih-Wei Lin publish?"],"info":{}}
{"id":"train_2444","question":"List all the primary affiliations of Marco Bianchi and Kl\\u00F8ve, Torleiv.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/85/2046-2> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/61/6070> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of M. Bianchi and Kl\\u00F8ve, Torleiv?"],"info":{}}
