{"id":"train_6469","question":"Count the different affiliations of the authors of 'Hybrid multi-parametric model predictive control of a nonlinear process approximated with a piecewise affine model'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/eucc/PregeljG09> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Hybrid multi-parametric model predictive control of a nonlinear process approximated with a piecewise affine model' have?"],"info":{}}
{"id":"train_6473","question":"What is the count of authors of 'Development and Implementation of High Power Hexapole Magnetic Tweezer System for Micromanipulations' who have Southern Methodist University as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icra/ZhangKRSK18> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Southern Methodist University, Department of Mechanical Engineering, Dallas, TX, USA' }","paraphrases":["How many authors of 'Development and Implementation of High Power Hexapole Magnetic Tweezer System for Micromanipulations' have Southern Methodist University as their primary affiliation?"],"info":{}}
{"id":"train_6474","question":"Count the papers published by the authors of 'Better Time-Space Lower Bounds for SAT and Related Problems' in Computational Complexity Conference.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/coco/Williams05> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Computational Complexity Conference' }","paraphrases":["How many papers did the authors of 'Better Time-Space Lower Bounds for SAT and Related Problems' publish in Computational Complexity Conference?"],"info":{}}
{"id":"train_6476","question":"What is the count of authors of 'Sangrahaka: A Tool for Annotating and Querying Knowledge Graphs' who have Indian Institute of Technology (IIT) as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2107-02782> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Indian Institute of Technology (IIT), Kanpur' }","paraphrases":["How many authors of 'Sangrahaka: A Tool for Annotating and Querying Knowledge Graphs' have Indian Institute of Technology (IIT), Kanpur as their primary affiliation?"],"info":{}}
{"id":"train_6479","question":"In 1978, how many papers did the authors of 'An Approach to Cost Estimating for Planning and Design' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/jcit/SchildHL78> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1978' }","paraphrases":["How many papers did the authors of 'An Approach to Cost Estimating for Planning and Design' publish in 1978?"],"info":{}}
{"id":"train_6480","question":"Count the different affiliations of the authors of 'An enhanced method for registration of dental surfaces partially scanned by a 3D dental laser scanning'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/cmpb/ParkKLSS15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'An enhanced method for registration of dental surfaces partially scanned by a 3D dental laser scanning' have?"],"info":{}}
{"id":"train_6486","question":"Mention the count of papers published by the authors of 'Opposites and Measures of Extremism in Concepts and Constructs' in Int. J. Man Mach. Stud..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/ijmms/Yager83> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Int. J. Man Mach. Stud.' }","paraphrases":["How many publications did the authors of the paper 'Opposites and Measures of Extremism in Concepts and Constructs' publish in Int. J. Man Mach. Stud.?"],"info":{}}
{"id":"train_6488","question":"Count the different affiliations of the authors of 'Recursive linear estimation for general discrete-time descriptor systems'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/automatica/IshiharaTB10> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Recursive linear estimation for general discrete-time descriptor systems' have?"],"info":{}}
{"id":"train_6491","question":"Count the different affiliations of the authors of 'Generating Interactive Prototypes from Query Annotated Discourse Models'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/icom/KisB15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Generating Interactive Prototypes from Query Annotated Discourse Models' have?"],"info":{}}
{"id":"train_6492","question":"Count the papers published by the authors of 'Powerline-PNC: Boosting throughput of powerline networks with physical-layer network coding' in SmartGridComm.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/smartgridcomm/YangWWYLL15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'SmartGridComm' }","paraphrases":["Mention the count of papers published by the authors of 'Powerline-PNC: Boosting throughput of powerline networks with physical-layer network coding' in SmartGridComm."],"info":{}}
{"id":"train_6493","question":"Count the papers published by the authors of 'Hierarchies of Infinite Structures Generated by Pushdown Automata and Recursion Schemes' in International Symposium on Mathematical Foundations of Computer Science.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/mfcs/Ong07> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'MFCS' }","paraphrases":["Mention the count of papers published by the authors of 'Hierarchies of Infinite Structures Generated by Pushdown Automata and Recursion Schemes' in MFCS."],"info":{}}
{"id":"train_6494","question":"Count the papers published by the authors of 'On identifying user complaints of iOS apps' in International Conference on Software Engineering.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icse/Khalid04> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICSE' }","paraphrases":["How many papers did the authors of 'On identifying user complaints of iOS apps' publish in ICSE?"],"info":{}}
{"id":"train_6498","question":"What is the count of authors of 'Internet use and expatriate adjustment: understanding the degree of isolation experienced in kingdom of Saudi Arabia' who have University of Pretoria, South Africa as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/saicsit/HattinghML12> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Pretoria, South Africa' }","paraphrases":["How many authors of 'Internet use and expatriate adjustment: understanding the degree of isolation experienced in kingdom of Saudi Arabia' have University of Pretoria as their primary affiliation?"],"info":{}}
{"id":"train_6501","question":"Count the different affiliations of the authors of 'Design and Evaluation of a Low Density Generator Matrix (LDGM) Large Block FEC Codec'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/ngc/RocaKL03> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Design and Evaluation of a Low Density Generator Matrix (LDGM) Large Block FEC Codec' have?"],"info":{}}
{"id":"train_6502","question":"Count the papers published by the authors of 'Bistatic SAR along track interferometry with multiple fixed receivers' in IGARSS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/igarss/DuqueLMM10a> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IGARSS' }","paraphrases":["How many publications did the authors of the paper 'Bistatic SAR along track interferometry with multiple fixed receivers' publish in IEEE International Geoscience and Remote Sensing Symposium?"],"info":{}}
{"id":"train_6503","question":"Mention the count of papers published by the authors of 'Arquitetura para Cocuradoria de Dados de Conhecimento Popular Integrados por meio de Linked Open Data' in SBBD.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/sbbd/YaguiV18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'SBBD' }","paraphrases":["How many papers did the authors of 'Arquitetura para Cocuradoria de Dados de Conhecimento Popular Integrados por meio de Linked Open Data' publish in SBBD?"],"info":{}}
{"id":"train_6504","question":"Mention the count of papers published by the authors of 'Optimal HDA Schemes for Transmission of a Gaussian Source Over a Gaussian Channel With Bandwidth Compression in the Presence of an Interference' in IEEE Trans. Signal Process..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tsp/VarastehB12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IEEE Trans. Signal Process.' }","paraphrases":["Count the papers published by the authors of 'Optimal HDA Schemes for Transmission of a Gaussian Source Over a Gaussian Channel With Bandwidth Compression in the Presence of an Interference' in IEEE Trans. Signal Process.."],"info":{}}
{"id":"train_6506","question":"In 1987, how many papers did the authors of 'Simplified Stable Merging Tasks' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jal/SaloweS87> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1987' }","paraphrases":["How many papers did the authors of 'Simplified Stable Merging Tasks' publish in 1987?"],"info":{}}
{"id":"train_6507","question":"Count the different affiliations of the authors of 'Understanding the Impact of Customer Reviews on Hotel Rating: An Empirical Research'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/corr/abs-2002-05342> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Understanding the Impact of Customer Reviews on Hotel Rating: An Empirical Research' have?"],"info":{}}
{"id":"train_6510","question":"Count the papers published by the authors of 'Analysis, modeling and estimation through a similarity based approach: an economic signal case study' in 1993.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icnn/ThomeT93> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1993' }","paraphrases":["In 1993, how many papers did the authors of 'Analysis, modeling and estimation through a similarity based approach: an economic signal case study' publish?"],"info":{}}
{"id":"train_6512","question":"Count the papers published by the authors of 'The Twofold Value of IT-Based Peer Assessment in Management Information Systems Education' in 2017.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/wi/RietscheLHS17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2017' }","paraphrases":["How many papers did the authors of 'The Twofold Value of IT-Based Peer Assessment in Management Information Systems Education' publish in 2017?"],"info":{}}
{"id":"train_6513","question":"Count the different affiliations of the authors of 'Method for characterize landslide caused by heavy rainfall by using smoothing method'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icacci/KokaneA15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Method for characterize landslide caused by heavy rainfall by using smoothing method' have?"],"info":{}}
{"id":"train_6514","question":"Count the papers published by the authors of 'QoS-aware routing protocol for Cognitive Radio Ad Hoc Networks' in Ad Hoc Networks.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/adhoc/RajNK21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Ad Hoc Networks' }","paraphrases":["Mention the count of papers published by the authors of 'QoS-aware routing protocol for Cognitive Radio Ad Hoc Networks' in Ad Hoc Networks."],"info":{}}
{"id":"train_6516","question":"In 1998, how many papers did the authors of 'Factory Automation Adapted for the Decommissioning of Nuclear Reprocessing Facilities' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icra/BicknellH98> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1998' }","paraphrases":["How many papers did the authors of 'Factory Automation Adapted for the Decommissioning of Nuclear Reprocessing Facilities' publish in 1998?"],"info":{}}
{"id":"train_6517","question":"In 2012, how many papers did the authors of 'A Computational Framework for Next-generation Bridge Imaging and Inspection' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/grapp/LattanziM12> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2012' }","paraphrases":["How many papers did the authors of 'A Computational Framework for Next-generation Bridge Imaging and Inspection' publish in 2012?"],"info":{}}
{"id":"train_6518","question":"Count the different affiliations of the authors of 'Editorial'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/comcom/BraunGS04> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Editorial' have?"],"info":{}}
{"id":"train_6519","question":"In 2013, how many papers did the authors of 'Illuminant Invariant Descriptors for Color Texture Classification' publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cciw/CusanoNS13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2013' }","paraphrases":["How many papers did the authors of 'Illuminant Invariant Descriptors for Color Texture Classification' publish in 2013?"],"info":{}}
{"id":"train_6520","question":"Count the different affiliations of the authors of 'Learning Simple Algorithms from Examples'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icml/ZarembaMJF16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Learning Simple Algorithms from Examples' have?"],"info":{}}
{"id":"train_6521","question":"Count the different affiliations of the authors of 'Comparison of reliability and the availability between four systems with warm standby components and standby switching failures'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/amc/WangDK06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'Comparison of reliability and the availability between four systems with warm standby components and standby switching failures' have?"],"info":{}}
{"id":"train_6522","question":"How many authors of 'Qualifications of Instruction Sequence Failures, Faults and Defects: Dormant, Effective, Detected, Temporary, and Permanent' have University of Amsterdam, Netherlands as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/cuza/Bergstra21> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Amsterdam, Netherlands' }","paraphrases":["What is the count of authors of 'Qualifications of Instruction Sequence Failures, Faults and Defects: Dormant, Effective, Detected, Temporary, and Permanent' who have University of Amsterdam as their primary affiliation?"],"info":{}}
{"id":"train_6524","question":"Mention the count of papers published by the authors of 'Synergistic use of AMSR-E and MODIS Data for Understanding Grassland Land Surface Phenologies' in IEEE International Geoscience and Remote Sensing Symposium.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/igarss/DoubkovaH06> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'IGARSS' }","paraphrases":["How many papers did the authors of 'Synergistic use of AMSR-E and MODIS Data for Understanding Grassland Land Surface Phenologies' publish in IGARSS?"],"info":{}}
{"id":"train_6527","question":"How many papers did the authors of 'Using Task-Based Parallelism Directly on the GPU for Automated Asynchronous Data Transfer' publish in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/parco/ChalkGS15> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2016' }","paraphrases":["In 2016, how many papers did the authors of 'Using Task-Based Parallelism Directly on the GPU for Automated Asynchronous Data Transfer' publish?"],"info":{}}
{"id":"train_6528","question":"Mention the count of papers published by the authors of 'Information Sharing in Spectrum Auction for Dynamic Spectrum Access' in IEEE Global Telecommunications Conference .","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/globecom/YuGLGWXCV09> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'GLOBECOM' }","paraphrases":["How many publications did the authors of the paper 'Information Sharing in Spectrum Auction for Dynamic Spectrum Access' publish in IEEE Global Telecommunications Conference ?"],"info":{}}
{"id":"train_6530","question":"Count the papers published by the authors of 'Clustering Data: Dealing with High Density Variations' in 2000.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icpr/RibertEL00> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2000' }","paraphrases":["In 2000, how many papers did the authors of 'Clustering Data: Dealing with High Density Variations' publish?"],"info":{}}
{"id":"train_6531","question":"Count the papers published by the authors of 'A fully vector quantised self-excited vocoder' in ICASSP.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icassp/SalamiHA89> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICASSP' }","paraphrases":["How many papers did the authors of 'A fully vector quantised self-excited vocoder' publish in ICASSP?"],"info":{}}
{"id":"train_6533","question":"Mention the count of papers published by the authors of 'A Formal Software Development Approach Using Refinement Calculus' in J. Comput. Sci. Technol..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/jcst/YunfengJMZZ01> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'J. Comput. Sci. Technol.' }","paraphrases":["How many papers did the authors of 'A Formal Software Development Approach Using Refinement Calculus' publish in J. Comput. Sci. Technol.?"],"info":{}}
{"id":"train_6534","question":"Count the different affiliations of the authors of 'The blended e-learning imperative: Strategy and technology that enables collaboration and interaction in distributed elearning'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/webnet/Austin01> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'The blended e-learning imperative: Strategy and technology that enables collaboration and interaction in distributed elearning' have?"],"info":{}}
{"id":"train_6535","question":"Count the papers published by the authors of 'An efficient technique of scheduling mobile sinks in hybrid WSN' in 2014.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iecon/DuZS14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2014' }","paraphrases":["In 2014, how many papers did the authors of 'An efficient technique of scheduling mobile sinks in hybrid WSN' publish?"],"info":{}}
{"id":"train_6537","question":"How many authors of 'Cyclic hydraulic actuation for soft robotic devices' have MIT Computer Science and Artificial Intelligence Laboratory, Cambridge, USA as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iros/KatzschmannMDR16> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'MIT Computer Science and Artificial Intelligence Laboratory, Cambridge, USA' }","paraphrases":["What is the count of authors of 'Cyclic hydraulic actuation for soft robotic devices' who have MIT Computer Science and Artificial Intelligence Laboratory as their primary affiliation?"],"info":{}}
{"id":"train_6538","question":"What is the count of authors of 'SAGE: Percipient Storage for Exascale Data Centric Computing' who have J\\u00FClich Supercomputing Centre, Germany as their primary affiliation?","sparql":"SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/pc/Narasimhamurthy19> <https://dblp.org/rdf/schema#authoredBy> ?answer . ?answer <https://dblp.org/rdf/schema#primaryAffiliation> 'J\\u00FClich Supercomputing Centre, Germany' }","paraphrases":["How many authors of 'SAGE: Percipient Storage for Exascale Data Centric Computing' have J\\u00FClich Supercomputing Centre as their primary affiliation?"],"info":{}}
{"id":"train_6539","question":"Count the papers published by the authors of 'Synthesizing Quantum Circuits via Numerical Optimization' in 2019.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/iccS/BrugiereBVA19> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2019' }","paraphrases":["How many papers did the authors of 'Synthesizing Quantum Circuits via Numerical Optimization' publish in 2019?"],"info":{}}
{"id":"train_6541","question":"Mention the count of papers published by the authors of 'New Bounds for MAX-SAT by Clause Learning' in International Computer Science Symposium in Russia.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/csr/KulikovK07> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CSR' }","paraphrases":["Count the papers published by the authors of 'New Bounds for MAX-SAT by Clause Learning' in International Computer Science Symposium in Russia."],"info":{}}
{"id":"train_6542","question":"Count the papers published by the authors of 'Social Learning and Cultural Evolution in Artificial Life' in Artif. Life.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/alife/MarriottBAS18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Artif. Life' }","paraphrases":["Mention the count of papers published by the authors of 'Social Learning and Cultural Evolution in Artificial Life' in Artif. Life."],"info":{}}
{"id":"train_6543","question":"What is the count of authors of 'Classification of Medical Images in the Domain of Melanoid Skin Lesions' who have University of Kansas as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/cores/HippeGBKMPW05> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Kansas, Lawrence, USA' }","paraphrases":["How many authors of 'Classification of Medical Images in the Domain of Melanoid Skin Lesions' have University of Kansas as their primary affiliation?"],"info":{}}
{"id":"train_6545","question":"Count the papers published by the authors of 'Sketched Subspace Clustering' in 2018.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/tsp/TraganitisG18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2018' }","paraphrases":["How many papers did the authors of 'Sketched Subspace Clustering' publish in 2018?"],"info":{}}
{"id":"train_6546","question":"Mention the count of papers published by the authors of 'Matterport3D: Learning from RGB-D Data in Indoor Environments' in 3DV.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/3dim/ChangDFHNSSZZ17> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn '3DV' }","paraphrases":["How many papers did the authors of 'Matterport3D: Learning from RGB-D Data in Indoor Environments' publish in 3DV?"],"info":{}}
{"id":"train_6547","question":"Count the different affiliations of the authors of 'A normal form for spider diagrams of order'.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/vlc/DelaneySTT14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }","paraphrases":["How many different affiliations do the authors of 'A normal form for spider diagrams of order' have?"],"info":{}}
{"id":"train_6548","question":"How many papers did the authors of 'Interworking of Distributed Object Systems using a Soap Bridge' publish in 2002?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/imsa/ParkKL02> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2002' }","paraphrases":["In 2002, how many papers did the authors of 'Interworking of Distributed Object Systems using a Soap Bridge' publish?"],"info":{}}
{"id":"train_6549","question":"Mention the count of papers published by the authors of 'Query Modification in Object-Oriented Database Federations' in International Conference on Cooperative Information Systems.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/coopis/VermeerA97> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'CoopIS' }","paraphrases":["How many papers did the authors of 'Query Modification in Object-Oriented Database Federations' publish in International Conference on Cooperative Information Systems?"],"info":{}}
{"id":"train_6550","question":"Mention the count of papers published by the authors of 'Cost/speed analysis of mobile wireless DTNs under random waypoint mobility' in WiOpt.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/wiopt/CavallariVT16> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'WiOpt' }","paraphrases":["How many papers did the authors of 'Cost/speed analysis of mobile wireless DTNs under random waypoint mobility' publish in International Symposium on Modelling and Optimization in Mobile, Ad Hoc, and Wireless Networks?"],"info":{}}
{"id":"train_6551","question":"Mention the count of papers published by the authors of 'Scene context dependent reference frame placement for MPEG video coding' in ICASSP.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/icassp/LanH97> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'ICASSP' }","paraphrases":["Count the papers published by the authors of 'Scene context dependent reference frame placement for MPEG video coding' in ICASSP."],"info":{}}
{"id":"train_6552","question":"Count the papers published by the authors of 'Spectroscopic Detection of Cervical Pre-Cancer through Radial Basis Function Networks' in 1997.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/conf/nips/TumerRG96> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '1997' }","paraphrases":["How many papers did the authors of 'Spectroscopic Detection of Cervical Pre-Cancer through Radial Basis Function Networks' publish in 1997?"],"info":{}}
{"id":"train_6553","question":"Count the papers published by the authors of 'A 1-nS 1-V Sub-1-\\u00B5W Linear CMOS OTA with Rail-to-Rail Input for Hz-Band Sensory Interfaces' in Sensors.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ( COUNT ( ?answer ) AS ?count ) WHERE { <https://dblp.org/rec/journals/sensors/JakuszJBKS20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:publishedIn 'Sensors' }","paraphrases":["How many publications did the authors of the paper 'A 1-nS 1-V Sub-1-\\u00B5W Linear CMOS OTA with Rail-to-Rail Input for Hz-Band Sensory Interfaces' publish in Sensors?"],"info":{}}
