{"id":"train_3334","question":"Mention the year in which Chao Zeng published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/35/2167> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Chao Zeng publish the most research papers?"],"info":{}}
{"id":"train_3335","question":"In which year did the author June A. publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/78/9938> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did June Ahn publish the most papers?"],"info":{}}
{"id":"train_3336","question":"In which year did the author Hung-Ching Lu publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/42/3871> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Hung-Ching Lu in which year?"],"info":{}}
{"id":"train_3337","question":"When was the first paper by Yu, F. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/25/4011> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Fan Yu published?"],"info":{}}
{"id":"train_3338","question":"Report the year in which Ralescu, D. A. published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/3952> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Ralescu, D. A. in which year?"],"info":{}}
{"id":"train_3339","question":"Who is the most frequent co-author of Xu, Lei and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/360-15> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/19/360-15> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Lei Xu and how many papers do they have together?"],"info":{}}
{"id":"train_3340","question":"In which year did the author Ling-Yun Wu publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/75/6006> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Ling-Yun W. in which year?"],"info":{}}
{"id":"train_3342","question":"Report the year in which Wang, Zhiqi published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/19/4423> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Zhiqi Wang published?"],"info":{}}
{"id":"train_3344","question":"Report the year in which Amy Deipolyi published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/226/8045> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by A. Deipolyi published?"],"info":{}}
{"id":"train_3345","question":"Who is the most frequent co-author of Chow, Edmond and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/96/2502> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/96/2502> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Chow, Edmond has the most papers and how many?"],"info":{}}
{"id":"train_3346","question":"Mention the year in which Tianxiang Wang published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/164/8739> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Wang, T. publish the most research papers?"],"info":{}}
{"id":"train_3347","question":"In which year was the last paper by Gasparetti, F. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/51/5347> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Fabio Gasparetti published?"],"info":{}}
{"id":"train_3349","question":"When was the first paper by G. Xie published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/54/1672> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by G. Xie published?"],"info":{}}
{"id":"train_3350","question":"Find the year in which Fabio M. Marchese published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/87/433> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Marchese, F. M. published?"],"info":{}}
{"id":"train_3351","question":"In which year did Chao G. publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/77/793> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Chao Gu published the least papers."],"info":{}}
{"id":"train_3352","question":"Report the year in which Senthilarasi, M. published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/240/2783> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by M. Senthilarasi published?"],"info":{}}
{"id":"train_3353","question":"Report the year in which M. Lauras published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/46/8051> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by M. Lauras published?"],"info":{}}
{"id":"train_3354","question":"In which year did the author Ting-Zhu H. publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/02/5276> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which Ting-Zhu H. published the most papers."],"info":{}}
{"id":"train_3355","question":"Report the year in which Y. Li published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/08/8174> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Y. Li published?"],"info":{}}
{"id":"train_3356","question":"Report the year in which D. Essam published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/e/DEssam> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by D. Essam in which year?"],"info":{}}
{"id":"train_3357","question":"In which year did the author C. Endisch publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/91/1177> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Christian Endisch published the least papers."],"info":{}}
{"id":"train_3359","question":"Report the year in which Hu, S. published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/230/0635> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Hu, S. published?"],"info":{}}
{"id":"train_3360","question":"Who is the most frequent co-author of Muhammad Torabi Dashti and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/1815> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/95/1815> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Muhammad Torabi Dashti and how many papers do they have together?"],"info":{}}
{"id":"train_3361","question":"In which year was the last paper by Zesheng Chen published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/61/2918> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which Zesheng C. published their last paper."],"info":{}}
{"id":"train_3362","question":"Who is the most frequent co-author of Kyeongcheol Yang and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/52/4165> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/52/4165> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Yang, K. has the most papers and how many?"],"info":{}}
{"id":"train_3363","question":"Report the most frequent co-author of James M. Thomas and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/60/7337> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/60/7337> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of James M. Thomas and how many publications do they have together?"],"info":{}}
{"id":"train_3364","question":"In which year did the author Julia Kreutzer publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/182/2180> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Kreutzer, Julia in which year?"],"info":{}}
{"id":"train_3365","question":"In which year did Y. Gao publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/89/4402-29> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Y. Gao in which year?"],"info":{}}
{"id":"train_3366","question":"Report the most frequent co-author of Brigitte Bigi and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/96/6901> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/96/6901> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Bigi, B. and how many publications do they have together?"],"info":{}}
{"id":"train_3367","question":"In which year did Yufei Z. publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/35/841> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Yufei Z. publish the least publications?"],"info":{}}
{"id":"train_3368","question":"In which year was the last paper by Bezdek, James C. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/07/1057> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Bezdek, James C. published?"],"info":{}}
{"id":"train_3369","question":"Report the most frequent co-author of Fabio Patern\\u00F2 and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/6915> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/05/6915> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Patern\\u00F2, Fabio and how many publications do they have together?"],"info":{}}
{"id":"train_3371","question":"Report the year in which Kaj Juslin published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/67/6858> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Kaj J. published?"],"info":{}}
{"id":"train_3372","question":"Find the year in which Jayaram K. Udupa published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/67/5193> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Udupa, Jayaram K. published?"],"info":{}}
{"id":"train_3373","question":"Find the year in which Hiroshi Motoda published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/08/6525> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Motoda, Hiroshi published?"],"info":{}}
{"id":"train_3374","question":"In which year did the author K. Kanzaki publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/40/2891> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Kyoko Kanzaki publish the most papers?"],"info":{}}
{"id":"train_3375","question":"Mention the year in which Jianhua M. published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/49/1832> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Jianhua M. publish the most papers?"],"info":{}}
{"id":"train_3376","question":"With which author does Hrafn Loftsson has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/98/5952> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/98/5952> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of H. Loftsson and how many publications do they have together?"],"info":{}}
{"id":"train_3377","question":"In which year did the author Mina G. publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/185/2512> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Mina Ghomi publish the most papers?"],"info":{}}
{"id":"train_3378","question":"Who is the most frequent co-author of P. Kumar Ghosh and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/73/6634> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/73/6634> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does P. Kumar Ghosh has the most papers and how many?"],"info":{}}
{"id":"train_3379","question":"Who is the most frequent co-author of Popovic, V. and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/25/5046> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/25/5046> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Popovic, V. has the most papers and how many?"],"info":{}}
{"id":"train_3380","question":"Find the year in which Yuji Sukekawa published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/207/6444> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Yuji Sukekawa published?"],"info":{}}
{"id":"train_3381","question":"In which year did Taku Komura publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/6832> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Taku Komura published the least papers."],"info":{}}
{"id":"train_3382","question":"In which year was the first paper by Rui Yamaguchi published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/92/7043> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which R. Yamaguchi published their first paper."],"info":{}}
{"id":"train_3383","question":"Find the year in which Sjoerd Cranen published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/64/1766> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Cranen, Sjoerd published?"],"info":{}}
{"id":"train_3384","question":"Report the most frequent co-author of Thien T. T. Le and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/188/7447> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/188/7447> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Le, T. T. T. has the most papers and how many?"],"info":{}}
{"id":"train_3385","question":"In which year was the first paper by Pawel Swiatek published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/68/5177> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Swiatek, Pawel published their first paper."],"info":{}}
{"id":"train_3386","question":"Who is the most frequent co-author of Lee, Seong-Whan and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/l/SeongWhanLee> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/l/SeongWhanLee> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Seong-Whan Lee has the most papers and how many?"],"info":{}}
{"id":"train_3387","question":"When was the first paper by Young-Hwan You published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/91/7006> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Y. You published their first paper."],"info":{}}
{"id":"train_3388","question":"When was the first paper by Kao, S. H. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/77/4630> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by S. H. Kao published?"],"info":{}}
{"id":"train_3389","question":"In which year was the first paper by Simon S. Lam published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/l/SimonSLam> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by S. S. Lam published?"],"info":{}}
{"id":"train_3390","question":"When was the first paper by Yair Vaknin published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/318/4450> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Yair Vaknin published?"],"info":{}}
{"id":"train_3391","question":"In which year did Gupta, Piyush publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/57/6295> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Gupta, Piyush publish the most research papers?"],"info":{}}
{"id":"train_3393","question":"When was the last paper by Wilson Eberle published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/17/3626> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which W. Eberle published their last paper."],"info":{}}
{"id":"train_3394","question":"Report the year in which Aditya Mahajan published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/84/6024> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Mahajan, A. publish the least papers and how many?"],"info":{}}
{"id":"train_3395","question":"Find the year in which Chen, M. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/77/10585> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Moyuan Chen published?"],"info":{}}
{"id":"train_3396","question":"Report the most frequent co-author of Jonathan L. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/85/6906-1> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/85/6906-1> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Jonathan Li has the most papers and how many?"],"info":{}}
{"id":"train_3397","question":"Report the year in which Edwards, Seamus published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/305/4200> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Edwards, Seamus publish the least papers and how many?"],"info":{}}
{"id":"train_3398","question":"In which year did Seitel, A. publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/38/433> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Alexander Seitel publish the least publications?"],"info":{}}
{"id":"train_3399","question":"In which year did Joseph R. Cavallaro publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/41/5458> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Joseph R. Cavallaro publish the least publications?"],"info":{}}
{"id":"train_3400","question":"Report the year in which Antoine Lemarechal published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/92/5909> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Antoine L. publish the least papers and how many?"],"info":{}}
{"id":"train_3401","question":"In which year did the author Umapada Pal publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/p/UmapadaPal> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Umapada Pal in which year?"],"info":{}}
{"id":"train_3403","question":"In which year was the first paper by Yakov B. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/24/9830> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Yakov Babichenko published their first paper."],"info":{}}
{"id":"train_3404","question":"In which year did S. Leeratanavalee publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/74/5891> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Leeratanavalee, S. in which year?"],"info":{}}
