{"id":"train_1194","question":"Did Burhan Ul Islam Khan publish in IEEE Access in the last 4 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/228/4526> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'IEEE Access' }","paraphrases":["Has Burhan Ul Islam Khan published in IEEE Access in the last four years?"],"info":{}}
{"id":"train_1195","question":"Did Dorothy R. Graham publish the paper 'Requirements and Testing: Seven Missing-Link Myths'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/software/Graham02> dblp:authoredBy <https://dblp.org/pid/23/989> }","paraphrases":["Was the paper 'Requirements and Testing: Seven Missing-Link Myths' published by the person named Dorothy R. Graham?"],"info":{}}
{"id":"train_1197","question":"Was the paper 'Adaptive Sustainable Organizations: System Dynamic Models of a University Balancing the Virtuous and the Vicious' published by the author Gabrielle Peko?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hicss/PatelPS19> dblp:authoredBy <https://dblp.org/pid/51/10952> }","paraphrases":["Did Gabrielle Peko publish the paper 'Adaptive Sustainable Organizations: System Dynamic Models of a University Balancing the Virtuous and the Vicious'?"],"info":{}}
{"id":"train_1198","question":"Did Qiang-Sheng Hua publish the paper 'Minimum Latency Aggregation Scheduling for Arbitrary Tree Topologies under the SINR Model' in the last nine years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/adhoc-now/WangHW12> dblp:authoredBy <https://dblp.org/pid/82/3694> . <https://dblp.org/rec/conf/adhoc-now/WangHW12> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Did Qiang-Sheng Hua publish the paper 'Minimum Latency Aggregation Scheduling for Arbitrary Tree Topologies under the SINR Model' in the last 9 years?"],"info":{}}
{"id":"train_1199","question":"Has Peter Kanuch published in TSP in the last five years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/245/8211> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn 'TSP' }","paraphrases":["Did Kanuch, P. publish in TSP in the last five years?"],"info":{}}
{"id":"train_1200","question":"Was the paper 'Federated Scheduling Admits No Constant Speedup Factors for Constrained-Deadline DAG Task System' published by Chen, Jian-Jia in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/Chen15t> dblp:authoredBy <https://dblp.org/pid/70/1961> . <https://dblp.org/rec/journals/corr/Chen15t> dblp:publishedIn 'CoRR' }","paraphrases":["Did Chen, Jian-Jia publish the paper 'Federated Scheduling Admits No Constant Speedup Factors for Constrained-Deadline DAG Task System' in CoRR?"],"info":{}}
{"id":"train_1201","question":"Was the paper 'Adapting Software Quality Models: Practical Challenges, Approach, and First Empirical Results' co-authored by Kl\\u00E4s, Michael and Constanza Lampasona?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/KlasLM13> dblp:authoredBy <https://dblp.org/pid/26/6244> . <https://dblp.org/rec/journals/corr/KlasLM13> dblp:authoredBy <https://dblp.org/pid/67/6437> }","paraphrases":["Did Kl\\u00E4s, Michael and C. Lampasona co-author the paper 'Adapting Software Quality Models: Practical Challenges, Approach, and First Empirical Results'?"],"info":{}}
{"id":"train_1202","question":"Has Seung-Ho Park published in ICCE in the last nine years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/19/4818> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) . ?x dblp:publishedIn 'ICCE' }","paraphrases":["Did Seung-Ho Park publish in ICCE in the last nine years?"],"info":{}}
{"id":"train_1203","question":"Has Halim Sayoud published in ICCIT in the last five years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/32/2611> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn 'ICCIT' }","paraphrases":["Did Halim Sayoud publish in ICCIT in the last 5 years?"],"info":{}}
{"id":"train_1204","question":"Did Lan Umek publish the paper 'Subgroup discovery in data sets with multi-dimensional responses'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ida/UmekZ11> dblp:authoredBy <https://dblp.org/pid/67/7170> }","paraphrases":["Was the paper 'Subgroup discovery in data sets with multi-dimensional responses' published by the person L. Umek?"],"info":{}}
{"id":"train_1205","question":"Did Anna M. publish in CoRR in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/312/6769> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'CoRR' }","paraphrases":["Has Anna Minarovicov\\u00E1 published in CoRR in the last 3 years?"],"info":{}}
{"id":"train_1206","question":"Did Wei Liu publish the paper 'Personalized Reputation Model in Cooperative Distributed Systems' in International Conference on Parallel and Distributed Systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icpads/LiuTW10> dblp:authoredBy <https://dblp.org/pid/49/3283> . <https://dblp.org/rec/conf/icpads/LiuTW10> dblp:publishedIn 'ICPADS' }","paraphrases":["Was the paper 'Personalized Reputation Model in Cooperative Distributed Systems' published by Liu, W. in International Conference on Parallel and Distributed Systems?"],"info":{}}
{"id":"train_1207","question":"Did Yasuo Kuniyoshi publish the paper 'Preface' in the last seven years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ar/KuniyoshiI09> dblp:authoredBy <https://dblp.org/pid/42/4337> . <https://dblp.org/rec/journals/ar/KuniyoshiI09> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Did Yasuo Kuniyoshi publish the paper 'Preface' in the last 7 years?"],"info":{}}
{"id":"train_1208","question":"Did William C. Calhoun publish the paper 'Incomparable Prime Ideals of Recursively Enumerable Degrees' in Ann. Pure Appl. Log.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/apal/Calhoun93> dblp:authoredBy <https://dblp.org/pid/37/2212> . <https://dblp.org/rec/journals/apal/Calhoun93> dblp:publishedIn 'Ann. Pure Appl. Log.' }","paraphrases":["Was the paper 'Incomparable Prime Ideals of Recursively Enumerable Degrees' published by William C. Calhoun in Ann. Pure Appl. Log.?"],"info":{}}
{"id":"train_1209","question":"Was the paper 'A Framework for Mutant Genetic Generation for WS-BPEL' published by the person named Juan J. Dom\\u00EDnguez-Jim\\u00E9nez?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/sofsem/Dominguez-JimenezEM09> dblp:authoredBy <https://dblp.org/pid/91/545> }","paraphrases":["Did Juan J. Dom\\u00EDnguez-Jim\\u00E9nez publish the paper 'A Framework for Mutant Genetic Generation for WS-BPEL'?"],"info":{}}
{"id":"train_1211","question":"Did Rush H. Al-Abuji publish the paper 'Simulated evolution algorithm for multiobjective VLSI netlist bi-partitioning' in ISCAS (5)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iscas/SaitEA03> dblp:authoredBy <https://dblp.org/pid/10/4877> . <https://dblp.org/rec/conf/iscas/SaitEA03> dblp:publishedIn 'ISCAS (5)' }","paraphrases":["Was the paper 'Simulated evolution algorithm for multiobjective VLSI netlist bi-partitioning' published by Rush H. Al-Abuji in ISCAS?"],"info":{}}
{"id":"train_1213","question":"Did Ling Xiao publish the paper 'An Analytical Solution to the Electromagnetic Performance of an Ultra-High-Speed PM Motor'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jece/ChengDXZS19> dblp:authoredBy <https://dblp.org/pid/59/4568> }","paraphrases":["Was the paper 'An Analytical Solution to the Electromagnetic Performance of an Ultra-High-Speed PM Motor' published by the author Ling Xiao?"],"info":{}}
{"id":"train_1214","question":"Did Alberto Montilla Bravo and Marisol Garc\\u00EDa-Valls co-author the paper 'FIPA-Based QoS Negotiator for Nomadic Agents'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mata/BravoG02> dblp:authoredBy <https://dblp.org/pid/33/4344> . <https://dblp.org/rec/conf/mata/BravoG02> dblp:authoredBy <https://dblp.org/pid/91/2218> }","paraphrases":["Was the paper 'FIPA-Based QoS Negotiator for Nomadic Agents' co-authored by Alberto M. Bravo and Marisol G.?"],"info":{}}
{"id":"train_1215","question":"Did Hong Qin publish the paper 'Drawing-Based Procedural Modeling of Chinese Architectures' in the last nine years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tvcg/HouQQ12> dblp:authoredBy <https://dblp.org/pid/79/627> . <https://dblp.org/rec/journals/tvcg/HouQQ12> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Did Hong Qin publish the paper 'Drawing-Based Procedural Modeling of Chinese Architectures' in the last 9 years?"],"info":{}}
{"id":"train_1216","question":"Have Capuano, Daniele and Maria De Marsico co-authored the paper 'Experimenting dele: a deaf-centered e-learning visual environment'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/avi/BottoniLCLM12> dblp:authoredBy <https://dblp.org/pid/99/11498> . <https://dblp.org/rec/conf/avi/BottoniLCLM12> dblp:authoredBy <https://dblp.org/pid/75/7001> }","paraphrases":["Was the paper 'Experimenting dele: a deaf-centered e-learning visual environment' co-authored by Capuano, Daniele and Maria D. Marsico?"],"info":{}}
{"id":"train_1217","question":"Did Min Sun publish in ICCV in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/62/2750> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'ICCV' }","paraphrases":["Has Min Sun published in ICCV in the last 3 years?"],"info":{}}
{"id":"train_1218","question":"Was the paper 'An emerging co-array fortran compiler' published by Cristian C. in Principles and Practice of Parallel Programming?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ppopp/CoarfaD03> dblp:authoredBy <https://dblp.org/pid/52/4406> . <https://dblp.org/rec/conf/ppopp/CoarfaD03> dblp:publishedIn 'PPoPP' }","paraphrases":["Did Cristian C. publish the paper 'An emerging co-array fortran compiler' in Principles and Practice of Parallel Programming?"],"info":{}}
{"id":"train_1219","question":"Has Xiao Xue published in IEICE Trans. Commun. in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/82/2187> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'IEICE Trans. Commun.' }","paraphrases":["Did Xiao Xue publish in IEICE Trans. Commun. in the last 3 years?"],"info":{}}
{"id":"train_1220","question":"Did Thomas E. Anderson publish the paper 'Overcoming the Internet Impasse through Virtualization'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/computer/AndersonPST05> dblp:authoredBy <https://dblp.org/pid/a/ThomasEAnderson> }","paraphrases":["Was the paper 'Overcoming the Internet Impasse through Virtualization' published by the person named Thomas E. Anderson?"],"info":{}}
{"id":"train_1221","question":"Has Tomasz Kania published in Am. Math. Mon. in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/248/9255> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'Am. Math. Mon.' }","paraphrases":["Did Kania, Tomasz publish in Am. Math. Mon. in the last 8 years?"],"info":{}}
{"id":"train_1222","question":"Did Misic, Bratislav publish the paper 'Comparing spatial null models for brain maps'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/neuroimage/MarkelloM21> dblp:authoredBy <https://dblp.org/pid/22/10997> }","paraphrases":["Was the paper 'Comparing spatial null models for brain maps' published by the person named Bratislav Misic?"],"info":{}}
{"id":"train_1223","question":"Was the paper 'Collecting Behavior Logs with Emotions in Town' published by the author Kenro Aihara?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/hci/Aihara14> dblp:authoredBy <https://dblp.org/pid/49/5300> }","paraphrases":["Was the paper 'Collecting Behavior Logs with Emotions in Town' published by the person K. Aihara?"],"info":{}}
{"id":"train_1224","question":"Did A. Schulz publish the paper 'Fr\\u00E9chet Distance of Surfaces: Some Simple Hard Cases' in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/esa/BuchinBS10> dblp:authoredBy <https://dblp.org/pid/80/1348-1> . <https://dblp.org/rec/conf/esa/BuchinBS10> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Did Andr\\u00E9 Schulz publish the paper 'Fr\\u00E9chet Distance of Surfaces: Some Simple Hard Cases' in the last 8 years?"],"info":{}}
{"id":"train_1225","question":"Did Xiaowen Chu and Yiu-Wing Leung co-author the paper 'Energy efficient real-time task scheduling on CPU-GPU hybrid clusters'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/infocom/MeiCLLL17> dblp:authoredBy <https://dblp.org/pid/24/2536> . <https://dblp.org/rec/conf/infocom/MeiCLLL17> dblp:authoredBy <https://dblp.org/pid/95/39> }","paraphrases":["Was the paper 'Energy efficient real-time task scheduling on CPU-GPU hybrid clusters' co-authored by Xiaowen Chu and Leung, Yiu-Wing?"],"info":{}}
{"id":"train_1226","question":"Did Mohammad A. Hanif publish the paper 'A Novel Scheme of Product Polar Codes with High Efficiency and Rate Compatibility'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wicomm/HanifV20> dblp:authoredBy <https://dblp.org/pid/124/1960> }","paraphrases":["Was the paper 'A Novel Scheme of Product Polar Codes with High Efficiency and Rate Compatibility' published by the person Mohammad Abu Hanif?"],"info":{}}
{"id":"train_1228","question":"Have Maletic, J. I. and B. S. Alqadi co-authored the paper 'Integration of Program Slicing with Cognitive Complexity for Defect Prediction'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icsm/AlqadiM20> dblp:authoredBy <https://dblp.org/pid/m/JonathanIMaletic> . <https://dblp.org/rec/conf/icsm/AlqadiM20> dblp:authoredBy <https://dblp.org/pid/195/8810> }","paraphrases":["Was the paper 'Integration of Program Slicing with Cognitive Complexity for Defect Prediction' co-authored by Maletic, J. I. and B. S. Alqadi?"],"info":{}}
{"id":"train_1229","question":"Did Jiyoung Woo publish the paper 'Action2Score: An Embedding Approach To Score Player Action' in the last 6 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2207-10297> dblp:authoredBy <https://dblp.org/pid/119/3771> . <https://dblp.org/rec/journals/corr/abs-2207-10297> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Did Jiyoung Woo publish the paper 'Action2Score: An Embedding Approach To Score Player Action' in the last six years?"],"info":{}}
{"id":"train_1231","question":"Did Joakim Jald\\u00E9n publish the paper 'On the complexity of sphere decoding in digital communications' in IEEE Trans. Signal Process.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tsp/JaldenO05> dblp:authoredBy <https://dblp.org/pid/62/241> . <https://dblp.org/rec/journals/tsp/JaldenO05> dblp:publishedIn 'IEEE Trans. Signal Process.' }","paraphrases":["Was the paper 'On the complexity of sphere decoding in digital communications' published by Joakim Jald\\u00E9n in IEEE Trans. Signal Process.?"],"info":{}}
{"id":"train_1232","question":"Did Zamani, Majid publish the paper 'From Small-Gain Theory to Compositional Construction of Barrier Certificates for Large-Scale Stochastic Systems' in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2101-06916> dblp:authoredBy <https://dblp.org/pid/34/9188> . <https://dblp.org/rec/journals/corr/abs-2101-06916> dblp:publishedIn 'CoRR' }","paraphrases":["Was the paper 'From Small-Gain Theory to Compositional Construction of Barrier Certificates for Large-Scale Stochastic Systems' published by Zamani, Majid in CoRR?"],"info":{}}
{"id":"train_1233","question":"Was the paper 'Robust adaptive Dynamic Surface Control of a hypersonic flight vehicle' published by the person Kendrick Amezquita Semprun?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/ButtYS10> dblp:authoredBy <https://dblp.org/pid/76/9182> }","paraphrases":["Was the paper 'Robust adaptive Dynamic Surface Control of a hypersonic flight vehicle' published by the person named Semprun, Kendrick Amezquita?"],"info":{}}
{"id":"train_1234","question":"Did Alghofaily, B. publish in Serv. Oriented Comput. Appl. in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/233/5776> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'Serv. Oriented Comput. Appl.' }","paraphrases":["Has Alghofaily, B. published in Serv. Oriented Comput. Appl. in the last 2 years?"],"info":{}}
{"id":"train_1235","question":"Did Ian H. Stevenson publish in J. Comput. Neurosci. in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/62/10432> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'J. Comput. Neurosci.' }","paraphrases":["Has Stevenson, Ian H. published in J. Comput. Neurosci. in the last 3 years?"],"info":{}}
{"id":"train_1236","question":"Was the paper 'On Learning Mixture Models with Sparse Parameters' co-authored by Mazumdar, Arya and Soumyabrata Pal?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aistats/PalM22> dblp:authoredBy <https://dblp.org/pid/77/6050> . <https://dblp.org/rec/conf/aistats/PalM22> dblp:authoredBy <https://dblp.org/pid/206/6371> }","paraphrases":["Have Arya Mazumdar and Soumyabrata Pal co-authored the paper 'On Learning Mixture Models with Sparse Parameters'?"],"info":{}}
{"id":"train_1237","question":"Did Kubala, F. publish the paper 'Online speaker clustering' in the last 6 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/LiuK04> dblp:authoredBy <https://dblp.org/pid/58/6179> . <https://dblp.org/rec/conf/icassp/LiuK04> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Did Francis Kubala publish the paper 'Online speaker clustering' in the last six years?"],"info":{}}
{"id":"train_1238","question":"Was the paper 'Oshidori-Net: Connecting Regional EPR Systems to Achieve Secure Mutual Reference with Thin-Client Computing Technology' published by Hirohiko M. in E-HEALTH?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ifip/KuwataTTKNMTI10> dblp:authoredBy <https://dblp.org/pid/132/7694> . <https://dblp.org/rec/conf/ifip/KuwataTTKNMTI10> dblp:publishedIn 'E-HEALTH' }","paraphrases":["Did Hirohiko M. publish the paper 'Oshidori-Net: Connecting Regional EPR Systems to Achieve Secure Mutual Reference with Thin-Client Computing Technology' in E-HEALTH?"],"info":{}}
{"id":"train_1240","question":"Was the paper 'Asymmetry in the diurnal variation of surface albedo' published by Young, David F. in IEEE Trans. Geosci. Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tgrs/MinnisMSY97> dblp:authoredBy <https://dblp.org/pid/41/9627> . <https://dblp.org/rec/journals/tgrs/MinnisMSY97> dblp:publishedIn 'IEEE Trans. Geosci. Remote. Sens.' }","paraphrases":["Did Young, David F. publish the paper 'Asymmetry in the diurnal variation of surface albedo' in IEEE Trans. Geosci. Remote. Sens.?"],"info":{}}
{"id":"train_1241","question":"Was the paper 'Research on a Chinese Language Model Based on Ontology and Statistical Method' published by the person Zheng, Dequan?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jclc/ZhengYZL04> dblp:authoredBy <https://dblp.org/pid/89/876> }","paraphrases":["Was the paper 'Research on a Chinese Language Model Based on Ontology and Statistical Method' published by the author Zheng, Dequan?"],"info":{}}
{"id":"train_1242","question":"Was the paper 'An Event-contrastive Connectome Network for Automatic Assessment of Individual Face Processing and Memory Ability' published by H. Yang in ICASSP?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icassp/HsiehYTSL19> dblp:authoredBy <https://dblp.org/pid/226/2074> . <https://dblp.org/rec/conf/icassp/HsiehYTSL19> dblp:publishedIn 'ICASSP' }","paraphrases":["Did Hao-Chun Yang publish the paper 'An Event-contrastive Connectome Network for Automatic Assessment of Individual Face Processing and Memory Ability' in ICASSP?"],"info":{}}
{"id":"train_1244","question":"Did Markus S. publish the paper 'Large-Scale Analysis of Group-Specific Music Genre Taste from Collaborative Tags' in IEEE International Symposium on Multimedia?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ism/SchedlF17> dblp:authoredBy <https://dblp.org/pid/77/271> . <https://dblp.org/rec/conf/ism/SchedlF17> dblp:publishedIn 'ISM' }","paraphrases":["Was the paper 'Large-Scale Analysis of Group-Specific Music Genre Taste from Collaborative Tags' published by Markus S. in ISM?"],"info":{}}
{"id":"train_1245","question":"Did Andreas S\\u00E4uberli publish in ASSETS in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/266/0857> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'ASSETS' }","paraphrases":["Has Andreas S\\u00E4uberli published in ASSETS in the last three years?"],"info":{}}
{"id":"train_1246","question":"Was the paper 'Scaling up learning analytics' published by the author Rebecca Ferguson?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/delfi/Ferguson15> dblp:authoredBy <https://dblp.org/pid/57/9370> }","paraphrases":["Did Rebecca Ferguson publish the paper 'Scaling up learning analytics'?"],"info":{}}
{"id":"train_1247","question":"Was the paper 'Translating Negation: Induction, Search And Model Errors' published by Bonnie L. Webber in SSST@NAACL-HLT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ssst/FancelluW15> dblp:authoredBy <https://dblp.org/pid/95/4733> . <https://dblp.org/rec/conf/ssst/FancelluW15> dblp:publishedIn 'SSST@NAACL-HLT' }","paraphrases":["Did Bonnie L. Webber publish the paper 'Translating Negation: Induction, Search And Model Errors' in SSST@NAACL-HLT?"],"info":{}}
{"id":"train_1248","question":"Was the paper 'Reversible Watermarking Based on Adaptive Prediction Error Expansion' published by the person named Qi Li?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icgec/LiYLP18> dblp:authoredBy <https://dblp.org/pid/181/2688> }","paraphrases":["Was the paper 'Reversible Watermarking Based on Adaptive Prediction Error Expansion' published by the author Qi Li?"],"info":{}}
{"id":"train_1249","question":"Did Hu Han publish the paper 'Deep Multi-Task Learning for Joint Prediction of Heterogeneous Face Attributes' in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fgr/WangHSC17> dblp:authoredBy <https://dblp.org/pid/03/6451-1> . <https://dblp.org/rec/conf/fgr/WangHSC17> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Did Han, Hu publish the paper 'Deep Multi-Task Learning for Joint Prediction of Heterogeneous Face Attributes' in the last 4 years?"],"info":{}}
{"id":"train_1250","question":"Has Jianhui Wu published in IEEE Trans. Wirel. Commun. in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/53/6118> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'IEEE Trans. Wirel. Commun.' }","paraphrases":["Did Jianhui Wu publish in IEEE Trans. Wirel. Commun. in the last 2 years?"],"info":{}}
{"id":"train_1251","question":"Have Srinath T. V. Setty and Nikitin, K. co-authored the paper 'Replicated state machines without replicated execution'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iacr/LeeNS20> dblp:authoredBy <https://dblp.org/pid/68/8463> . <https://dblp.org/rec/journals/iacr/LeeNS20> dblp:authoredBy <https://dblp.org/pid/203/4231> }","paraphrases":["Was the paper 'Replicated state machines without replicated execution' co-authored by Srinath T. V. Setty and Kirill Nikitin?"],"info":{}}
{"id":"train_1252","question":"Did Coronado, E. publish the paper 'SIMPRE: A software package to calculate crystal field parameters, energy levels, and magnetic properties on mononuclear lanthanoid complexes based on charge distributions' in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jcc/BaldoviCCCGP13> dblp:authoredBy <https://dblp.org/pid/57/393> . <https://dblp.org/rec/journals/jcc/BaldoviCCCGP13> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did Coronado, E. publish the paper 'SIMPRE: A software package to calculate crystal field parameters, energy levels, and magnetic properties on mononuclear lanthanoid complexes based on charge distributions' in the last two years?"],"info":{}}
{"id":"train_1254","question":"Was the paper 'Improving the Character Ngram Model for the DSL Task with BM25 Weighting and Less Frequently Used Feature Sets' co-authored by Yves Bestgen and Kexin Qiao?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vardial/Bestgen17> dblp:authoredBy <https://dblp.org/pid/19/2544> . <https://dblp.org/rec/conf/vardial/Bestgen17> dblp:authoredBy <https://dblp.org/pid/152/2559> }","paraphrases":["Did Yves Bestgen and Kexin Qiao co-author the paper 'Improving the Character Ngram Model for the DSL Task with BM25 Weighting and Less Frequently Used Feature Sets'?"],"info":{}}
{"id":"train_1255","question":"Have W. Ho Mow and Bin Qian co-authored the paper 'A Markov error modeling approach to distributed turbo coding'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/isit/QianM15> dblp:authoredBy <https://dblp.org/pid/81/4404> . <https://dblp.org/rec/conf/isit/QianM15> dblp:authoredBy <https://dblp.org/pid/55/3292> }","paraphrases":["Was the paper 'A Markov error modeling approach to distributed turbo coding' co-authored by Wai Ho Mow and Qian, B.?"],"info":{}}
{"id":"train_1256","question":"Was the paper 'First responders actions to cope with volatile digital evidence' published by the person Jill Slay?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijesdf/WattS15> dblp:authoredBy <https://dblp.org/pid/04/6319> }","paraphrases":["Was the paper 'First responders actions to cope with volatile digital evidence' published by the author Slay, Jill?"],"info":{}}
{"id":"train_1257","question":"Did Risto Mononen publish the paper 'Security and Authentication in the Mobile World'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wpc/OjanperaM02> dblp:authoredBy <https://dblp.org/pid/34/6947> }","paraphrases":["Was the paper 'Security and Authentication in the Mobile World' published by the person named Risto Mononen?"],"info":{}}
{"id":"train_1258","question":"Did J. Beyer publish in Comput. Graph. Forum in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/53/531> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'Comput. Graph. Forum' }","paraphrases":["Has J. Beyer published in Comput. Graph. Forum in the last 4 years?"],"info":{}}
{"id":"train_1259","question":"Have Hua Zhang and J. Wang co-authored the paper 'Analyzing Uplink Outage Probability of Grant-Free Access and Retransmission for URLLC'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/wcsp/Zhang0W21> dblp:authoredBy <https://dblp.org/pid/69/2745-2> . <https://dblp.org/rec/conf/wcsp/Zhang0W21> dblp:authoredBy <https://dblp.org/pid/94/7080> }","paraphrases":["Was the paper 'Analyzing Uplink Outage Probability of Grant-Free Access and Retransmission for URLLC' co-authored by Zhang, H. and Jun-Bo Wang?"],"info":{}}
{"id":"train_1260","question":"Did Ke, Z. publish the paper 'A Queueing Model for Industrial Public Blockchains and Validation' in ICIT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icit2/KeP21> dblp:authoredBy <https://dblp.org/pid/217/8663> . <https://dblp.org/rec/conf/icit2/KeP21> dblp:publishedIn 'ICIT' }","paraphrases":["Was the paper 'A Queueing Model for Industrial Public Blockchains and Validation' published by Zuqiang Ke in ICIT?"],"info":{}}
{"id":"train_1261","question":"Was the paper 'Three-dimensional free vibrations analysis of functionally graded rectangular plates by the meshless local Petrov-Galerkin (MLPG) method' published by M. Rashidi Moghaddam in Appl. Math. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/amc/MoghaddamB17> dblp:authoredBy <https://dblp.org/pid/195/6572> . <https://dblp.org/rec/journals/amc/MoghaddamB17> dblp:publishedIn 'Appl. Math. Comput.' }","paraphrases":["Did M. R. Moghaddam publish the paper 'Three-dimensional free vibrations analysis of functionally graded rectangular plates by the meshless local Petrov-Galerkin (MLPG) method' in Appl. Math. Comput.?"],"info":{}}
{"id":"train_1262","question":"Was the paper 'Handling Information Loss of Graph Neural Networks for Session-based Recommendation' co-authored by Raymond Chi-Wing Wong and Chen, Tianwen?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kdd/ChenW20> dblp:authoredBy <https://dblp.org/pid/w/RaymondChiWingWong> . <https://dblp.org/rec/conf/kdd/ChenW20> dblp:authoredBy <https://dblp.org/pid/03/10742> }","paraphrases":["Did Raymond Chi-Wing Wong and Tianwen Chen co-author the paper 'Handling Information Loss of Graph Neural Networks for Session-based Recommendation'?"],"info":{}}
