{"id":"train_2095","question":"Wasn't the paper 'Measured capacity of an Ethernet: myths and reality' not not published by the author Jeffrey C. Mogul?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ccr/BoggsMK95> dblp:authoredBy <https://dblp.org/pid/m/JeffreyCMogul> }","paraphrases":["Was the paper 'Measured capacity of an Ethernet: myths and reality' not not published by the person Jeffrey C. Mogul?"],"info":{}}
{"id":"train_2096","question":"Isn't Ross A. Knepper not affiliated with Cornell University, USA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/pid/98/1547> dblp:primaryAffiliation 'Cornell University, USA' }","paraphrases":["Doesn't Ross A. Knepper not work at Cornell University?"],"info":{}}
{"id":"train_2097","question":"Was the paper 'KtSeqC: System Description' not not published by the person Gor\\u00E9, Rajeev?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/tableaux/BoyapatiG99> dblp:authoredBy <https://dblp.org/pid/g/RajeevGore> }","paraphrases":["Didn't Rajeev Gor\\u00E9 not publish the paper 'KtSeqC: System Description'?"],"info":{}}
{"id":"train_2098","question":"Wasn't the paper 'Weakly Secure Equivalence-Class Signatures from Standard Assumptions' not not published by the author Gay, Romain?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/iacr/FuchsbauerG18> dblp:authoredBy <https://dblp.org/pid/156/0378> }","paraphrases":["Wasn't the paper 'Weakly Secure Equivalence-Class Signatures from Standard Assumptions' not not published by the person named Gay, Romain?"],"info":{}}
{"id":"train_2100","question":"In VL/HCC and Comput. Music. J., what papers did S. Conversy publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/4104> { ?answer dblp:publishedIn 'VL/HCC' } UNION { ?answer dblp:publishedIn 'Comput. Music. J.' } }","paraphrases":["What papers did St\\u00E9phane Conversy publish in VL/HCC and Comput. Music. J.?"],"info":{}}
{"id":"train_2101","question":"What papers did Mark S. Nixon publish in Pattern Recognit. and WMT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/n/MarkSNixon> { ?answer dblp:publishedIn 'Pattern Recognit.' } UNION { ?answer dblp:publishedIn 'WMT' } }","paraphrases":["In Pattern Recognit. and WMT, what papers did M. S. Nixon publish?"],"info":{}}
{"id":"train_2102","question":"In Microprocess. and FOGA, what papers did Y. T. Fung publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/167/5452> { ?answer dblp:publishedIn 'Microprocess.' } UNION { ?answer dblp:publishedIn 'FOGA' } }","paraphrases":["What papers did Y. T. Fung publish in Microprocess. and Foundations of Genetic Algorithms?"],"info":{}}
{"id":"train_2103","question":"List all the primary affiliations of Lucie M\\u00E9nard and Eric F..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/47/5322> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/80/6326> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Lucie M. and Eric F.?"],"info":{}}
{"id":"train_2104","question":"What papers did Mikolaj Chwalisz publish in DySPAN and EuroISI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/157/8020> { ?answer dblp:publishedIn 'DySPAN' } UNION { ?answer dblp:publishedIn 'EuroISI' } }","paraphrases":["In DySPAN and EuroISI, what papers did Chwalisz, M. publish?"],"info":{}}
{"id":"train_2105","question":"List all the papers that Dumas, Sylvie and B. Weber published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/32/4726> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/03/5411> } }","paraphrases":["What are the papers that Sylvie Dumas and B. Weber published?"],"info":{}}
{"id":"train_2106","question":"What papers did Hua D. publish in Opt. Switch. Netw. and FAT*?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/79/473-4> { ?answer dblp:publishedIn 'Opt. Switch. Netw.' } UNION { ?answer dblp:publishedIn 'FAT*' } }","paraphrases":["In Opt. Switch. Netw. and FAT*, what papers did Hua D. publish?"],"info":{}}
{"id":"train_2107","question":"What papers did Dominique Sotteau publish in Discret. Appl. Math. and CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/s/DSotteau> { ?answer dblp:publishedIn 'Discret. Appl. Math.' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["In Discret. Appl. Math. and CoRR, what papers did Dominique Sotteau publish?"],"info":{}}
{"id":"train_2108","question":"What papers did Pulido-Guerrero, Santiago publish in Int. J. Autom. Comput. and SMC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/271/5000> { ?answer dblp:publishedIn 'Int. J. Autom. Comput.' } UNION { ?answer dblp:publishedIn 'SMC' } }","paraphrases":["In Int. J. Autom. Comput. and IEEE Conference on Systems, Man and Cybernetics, what papers did Santiago Pulido-Guerrero publish?"],"info":{}}
{"id":"train_2109","question":"List all the papers that Zdenek P. and Miroslav Byrtus published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/79/1317> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/215/0485> } }","paraphrases":["What are the papers that Zdenek Peroutka and Miroslav Byrtus published?"],"info":{}}
{"id":"train_2111","question":"List all the primary affiliations of Jonathan Roberts and Yousef E..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/54/6461> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/172/5309> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Roberts, J. and Yousef E.?"],"info":{}}
{"id":"train_2112","question":"What papers did Namrata Vaswani publish in ICPR (2) and Prague Bull. Math. Linguistics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/v/NamrataVaswani> { ?answer dblp:publishedIn 'ICPR (2)' } UNION { ?answer dblp:publishedIn 'Prague Bull. Math. Linguistics' } }","paraphrases":["In ICPR (2) and Prague Bull. Math. Linguistics, what papers did N. Vaswani publish?"],"info":{}}
{"id":"train_2113","question":"List all the papers that Gary Wong and Kirk Webb published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/31/7964> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/69/3087> } }","paraphrases":["What are the papers that Wong, G. and Kirk W. published?"],"info":{}}
{"id":"train_2115","question":"What papers did Fanqing Lin publish in CoRR and EURASIP J. Image Video Process.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/261/4944> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'EURASIP J. Image Video Process.' } }","paraphrases":["In CoRR and EURASIP J. Image Video Process., what papers did F. Lin publish?"],"info":{}}
{"id":"train_2116","question":"In Syst. Control. Lett. and INTERSPEECH, what papers did Jinhu Lu publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/6209> { ?answer dblp:publishedIn 'Syst. Control. Lett.' } UNION { ?answer dblp:publishedIn 'INTERSPEECH' } }","paraphrases":["What papers did Lu, J. publish in Syst. Control. Lett. and Interspeech?"],"info":{}}
{"id":"train_2117","question":"In BIOSIG and IEEE Trans. Image Process., what papers did Langnickel, Mirko publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/23/3122> { ?answer dblp:publishedIn 'BIOSIG' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Image Process.' } }","paraphrases":["What papers did Mirko Langnickel publish in BIOSIG and IEEE Trans. Image Process.?"],"info":{}}
{"id":"train_2118","question":"In Inform. Spektrum and Electron. Colloquium Comput. Complex., what papers did Kurt M. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/m/KurtMehlhorn> { ?answer dblp:publishedIn 'Inform. Spektrum' } UNION { ?answer dblp:publishedIn 'Electron. Colloquium Comput. Complex.' } }","paraphrases":["What papers did Kurt Mehlhorn publish in Inform. Spektrum and Electron. Colloquium Comput. Complex.?"],"info":{}}
{"id":"train_2119","question":"List all the papers that Alvin Heng Jun Ren and Ling Feng published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/236/3077> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/58/4464> } }","paraphrases":["What are the papers that Alvin H. Jun Ren and Ling Feng published?"],"info":{}}
{"id":"train_2120","question":"In MeMeA and CBMS, what papers did G. D'Addio publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/10/7335> { ?answer dblp:publishedIn 'MeMeA' } UNION { ?answer dblp:publishedIn 'CBMS' } }","paraphrases":["What papers did Gianni D'Addio publish in MeMeA and CBMS?"],"info":{}}
{"id":"train_2121","question":"In Comput. Educ. and International Symposium on Information Theory and Its Applications, what papers did Wen-Lin Cheng publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/33/7834> { ?answer dblp:publishedIn 'Comput. Educ.' } UNION { ?answer dblp:publishedIn 'ISITA' } }","paraphrases":["What papers did Wen-Lin Cheng publish in Comput. Educ. and ISITA?"],"info":{}}
{"id":"train_2122","question":"What papers did J. Saarinen publish in EUSIPCO and POLICY?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/95/5590> { ?answer dblp:publishedIn 'EUSIPCO' } UNION { ?answer dblp:publishedIn 'POLICY' } }","paraphrases":["In EUSIPCO and POLICY, what papers did Jukka Saarinen publish?"],"info":{}}
{"id":"train_2123","question":"In IEEE International Conference on Fuzzy Systems and ACM Trans. Graph., what papers did Alves, R. Teixeira publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/3684> { ?answer dblp:publishedIn 'FUZZ-IEEE' } UNION { ?answer dblp:publishedIn 'ACM Trans. Graph.' } }","paraphrases":["What papers did Alves, R. Teixeira publish in FUZZ-IEEE and ACM Trans. Graph.?"],"info":{}}
{"id":"train_2124","question":"In ICARCV and SIGGRAPH Electronic Art and Animation Catalog, what papers did Y. Wen publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/232/3770> { ?answer dblp:publishedIn 'ICARCV' } UNION { ?answer dblp:publishedIn 'SIGGRAPH Electronic Art and Animation Catalog' } }","paraphrases":["What papers did Yubin Wen publish in ICARCV and SIGGRAPH Electronic Art and Animation Catalog?"],"info":{}}
{"id":"train_2125","question":"List all the papers that Seo, J. and JongSeob Baek published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/05/1021> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/63/1459> } }","paraphrases":["What are the papers that Jong-Soo Seo and J. Baek published?"],"info":{}}
{"id":"train_2126","question":"What papers did Sung-Bae Cho publish in RiiSS and ICYCS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/88/2576> { ?answer dblp:publishedIn 'RiiSS' } UNION { ?answer dblp:publishedIn 'ICYCS' } }","paraphrases":["In RiiSS and ICYCS, what papers did Sung-Bae Cho publish?"],"info":{}}
{"id":"train_2127","question":"What papers did Tripathy, B. K. publish in RSCTC and Microprocess. Microsystems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/92/3463> { ?answer dblp:publishedIn 'RSCTC' } UNION { ?answer dblp:publishedIn 'Microprocess. Microsystems' } }","paraphrases":["In RSCTC and Microprocess. Microsystems, what papers did B. K. Tripathy publish?"],"info":{}}
{"id":"train_2128","question":"What papers did S. Schmitz publish in LICS and Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/62/6048> { ?answer dblp:publishedIn 'LICS' } UNION { ?answer dblp:publishedIn 'Remote. Sens.' } }","paraphrases":["In LICS and Remote. Sens., what papers did S. Schmitz publish?"],"info":{}}
{"id":"train_2129","question":"What are the papers that Mathias Philipp and R. S. Sandhu published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/28/2124> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/s/RaviSSandhu> } }","paraphrases":["List all the papers that Mathias P. and Ravi S. Sandhu published."],"info":{}}
{"id":"train_2130","question":"List all the papers that Didier T. and Jean-Fran\\u00E7ois L\\u00E9on published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/62/10466> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/19/11319> } }","paraphrases":["What are the papers that Didier Tanr\\u00E9 and Jean-Fran\\u00E7ois L\\u00E9on published?"],"info":{}}
{"id":"train_2131","question":"In CoRR and SPECOM, what papers did Jiaqi Zhang publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/3021> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'SPECOM' } }","paraphrases":["What papers did Jiaqi Zhang publish in CoRR and SPECOM?"],"info":{}}
{"id":"train_2132","question":"What papers did DeLiang Wang publish in ICASSP and ICDM Workshops?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/31/6085> { ?answer dblp:publishedIn 'ICASSP' } UNION { ?answer dblp:publishedIn 'ICDM Workshops' } }","paraphrases":["In ICASSP and ICDM Workshops, what papers did DeLiang Wang publish?"],"info":{}}
{"id":"train_2133","question":"What are the papers that Majid Yar and Sachin S. Kamble published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/116/1250> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/181/8024> } }","paraphrases":["List all the papers that Majid Yar and Sachin S. Kamble published."],"info":{}}
{"id":"train_2134","question":"In Discret. Math. and IEEE Access, what papers did Hsu, L. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/1324> { ?answer dblp:publishedIn 'Discret. Math.' } UNION { ?answer dblp:publishedIn 'IEEE Access' } }","paraphrases":["What papers did Lih-Hsing Hsu publish in Discret. Math. and IEEE Access?"],"info":{}}
{"id":"train_2135","question":"In ICMC and Applied Computing Conference, what papers did Kristoffer Jensen publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/73/1552> { ?answer dblp:publishedIn 'ICMC' } UNION { ?answer dblp:publishedIn 'ACC' } }","paraphrases":["What papers did Kristoffer J. publish in ICMC and Applied Computing Conference?"],"info":{}}
{"id":"train_2136","question":"What papers did Ute Massler publish in International Conference on Computer Supported Education and Inf.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/61/8672> { ?answer dblp:publishedIn 'CSEDU (Selected Papers)' } UNION { ?answer dblp:publishedIn 'Inf.' } }","paraphrases":["In CSEDU (Selected Papers) and Inf., what papers did Ute Massler publish?"],"info":{}}
{"id":"train_2137","question":"In MSV and IEEE Congress on Evolutionary Computation, what papers did Son, T. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/7503> { ?answer dblp:publishedIn 'MSV' } UNION { ?answer dblp:publishedIn 'IEEE Congress on Evolutionary Computation' } }","paraphrases":["What papers did Son, T. publish in MSV and IEEE Congress on Evolutionary Computation?"],"info":{}}
{"id":"train_2138","question":"List all the primary affiliations of Lina He and Xin Guo Ming.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/76/10700> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/30/7396> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of He, L. and Xin Guo Ming?"],"info":{}}
{"id":"train_2139","question":"In IEEE Access and Proc. ACM Hum. Comput. Interact., what papers did Max B. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/MaxBramer> { ?answer dblp:publishedIn 'IEEE Access' } UNION { ?answer dblp:publishedIn 'Proc. ACM Hum. Comput. Interact.' } }","paraphrases":["What papers did Max B. publish in IEEE Access and Proc. ACM Hum. Comput. Interact.?"],"info":{}}
{"id":"train_2140","question":"List all the papers that Carl E. Rasmussen and Frank J\\u00E4kel published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/83/5440> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/48/1138> } }","paraphrases":["What are the papers that C. E. Rasmussen and Frank J\\u00E4kel published?"],"info":{}}
{"id":"train_2141","question":"What papers did Ya-Qing B. publish in J. Appl. Math. and CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/146/9125> { ?answer dblp:publishedIn 'J. Appl. Math.' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["In J. Appl. Math. and CoRR, what papers did Ya-Qing Bi publish?"],"info":{}}
{"id":"train_2142","question":"What papers did Michael Orshansky publish in ISLPED and VARY@MoDELS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/3999> { ?answer dblp:publishedIn 'ISLPED' } UNION { ?answer dblp:publishedIn 'VARY@MoDELS' } }","paraphrases":["In ISLPED and VARY@MoDELS, what papers did Michael Orshansky publish?"],"info":{}}
{"id":"train_2143","question":"In IEEE Trans. Syst. Man Cybern. Syst. and Appl. Math. Comput., what papers did Wen-Hsien Chen publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/36/8774> { ?answer dblp:publishedIn 'IEEE Trans. Syst. Man Cybern. Syst.' } UNION { ?answer dblp:publishedIn 'Appl. Math. Comput.' } }","paraphrases":["What papers did W. Chen publish in IEEE Trans. Syst. Man Cybern. Syst. and Appl. Math. Comput.?"],"info":{}}
{"id":"train_2146","question":"In TaPP and Int. J. Syst. Sci., what papers did Ian T. Foster publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/f/IanTFoster> { ?answer dblp:publishedIn 'TaPP' } UNION { ?answer dblp:publishedIn 'Int. J. Syst. Sci.' } }","paraphrases":["What papers did Foster, I. T. publish in TaPP and Int. J. Syst. Sci.?"],"info":{}}
{"id":"train_2147","question":"In NIME and IEEE Trans. Ind. Informatics, what papers did Hans-Christoph S. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/58/1880> { ?answer dblp:publishedIn 'NIME' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Ind. Informatics' } }","paraphrases":["What papers did Hans-Christoph S. publish in NIME and IEEE Trans. Ind. Informatics?"],"info":{}}
{"id":"train_2148","question":"What are the papers that Y. Li and Lucian I. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/48/9884> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/i/LucianIlie> } }","paraphrases":["List all the papers that Y. Li and Lucian I. published."],"info":{}}
{"id":"train_2149","question":"In CoRR and ACM Trans. Graph., what papers did Saumik Bhattacharya publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/154/8318> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'ACM Trans. Graph.' } }","paraphrases":["What papers did Saumik Bhattacharya publish in CoRR and ACM Trans. Graph.?"],"info":{}}
{"id":"train_2150","question":"What are the papers that Peter S. and Uttaran B. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/40/2885> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/220/7744> } }","paraphrases":["List all the papers that Peter Schr\\u00F6der and Uttaran B. published."],"info":{}}
{"id":"train_2151","question":"What are the primary affiliations of Huamin Qu and Yong Wang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/65/1792> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/84/2694-21> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Huamin Q. and Yong Wang."],"info":{}}
{"id":"train_2152","question":"List all the papers that Agrawala, M. and G. Humphreys published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/64/2431> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/36/5153> } }","paraphrases":["What are the papers that Agrawala, M. and G. Humphreys published?"],"info":{}}
{"id":"train_2153","question":"List all the papers that Zhu, W. and Fei-Yue W. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/z/WilliamZhu> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/14/374-1> } }","paraphrases":["What are the papers that Zhu, W. and Fei-Yue Wang published?"],"info":{}}
{"id":"train_2154","question":"In CoRR and Appl. Math. Comput., what papers did Sevilla, R. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/148/7117> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'Appl. Math. Comput.' } }","paraphrases":["What papers did Rub\\u00E9n Sevilla publish in CoRR and Appl. Math. Comput.?"],"info":{}}
{"id":"train_2155","question":"In ITSC and J. Int. Comput. Games Assoc., what papers did Chun-Hsiao Yeh publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/203/3213> { ?answer dblp:publishedIn 'ITSC' } UNION { ?answer dblp:publishedIn 'J. Int. Comput. Games Assoc.' } }","paraphrases":["What papers did Yeh, Chun-Hsiao publish in ITSC and J. Int. Comput. Games Assoc.?"],"info":{}}
{"id":"train_2156","question":"In CoRR and ICIT, what papers did Can Pu publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/203/8634> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'ICIT' } }","paraphrases":["What papers did Can Pu publish in CoRR and ICIT?"],"info":{}}
{"id":"train_2157","question":"What papers did Soh-Khim Ong publish in Robotica and ASP-DAC?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/o/SohKhimOng> { ?answer dblp:publishedIn 'Robotica' } UNION { ?answer dblp:publishedIn 'ASP-DAC' } }","paraphrases":["In Robotica and ASP-DAC, what papers did Ong, S. publish?"],"info":{}}
{"id":"train_2158","question":"What are the primary affiliations of E. N. Elnozahy and Alex Kinneer?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/e/ENElnozahy> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/78/6956> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of E. N. Elnozahy and Alex Kinneer."],"info":{}}
{"id":"train_2159","question":"In International Symposium on Information Assurance and Security and Medical Imaging: Image Processing, what papers did Xuan-yong Z. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/19/7488> { ?answer dblp:publishedIn 'IAS' } UNION { ?answer dblp:publishedIn 'Medical Imaging: Image Processing' } }","paraphrases":["What papers did Xuan-yong Z. publish in IAS and Medical Imaging: Image Processing?"],"info":{}}
{"id":"train_2160","question":"What papers did Yong S. publish in Int. J. Distributed Sens. Networks and Guide to Advanced Empirical Software Engineering?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/64/3333> { ?answer dblp:publishedIn 'Int. J. Distributed Sens. Networks' } UNION { ?answer dblp:publishedIn 'Guide to Advanced Empirical Software Engineering' } }","paraphrases":["In Int. J. Distributed Sens. Networks and Guide to Advanced Empirical Software Engineering, what papers did Yong Sun publish?"],"info":{}}
{"id":"train_2162","question":"List all the papers that Kim, J. and Kim, Sungshin published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/97/3030> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/97/622> } }","paraphrases":["What are the papers that Kim, J. and Sungshin Kim published?"],"info":{}}
{"id":"train_2163","question":"What papers did Piotr S. publish in BDAS and Eur. J. Oper. Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/69/10106> { ?answer dblp:publishedIn 'BDAS' } UNION { ?answer dblp:publishedIn 'Eur. J. Oper. Res.' } }","paraphrases":["In BDAS and Eur. J. Oper. Res., what papers did Piotr Szwed publish?"],"info":{}}
{"id":"train_2164","question":"What papers did Osendorfer, Christian publish in ICMLA and Int. J. Bifurc. Chaos?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/11/1393> { ?answer dblp:publishedIn 'ICMLA' } UNION { ?answer dblp:publishedIn 'Int. J. Bifurc. Chaos' } }","paraphrases":["In International Conference on Machine Learning and Applications and Int. J. Bifurc. Chaos, what papers did Osendorfer, Christian publish?"],"info":{}}
{"id":"train_2165","question":"What are the primary affiliations of Demetri Terzopoulos and S. Lee?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/85/4738> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/74/1889> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Demetri Terzopoulos and Sung-Hee Lee."],"info":{}}
{"id":"train_2166","question":"What papers did Gopalkrishna Veni publish in International Conference on Image Analysis and Recognition and Asia Information Retrieval Symposium?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/131/4790> { ?answer dblp:publishedIn 'ICIAR' } UNION { ?answer dblp:publishedIn 'AIRS' } }","paraphrases":["In International Conference on Image Analysis and Recognition and Asia Information Retrieval Symposium, what papers did Gopalkrishna Veni publish?"],"info":{}}
{"id":"train_2167","question":"List all the papers that Mateo D. Rubio and Carlos Montenegro published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/286/1864> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/197/6982> } }","paraphrases":["What are the papers that Mateo D. Rubio and Montenegro, C. published?"],"info":{}}
{"id":"train_2168","question":"What papers did Fabrizio Perin publish in ICSM and GLOBECOM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/22/7677> { ?answer dblp:publishedIn 'ICSM' } UNION { ?answer dblp:publishedIn 'GLOBECOM' } }","paraphrases":["In ICSM and GLOBECOM, what papers did Fabrizio Perin publish?"],"info":{}}
{"id":"train_2169","question":"What papers did G. E. Bottomley publish in IEEE Trans. Aerosp. Electron. Syst. and IEEE Trans. Pattern Anal. Mach. Intell.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/3183> { ?answer dblp:publishedIn 'IEEE Trans. Aerosp. Electron. Syst.' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Pattern Anal. Mach. Intell.' } }","paraphrases":["In IEEE Trans. Aerosp. Electron. Syst. and IEEE Trans. Pattern Anal. Mach. Intell., what papers did G. E. Bottomley publish?"],"info":{}}
{"id":"train_2171","question":"What papers did A. A. Porter publish in Empir. Softw. Eng. and IEEE Trans. Geosci. Remote. Sens.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/p/AdamAPorter> { ?answer dblp:publishedIn 'Empir. Softw. Eng.' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Geosci. Remote. Sens.' } }","paraphrases":["In Empir. Softw. Eng. and IEEE Trans. Geosci. Remote. Sens., what papers did Adam A. Porter publish?"],"info":{}}
{"id":"train_2172","question":"What are the primary affiliations of Anke Huckauf and David K.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/71/3> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/90/4474> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Huckauf, A. and David Kowalski."],"info":{}}
