{"id":"train_1037","question":"In which venues did Haijun Wang publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/46/1165> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Haijun Wang published and in which venues?"],"info":{}}
{"id":"train_1038","question":"List the titles of the papers that Joanne Hinds published in the last two years and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/183/7530> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Joanne Hinds published in the last two years and in which venues?"],"info":{}}
{"id":"train_1040","question":"Which papers did author X. Chai publish and in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/242/4753> . ?firstanswer dblp:yearOfPublication ?secondanswer }","paraphrases":["Which publications did X. Chai author and in which year?"],"info":{}}
{"id":"train_1046","question":"Mention the other authors with whom Magiel Bruntink has co-authored papers in the last 8 years and where are they affiliated.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/42/5878> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:authoredBy ?firstanswer FILTER ( ?firstanswer != <https://dblp.org/pid/42/5878> ) . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the co-authors of Bruntink, M. in the last eight years and where are they affiliated?"],"info":{}}
{"id":"train_1047","question":"In which venues did Jason Hedetniemi publish papers and what are the titles of these papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/178/0259> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["What are the titles of the papers that Hedetniemi, Jason published and in which venues?"],"info":{}}
{"id":"train_1048","question":"List the titles of the papers that Mohanty, R. Prasad published and in which venues.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/140/8807> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }","paraphrases":["List the venues in which Mohanty, R. Prasad published papers and the titles of these papers."],"info":{}}
{"id":"train_1050","question":"Did Wanlei Zhou and Chowdhury, Morshed U. co-author the paper 'MVGL Analyser for Multi-classifier Based Spam Filtering System'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ACISicis/IslamZC09> dblp:authoredBy <https://dblp.org/pid/92/2939> . <https://dblp.org/rec/conf/ACISicis/IslamZC09> dblp:authoredBy <https://dblp.org/pid/74/4874> }","paraphrases":["Was the paper 'MVGL Analyser for Multi-classifier Based Spam Filtering System' co-authored by Wanlei Zhou and Morshed U. Chowdhury?"],"info":{}}
{"id":"train_1052","question":"Has J. Florens published in Computer Graphics in the last 5 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/26/5845> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -5 ) . ?x dblp:publishedIn 'Computer Graphics' }","paraphrases":["Did J. Florens publish in Computer Graphics in the last five years?"],"info":{}}
{"id":"train_1054","question":"Did Banville, H. J. publish the paper 'Self-supervised representation learning from electroencephalography signals' in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-1911-05419> dblp:authoredBy <https://dblp.org/pid/160/4305> . <https://dblp.org/rec/journals/corr/abs-1911-05419> dblp:publishedIn 'CoRR' }","paraphrases":["Was the paper 'Self-supervised representation learning from electroencephalography signals' published by Hubert J. Banville in CoRR?"],"info":{}}
{"id":"train_1055","question":"Did Xiaotong Z. publish the paper 'Book Rating Model Based on Self-Attention and LSTM' in ICRAI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icrai/Zhao20> dblp:authoredBy <https://dblp.org/pid/197/3519> . <https://dblp.org/rec/conf/icrai/Zhao20> dblp:publishedIn 'ICRAI' }","paraphrases":["Was the paper 'Book Rating Model Based on Self-Attention and LSTM' published by Xiaotong Z. in ICRAI?"],"info":{}}
{"id":"train_1056","question":"Has Martin F. published in Security and Quality in Cyber-Physical Systems Engineering in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/184/6474> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'Security and Quality in Cyber-Physical Systems Engineering' }","paraphrases":["Did Martin Fruhmann publish in Security and Quality in Cyber-Physical Systems Engineering in the last three years?"],"info":{}}
{"id":"train_1058","question":"Did Joseph P. Simonis publish the paper 'Globalization Techniques for Newton-Krylov Methods and Applications to the Fully Coupled Solution of the Navier-Stokes Equations'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/siamrev/PawlowskiSSW06> dblp:authoredBy <https://dblp.org/pid/31/9301> }","paraphrases":["Was the paper 'Globalization Techniques for Newton-Krylov Methods and Applications to the Fully Coupled Solution of the Navier-Stokes Equations' published by the author Joseph P. Simonis?"],"info":{}}
{"id":"train_1059","question":"Did Hui-sen H. publish the paper 'Design of a hiccup mode over-current protection circuit for DC-DC switching converters' in Microelectron. J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mj/ShiMHLL12> dblp:authoredBy <https://dblp.org/pid/86/10754> . <https://dblp.org/rec/journals/mj/ShiMHLL12> dblp:publishedIn 'Microelectron. J.' }","paraphrases":["Was the paper 'Design of a hiccup mode over-current protection circuit for DC-DC switching converters' published by Hui-sen H. in Microelectron. J.?"],"info":{}}
{"id":"train_1060","question":"Was the paper 'Complexity Measures for Regular Expressions' published by the author Andrzej E.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/stoc/EhrenfeuchtZ74> dblp:authoredBy <https://dblp.org/pid/e/AEhrenfeucht> }","paraphrases":["Was the paper 'Complexity Measures for Regular Expressions' published by the person named Andrzej E.?"],"info":{}}
{"id":"train_1061","question":"Was the paper 'Design of a Passive RFID Tag Antenna with a Modified T-match Structure' co-authored by Melaka Senadeera and Shyama Wickramasinghe?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iciis/WickramasingheJ21> dblp:authoredBy <https://dblp.org/pid/310/5755> . <https://dblp.org/rec/conf/iciis/WickramasingheJ21> dblp:authoredBy <https://dblp.org/pid/140/7567> }","paraphrases":["Have Senadeera, Melaka and Wickramasinghe, Shyama co-authored the paper 'Design of a Passive RFID Tag Antenna with a Modified T-match Structure'?"],"info":{}}
{"id":"train_1062","question":"Have Sangeeta Mittal and Porwal, Shardha co-authored the paper 'A Secure Key Delegation Mechanism for Fog Networking'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ic3/PorwalM19> dblp:authoredBy <https://dblp.org/pid/122/2118> . <https://dblp.org/rec/conf/ic3/PorwalM19> dblp:authoredBy <https://dblp.org/pid/152/3619> }","paraphrases":["Was the paper 'A Secure Key Delegation Mechanism for Fog Networking' co-authored by Sangeeta M. and Porwal, Shardha?"],"info":{}}
{"id":"train_1063","question":"Was the paper 'APP and PHY in Harmony: A framework enabling flexible physical layer processing to address application requirements' published by Matthias Hollick in NetSys?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/kivs/SchulzSWREH15> dblp:authoredBy <https://dblp.org/pid/95/1816> . <https://dblp.org/rec/conf/kivs/SchulzSWREH15> dblp:publishedIn 'NetSys' }","paraphrases":["Did Hollick, M. publish the paper 'APP and PHY in Harmony: A framework enabling flexible physical layer processing to address application requirements' in NetSys?"],"info":{}}
{"id":"train_1064","question":"Did T. J. Lowi publish the paper 'Comments on \\democracy in an information society\\: Making it a real revolution' in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tis/LowiL86> dblp:authoredBy <https://dblp.org/pid/166/5718> . <https://dblp.org/rec/journals/tis/LowiL86> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Did Theodore J. Lowi publish the paper 'Comments on \\democracy in an information society\\: Making it a real revolution' in the last 2 years?"],"info":{}}
{"id":"train_1065","question":"Did Yao Sun publish the paper 'Conductance Emulating Control Strategy for Three-Phase Current Source Rectifier Under Unbalanced Grid Voltages' in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/tcasII/LinSXXSZ22> dblp:authoredBy <https://dblp.org/pid/62/6846-1> . <https://dblp.org/rec/journals/tcasII/LinSXXSZ22> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Did Yao Sun publish the paper 'Conductance Emulating Control Strategy for Three-Phase Current Source Rectifier Under Unbalanced Grid Voltages' in the last nine years?"],"info":{}}
{"id":"train_1066","question":"Did Klawitter, Jonathan publish in Discret. Math. Theor. Comput. Sci. in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/168/8735> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn 'Discret. Math. Theor. Comput. Sci.' }","paraphrases":["Has Klawitter, Jonathan published in Discret. Math. Theor. Comput. Sci. in the last 6 years?"],"info":{}}
{"id":"train_1067","question":"Did Penglin Dai publish in CoRR in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/159/6594> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) . ?x dblp:publishedIn 'CoRR' }","paraphrases":["Has Penglin Dai published in CoRR in the last 4 years?"],"info":{}}
{"id":"train_1068","question":"Was the paper 'Q-learning based dynamic task scheduling for energy-efficient cloud computing' published by the person named Qian Yin?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/fgcs/DingFZKYZ20> dblp:authoredBy <https://dblp.org/pid/46/758> }","paraphrases":["Did Q. Yin publish the paper 'Q-learning based dynamic task scheduling for energy-efficient cloud computing'?"],"info":{}}
{"id":"train_1069","question":"Did Blatter, Christian publish in Am. Math. Mon. in the last 6 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/41/4960> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -6 ) . ?x dblp:publishedIn 'Am. Math. Mon.' }","paraphrases":["Has Blatter, Christian published in Am. Math. Mon. in the last six years?"],"info":{}}
{"id":"train_1070","question":"Was the paper 'Analytical expressions for the ergodic capacities of certain MIMO systems by the Mellin transform' published by the person named Ramakrishna Janaswamy?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/globecom/Janaswamy03> dblp:authoredBy <https://dblp.org/pid/73/6748> }","paraphrases":["Did Ramakrishna Janaswamy publish the paper 'Analytical expressions for the ergodic capacities of certain MIMO systems by the Mellin transform'?"],"info":{}}
{"id":"train_1071","question":"Have Nicolae Paraschiv and Olteanu, Marius co-authored the paper 'The influence of random numbers generators upon genetic algorithms'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ijris/OlteanuP13> dblp:authoredBy <https://dblp.org/pid/97/8800> . <https://dblp.org/rec/journals/ijris/OlteanuP13> dblp:authoredBy <https://dblp.org/pid/164/2220> }","paraphrases":["Was the paper 'The influence of random numbers generators upon genetic algorithms' co-authored by Nicolae Paraschiv and Olteanu, Marius?"],"info":{}}
{"id":"train_1072","question":"Did Santana, R. publish the paper 'A Markov Network Based Factorized Distribution Algorithm for Optimization'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecml/Santana03> dblp:authoredBy <https://dblp.org/pid/46/592> }","paraphrases":["Was the paper 'A Markov Network Based Factorized Distribution Algorithm for Optimization' published by the author Santana, R.?"],"info":{}}
{"id":"train_1073","question":"Did Joung Woo Ryu publish in PAISI in the last seven years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/39/4486> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -7 ) . ?x dblp:publishedIn 'PAISI' }","paraphrases":["Has Joung Woo Ryu published in PAISI in the last seven years?"],"info":{}}
{"id":"train_1075","question":"Was the paper 'Compartmental diffusion and microstructural properties of human brain gray and white matter studied with double diffusion encoding magnetic resonance spectroscopy of metabolites and water' co-authored by Itamar Ronen and Andrew G. Webb?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/neuroimage/LundellNBKWR21> dblp:authoredBy <https://dblp.org/pid/36/10728> . <https://dblp.org/rec/journals/neuroimage/LundellNBKWR21> dblp:authoredBy <https://dblp.org/pid/01/3369> }","paraphrases":["Have Itamar R. and A. G. Webb co-authored the paper 'Compartmental diffusion and microstructural properties of human brain gray and white matter studied with double diffusion encoding magnetic resonance spectroscopy of metabolites and water'?"],"info":{}}
{"id":"train_1076","question":"Did Eyvind Fossbakk publish the paper 'An MPEG-21 framework for streaming media' in International Workshop on Multimedia Signal Processing?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/mmsp/FossbakkMYP01> dblp:authoredBy <https://dblp.org/pid/147/0964> . <https://dblp.org/rec/conf/mmsp/FossbakkMYP01> dblp:publishedIn 'MMSP' }","paraphrases":["Was the paper 'An MPEG-21 framework for streaming media' published by Eyvind F. in International Workshop on Multimedia Signal Processing?"],"info":{}}
{"id":"train_1077","question":"Was the paper 'A novel discretization algorithm based on multi-scale and information entropy' co-authored by Qingxia Yin and Xun, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/apin/XunYZYC21> dblp:authoredBy <https://dblp.org/pid/278/9638> . <https://dblp.org/rec/journals/apin/XunYZYC21> dblp:authoredBy <https://dblp.org/pid/176/1092> }","paraphrases":["Did Qingxia Yin and Yaling Xun co-author the paper 'A novel discretization algorithm based on multi-scale and information entropy'?"],"info":{}}
{"id":"train_1078","question":"Was the paper 'Counting Bases of Representable Matroids' published by Michael Snook in Electron. J. Comb.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/combinatorics/Snook12> dblp:authoredBy <https://dblp.org/pid/128/5489> . <https://dblp.org/rec/journals/combinatorics/Snook12> dblp:publishedIn 'Electron. J. Comb.' }","paraphrases":["Did Snook, Michael publish the paper 'Counting Bases of Representable Matroids' in Electron. J. Comb.?"],"info":{}}
{"id":"train_1079","question":"Was the paper 'Effects of Wind Conditions on Wind Turbine Temperature Monitoring and Solution Based on Wind Condition Clustering and IGA-ELM' published by the author Zhuang, Shengxian?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/HouZ22> dblp:authoredBy <https://dblp.org/pid/179/0203> }","paraphrases":["Did Zhuang, Shengxian publish the paper 'Effects of Wind Conditions on Wind Turbine Temperature Monitoring and Solution Based on Wind Condition Clustering and IGA-ELM'?"],"info":{}}
{"id":"train_1081","question":"Did Hitzer, Eckhard publish the paper 'New Views of Crystal Symmetry' in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/Hitzer13e> dblp:authoredBy <https://dblp.org/pid/130/3791> . <https://dblp.org/rec/journals/corr/Hitzer13e> dblp:publishedIn 'CoRR' }","paraphrases":["Was the paper 'New Views of Crystal Symmetry' published by Eckhard Hitzer in CoRR?"],"info":{}}
{"id":"train_1083","question":"Did P. D. Turney publish the paper 'Exploiting Context When Learning to Classify' in the last four years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/cs-LG-0212035> dblp:authoredBy <https://dblp.org/pid/t/PeterDTurney> . <https://dblp.org/rec/journals/corr/cs-LG-0212035> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Did P. D. Turney publish the paper 'Exploiting Context When Learning to Classify' in the last 4 years?"],"info":{}}
{"id":"train_1085","question":"Did Zhang, C. publish the paper 'A new regularized restricted Boltzmann machine based on class preserving' in the last three years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/kbs/HuZJZ17> dblp:authoredBy <https://dblp.org/pid/69/5538-2> . <https://dblp.org/rec/journals/kbs/HuZJZ17> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["Did Chunxia Zhang publish the paper 'A new regularized restricted Boltzmann machine based on class preserving' in the last 3 years?"],"info":{}}
{"id":"train_1086","question":"Did Jonny Gustafsson publish the paper 'Internet-based preproduction system for holographic stereograms'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jei/Gustafsson01> dblp:authoredBy <https://dblp.org/pid/92/4090> }","paraphrases":["Was the paper 'Internet-based preproduction system for holographic stereograms' published by the author J. Gustafsson?"],"info":{}}
{"id":"train_1087","question":"Was the paper 'A comparison of the predictive potential of various vegetation indices for leaf chlorophyll content' published by Shichao Cui in Earth Sci. Informatics?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/esi/CuiZ17> dblp:authoredBy <https://dblp.org/pid/199/8478> . <https://dblp.org/rec/journals/esi/CuiZ17> dblp:publishedIn 'Earth Sci. Informatics' }","paraphrases":["Did Shichao Cui publish the paper 'A comparison of the predictive potential of various vegetation indices for leaf chlorophyll content' in Earth Sci. Informatics?"],"info":{}}
{"id":"train_1088","question":"Was the paper 'Automatic segmentation for neonatal phonocardiogram' published by the person V. Shelevytska?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/Gomez-QuintanaS21> dblp:authoredBy <https://dblp.org/pid/251/8657> }","paraphrases":["Was the paper 'Automatic segmentation for neonatal phonocardiogram' published by the author Victoriya Shelevytska?"],"info":{}}
{"id":"train_1089","question":"Did F. Seela publish the paper 'Oligonucleotides containing fluorescent 2'-deoxyisoinosine: solid-phase synthesis and duplex stability' in Nucleic Acids Res.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/nar/SeelaC95> dblp:authoredBy <https://dblp.org/pid/42/5568> . <https://dblp.org/rec/journals/nar/SeelaC95> dblp:publishedIn 'Nucleic Acids Res.' }","paraphrases":["Was the paper 'Oligonucleotides containing fluorescent 2'-deoxyisoinosine: solid-phase synthesis and duplex stability' published by Frank Seela in Nucleic Acids Res.?"],"info":{}}
{"id":"train_1090","question":"Was the paper 'Text Recognition in Real Scenarios with a Few Labeled Samples' published by the person Jinghuang L.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2006-12209> dblp:authoredBy <https://dblp.org/pid/267/9726> }","paraphrases":["Did Jinghuang Lin publish the paper 'Text Recognition in Real Scenarios with a Few Labeled Samples'?"],"info":{}}
{"id":"train_1092","question":"Was the paper 'TRF: Learning Kernels with Tuned Random Features' co-authored by Gupta, S. and S. Rana?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/aaai/Shilton0RVV22> dblp:authoredBy <https://dblp.org/pid/47/333-1> . <https://dblp.org/rec/conf/aaai/Shilton0RVV22> dblp:authoredBy <https://dblp.org/pid/57/6712> }","paraphrases":["Did Gupta, S. and Santu Rana co-author the paper 'TRF: Learning Kernels with Tuned Random Features'?"],"info":{}}
{"id":"train_1093","question":"Did Svitlana Vakulenko publish the paper 'QRFA: A Data-Driven Model of Information-Seeking Dialogues'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecir/VakulenkoRCR19> dblp:authoredBy <https://dblp.org/pid/132/4990> }","paraphrases":["Was the paper 'QRFA: A Data-Driven Model of Information-Seeking Dialogues' published by the person named Svitlana Vakulenko?"],"info":{}}
{"id":"train_1094","question":"Has Jan De Beule published in Discret. Math. in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/96/6052> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'Discret. Math.' }","paraphrases":["Did Jan D. Beule publish in Discret. Math. in the last 3 years?"],"info":{}}
{"id":"train_1095","question":"Was the paper 'UML Modeling of Network Topologies for Distributed Computer System' published by the author Vipin Saxena?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cit/SaxenaA09> dblp:authoredBy <https://dblp.org/pid/96/4985> }","paraphrases":["Did Saxena, V. publish the paper 'UML Modeling of Network Topologies for Distributed Computer System'?"],"info":{}}
{"id":"train_1097","question":"Did Liu, N. publish the paper 'Efficient kNN search in polyphonic music databases using a lower bounding mechanism' in the last 9 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/mms/LiuWC05> dblp:authoredBy <https://dblp.org/pid/83/4000> . <https://dblp.org/rec/journals/mms/LiuWC05> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Did Liu, N. publish the paper 'Efficient kNN search in polyphonic music databases using a lower bounding mechanism' in the last nine years?"],"info":{}}
{"id":"train_1098","question":"Was the paper 'Graph grammars, monadic second-order logic and the theory of graph minors' published by the person Bruno C.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/gst/Courcelle91> dblp:authoredBy <https://dblp.org/pid/c/BCourcelle> }","paraphrases":["Was the paper 'Graph grammars, monadic second-order logic and the theory of graph minors' published by the person named Bruno C.?"],"info":{}}
{"id":"train_1099","question":"Did Houman Zolfaghari and Gonzalo E. Reyes co-author the paper 'Bi-Heyting algebras, toposes and modalities'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jphil/ReyesZ96> dblp:authoredBy <https://dblp.org/pid/164/8463> . <https://dblp.org/rec/journals/jphil/ReyesZ96> dblp:authoredBy <https://dblp.org/pid/24/6661> }","paraphrases":["Have Zolfaghari, H. and Gonzalo E. Reyes co-authored the paper 'Bi-Heyting algebras, toposes and modalities'?"],"info":{}}
{"id":"train_1101","question":"Has Fanghui Xiao published in CHIIR in the last 8 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/223/0244> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) . ?x dblp:publishedIn 'CHIIR' }","paraphrases":["Did Fanghui Xiao publish in CHIIR in the last eight years?"],"info":{}}
{"id":"train_1102","question":"Did Ziqing Hu publish the paper 'Energetic Variational Neural Network Discretizations to Gradient Flows' in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2206-07303> dblp:authoredBy <https://dblp.org/pid/301/8254> . <https://dblp.org/rec/journals/corr/abs-2206-07303> dblp:publishedIn 'CoRR' }","paraphrases":["Was the paper 'Energetic Variational Neural Network Discretizations to Gradient Flows' published by Z. Hu in CoRR?"],"info":{}}
{"id":"train_1103","question":"Was the paper 'Ontology-driven information system and management of heterogeneous research data' published by Vcelak, P. in BMEI?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/bmei/VcelakKK14> dblp:authoredBy <https://dblp.org/pid/68/10619> . <https://dblp.org/rec/conf/bmei/VcelakKK14> dblp:publishedIn 'BMEI' }","paraphrases":["Did Petr Vcelak publish the paper 'Ontology-driven information system and management of heterogeneous research data' in BMEI?"],"info":{}}
{"id":"train_1105","question":"Was the paper 'A Learning-to-Rank Algorithm for Constructing Defect Prediction Models' co-authored by Xin Yao and X. Yang?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ideal/YangTY12> dblp:authoredBy <https://dblp.org/pid/26/3646> . <https://dblp.org/rec/conf/ideal/YangTY12> dblp:authoredBy <https://dblp.org/pid/22/7399> }","paraphrases":["Did Xin Yao and Xiaoxing Yang co-author the paper 'A Learning-to-Rank Algorithm for Constructing Defect Prediction Models'?"],"info":{}}
{"id":"train_1106","question":"Did Yue Luo publish in CVPR in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/00/4396> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -2 ) . ?x dblp:publishedIn 'CVPR' }","paraphrases":["Has Yue Luo published in IEEE Conference on Computer Vision and Pattern Recognition in the last two years?"],"info":{}}
{"id":"train_1107","question":"Did X. Hao publish the paper 'Differential evolution with multi-stage strategies for global optimization' in IEEE Congress on Evolutionary Computation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cec/ZhouZHYX16> dblp:authoredBy <https://dblp.org/pid/183/9007> . <https://dblp.org/rec/conf/cec/ZhouZHYX16> dblp:publishedIn 'CEC' }","paraphrases":["Was the paper 'Differential evolution with multi-stage strategies for global optimization' published by X. Hao in CEC?"],"info":{}}
{"id":"train_1108","question":"Was the paper 'Optimal Pilot Symbols Ratio in Terms of Spectrum and Energy Efficiency in Uplink CoMP Networks' published by the person named Zhang, Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vtc/ZhangCW17> dblp:authoredBy <https://dblp.org/pid/139/5876-2> }","paraphrases":["Was the paper 'Optimal Pilot Symbols Ratio in Terms of Spectrum and Energy Efficiency in Uplink CoMP Networks' published by the author Yuhao Zhang?"],"info":{}}
{"id":"train_1109","question":"Was the paper 'Statistically Secure Anti-Collusion Code Design for Median Attack Robustness for Practical Fingerprinting' co-authored by Seong-Whan Kim and Seol, J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ih/SeolK06> dblp:authoredBy <https://dblp.org/pid/61/1921> . <https://dblp.org/rec/conf/ih/SeolK06> dblp:authoredBy <https://dblp.org/pid/99/2718> }","paraphrases":["Have Kim, Seong-Whan and Jae-Min Seol co-authored the paper 'Statistically Secure Anti-Collusion Code Design for Median Attack Robustness for Practical Fingerprinting'?"],"info":{}}
{"id":"train_1110","question":"Did Pfahringer, B. publish the paper 'Classifier Chains: A Review and Perspectives'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jair/ReadPHF21> dblp:authoredBy <https://dblp.org/pid/10/140> }","paraphrases":["Was the paper 'Classifier Chains: A Review and Perspectives' published by the person Bernhard Pfahringer?"],"info":{}}
{"id":"train_1112","question":"Did Sims, Charles C. publish the paper 'Complexity Issues in Infinite Group Theory' in Groups And Computation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/dimacs/Sims91> dblp:authoredBy <https://dblp.org/pid/47/4552> . <https://dblp.org/rec/conf/dimacs/Sims91> dblp:publishedIn 'Groups And Computation' }","paraphrases":["Was the paper 'Complexity Issues in Infinite Group Theory' published by Sims, Charles C. in Groups And Computation?"],"info":{}}
{"id":"train_1115","question":"Did V. A. Lesnikov publish the paper 'Approximation of the central chi-squared distribution for on-line computation of the threshold for energy detector'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ewdts/LesnikovNCD16> dblp:authoredBy <https://dblp.org/pid/17/11070> }","paraphrases":["Was the paper 'Approximation of the central chi-squared distribution for on-line computation of the threshold for energy detector' published by the person V. A. Lesnikov?"],"info":{}}
{"id":"train_1116","question":"Did Kurt Fuchel publish the paper 'Considerations in the design of a multiple computer system with extended core storage' in Commun. ACM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cacm/Fuchel68> dblp:authoredBy <https://dblp.org/pid/67/5343> . <https://dblp.org/rec/journals/cacm/Fuchel68> dblp:publishedIn 'Commun. ACM' }","paraphrases":["Was the paper 'Considerations in the design of a multiple computer system with extended core storage' published by Kurt Fuchel in Commun. ACM?"],"info":{}}
{"id":"train_1117","question":"Did Elliott, Madison publish the paper 'LSQT: Low-Stretch Quasi-Trees for Bundling and Layout' in the last eight years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2007-06237> dblp:authoredBy <https://dblp.org/pid/235/5659> . <https://dblp.org/rec/journals/corr/abs-2007-06237> dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -8 ) }","paraphrases":["Did Elliott, Madison publish the paper 'LSQT: Low-Stretch Quasi-Trees for Bundling and Layout' in the last 8 years?"],"info":{}}
{"id":"train_1118","question":"Did Jing-Shiang Cheng publish in ICC in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { ?x dblp:authoredBy <https://dblp.org/pid/23/4185> . ?x dblp:yearOfPublication ?y . FILTER ( ?y > YEAR ( NOW () ) -3 ) . ?x dblp:publishedIn 'ICC' }","paraphrases":["Has Jing-Shiang Cheng published in ICC in the last 3 years?"],"info":{}}
