{"id":"train_2262","question":"In IPAW and Scientometrics, what papers did Deborah L. McGuinness publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/m/DLMcGuinness> { ?answer dblp:publishedIn 'IPAW' } UNION { ?answer dblp:publishedIn 'Scientometrics' } }","paraphrases":["What papers did Deborah L. McGuinness publish in IPAW and Scientometrics?"],"info":{}}
{"id":"train_2263","question":"List all the papers that Paletta, Maur\\u00EDcio and Pilar Herrero published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/90/4707> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/40/6392> } }","paraphrases":["What are the papers that Paletta, Maur\\u00EDcio and Pilar Herrero published?"],"info":{}}
{"id":"train_2264","question":"What papers did Lorena Pradenas publish in HM and Int. J. RF Technol. Res. Appl.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/17/2660> { ?answer dblp:publishedIn 'HM' } UNION { ?answer dblp:publishedIn 'Int. J. RF Technol. Res. Appl.' } }","paraphrases":["In HM and Int. J. RF Technol. Res. Appl., what papers did Pradenas, Lorena publish?"],"info":{}}
{"id":"train_2265","question":"List all the papers that X. Huang and Kai Yu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/00/2922> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/197/1322> } }","paraphrases":["What are the papers that X. Huang and Kai Yu published?"],"info":{}}
{"id":"train_2266","question":"What papers did Robert E. McCauley publish in MIS Q. and Electron. Notes Theor. Comput. Sci.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/158/3110> { ?answer dblp:publishedIn 'MIS Q.' } UNION { ?answer dblp:publishedIn 'Electron. Notes Theor. Comput. Sci.' } }","paraphrases":["In MIS Q. and Electron. Notes Theor. Comput. Sci., what papers did Robert E. McCauley publish?"],"info":{}}
{"id":"train_2268","question":"List all the papers that A. Sharang and Deepak Pathak published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/150/6958> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/155/9860> } }","paraphrases":["What are the papers that Abhijit Sharang and Deepak Pathak published?"],"info":{}}
{"id":"train_2269","question":"List all the papers that Scott B. Huffman and Randal V. Zoeller published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/08/2678> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/97/5297> } }","paraphrases":["What are the papers that Scott B. Huffman and Randal V. Zoeller published?"],"info":{}}
{"id":"train_2270","question":"In Wirel. Pers. Commun. and National Conference of the American Association for Artificial Intelligence, what papers did Chinmoy Kundu publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/70/11154> { ?answer dblp:publishedIn 'Wirel. Pers. Commun.' } UNION { ?answer dblp:publishedIn 'AAAI' } }","paraphrases":["What papers did Kundu, C. publish in Wirel. Pers. Commun. and AAAI?"],"info":{}}
{"id":"train_2271","question":"In CoRR and RO-MAN, what papers did Dover, Thomas P. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/129/1227> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'RO-MAN' } }","paraphrases":["What papers did Thomas P. Dover publish in CoRR and RO-MAN?"],"info":{}}
{"id":"train_2272","question":"In Organ. Sci. and DBSec, what papers did Joseph Kolars publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/149/8322> { ?answer dblp:publishedIn 'Organ. Sci.' } UNION { ?answer dblp:publishedIn 'DBSec' } }","paraphrases":["What papers did J. Kolars publish in Organ. Sci. and IFIP WG 11.3 Working Conference on Data and Applications Security?"],"info":{}}
{"id":"train_2274","question":"In Euro-Par, Vol. II and ICRA, what papers did Wierum, J. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/2111> { ?answer dblp:publishedIn 'Euro-Par, Vol. II' } UNION { ?answer dblp:publishedIn 'ICRA' } }","paraphrases":["What papers did Jens-Michael Wierum publish in Euro-Par, Vol. II and ICRA?"],"info":{}}
{"id":"train_2275","question":"In Signal Process. Image Commun. and J. Heuristics, what papers did Rin-Chul K. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/47/6856> { ?answer dblp:publishedIn 'Signal Process. Image Commun.' } UNION { ?answer dblp:publishedIn 'J. Heuristics' } }","paraphrases":["What papers did Rin-Chul K. publish in Signal Process. Image Commun. and J. Heuristics?"],"info":{}}
{"id":"train_2277","question":"List all the papers that Zhuang, J. and Haiming Chen published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/238/6759> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/75/248> } }","paraphrases":["What are the papers that Jianhui Zhuang and Haiming Chen published?"],"info":{}}
{"id":"train_2278","question":"What are the papers that R. Montante and Barbara M. Anthony published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/96/6481> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/88/6938> } }","paraphrases":["List all the papers that Robert Montante and Anthony, B. M. published."],"info":{}}
{"id":"train_2280","question":"What papers did Mitchell G. Spiegel publish in SIGMETRICS Perform. Evaluation Rev. and Living Machines?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/60/1604> { ?answer dblp:publishedIn 'SIGMETRICS Perform. Evaluation Rev.' } UNION { ?answer dblp:publishedIn 'Living Machines' } }","paraphrases":["In SIGMETRICS Perform. Evaluation Rev. and Living Machines, what papers did Mitchell G. Spiegel publish?"],"info":{}}
{"id":"train_2281","question":"What papers did Anglin, G. J. publish in J. Comput. High. Educ. and WASSA@NAACL-HLT?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/70/8831> { ?answer dblp:publishedIn 'J. Comput. High. Educ.' } UNION { ?answer dblp:publishedIn 'WASSA@NAACL-HLT' } }","paraphrases":["In J. Comput. High. Educ. and WASSA@NAACL-HLT, what papers did Gary J. Anglin publish?"],"info":{}}
{"id":"train_2282","question":"List all the papers that J. T. Kao and Anantha P. Chandrakasan published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/135/2049> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/c/AnanthaChandrakasan> } }","paraphrases":["What are the papers that James T. Kao and Chandrakasan, A. P. published?"],"info":{}}
{"id":"train_2283","question":"What are the papers that Oded B. and David S. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/77/5325> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/09/2807> } }","paraphrases":["List all the papers that Oded B. and David S. published."],"info":{}}
{"id":"train_2284","question":"What are the papers that Jaegul Choo and Jihoon Kim published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/07/2074> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/51/4060> } }","paraphrases":["List all the papers that Jaegul C. and Jihoon Kim published."],"info":{}}
{"id":"train_2287","question":"In DASC/PiCom/DataCom/CyberSciTech and IEEE International Conference on Image Processing, what papers did Xiaowei Zhao publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/02/8134> { ?answer dblp:publishedIn 'DASC/PiCom/DataCom/CyberSciTech' } UNION { ?answer dblp:publishedIn 'ICIP' } }","paraphrases":["What papers did Zhao, X. publish in DASC/PiCom/DataCom/CyberSciTech and ICIP?"],"info":{}}
{"id":"train_2288","question":"What are the papers that Hans-Arno J. and Kaiwen Zhang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/j/HansArnoJacobsen> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/12/4550-1> } }","paraphrases":["List all the papers that Hans-Arno Jacobsen and Kaiwen Zhang published."],"info":{}}
{"id":"train_2289","question":"List all the papers that Celso B. M. Ribeiro and Leonardo G. da Fonseca published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/278/7443> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/04/6144> } }","paraphrases":["What are the papers that Celso B. M. Ribeiro and Leonardo G. da Fonseca published?"],"info":{}}
{"id":"train_2290","question":"What papers did Jay Kishigami publish in IET Cyper-Phys. Syst.: Theory & Appl. and J. Intell. Robotic Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/152/4195> { ?answer dblp:publishedIn 'IET Cyper-Phys. Syst.: Theory & Appl.' } UNION { ?answer dblp:publishedIn 'J. Intell. Robotic Syst.' } }","paraphrases":["In IET Cyper-Phys. Syst.: Theory & Appl. and J. Intell. Robotic Syst., what papers did Jay Kishigami publish?"],"info":{}}
{"id":"train_2291","question":"What papers did Robert P. Biuk-Aghai publish in Int. Sym. Wikis and Comput. Graph. Forum?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/52/2541> { ?answer dblp:publishedIn 'Int. Sym. Wikis' } UNION { ?answer dblp:publishedIn 'Comput. Graph. Forum' } }","paraphrases":["In Int. Sym. Wikis and Comput. Graph. Forum, what papers did Robert P. Biuk-Aghai publish?"],"info":{}}
{"id":"train_2293","question":"List all the primary affiliations of Hannes Hartenstein and H. K\\u00FChner.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/25/2112> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/34/9064> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Hartenstein, H. and H. K\\u00FChner?"],"info":{}}
{"id":"train_2295","question":"List all the papers that Massimiliano Forliti and Marco D. Marinis published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/39/4478> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/32/4547> } }","paraphrases":["What are the papers that Forliti, M. and Marco De Marinis published?"],"info":{}}
{"id":"train_2296","question":"What are the papers that O. Scherzer and Lingyun Qiu published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/38/5361> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/13/6620> } }","paraphrases":["List all the papers that O. Scherzer and Lingyun Q. published."],"info":{}}
{"id":"train_2297","question":"List all the papers that Allison R. B. Tyler and Alexandria J. Rayburn published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/239/3113> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/300/2320> } }","paraphrases":["What are the papers that A. R. B. Tyler and Alexandria Jane Rayburn published?"],"info":{}}
{"id":"train_2299","question":"List all the papers that Tak Hur and Daniel K. Park published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/315/6166> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/86/2050> } }","paraphrases":["What are the papers that Tak Hur and Daniel K. Park published?"],"info":{}}
{"id":"train_2300","question":"List all the papers that J. Nezan and D. M\\u00E9nard published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/99/3613> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/14/1517> } }","paraphrases":["What are the papers that J. Nezan and D. M\\u00E9nard published?"],"info":{}}
{"id":"train_2302","question":"What are the papers that X. Liang and Zichao Y. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/136/0900> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/07/8707> } }","paraphrases":["List all the papers that Xiaodan Liang and Zichao Yang published."],"info":{}}
{"id":"train_2303","question":"What papers did Daniel L. Noneaker publish in ICC and ONDM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/04/3943> { ?answer dblp:publishedIn 'ICC' } UNION { ?answer dblp:publishedIn 'ONDM' } }","paraphrases":["In ICC and ONDM, what papers did Daniel L. Noneaker publish?"],"info":{}}
{"id":"train_2305","question":"List all the papers that Tilman Dingler and Kai Kunze published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/79/8692> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/44/5109> } }","paraphrases":["What are the papers that Tilman Dingler and Kunze, Kai published?"],"info":{}}
{"id":"train_2307","question":"List all the papers that Abramov, S. A. and M. van Hoeij published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/64/1312> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/26/5663> } }","paraphrases":["What are the papers that Abramov, S. A. and Mark van Hoeij published?"],"info":{}}
{"id":"train_2308","question":"In CoRR and ISSRE Workshops, what papers did Alexander Lavin publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/163/1808> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'ISSRE Workshops' } }","paraphrases":["What papers did Lavin, A. publish in CoRR and ISSRE Workshops?"],"info":{}}
{"id":"train_2309","question":"In CoRR and IEEE Trans. Ind. Electron., what papers did Stefan Rothe publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/249/2595> { ?answer dblp:publishedIn 'CoRR' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Ind. Electron.' } }","paraphrases":["What papers did Rothe, S. publish in CoRR and IEEE Trans. Ind. Electron.?"],"info":{}}
{"id":"train_2310","question":"List all the papers that Sim\\u00E3o Melo de Sousa and Yiran Xu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/35/5844> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/122/5246> } }","paraphrases":["What are the papers that Sousa, Sim\\u00E3o Melo de and Y. Xu published?"],"info":{}}
{"id":"train_2311","question":"What papers did Luming Zhang publish in Adv. Comput. Math. and J. Artif. Soc. Soc. Simul.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/73/2476> { ?answer dblp:publishedIn 'Adv. Comput. Math.' } UNION { ?answer dblp:publishedIn 'J. Artif. Soc. Soc. Simul.' } }","paraphrases":["In Adv. Comput. Math. and J. Artif. Soc. Soc. Simul., what papers did Luming Zhang publish?"],"info":{}}
{"id":"train_2312","question":"In AICT/ICIW and Discret. Math., what papers did Elliot A. Vargas-Figueroa publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/48/5051> { ?answer dblp:publishedIn 'AICT/ICIW' } UNION { ?answer dblp:publishedIn 'Discret. Math.' } }","paraphrases":["What papers did Elliot A. Vargas-Figueroa publish in AICT/ICIW and Discret. Math.?"],"info":{}}
{"id":"train_2313","question":"In BCS HCI and DATE, what papers did Henriksen-Bulmer, Jane publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/190/9476> { ?answer dblp:publishedIn 'BCS HCI' } UNION { ?answer dblp:publishedIn 'DATE' } }","paraphrases":["What papers did Henriksen-Bulmer, Jane publish in BCS HCI and DATE?"],"info":{}}
{"id":"train_2314","question":"What papers did Mircea M. publish in WRLA@ETAPS and MeMeA?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/98/1023> { ?answer dblp:publishedIn 'WRLA@ETAPS' } UNION { ?answer dblp:publishedIn 'MeMeA' } }","paraphrases":["In WRLA@ETAPS and MeMeA, what papers did Mircea M. publish?"],"info":{}}
{"id":"train_2316","question":"List all the papers that Giuseppe De Santis and V. Walter Anelli published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/204/3599> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/171/0384> } }","paraphrases":["What are the papers that Giuseppe De Santis and Vito Walter Anelli published?"],"info":{}}
{"id":"train_2317","question":"In SBSC and Conference on Information Sciences and Systems, what papers did Amandi, A. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/47/3034> { ?answer dblp:publishedIn 'SBSC' } UNION { ?answer dblp:publishedIn 'CISS' } }","paraphrases":["What papers did Amandi, A. publish in SBSC and Conference on Information Sciences and Systems?"],"info":{}}
{"id":"train_2318","question":"List all the papers that Patricia H. Rodr\\u00EDguez and Alonso, J. B. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/94/9014> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/61/6223> } }","paraphrases":["What are the papers that Patricia Henr\\u00EDquez Rodr\\u00EDguez and Jes\\u00FAs B. Alonso published?"],"info":{}}
{"id":"train_2319","question":"What papers did Neil C. Randall publish in SIGDOC and MILCOM?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/374> { ?answer dblp:publishedIn 'SIGDOC' } UNION { ?answer dblp:publishedIn 'MILCOM' } }","paraphrases":["In SIGDOC and MILCOM, what papers did Randall, N. C. publish?"],"info":{}}
{"id":"train_2320","question":"List all the primary affiliations of Stanley T. Birchfield and Chen, Zhichao.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/b/StanBirchfield> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/16/5141> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Stanley T. Birchfield and Chen, Zhichao?"],"info":{}}
{"id":"train_2321","question":"List all the papers that T. M. Schuck and Yan, X. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/68/10890> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/07/1397> } }","paraphrases":["What are the papers that T. M. Schuck and Yan, X. published?"],"info":{}}
{"id":"train_2323","question":"In Neurocomputing and Neural Networks, what papers did Hongming Yang publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/5920> { ?answer dblp:publishedIn 'Neurocomputing' } UNION { ?answer dblp:publishedIn 'Neural Networks' } }","paraphrases":["What papers did Yang, H. publish in Neurocomputing and Neural Networks?"],"info":{}}
{"id":"train_2324","question":"What are the papers that Alan Thorogood and David Hwang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/93/4225> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/56/4252> } }","paraphrases":["List all the papers that Alan T. and David Hwang published."],"info":{}}
{"id":"train_2325","question":"What papers did Shuilin Liu publish in ICMC and J. Electr. Comput. Eng.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/176/0486> { ?answer dblp:publishedIn 'ICMC' } UNION { ?answer dblp:publishedIn 'J. Electr. Comput. Eng.' } }","paraphrases":["In ICMC and J. Electr. Comput. Eng., what papers did S. Liu publish?"],"info":{}}
{"id":"train_2326","question":"What papers did Ryan C. publish in Sensors and ASPLOS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/250/4832> { ?answer dblp:publishedIn 'Sensors' } UNION { ?answer dblp:publishedIn 'ASPLOS' } }","paraphrases":["In Sensors and Architectural Support for Programming Languages and Operating Systems, what papers did Ryan Carter publish?"],"info":{}}
{"id":"train_2327","question":"What papers did Japjot S. Bawa publish in IEEE ANTS and Astron. Comput.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/268/3855> { ?answer dblp:publishedIn 'IEEE ANTS' } UNION { ?answer dblp:publishedIn 'Astron. Comput.' } }","paraphrases":["In IEEE ANTS and Astron. Comput., what papers did Japjot Singh Bawa publish?"],"info":{}}
{"id":"train_2328","question":"In TAPAS and Data Compression Conference, what papers did H. Sun publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/00/2118> { ?answer dblp:publishedIn 'TAPAS' } UNION { ?answer dblp:publishedIn 'Data Compression Conference' } }","paraphrases":["What papers did H. Sun publish in TAPAS and Data Compression Conference?"],"info":{}}
{"id":"train_2331","question":"In J. Open Source Softw. and CCGRID, what papers did Robert Podgorney publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/257/8065> { ?answer dblp:publishedIn 'J. Open Source Softw.' } UNION { ?answer dblp:publishedIn 'CCGRID' } }","paraphrases":["What papers did Robert P. publish in J. Open Source Softw. and IEEE International Symposium on Cluster, Cloud and Grid Computing?"],"info":{}}
{"id":"train_2334","question":"What papers did Breitenecker, F. publish in Simul. Model. Pract. Theory and CLUSTER?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/1158> { ?answer dblp:publishedIn 'Simul. Model. Pract. Theory' } UNION { ?answer dblp:publishedIn 'CLUSTER' } }","paraphrases":["In Simul. Model. Pract. Theory and IEEE International Conference on Cluster Computing, what papers did Felix Breitenecker publish?"],"info":{}}
{"id":"train_2336","question":"What papers did Nadia Pantidi publish in CHI and MEDES?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/35/1264> { ?answer dblp:publishedIn 'CHI' } UNION { ?answer dblp:publishedIn 'MEDES' } }","paraphrases":["In CHI and MEDES, what papers did N. Pantidi publish?"],"info":{}}
{"id":"train_2338","question":"What papers did R. Rymon publish in ACM International Conference on Knowledge Discovery and Data Mining and IEEE Trans. Wirel. Commun.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/90/5745> { ?answer dblp:publishedIn 'KDD' } UNION { ?answer dblp:publishedIn 'IEEE Trans. Wirel. Commun.' } }","paraphrases":["In KDD and IEEE Trans. Wirel. Commun., what papers did R. Rymon publish?"],"info":{}}
{"id":"train_2339","question":"What are the primary affiliations of L. Guilherme Uzeda Garcia and Fran\\u00E7ois Baccelli?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/201/2498> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/b/FrancoisBaccelli> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Luis Guilherme Uzeda Garcia and Fran\\u00E7ois Baccelli."],"info":{}}
{"id":"train_2340","question":"List all the papers that Paal E. Engelstad and Aleksander Bai published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/e/PaalEngelstad> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/160/6282> } }","paraphrases":["What are the papers that Engelstad, Paal E. and Aleksander Bai published?"],"info":{}}
{"id":"train_2342","question":"List all the primary affiliations of Mayank V. and Afzel Noore.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/58/323> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/41/6759> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Mayank Vatsa and Noore, Afzel?"],"info":{}}
{"id":"train_2343","question":"In DepCoS-RELCOMEX and AHFE (4), what papers did Kisiel, T. publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/181/6076> { ?answer dblp:publishedIn 'DepCoS-RELCOMEX' } UNION { ?answer dblp:publishedIn 'AHFE (4)' } }","paraphrases":["What papers did Tomasz Kisiel publish in DepCoS-RELCOMEX and AHFE?"],"info":{}}
{"id":"train_2344","question":"What papers did Chunsheng L. publish in Int. J. Commun. Syst. and International Symposium on Neural Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/63/623> { ?answer dblp:publishedIn 'Int. J. Commun. Syst.' } UNION { ?answer dblp:publishedIn 'ISNN (2)' } }","paraphrases":["In Int. J. Commun. Syst. and International Symposium on Neural Networks, what papers did Chunsheng L. publish?"],"info":{}}
{"id":"train_2346","question":"List all the papers that S. Noor Mahammad and Shanmugakumar Murugesan published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/152/3821> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/208/0227> } }","paraphrases":["What are the papers that S. Noor Mahammad and Shanmugakumar Murugesan published?"],"info":{}}
{"id":"train_2347","question":"In CIRA and SimVis, what papers did Joe Saunders publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/55/6417> { ?answer dblp:publishedIn 'CIRA' } UNION { ?answer dblp:publishedIn 'SimVis' } }","paraphrases":["What papers did J. Saunders publish in CIRA and SimVis?"],"info":{}}
{"id":"train_2348","question":"In IEEE Trans. Ind. Electron. and CoRR, what papers did Y. Zhang publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/119/3836> { ?answer dblp:publishedIn 'IEEE Trans. Ind. Electron.' } UNION { ?answer dblp:publishedIn 'CoRR' } }","paraphrases":["What papers did Yongchang Zhang publish in IEEE Trans. Ind. Electron. and CoRR?"],"info":{}}
{"id":"train_2349","question":"What papers did Piqueras, Santiago publish in IberSPEECH and J. Frankl. Inst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/153/4527> { ?answer dblp:publishedIn 'IberSPEECH' } UNION { ?answer dblp:publishedIn 'J. Frankl. Inst.' } }","paraphrases":["In IberSPEECH and J. Frankl. Inst., what papers did Piqueras, Santiago publish?"],"info":{}}
{"id":"train_2350","question":"What papers did Recasens, Marta publish in Language Resources and Evaluation Conference and IV?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/28/5369> { ?answer dblp:publishedIn 'LREC' } UNION { ?answer dblp:publishedIn 'IV' } }","paraphrases":["In LREC and IV, what papers did Marta Recasens publish?"],"info":{}}
{"id":"train_2352","question":"In Econometrics of Risk and DCC, what papers did Niwattisaiwong Seksiri publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/164/2727> { ?answer dblp:publishedIn 'Econometrics of Risk' } UNION { ?answer dblp:publishedIn 'DCC' } }","paraphrases":["What papers did Niwattisaiwong S. publish in Econometrics of Risk and DCC?"],"info":{}}
{"id":"train_2353","question":"List all the primary affiliations of Hong, Y. and Huang, Nina.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/66/5863-2> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/254/7312> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Yili Hong and Huang, Nina?"],"info":{}}
{"id":"train_2354","question":"List all the primary affiliations of Rajan, B. Sundar and Ganesan, Abhinav.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/r/BSundarRajan> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/46/10835> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of B. Sundar Rajan and Abhinav Ganesan?"],"info":{}}
{"id":"train_2355","question":"What are the primary affiliations of Qi Yu and Yu Kong?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/58/6957-1> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/55/3630> dblp:primaryAffiliation ?answer } }","paraphrases":["List all the primary affiliations of Qi Yu and Yu K.."],"info":{}}
{"id":"train_2356","question":"List all the primary affiliations of Nan Guo and T. Gao.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { { <https://dblp.org/pid/42/617> dblp:primaryAffiliation ?answer } UNION { <https://dblp.org/pid/22/6267> dblp:primaryAffiliation ?answer } }","paraphrases":["What are the primary affiliations of Nan Guo and T. Gao?"],"info":{}}
