{"id":"train_6063","question":"In 2005 in IEICE Trans. Inf. Syst., who are the authors that published papers about Bayesian approach?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ieicet/JitsuhiroN05> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ieicet/JitsuhiroN05> dblp:publishedIn 'IEICE Trans. Inf. Syst.' . <https://dblp.org/rec/journals/ieicet/JitsuhiroN05> dblp:yearOfPublication '2005' }","paraphrases":["Who are the authors that published papers about Bayesian approach in IEICE Trans. Inf. Syst. in 2005?"],"info":{}}
{"id":"train_6064","question":"In 2008 in CSTST, who are the authors that published papers about Tech products?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/wstst/LiA08> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/wstst/LiA08> dblp:publishedIn 'CSTST' . <https://dblp.org/rec/conf/wstst/LiA08> dblp:yearOfPublication '2008' }","paraphrases":["In the year 2008 in CSTST, who are the authors that published research papers about Tech products?"],"info":{}}
{"id":"train_6065","question":"What are the titles of the papers on Logic analysis that were published in J. Appl. Log. in 2015?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/japll/NovakHHS15> dblp:publishedIn 'J. Appl. Log.' . <https://dblp.org/rec/journals/japll/NovakHHS15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/journals/japll/NovakHHS15> dblp:title ?answer }","paraphrases":["In J. Appl. Log. in 2015, what are the titles of the papers on Logic analysis?"],"info":{}}
{"id":"train_6066","question":"In the year 2015 in IEEE Trans. Geosci. Remote. Sens., what are the titles of the research papers on Squint range?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tgrs/WangLCNY15> dblp:publishedIn 'IEEE Trans. Geosci. Remote. Sens.' . <https://dblp.org/rec/journals/tgrs/WangLCNY15> dblp:yearOfPublication '2015' . <https://dblp.org/rec/journals/tgrs/WangLCNY15> dblp:title ?answer }","paraphrases":["In 2015 in IEEE Trans. Geosci. Remote. Sens., what are the titles of the papers on Squint range?"],"info":{}}
{"id":"train_6067","question":"In 2020 in NFV-SDN, who are the authors that published papers about Edge services?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/nfvsdn/KourtisAKWOXCYK20> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/nfvsdn/KourtisAKWOXCYK20> dblp:publishedIn 'NFV-SDN' . <https://dblp.org/rec/conf/nfvsdn/KourtisAKWOXCYK20> dblp:yearOfPublication '2020' }","paraphrases":["In the year 2020 in NFV-SDN, who are the authors that published research papers about Edge services?"],"info":{}}
{"id":"train_6068","question":"University of California Irvine, CA, USA published a paper on Communication speed selection in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/codes/LiuCB02> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of California Irvine, CA, USA' . <https://dblp.org/rec/conf/codes/LiuCB02> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Communication speed selection by University of California Irvine, CA, USA published?"],"info":{}}
{"id":"train_6069","question":"When was the paper on Quality assessment by University of Waterloo, Canada published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tip/MaZZW15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Waterloo, Canada' . <https://dblp.org/rec/journals/tip/MaZZW15> dblp:yearOfPublication ?answer }","paraphrases":["University of Waterloo published a paper on Quality assessment in what year?"],"info":{}}
{"id":"train_6070","question":"In 2018 in CoRR, what are the titles of the papers on Software engineers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-1810-02685> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-1810-02685> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/corr/abs-1810-02685> dblp:title ?answer }","paraphrases":["In the year 2018 in CoRR, what are the titles of the research papers on Software engineers?"],"info":{}}
{"id":"train_6071","question":"In 2014 in CoRR, who are the authors that published papers about Time systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/DavoudM14> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/DavoudM14> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/DavoudM14> dblp:yearOfPublication '2014' }","paraphrases":["In the year 2014 in CoRR, who are the authors that published research papers about Time systems?"],"info":{}}
{"id":"train_6072","question":"In the year 2011 in ICWET, what are the titles of the research papers on Side effects?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icwet/JinturkarK11> dblp:publishedIn 'ICWET' . <https://dblp.org/rec/conf/icwet/JinturkarK11> dblp:yearOfPublication '2011' . <https://dblp.org/rec/conf/icwet/JinturkarK11> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Side effects that were published in ICWET in 2011?"],"info":{}}
{"id":"train_6073","question":"In 2012 in GIIS, who are the authors that published papers about Situation assessment?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/giis/AguilarSTZ12> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/giis/AguilarSTZ12> dblp:publishedIn 'GIIS' . <https://dblp.org/rec/conf/giis/AguilarSTZ12> dblp:yearOfPublication '2012' }","paraphrases":["In GIIS in 2012, who are the authors that published papers about Situation assessment?"],"info":{}}
{"id":"train_6074","question":"What are the titles of the papers on Web development that were published in ICCSE in 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccse2/ZhouLZ20> dblp:publishedIn 'ICCSE' . <https://dblp.org/rec/conf/iccse2/ZhouLZ20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/conf/iccse2/ZhouLZ20> dblp:title ?answer }","paraphrases":["In ICCSE in 2020, what are the titles of the papers on Web development?"],"info":{}}
{"id":"train_6075","question":"What are the titles of the papers on Tracking control that were published in AMC in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amc/BeauduinFT16> dblp:publishedIn 'AMC' . <https://dblp.org/rec/conf/amc/BeauduinFT16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/conf/amc/BeauduinFT16> dblp:title ?answer }","paraphrases":["In 2016 in AMC, what are the titles of the papers on Tracking control?"],"info":{}}
{"id":"train_6076","question":"In the year 2003 in Int. J. Neural Syst., what are the titles of the research papers on Plane analog processor?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijns/CembranoRED03> dblp:publishedIn 'Int. J. Neural Syst.' . <https://dblp.org/rec/journals/ijns/CembranoRED03> dblp:yearOfPublication '2003' . <https://dblp.org/rec/journals/ijns/CembranoRED03> dblp:title ?answer }","paraphrases":["In 2003 in Int. J. Neural Syst., what are the titles of the papers on Plane analog processor?"],"info":{}}
{"id":"train_6077","question":"What are the titles of the papers on Operation performance that were published in Simul. Model. Pract. Theory in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/simpra/QiLYZ18> dblp:publishedIn 'Simul. Model. Pract. Theory' . <https://dblp.org/rec/journals/simpra/QiLYZ18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/simpra/QiLYZ18> dblp:title ?answer }","paraphrases":["In 2018 in Simul. Model. Pract. Theory, what are the titles of the papers on Operation performance?"],"info":{}}
{"id":"train_6078","question":"In 2001 in American Medical Informatics Annual Fall Symposium, who are the authors that published papers about Management system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/amia/LussierKLPC01> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/amia/LussierKLPC01> dblp:publishedIn 'AMIA' . <https://dblp.org/rec/conf/amia/LussierKLPC01> dblp:yearOfPublication '2001' }","paraphrases":["Who are the authors that published papers about Management system in American Medical Informatics Annual Fall Symposium in 2001?"],"info":{}}
{"id":"train_6079","question":"In the year 2013 in IFIP TC13 Conference on Human-Computer Interaction, who are the authors that published research papers about Communication system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/interact/GuerrierKP13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/interact/GuerrierKP13> dblp:publishedIn 'INTERACT (4)' . <https://dblp.org/rec/conf/interact/GuerrierKP13> dblp:yearOfPublication '2013' }","paraphrases":["Who are the authors that published papers about Communication system in INTERACT (4) in 2013?"],"info":{}}
{"id":"train_6080","question":"In 2010 in NLPKE, what are the titles of the papers on Relation learning?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/nlpke/FallucchiZ10> dblp:publishedIn 'NLPKE' . <https://dblp.org/rec/conf/nlpke/FallucchiZ10> dblp:yearOfPublication '2010' . <https://dblp.org/rec/conf/nlpke/FallucchiZ10> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Relation learning that were published in NLPKE in 2010?"],"info":{}}
{"id":"train_6081","question":"In the year 2018 in IEEE Commun. Mag., what are the titles of the research papers on Machine learning?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cm/MohammadiA18> dblp:publishedIn 'IEEE Commun. Mag.' . <https://dblp.org/rec/journals/cm/MohammadiA18> dblp:yearOfPublication '2018' . <https://dblp.org/rec/journals/cm/MohammadiA18> dblp:title ?answer }","paraphrases":["In IEEE Commun. Mag. in 2018, what are the titles of the papers on Machine learning?"],"info":{}}
{"id":"train_6082","question":"Who are the authors that published papers about Wildlife protection in AAMAS in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/atal/NguyenSGPJTDWRC16> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/atal/NguyenSGPJTDWRC16> dblp:publishedIn 'AAMAS' . <https://dblp.org/rec/conf/atal/NguyenSGPJTDWRC16> dblp:yearOfPublication '2016' }","paraphrases":["In 2016 in AAMAS, who are the authors that published papers about Wildlife protection?"],"info":{}}
{"id":"train_6083","question":"When was the research paper on Delivery supply chain by University of Lisbon published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cec/FariaSSSK06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Lisbon, Portugal' . <https://dblp.org/rec/conf/cec/FariaSSSK06> dblp:yearOfPublication ?answer }","paraphrases":["University of Lisbon published a paper on Delivery supply chain in what year?"],"info":{}}
{"id":"train_6084","question":"In the year 2020 in Int. J. Interact. Mob. Technol., what are the titles of the research papers on Attendance records technology?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ijim/UtomoWRIGA20> dblp:publishedIn 'Int. J. Interact. Mob. Technol.' . <https://dblp.org/rec/journals/ijim/UtomoWRIGA20> dblp:yearOfPublication '2020' . <https://dblp.org/rec/journals/ijim/UtomoWRIGA20> dblp:title ?answer }","paraphrases":["In 2020 in Int. J. Interact. Mob. Technol., what are the titles of the papers on Attendance records technology?"],"info":{}}
{"id":"train_6085","question":"In the year 2022 in Symmetry, what are the titles of the research papers on Mercer inequalities?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/symmetry/Bin-MohsinSJABN22> dblp:publishedIn 'Symmetry' . <https://dblp.org/rec/journals/symmetry/Bin-MohsinSJABN22> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/symmetry/Bin-MohsinSJABN22> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Mercer inequalities that were published in Symmetry in 2022?"],"info":{}}
{"id":"train_6086","question":"In J. Assoc. Inf. Syst. in 2008, who are the authors that published papers about Yield shift theory?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jais/BriggsRV08> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jais/BriggsRV08> dblp:publishedIn 'J. Assoc. Inf. Syst.' . <https://dblp.org/rec/journals/jais/BriggsRV08> dblp:yearOfPublication '2008' }","paraphrases":["Who are the authors that published papers about Yield shift theory in J. Assoc. Inf. Syst. in 2008?"],"info":{}}
{"id":"train_6087","question":"In CoRR in 2020, who are the authors that published papers about Query generation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2004-14503> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/corr/abs-2004-14503> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2004-14503> dblp:yearOfPublication '2020' }","paraphrases":["Who are the authors that published papers about Query generation in CoRR in 2020?"],"info":{}}
{"id":"train_6089","question":"Who are the authors that published papers about Tactile letter in British Computer Society Conference on Human-Computer Interaction in 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/ChuP18> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/hci/ChuP18> dblp:publishedIn 'HCI (7)' . <https://dblp.org/rec/conf/hci/ChuP18> dblp:yearOfPublication '2018' }","paraphrases":["In British Computer Society Conference on Human-Computer Interaction in 2018, who are the authors that published papers about Tactile letter?"],"info":{}}
{"id":"train_6090","question":"University of California Santa Cruz published a paper on Innovation lab in what year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/interactions/Isbister12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of California Santa Cruz, Social Emotional Technology Lab, CA, USA' . <https://dblp.org/rec/journals/interactions/Isbister12> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Innovation lab by University of California Santa Cruz published?"],"info":{}}
{"id":"train_6091","question":"In 2013 in Comput. Sci., what are the titles of the papers on Control space?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/aghcs/JurczykG13> dblp:publishedIn 'Comput. Sci.' . <https://dblp.org/rec/journals/aghcs/JurczykG13> dblp:yearOfPublication '2013' . <https://dblp.org/rec/journals/aghcs/JurczykG13> dblp:title ?answer }","paraphrases":["In Comput. Sci. in 2013, what are the titles of the papers on Control space?"],"info":{}}
{"id":"train_6092","question":"Who are the authors that published papers about Biosignal monitoring system in MobiHealth in 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mobihealth/PeregoAZB14> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/mobihealth/PeregoAZB14> dblp:publishedIn 'MobiHealth' . <https://dblp.org/rec/conf/mobihealth/PeregoAZB14> dblp:yearOfPublication '2014' }","paraphrases":["In 2014 in MobiHealth, who are the authors that published papers about Biosignal monitoring system?"],"info":{}}
{"id":"train_6093","question":"In CoRR in 2017, what are the titles of the papers on Life time value prediction?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/ChamberlainCLPD17> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/ChamberlainCLPD17> dblp:yearOfPublication '2017' . <https://dblp.org/rec/journals/corr/ChamberlainCLPD17> dblp:title ?answer }","paraphrases":["In the year 2017 in CoRR, what are the titles of the research papers on Life time value prediction?"],"info":{}}
{"id":"train_6094","question":"What are the titles of the papers on Road trains that were published in SIGSPATIAL/GIS in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gis/AgatzBKMS0W16> dblp:publishedIn 'SIGSPATIAL/GIS' . <https://dblp.org/rec/conf/gis/AgatzBKMS0W16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/conf/gis/AgatzBKMS0W16> dblp:title ?answer }","paraphrases":["In the year 2016 in SIGSPATIAL/GIS, what are the titles of the research papers on Road trains?"],"info":{}}
{"id":"train_6095","question":"In the year 2013 in IEEE Trans. Biomed. Eng., what are the titles of the research papers on Walking model?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tbe/HuSC13> dblp:publishedIn 'IEEE Trans. Biomed. Eng.' . <https://dblp.org/rec/journals/tbe/HuSC13> dblp:yearOfPublication '2013' . <https://dblp.org/rec/journals/tbe/HuSC13> dblp:title ?answer }","paraphrases":["In 2013 in IEEE Trans. Biomed. Eng., what are the titles of the papers on Walking model?"],"info":{}}
{"id":"train_6096","question":"In the year 2012 in CSMR, what are the titles of the research papers on Test cases?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/csmr/IslamMSS12> dblp:publishedIn 'CSMR' . <https://dblp.org/rec/conf/csmr/IslamMSS12> dblp:yearOfPublication '2012' . <https://dblp.org/rec/conf/csmr/IslamMSS12> dblp:title ?answer }","paraphrases":["In CSMR in 2012, what are the titles of the papers on Test cases?"],"info":{}}
{"id":"train_6097","question":"In IEEE Conference on Computer Vision and Pattern Recognition in 2016, who are the authors that published papers about Object detector?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/cvpr/NajibiRD16> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/cvpr/NajibiRD16> dblp:publishedIn 'CVPR' . <https://dblp.org/rec/conf/cvpr/NajibiRD16> dblp:yearOfPublication '2016' }","paraphrases":["In the year 2016 in CVPR, who are the authors that published research papers about Object detector?"],"info":{}}
{"id":"train_6098","question":"In the year 2019 in Found. Trends Inf. Syst., what are the titles of the research papers on Investment support?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ftis/StoreyW19> dblp:publishedIn 'Found. Trends Inf. Syst.' . <https://dblp.org/rec/journals/ftis/StoreyW19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/journals/ftis/StoreyW19> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Investment support that were published in Found. Trends Inf. Syst. in 2019?"],"info":{}}
{"id":"train_6099","question":"In the year 2008 in ICDM, who are the authors that published research papers about Isolation forest?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icdm/LiuTZ08> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icdm/LiuTZ08> dblp:publishedIn 'ICDM' . <https://dblp.org/rec/conf/icdm/LiuTZ08> dblp:yearOfPublication '2008' }","paraphrases":["Who are the authors that published papers about Isolation forest in IEEE International Conference on Data Mining in 2008?"],"info":{}}
{"id":"train_6101","question":"In SIGAda in 2009, who are the authors that published papers about Aircraft systems?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigada/Sward09a> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/sigada/Sward09a> dblp:publishedIn 'SIGAda' . <https://dblp.org/rec/conf/sigada/Sward09a> dblp:yearOfPublication '2009' }","paraphrases":["In 2009 in SIGAda, who are the authors that published papers about Aircraft systems?"],"info":{}}
{"id":"train_6102","question":"In Sensors in 2016, what are the titles of the papers on Level context inference?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/sensors/VillalongaRKPRL16> dblp:publishedIn 'Sensors' . <https://dblp.org/rec/journals/sensors/VillalongaRKPRL16> dblp:yearOfPublication '2016' . <https://dblp.org/rec/journals/sensors/VillalongaRKPRL16> dblp:title ?answer }","paraphrases":["In the year 2016 in Sensors, what are the titles of the research papers on Level context inference?"],"info":{}}
{"id":"train_6103","question":"Mention the year in which Chinese University of Hong Kong published a paper on Ring signatures.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iacr/WeiY06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Chinese University of Hong Kong' . <https://dblp.org/rec/journals/iacr/WeiY06> dblp:yearOfPublication ?answer }","paraphrases":["When was the research paper on Ring signatures by Chinese University of Hong Kong published?"],"info":{}}
{"id":"train_6104","question":"In 2016 in J. Mach. Learn. Res., who are the authors that published papers about Ratio graph cuts?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jmlr/TrillosSBLB16> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jmlr/TrillosSBLB16> dblp:publishedIn 'J. Mach. Learn. Res.' . <https://dblp.org/rec/journals/jmlr/TrillosSBLB16> dblp:yearOfPublication '2016' }","paraphrases":["Who are the authors that published papers about Ratio graph cuts in J. Mach. Learn. Res. in 2016?"],"info":{}}
{"id":"train_6105","question":"What are the titles of the papers on Eye lenses that were published in IEEE/RSJ International Conference on Intelligent Robots and Systems in 1993?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iros/BasuL93> dblp:publishedIn 'IROS' . <https://dblp.org/rec/conf/iros/BasuL93> dblp:yearOfPublication '1993' . <https://dblp.org/rec/conf/iros/BasuL93> dblp:title ?answer }","paraphrases":["In IEEE/RSJ International Conference on Intelligent Robots and Systems in 1993, what are the titles of the papers on Eye lenses?"],"info":{}}
{"id":"train_6106","question":"In the year 2013 in International Conference on Information Fusion, who are the authors that published research papers about Language understanding?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fusion/ShapiroS13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/fusion/ShapiroS13> dblp:publishedIn 'FUSION' . <https://dblp.org/rec/conf/fusion/ShapiroS13> dblp:yearOfPublication '2013' }","paraphrases":["In 2013 in International Conference on Information Fusion, who are the authors that published papers about Language understanding?"],"info":{}}
{"id":"train_6107","question":"Who are the authors that published papers about Data modeling in MOVE++@SIGSPATIAL in 2019?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/gis/Barnes19> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/gis/Barnes19> dblp:publishedIn 'MOVE++@SIGSPATIAL' . <https://dblp.org/rec/conf/gis/Barnes19> dblp:yearOfPublication '2019' }","paraphrases":["In 2019 in MOVE++@SIGSPATIAL, who are the authors that published papers about Data modeling?"],"info":{}}
{"id":"train_6109","question":"In the year 2000 in SIGCPR, who are the authors that published research papers about Information systems development?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigcpr/TrimmerCWB00> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/sigcpr/TrimmerCWB00> dblp:publishedIn 'SIGCPR' . <https://dblp.org/rec/conf/sigcpr/TrimmerCWB00> dblp:yearOfPublication '2000' }","paraphrases":["In SIGCPR in 2000, who are the authors that published papers about Information systems development?"],"info":{}}
{"id":"train_6110","question":"Who are the authors that published papers about Efficiency analysis in IEICE Trans. Electron. in 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/ieicet/SaitoSTMSMMZ16> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/ieicet/SaitoSTMSMMZ16> dblp:publishedIn 'IEICE Trans. Electron.' . <https://dblp.org/rec/journals/ieicet/SaitoSTMSMMZ16> dblp:yearOfPublication '2016' }","paraphrases":["In 2016 in IEICE Trans. Electron., who are the authors that published papers about Efficiency analysis?"],"info":{}}
{"id":"train_6111","question":"Who are the authors that published papers about Homology search in Pacific Symposium on Biocomputing in 2001?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/psb/ChangRA01> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/psb/ChangRA01> dblp:publishedIn 'Pacific Symposium on Biocomputing' . <https://dblp.org/rec/conf/psb/ChangRA01> dblp:yearOfPublication '2001' }","paraphrases":["In Pacific Symposium on Biocomputing in 2001, who are the authors that published papers about Homology search?"],"info":{}}
{"id":"train_6112","question":"In 2016 in International Conference on Computer Communication and Networks, who are the authors that published papers about Communication system?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icccn/ChuNS16> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/icccn/ChuNS16> dblp:publishedIn 'ICCCN' . <https://dblp.org/rec/conf/icccn/ChuNS16> dblp:yearOfPublication '2016' }","paraphrases":["In International Conference on Computer Communication and Networks in 2016, who are the authors that published papers about Communication system?"],"info":{}}
{"id":"train_6113","question":"In the year 2019 in VEHITS, what are the titles of the research papers on Response framework?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vehits/HamadTP19> dblp:publishedIn 'VEHITS' . <https://dblp.org/rec/conf/vehits/HamadTP19> dblp:yearOfPublication '2019' . <https://dblp.org/rec/conf/vehits/HamadTP19> dblp:title ?answer }","paraphrases":["In VEHITS in 2019, what are the titles of the papers on Response framework?"],"info":{}}
{"id":"train_6114","question":"In the year 2013 in J. Frankl. Inst., what are the titles of the research papers on Output feedback?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jfi/AiZF13> dblp:publishedIn 'J. Frankl. Inst.' . <https://dblp.org/rec/journals/jfi/AiZF13> dblp:yearOfPublication '2013' . <https://dblp.org/rec/journals/jfi/AiZF13> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Output feedback that were published in J. Frankl. Inst. in 2013?"],"info":{}}
{"id":"train_6115","question":"Who are the authors that published papers about Precursor depletion in J. Cogn. Neurosci. in 2021?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jocn/ChassignolleJSB21> dblp:authoredBy ?answer . <https://dblp.org/rec/journals/jocn/ChassignolleJSB21> dblp:publishedIn 'J. Cogn. Neurosci.' . <https://dblp.org/rec/journals/jocn/ChassignolleJSB21> dblp:yearOfPublication '2021' }","paraphrases":["In 2021 in J. Cogn. Neurosci., who are the authors that published papers about Precursor depletion?"],"info":{}}
{"id":"train_6116","question":"Who are the authors that published papers about Trace modeling in IEEE International Conference on Intelligence and Security Informatics in 2013?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/isi/MappusB13> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/isi/MappusB13> dblp:publishedIn 'ISI' . <https://dblp.org/rec/conf/isi/MappusB13> dblp:yearOfPublication '2013' }","paraphrases":["In 2013 in IEEE International Conference on Intelligence and Security Informatics, who are the authors that published papers about Trace modeling?"],"info":{}}
{"id":"train_6117","question":"Who are the authors that published papers about Web pages in FGIT-ASEA in 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/fgit/AmalfitanoFT09> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/fgit/AmalfitanoFT09> dblp:publishedIn 'FGIT-ASEA' . <https://dblp.org/rec/conf/fgit/AmalfitanoFT09> dblp:yearOfPublication '2009' }","paraphrases":["In the year 2009 in FGIT-ASEA, who are the authors that published research papers about Web pages?"],"info":{}}
{"id":"train_6118","question":"In 2011 in CASE, what are the titles of the papers on Glass machine?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/case/SernaCBRC11> dblp:publishedIn 'CASE' . <https://dblp.org/rec/conf/case/SernaCBRC11> dblp:yearOfPublication '2011' . <https://dblp.org/rec/conf/case/SernaCBRC11> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Glass machine that were published in CASE in 2011?"],"info":{}}
{"id":"train_6119","question":"In 2021 in British Computer Society Conference on Human-Computer Interaction, who are the authors that published papers about Body movements?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/hci/YamamotoSF21> dblp:authoredBy ?answer . <https://dblp.org/rec/conf/hci/YamamotoSF21> dblp:publishedIn 'HCI (2)' . <https://dblp.org/rec/conf/hci/YamamotoSF21> dblp:yearOfPublication '2021' }","paraphrases":["In HCI (2) in 2021, who are the authors that published papers about Body movements?"],"info":{}}
{"id":"train_6120","question":"In the year 2022 in CoRR, what are the titles of the research papers on Downlink duality?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/corr/abs-2201-04922> dblp:publishedIn 'CoRR' . <https://dblp.org/rec/journals/corr/abs-2201-04922> dblp:yearOfPublication '2022' . <https://dblp.org/rec/journals/corr/abs-2201-04922> dblp:title ?answer }","paraphrases":["What are the titles of the papers on Downlink duality that were published in CoRR in 2022?"],"info":{}}
