{"id":"train_4509","question":"List the authors of 'Parallel approach of a bioinspired routing protocol for MANETs' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/ijahuc/Garcia-VillalbaCO13> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/ijahuc/Garcia-VillalbaCO13> ) }","paraphrases":["Who are the authors of the publication 'Parallel approach of a bioinspired routing protocol for MANETs' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4510","question":"Who are the authors of the publication 'Privacy' and where did they publish other papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/reference/crypt/Adams05p> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/reference/crypt/Adams05p> ) }","paraphrases":["Who are the authors of the publication 'Privacy' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4514","question":"List the authors of 'I've seen this before: sharing cyber-physical incident knowledge' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icse/AlrimawiPMN18> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/icse/AlrimawiPMN18> ) }","paraphrases":["Who are the authors of the publication 'I've seen this before: sharing cyber-physical incident knowledge' and what other papers did they publish?"],"info":{}}
{"id":"train_4515","question":"Find the authors of 'A Soft Sensor for Bleeding Detection in Colonoscopies' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/aisy/GeraldMSAR22a> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/aisy/GeraldMSAR22a> ) }","paraphrases":["Who are the authors of the publication 'A Soft Sensor for Bleeding Detection in Colonoscopies' and what other papers did they publish?"],"info":{}}
{"id":"train_4516","question":"Who are the authors of 'The road less traveled: Internet collaboration: good, bad, and downright ugly' and where are they from?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/crossroads/Cranor96> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'The road less traveled: Internet collaboration: good, bad, and downright ugly' and what are their affiliations?"],"info":{}}
{"id":"train_4521","question":"Who are the authors of the publication 'Private Cloud in 6G Networks: A Study from the Total Cost of Ownership Perspective' and what other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/5gwn/ChiDFRHC20> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/5gwn/ChiDFRHC20> ) }","paraphrases":["Who are the authors of the publication 'Private Cloud in 6G Networks: A Study from the Total Cost of Ownership Perspective' and which other papers did they publish?"],"info":{}}
{"id":"train_4523","question":"Who are the authors of the publication 'BaNHFaP: A Bayesian Network Based Failure Prediction Approach for Hard Disk Drives' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/bracis/ChavesPLQGM16> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'BaNHFaP: A Bayesian Network Based Failure Prediction Approach for Hard Disk Drives' and where are they from?"],"info":{}}
{"id":"train_4524","question":"List the authors of 'Decolonizing HCI Across Borders' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/chi/CannanureG0WMKR21> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Decolonizing HCI Across Borders' and what are their affiliations?"],"info":{}}
{"id":"train_4525","question":"Who are the authors of the publication 'Stability of 2-D continuous systems in roesser model based on KYP lemma' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/IEEEssd/RachidHH17> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/IEEEssd/RachidHH17> ) }","paraphrases":["Who are the authors of the publication 'Stability of 2-D continuous systems in roesser model based on KYP lemma' and what other papers did they publish?"],"info":{}}
{"id":"train_4529","question":"Who are the authors of the publication 'MTQA: Text-Based Multitype Question and Answer Reading Comprehension Model' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/cin/ChenMWMZ21> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'MTQA: Text-Based Multitype Question and Answer Reading Comprehension Model' and where are they from?"],"info":{}}
{"id":"train_4532","question":"Who are the authors of the publication 'Size-Constrained Weighted Set Cover' and what are their affiliations?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icde/GolabKLSS15> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of 'Size-Constrained Weighted Set Cover' and where are they from?"],"info":{}}
{"id":"train_4533","question":"Who are the authors of the publication 'Externalities in Knowledge Production: Evidence from a Randomized Field Experiment' and which other papers did they publish?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1903-01861> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/corr/abs-1903-01861> ) }","paraphrases":["Who are the authors of the publication 'Externalities in Knowledge Production: Evidence from a Randomized Field Experiment' and what other papers did they publish?"],"info":{}}
{"id":"train_4534","question":"Find the authors of 'Objects in the cloud may be closer than they appear towards a taxonomy of web-based software' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/wse/TaivalsaariM11> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/wse/TaivalsaariM11> ) }","paraphrases":["Who are the authors of 'Objects in the cloud may be closer than they appear towards a taxonomy of web-based software' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4535","question":"List the authors of 'Hybrid HMM-NN Modeling of Stationary-Transitional Units for Continuous Speech Recognition' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/iconip/AlbesanoGM97> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/iconip/AlbesanoGM97> ) }","paraphrases":["Who are the authors of 'Hybrid HMM-NN Modeling of Stationary-Transitional Units for Continuous Speech Recognition' and which other papers did they publish?"],"info":{}}
{"id":"train_4538","question":"Find the authors of 'Improvements in Axle Box Acceleration Measurements for the Detection of Light Squats in Railway Infrastructure' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tie/LiMND15> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["List the authors of 'Improvements in Axle Box Acceleration Measurements for the Detection of Light Squats in Railway Infrastructure' and their affiliations."],"info":{}}
{"id":"train_4540","question":"Who are the authors of the publication 'A Spatial Coherence Beamformer Design for Power Doppler Imaging' and what are the venues of the other papers they published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tmi/OzgunTB20> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/tmi/OzgunTB20> ) }","paraphrases":["Who are the authors of the publication 'A Spatial Coherence Beamformer Design for Power Doppler Imaging' and where did they publish other papers?"],"info":{}}
{"id":"train_4543","question":"List the authors of 'An ensemble approach to outlier detection using some conventional clustering algorithms' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/mta/SahaCGKS21> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/journals/mta/SahaCGKS21> ) }","paraphrases":["Find the authors of 'An ensemble approach to outlier detection using some conventional clustering algorithms' and the other papers they published."],"info":{}}
{"id":"train_4544","question":"List the authors of 'Hitting all Maximal Independent Sets of a Bipartite Graph' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1208-5589> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/journals/corr/abs-1208-5589> ) }","paraphrases":["Find the authors of 'Hitting all Maximal Independent Sets of a Bipartite Graph' and the venues of the other papers they published."],"info":{}}
{"id":"train_4545","question":"List the authors of 'Does more data always yield better translations?' and their affiliations.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/eacl/GascoRSAC12> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }","paraphrases":["Who are the authors of the publication 'Does more data always yield better translations?' and what are their affiliations?"],"info":{}}
{"id":"train_4547","question":"List the authors of 'Multicast resource allocation with side information in multicarrier wireless networks' and the venues of the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icc/QiH15> dblp:authoredBy ?firstanswer . ?x dblp:authoredBy ?firstanswer . ?x dblp:publishedIn ?secondanswer FILTER ( ?x != <https://dblp.org/rec/conf/icc/QiH15> ) }","paraphrases":["Who are the authors of the publication 'Multicast resource allocation with side information in multicarrier wireless networks' and what are the venues of the other papers they published?"],"info":{}}
{"id":"train_4549","question":"Find the authors of 'Genetic Algorithms for Morphological Filtering' and the other papers they published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/mic/Sedaaghi03> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER ( ?secondanswer != <https://dblp.org/rec/conf/mic/Sedaaghi03> ) }","paraphrases":["Who are the authors of 'Genetic Algorithms for Morphological Filtering' and which other papers did they publish?"],"info":{}}
{"id":"train_4550","question":"Did the authors of 'Behavioral modeling of delta-sigma modulators' also publish a paper in the venue Order?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/csi/DavisF98> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/csi/DavisF98> ) . ?y dblp:publishedIn 'Order' }","paraphrases":["Did the authors of the paper 'Behavioral modeling of delta-sigma modulators' also publish a publication in Order?"],"info":{}}
{"id":"train_4551","question":"Was the publication 'A hardware-in-the-loop simulator to test control systems of hydroelectric plants' published in the year 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/springsim/Galindo-GarciaR09> dblp:yearOfPublication '2009' }","paraphrases":["Was 'A hardware-in-the-loop simulator to test control systems of hydroelectric plants' published in 2009?"],"info":{}}
{"id":"train_4554","question":"Did the authors of 'Fully-distributed control plane for elastic optical network with GMPLS with RMSA' also publish a paper in J. Inf. Process. Syst.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ecoc/FukudaLBSY14> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ecoc/FukudaLBSY14> ) . ?y dblp:publishedIn 'J. Inf. Process. Syst.' }","paraphrases":["Did the authors of the paper 'Fully-distributed control plane for elastic optical network with GMPLS with RMSA' also publish a publication in J. Inf. Process. Syst.?"],"info":{}}
{"id":"train_4556","question":"Did the authors of the publication 'Research on Force Control of Spherical Fruit and Vegetable End-Effector Based on Data-Driven Control Algorithm' publish other papers in Wireless Networks?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/icccsec/LiuHLDDJ22> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/icccsec/LiuHLDDJ22> ) . ?y dblp:publishedIn 'Wireless Networks' }","paraphrases":["Did the authors of the paper 'Research on Force Control of Spherical Fruit and Vegetable End-Effector Based on Data-Driven Control Algorithm' also publish a publication in Wireless Networks?"],"info":{}}
{"id":"train_4557","question":"Did the authors of the paper 'A Contrastive Learning Method for the Visual Representation of 3D Point Clouds' also publish the publication 'How Fast Can We Compute Orbits of Groups?'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/algorithms/ZhuZC22> dblp:authoredBy ?x . <https://dblp.org/rec/conf/icms/Betten18a> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/icms/Betten18a> != <https://dblp.org/rec/journals/algorithms/ZhuZC22> ) }","paraphrases":["Did the authors of the publication 'A Contrastive Learning Method for the Visual Representation of 3D Point Clouds' also publish the paper 'How Fast Can We Compute Orbits of Groups?'?"],"info":{}}
{"id":"train_4558","question":"Was the publication 'Homology of Linear Groups' published in the year 2001?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/books/daglib/0028403> dblp:yearOfPublication '2001' }","paraphrases":["Was the publication 'Homology of Linear Groups' published in 2001?"],"info":{}}
{"id":"train_4561","question":"Did the authors of 'Omni-directional 3D measurement using double fish-eye stereo vision' also publish a paper in CoRR?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/fcv/IguchiY15> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/fcv/IguchiY15> ) . ?y dblp:publishedIn 'CoRR' }","paraphrases":["Did the authors of the publication 'Omni-directional 3D measurement using double fish-eye stereo vision' publish other papers in CoRR?"],"info":{}}
{"id":"train_4563","question":"Did the authors of the publication 'Optical character recognition based on analog preprocessing and automatic feature extraction' also publish a publication in Int. J. Distance Educ. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/cvgip/LashasSVD85> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/cvgip/LashasSVD85> ) . ?y dblp:publishedIn 'Int. J. Distance Educ. Technol.' }","paraphrases":["Did the authors of 'Optical character recognition based on analog preprocessing and automatic feature extraction' also publish a paper in the venue Int. J. Distance Educ. Technol.?"],"info":{}}
{"id":"train_4564","question":"Did the authors of the publication 'A Model for User-Oriented Data Provenance in Pipelined Scientific Workflows' also publish a publication in J. Documentation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/ipaw/BowersMLCD06> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/ipaw/BowersMLCD06> ) . ?y dblp:publishedIn 'J. Documentation' }","paraphrases":["Did the authors of 'A Model for User-Oriented Data Provenance in Pipelined Scientific Workflows' also publish a paper in the venue J. Documentation?"],"info":{}}
{"id":"train_4565","question":"Did the authors of the paper 'Technology transfer in schools: from research to innovation' also publish the publication 'Applying Artificial Intelligence to Data Analysis'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/bjet/BottinoFM98> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ecai/Hajek82> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/ecai/Hajek82> != <https://dblp.org/rec/journals/bjet/BottinoFM98> ) }","paraphrases":["Did the authors of the publication 'Technology transfer in schools: from research to innovation' also publish the paper 'Applying Artificial Intelligence to Data Analysis'?"],"info":{}}
{"id":"train_4567","question":"Did the authors of the paper 'A comparative study of motion estimation algorithms in cardiac ultrasound sequences' also publish a publication in VLDB J.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/atsip/KhachiraKH16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/atsip/KhachiraKH16> ) . ?y dblp:publishedIn 'VLDB J.' }","paraphrases":["Did the authors of the publication 'A comparative study of motion estimation algorithms in cardiac ultrasound sequences' publish other papers in VLDB J.?"],"info":{}}
{"id":"train_4568","question":"Do the authors of 'Assessing the veracity of identity assertions via OSNs' have Duke University as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/comsnets/SirivianosKGY12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'Duke University, Durham, USA' }","paraphrases":["Is Duke University the primary affiliation of the authors of 'Assessing the veracity of identity assertions via OSNs'?"],"info":{}}
{"id":"train_4569","question":"Did the authors of the publication 'TasteIT Analyzing chemical sensor data using fuzzy logic' also publish a publication in Fundam. Informaticae?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/compsens/HeidenTS11> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/compsens/HeidenTS11> ) . ?y dblp:publishedIn 'Fundam. Informaticae' }","paraphrases":["Did the authors of 'TasteIT Analyzing chemical sensor data using fuzzy logic' also publish a paper in the venue Fundam. Informaticae?"],"info":{}}
{"id":"train_4570","question":"Did the authors of the paper 'Formation Reconfiguration for Fixed-Wing UAVs' also publish a publication in Comput. Optim. Appl.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jirs/ChenWSLLY21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/jirs/ChenWSLLY21> ) . ?y dblp:publishedIn 'Comput. Optim. Appl.' }","paraphrases":["Did the authors of the publication 'Formation Reconfiguration for Fixed-Wing UAVs' publish other papers in Comput. Optim. Appl.?"],"info":{}}
{"id":"train_4571","question":"Was the paper 'An Efficient FFT Architecture for OFDM Communication Systems' published in the year 2009?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/artcom/HarikrishnaR09> dblp:yearOfPublication '2009' }","paraphrases":["Was 'An Efficient FFT Architecture for OFDM Communication Systems' published in 2009?"],"info":{}}
{"id":"train_4572","question":"Was the publication 'Full Body Gesture Recognition for Human-Machine Interaction in Intelligent Spaces' published in the year 2016?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/iwbbio/Casillas-PerezG16> dblp:yearOfPublication '2016' }","paraphrases":["Was the publication 'Full Body Gesture Recognition for Human-Machine Interaction in Intelligent Spaces' published in 2016?"],"info":{}}
{"id":"train_4576","question":"Was the paper 'Proximal Gradient Temporal Difference Learning: Stable Reinforcement Learning with Polynomial Sample Complexity' published in the year 2018?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/jair/0006GG0MP18> dblp:yearOfPublication '2018' }","paraphrases":["Was the publication 'Proximal Gradient Temporal Difference Learning: Stable Reinforcement Learning with Polynomial Sample Complexity' published in 2018?"],"info":{}}
{"id":"train_4577","question":"Do the authors of 'Determining Sector Visibility of a Polygon' have University of British Columbia as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/compgeom/BhattacharyaKT89> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of British Columbia, Vancouver, Canada' }","paraphrases":["Is University of British Columbia the primary affiliation of the authors of 'Determining Sector Visibility of a Polygon'?"],"info":{}}
{"id":"train_4580","question":"Did the authors of the publication 'Innovative practices on silicon photonics' publish other papers in IEEE International Conference on Multimedia and Expo?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vts/MeadeKOA18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/vts/MeadeKOA18> ) . ?y dblp:publishedIn 'ICME' }","paraphrases":["Did the authors of the publication 'Innovative practices on silicon photonics' also publish a publication in IEEE International Conference on Multimedia and Expo?"],"info":{}}
{"id":"train_4581","question":"Was the publication 'Microsensor Electrodes for 3D Inline Process Monitoring in Multiphase Microreactors' published in the year 2020?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/sensors/UrbanSKUW20> dblp:yearOfPublication '2020' }","paraphrases":["Was 'Microsensor Electrodes for 3D Inline Process Monitoring in Multiphase Microreactors' published in 2020?"],"info":{}}
{"id":"train_4582","question":"Did the authors of the paper 'MLSmellHound: A Context-Aware Code Analysis Tool' also publish the paper 'Digital Straight Segment Filter for Geometric Description'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2205-03790> dblp:authoredBy ?x . <https://dblp.org/rec/conf/dgmm/DecelleNDML21> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/dgmm/DecelleNDML21> != <https://dblp.org/rec/journals/corr/abs-2205-03790> ) }","paraphrases":["Did the authors of the paper 'MLSmellHound: A Context-Aware Code Analysis Tool' also publish the publication 'Digital Straight Segment Filter for Geometric Description'?"],"info":{}}
{"id":"train_4584","question":"Is University of Texas at Dallas, Department of Computer Science, USA the primary affiliation of the authors of 'A survey of quality of service in IEEE 80211 networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/wc/ZhuLCP04> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'University of Texas at Dallas, Department of Computer Science, USA' }","paraphrases":["Do the authors of 'A survey of quality of service in IEEE 80211 networks' have University of Texas at Dallas as their primary affiliation?"],"info":{}}
{"id":"train_4585","question":"Did the authors of the paper 'A Combinatorial Geometric Approach to Linear Image Matching' also publish a publication in IIMSS?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/eccc/HundtL07> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/eccc/HundtL07> ) . ?y dblp:publishedIn 'IIMSS' }","paraphrases":["Did the authors of the publication 'A Combinatorial Geometric Approach to Linear Image Matching' publish other papers in IIMSS?"],"info":{}}
{"id":"train_4587","question":"Did the authors of 'Observation of flow variation in capillaries of artificial blood vessel by producing microbubble aggregations' also publish a paper in ICGSE?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/embc/MasudaSKWIAMC12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/embc/MasudaSKWIAMC12> ) . ?y dblp:publishedIn 'ICGSE' }","paraphrases":["Did the authors of 'Observation of flow variation in capillaries of artificial blood vessel by producing microbubble aggregations' also publish a paper in the venue IEEE International Conference on Global Software Engineering?"],"info":{}}
{"id":"train_4588","question":"Do the authors of 'Multi-hop discovery of Candidate Access Routers (MHD-CAR) for fast moving mobile nodes' have TU Dortmund University, Communication Networks Institute, Germany as their primary affiliation?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/pimrc/YousafMW08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation 'TU Dortmund University, Communication Networks Institute, Germany' }","paraphrases":["Is TU Dortmund University, Communication Networks Institute, Germany the primary affiliation of the authors of 'Multi-hop discovery of Candidate Access Routers (MHD-CAR) for fast moving mobile nodes'?"],"info":{}}
{"id":"train_4589","question":"Was the paper 'Density flow over networks: A mean-field game theoretic approach' published in the year 2014?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cdc/BausoZP14> dblp:yearOfPublication '2014' }","paraphrases":["Was 'Density flow over networks: A mean-field game theoretic approach' published in 2014?"],"info":{}}
{"id":"train_4593","question":"Was the paper 'Object capture with a camera-mobile robot system' published in the year 2006?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ram/Webster06> dblp:yearOfPublication '2006' }","paraphrases":["Was 'Object capture with a camera-mobile robot system' published in 2006?"],"info":{}}
{"id":"train_4596","question":"Did the authors of 'LEADOR: A Method for End-to-End Participatory Design of Autonomous Social Robots' also publish 'SCORES: Shape Composition with Recursive Substructure Priors'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/corr/abs-2105-01910> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-1809-05398> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/journals/corr/abs-1809-05398> != <https://dblp.org/rec/journals/corr/abs-2105-01910> ) }","paraphrases":["Did the authors of 'LEADOR: A Method for End-to-End Participatory Design of Autonomous Social Robots' also publish the publication 'SCORES: Shape Composition with Recursive Substructure Priors'?"],"info":{}}
{"id":"train_4597","question":"Did the authors of the publication 'Designing for sustainable mobile learning - re-evaluating the concepts \\formal\\ and \\informal\\' also publish a publication in CSEDU (2)?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/journals/ile/VibergAW21> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/journals/ile/VibergAW21> ) . ?y dblp:publishedIn 'CSEDU (2)' }","paraphrases":["Did the authors of 'Designing for sustainable mobile learning - re-evaluating the concepts \\formal\\ and \\informal\\' also publish a paper in the venue International Conference on Computer Supported Education?"],"info":{}}
{"id":"train_4599","question":"Did the authors of the publication 'Volume-based tumor neurosurgery planning in the Virtual Workbench' also publish 'Korean prosody generation and artificial neural networks'?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/vr/GuanSKHNC98> dblp:authoredBy ?x . <https://dblp.org/rec/conf/interspeech/MinL04> dblp:authoredBy ?x FILTER ( <https://dblp.org/rec/conf/interspeech/MinL04> != <https://dblp.org/rec/conf/vr/GuanSKHNC98> ) }","paraphrases":["Did the authors of 'Volume-based tumor neurosurgery planning in the Virtual Workbench' also publish the publication 'Korean prosody generation and artificial neural networks'?"],"info":{}}
{"id":"train_4600","question":"Did the authors of the paper 'Towards Large Scale Cross-Media Retrieval via Modeling Heterogeneous Information and Exploring an Efficient Indexing Scheme' also publish a publication in Inf. Softw. Technol.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> ASK { <https://dblp.org/rec/conf/cvm/LuWY12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER ( ?y != <https://dblp.org/rec/conf/cvm/LuWY12> ) . ?y dblp:publishedIn 'Inf. Softw. Technol.' }","paraphrases":["Did the authors of the publication 'Towards Large Scale Cross-Media Retrieval via Modeling Heterogeneous Information and Exploring an Efficient Indexing Scheme' publish other papers in Inf. Softw. Technol.?"],"info":{}}
