{"id":"train_3405","question":"Report the most frequent co-author of Beaver, Donald and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/05/241> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/05/241> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Donald Beaver has the most papers and how many?"],"info":{}}
{"id":"train_3406","question":"When was the last paper by Alistair Isaac published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/63/9411> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which A. Isaac published their last paper."],"info":{}}
{"id":"train_3407","question":"Who is the most frequent co-author of Khaled M. Elleithy and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/04/3246> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/04/3246> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Khaled M. Elleithy and how many papers do they have together?"],"info":{}}
{"id":"train_3408","question":"Find the year in which Dza-Shiang Hong published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/273/2387> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Hong, D. published?"],"info":{}}
{"id":"train_3409","question":"In which year did R. Jungclaus publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/07/6103> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Ralf Jungclaus publish the least publications?"],"info":{}}
{"id":"train_3410","question":"In which year did the author Joseph Bonneau publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/27/3087> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by J. Bonneau in which year?"],"info":{}}
{"id":"train_3411","question":"Report the year in which Ma, Yanjun published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/79/2225> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Ma, Yanjun published?"],"info":{}}
{"id":"train_3413","question":"In which year did Yangjun Ou publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/245/3872> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Yangjun Ou publish the most research papers?"],"info":{}}
{"id":"train_3414","question":"With which author does Isaac D. Scherson has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/s/IsaacDScherson> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/s/IsaacDScherson> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Scherson, I. D. and how many publications do they have together?"],"info":{}}
{"id":"train_3416","question":"In which year was the first paper by Ron Shamir published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/66/6913> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Ron Shamir published their first paper."],"info":{}}
{"id":"train_3417","question":"Find the year in which X. Lu published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/284/2766> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by X. Lu published?"],"info":{}}
{"id":"train_3418","question":"Mention the year in which J. Lin published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/00/7739> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author J. Lin publish the most research papers?"],"info":{}}
{"id":"train_3419","question":"Who is the most frequent co-author of V. Chandrasekar and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/31/5493-1> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/31/5493-1> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of V. Chandrasekar and how many papers do they have together?"],"info":{}}
{"id":"train_3421","question":"In which year did Mathias Lux publish the most papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/33/1111> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which M. Lux published the most papers."],"info":{}}
{"id":"train_3422","question":"Report the most frequent co-author of Peter Langthaler and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/7327> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/67/7327> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Peter Langthaler and how many publications do they have together?"],"info":{}}
{"id":"train_3423","question":"When was the first paper by G. Z. Markovic published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/67/4232> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Goran Z. Markovic published their first paper."],"info":{}}
{"id":"train_3424","question":"Report the most frequent co-author of Mikl\\u00F3s Telek and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/51/1636> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/51/1636> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Mikl\\u00F3s Telek and how many publications do they have together?"],"info":{}}
{"id":"train_3425","question":"Least number of papers were published by Lawrence Phillips in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/173/5867> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Phillips, Lawrence publish the least papers and how many?"],"info":{}}
{"id":"train_3426","question":"In which year was the first paper by Penedo, Janaina Rodrigues published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/48/11283> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Janaina Rodrigues Penedo published?"],"info":{}}
{"id":"train_3427","question":"Report the year in which Regan L. Mandryk published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/40/5931> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Mandryk, Regan L. publish the least papers and how many?"],"info":{}}
{"id":"train_3428","question":"When was the first paper by Chuliang Song published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/269/1615> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Chuliang Song published their first paper."],"info":{}}
{"id":"train_3429","question":"In which year did the author Lu Gan publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/45/3353> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which Lu Gan published the most papers."],"info":{}}
{"id":"train_3430","question":"Report the most frequent co-author of Thronas, Aaron I. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/192/8482> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/192/8482> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Aaron I. Thronas and how many publications do they have together?"],"info":{}}
{"id":"train_3431","question":"Find the year in which Dennis E. Speliotis published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/29/3885> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Speliotis, D. E. published?"],"info":{}}
{"id":"train_3434","question":"With which author does Andrzej Kolinski has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/4232> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/88/4232> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Kolinski, Andrzej and how many publications do they have together?"],"info":{}}
{"id":"train_3435","question":"In which year did Valeria Carofiglio publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/5366> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Valeria Carofiglio in which year?"],"info":{}}
{"id":"train_3436","question":"In which year did the author Dorian Popa publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/70/8416> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Popa, D. publish the most papers?"],"info":{}}
{"id":"train_3437","question":"Find the year in which Daxin Luo published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/160/2219> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Luo, Daxin published?"],"info":{}}
{"id":"train_3438","question":"When was the last paper by Augusto S. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/18/3620> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Augusto S. published?"],"info":{}}
{"id":"train_3439","question":"Find the year in which Wada, M. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/62/352> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Masahiro Wada published?"],"info":{}}
{"id":"train_3441","question":"With which author does S. Nawaz has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/158/2321> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/158/2321> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of S. Nawaz and how many publications do they have together?"],"info":{}}
{"id":"train_3442","question":"Report the year in which Dredze, M. published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/31/5468> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Dredze, M. in which year?"],"info":{}}
{"id":"train_3443","question":"When was the first paper by Patrick L. Callet published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/38/6666> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Patrick Le Callet published their first paper."],"info":{}}
{"id":"train_3444","question":"Find the year in which Cesar Ghali published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/83/8377> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Ghali, C. published?"],"info":{}}
{"id":"train_3445","question":"When was the first paper by Fumito Uwano published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/190/2531> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Fumito Uwano published their first paper."],"info":{}}
{"id":"train_3446","question":"In which year did Trenton Schulz publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/116/7444> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Schulz, T. publish the least publications?"],"info":{}}
{"id":"train_3447","question":"Report the year in which Jonathan B. Postel published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/20/5344> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Jonathan B. Postel publish the least papers and how many?"],"info":{}}
{"id":"train_3448","question":"When was the first paper by A. Emami published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/215/1573> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by A. Emami published?"],"info":{}}
{"id":"train_3449","question":"Report the year in which Dongyi Liu published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/134/8279> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Dongyi Liu in which year?"],"info":{}}
{"id":"train_3451","question":"In which year did the author Andleeb, S. publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/274/7416> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Andleeb, S. publish the least papers and how many?"],"info":{}}
{"id":"train_3452","question":"With which author does Alan S. Willsky has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/48/6690> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/48/6690> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Willsky, Alan S. and how many papers do they have together?"],"info":{}}
{"id":"train_3453","question":"Find the year in which Boffa, Maurice published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/82/2857> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Maurice Boffa published?"],"info":{}}
{"id":"train_3454","question":"In which year was the first paper by Regine Seidowsky published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/190/0570> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Seidowsky, Regine published their first paper."],"info":{}}
{"id":"train_3455","question":"Report the year in which Javier Leach Albert published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/a/JavierLeachAlbert> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Albert, Javier Leach published?"],"info":{}}
{"id":"train_3456","question":"Mention the year in which Tomoaki Moriya published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/72/7961> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Tomoaki Moriya publish the most papers?"],"info":{}}
{"id":"train_3457","question":"Report the year in which Troy Johnson published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/184/3583> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Troy Johnson published?"],"info":{}}
{"id":"train_3458","question":"Mention the year in which Brage Mo published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/207/4558> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Mo, B. publish the most research papers?"],"info":{}}
{"id":"train_3459","question":"In which year was the last paper by XiaoLing Xia published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/68/2329> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which XiaoLing Xia published their last paper."],"info":{}}
{"id":"train_3460","question":"Report the year in which Mar\\u00EDa Cecilia Reyes published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/208/4354> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Mar\\u00EDa Cecilia Reyes published?"],"info":{}}
{"id":"train_3461","question":"Mention the year in which Giuseppina Gini published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/44/5394> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Giuseppina Gini publish the most research papers?"],"info":{}}
{"id":"train_3462","question":"In which year did Daniela Laselva publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/47/8141> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Daniela L. publish the least publications?"],"info":{}}
{"id":"train_3464","question":"In which year was the first paper by Ervural, Saim published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/202/7490> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Ervural, Saim published?"],"info":{}}
{"id":"train_3466","question":"In which year was the first paper by A. Louri published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/17/5827> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Ahmed Louri published?"],"info":{}}
{"id":"train_3467","question":"Report the most frequent co-author of He, Z. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/44/4618> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/44/4618> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of He, Z. and how many publications do they have together?"],"info":{}}
{"id":"train_3468","question":"In which year did the author Francesco Valenti publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/184/2616> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Francesco V. publish the least papers and how many?"],"info":{}}
{"id":"train_3469","question":"When was the first paper by Sulin Ba published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/49/4505> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Sulin Ba published their first paper."],"info":{}}
{"id":"train_3470","question":"In which year did Christoph Meinel publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/m/CMeinel> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Christoph Meinel publish the least publications?"],"info":{}}
{"id":"train_3471","question":"In which year did Peter J. McCann publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/72/2578> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which P. J. McCann published the least papers."],"info":{}}
{"id":"train_3472","question":"In which year was the last paper by Wen S. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/50/5489> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which Wen Song published their last paper."],"info":{}}
{"id":"train_3473","question":"Report the most frequent co-author of Robert G. Clark and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/50/4533> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/50/4533> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Robert G. Clark and how many publications do they have together?"],"info":{}}
{"id":"train_3474","question":"Find the year in which Kuo-Yang Tu published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/38/2922> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Kuo-Yang Tu published?"],"info":{}}
{"id":"train_3475","question":"In which year did the author Zhiyong Wu publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/24/968-1> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Zhiyong Wu publish the least papers and how many?"],"info":{}}
{"id":"train_3476","question":"When was the first paper by Olav N. \\u00D8sterb\\u00F8 published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/33/2163> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which \\u00D8sterb\\u00F8, O. N. published their first paper."],"info":{}}
{"id":"train_3477","question":"Mention the year in which Eric Sanders published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/21/7459> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Sanders, Eric publish the most research papers?"],"info":{}}
