{"id":"train_423","question":"Which papers did E. Francine Barbosa publish in the last 2 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/2060> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["List the papers published by Ellen Francine Barbosa in the last two years."],"info":{}}
{"id":"train_424","question":"What are the papers written by Pavel Laskov and Konrad Rieck together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/63/4310> . ?answer dblp:authoredBy <https://dblp.org/pid/64/4020> }","paraphrases":["Find the papers written by Pavel Laskov and Konrad Rieck together."],"info":{}}
{"id":"train_425","question":"What are the papers written by Farina, A. and Mohammad Mahdi Chitgarha together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/63/6694> . ?answer dblp:authoredBy <https://dblp.org/pid/126/1103> }","paraphrases":["Which papers did Farina, A. and Mohammad Mahdi Chitgarha write together?"],"info":{}}
{"id":"train_427","question":"In which conferences or journals has Suguru Goto published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/2639> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Suguru Goto published."],"info":{}}
{"id":"train_428","question":"Mention the co-authors of Sun, Guo.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/32/7076> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/32/7076> ) }","paraphrases":["Who are the co-authors of Sun, Guo?"],"info":{}}
{"id":"train_429","question":"What are the venues in which Daniel Rubio Bonilla published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/15/10971> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Daniel Rubio Bonilla published papers?"],"info":{}}
{"id":"train_432","question":"Mention the co-authors of S. Alfat.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/304/4347> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/304/4347> ) }","paraphrases":["Who are the co-authors of Alfat, S.?"],"info":{}}
{"id":"train_433","question":"Which papers did S. J. Jackson and R. Manohar write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/88/4500> . ?answer dblp:authoredBy <https://dblp.org/pid/m/RajitManohar> }","paraphrases":["Find the papers written by S. J. Jackson and Rajit Manohar together."],"info":{}}
{"id":"train_434","question":"Who are the co-authors of Hou, Avus C. Y.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/40/4783> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/40/4783> ) }","paraphrases":["With which other authors has the author Hou, Avus C. Y. written papers?"],"info":{}}
{"id":"train_435","question":"Mention the venues in which Baumli, N. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/140/4663> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Baumli, N. published?"],"info":{}}
{"id":"train_436","question":"List the papers published by T. Kellam in the last seven years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/45/4688> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Which papers did T. Kellam publish in the last 7 years?"],"info":{}}
{"id":"train_437","question":"With which other authors has the author James W. Gray III written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/01/3461> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/01/3461> ) }","paraphrases":["Who are the co-authors of James W. Gray III?"],"info":{}}
{"id":"train_438","question":"What are the venues in which Charles Lenay published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/61/2338> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Charles Lenay published."],"info":{}}
{"id":"train_439","question":"Mention the venues in which J. Xu published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/20/1590> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which J. Xu published?"],"info":{}}
{"id":"train_440","question":"With which other authors has the author Lionel Garnier written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/24/5133> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/24/5133> ) }","paraphrases":["Mention the co-authors of Lionel Garnier."],"info":{}}
{"id":"train_443","question":"In which conferences or journals has Agbonjaru, J. published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/244/5237> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Joshua Agbonjaru published?"],"info":{}}
{"id":"train_444","question":"What are the venues in which M. Fumagalli published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/161/4517> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which M. Fumagalli published."],"info":{}}
{"id":"train_446","question":"Which papers did Y. Rozier and Y. Robach write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/96/6374> . ?answer dblp:authoredBy <https://dblp.org/pid/98/8448> }","paraphrases":["Find the papers written by Y. Rozier and Y. Robach together."],"info":{}}
{"id":"train_447","question":"List the papers published by J. Mayer in the last 6 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/99/788> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Which papers did J. Mayer publish in the last six years?"],"info":{}}
{"id":"train_448","question":"Which papers did Gregory H. Wakefield and Kyla A. McMullen write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/26/4731> . ?answer dblp:authoredBy <https://dblp.org/pid/47/7180> }","paraphrases":["What are the papers written by Gregory H. Wakefield and K. A. McMullen together?"],"info":{}}
{"id":"train_449","question":"Which publications did LaLonde, W. R. write with the author from Carleton University, Ottawa, Canada?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/l/WRLaLonde> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Carleton University, Ottawa, Canada' }","paraphrases":["What research papers did Wilf R. LaLonde publish with the author affiliated to Carleton University, Ottawa, Canada?"],"info":{}}
{"id":"train_450","question":"Which papers did Julian Warner publish in the last 6 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/42/2684> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["List the papers published by Warner, Julian in the last six years."],"info":{}}
{"id":"train_451","question":"Find the papers written by Abbott, Pamela and Sunila M. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/75/448> . ?answer dblp:authoredBy <https://dblp.org/pid/125/1152> }","paraphrases":["Which papers did Abbott, Pamela and Sunila M. write together?"],"info":{}}
{"id":"train_452","question":"Which publications did Rebecca Adam write with the author from University of Kiel?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/94/11067> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'University of Kiel, Germany' }","paraphrases":["What research papers did Rebecca Adam publish with the author affiliated to University of Kiel, Germany?"],"info":{}}
{"id":"train_453","question":"Who are the co-authors of Haibo Du?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/23/8131> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/23/8131> ) }","paraphrases":["With which other authors has the author Haibo Du written papers?"],"info":{}}
{"id":"train_454","question":"What are the venues in which David F. Nettleton published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/21/708> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which D. F. Nettleton published."],"info":{}}
{"id":"train_455","question":"List the papers published by A. Yautsiukhin in the last 6 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/07/4404> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["Which papers did Artsiom Yautsiukhin publish in the last 6 years?"],"info":{}}
{"id":"train_456","question":"Mention the papers published by Xiong, H. with the author from Microsoft Research Asia, Beijing, China.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/x/HuiXiong> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Microsoft Research Asia, Beijing, China' }","paraphrases":["Which publications did Hui Xiong write with the author from Microsoft Research Asia, Beijing, China?"],"info":{}}
{"id":"train_457","question":"With which other authors has the author Donald Parruca written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/127/7073> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/127/7073> ) }","paraphrases":["Who are the co-authors of Donald P.?"],"info":{}}
{"id":"train_458","question":"With which other authors has the author B. Barakat written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/163/9987> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/163/9987> ) }","paraphrases":["Who are the co-authors of Basel Barakat?"],"info":{}}
{"id":"train_459","question":"Mention the co-authors of Yuanan Liu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/57/1057> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/57/1057> ) }","paraphrases":["With which other authors has the author Yuanan Liu written papers?"],"info":{}}
{"id":"train_460","question":"Mention the venues in which Wang, Xi published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/08/5760-1> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Wang, Xi published?"],"info":{}}
{"id":"train_461","question":"With which other authors has the author S. Naz written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/195/8541> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/195/8541> ) }","paraphrases":["Who are the co-authors of Sumera Naz?"],"info":{}}
{"id":"train_462","question":"In which conferences or journals has An-Sung Wang published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/276/9141> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which An-Sung W. published?"],"info":{}}
{"id":"train_463","question":"Which papers did N. Phisutthangkoon publish in the last two years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/287/2750> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["List the papers published by Nuntipat Phisutthangkoon in the last two years."],"info":{}}
{"id":"train_464","question":"What research papers did George K. Karagiannidis publish with the author affiliated to Aristotle University of Thessaloniki?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/13/5195> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Aristotle University of Thessaloniki, Greece' }","paraphrases":["Which publications did George K. Karagiannidis write with the author from Aristotle University of Thessaloniki, Greece?"],"info":{}}
{"id":"train_466","question":"Find the papers written by Hongshu C. and Zhang, Y. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/141/8066> . ?answer dblp:authoredBy <https://dblp.org/pid/64/6544-95> }","paraphrases":["What are the papers written by Hongshu Chen and Yi Zhang together?"],"info":{}}
{"id":"train_467","question":"Who are the co-authors of Chedy Ra\\u00EFssi?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/1132> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/76/1132> ) }","paraphrases":["With which other authors has the author Ra\\u00EFssi, Chedy written papers?"],"info":{}}
{"id":"train_468","question":"Which papers did J. Huang publish in the last six years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/98/10180> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -6 ) }","paraphrases":["List the papers published by J. Huang in the last six years."],"info":{}}
{"id":"train_470","question":"Find the papers written by K. Gu and Shen, S. together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/187/3055> . ?answer dblp:authoredBy <https://dblp.org/pid/11/963> }","paraphrases":["What are the papers written by K. Gu and Shu Shen together?"],"info":{}}
{"id":"train_471","question":"With which other authors has the author Lan Yang written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/52/1313> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/52/1313> ) }","paraphrases":["Mention the co-authors of Lan Yang."],"info":{}}
{"id":"train_472","question":"List the papers published by Patrick J. Lawrence in the last 9 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/272/1532> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Which papers did Patrick J. Lawrence publish in the last 9 years?"],"info":{}}
{"id":"train_473","question":"What are the venues in which Matthias Springstein published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/183/0044> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Matthias Springstein published papers?"],"info":{}}
{"id":"train_475","question":"Mention the venues in which Leonid R. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/r/LeonidReyzin> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Leonid Reyzin published?"],"info":{}}
{"id":"train_476","question":"Mention the venues in which Tang, P. published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/93/509> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Tang, P. published?"],"info":{}}
{"id":"train_478","question":"Mention the co-authors of X. Liu.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/296/7300> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/296/7300> ) }","paraphrases":["Who are the co-authors of Xianda Liu?"],"info":{}}
{"id":"train_479","question":"What research papers did Habib Ullah Khan publish with the author affiliated to Qatar University, Doha?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/10688> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'Qatar University, Doha' }","paraphrases":["Which publications did Khan, Habib Ullah write with the author from Qatar University?"],"info":{}}
{"id":"train_480","question":"Which papers did C. Gout and Carole Le Guyader write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/10/597> . ?answer dblp:authoredBy <https://dblp.org/pid/53/4858> }","paraphrases":["Find the papers written by Christian Gout and Guyader, Carole Le together."],"info":{}}
{"id":"train_481","question":"Mention the co-authors of Folino, Francesco.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/76/5134> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/76/5134> ) }","paraphrases":["With which other authors has the author Francesco Folino written papers?"],"info":{}}
{"id":"train_482","question":"Find the papers written by L\\u00EDlia Ramalho Martins and Ana Teresa C. Martins together.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/94/5595> . ?answer dblp:authoredBy <https://dblp.org/pid/59/1719> }","paraphrases":["What are the papers written by L\\u00EDlia Ramalho Martins and Ana Teresa C. Martins together?"],"info":{}}
{"id":"train_483","question":"What are the papers written by Paulo Gomes Costa and Marcelo Roberto Petry together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/54/4477> . ?answer dblp:authoredBy <https://dblp.org/pid/94/7277> }","paraphrases":["Which papers did Costa, P. Gomes and Marcelo R. Petry write together?"],"info":{}}
{"id":"train_484","question":"With which other authors has the author T. Tadono written papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/10/8947> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/10/8947> ) }","paraphrases":["Mention the co-authors of Takeo Tadono."],"info":{}}
{"id":"train_485","question":"Who are the co-authors of Sami Muhaidat?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/14/7881> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/14/7881> ) }","paraphrases":["Mention the co-authors of Sami Muhaidat."],"info":{}}
{"id":"train_486","question":"Which papers did Cynthia Breazeal and Kenton Williams write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/65/5630> . ?answer dblp:authoredBy <https://dblp.org/pid/91/185> }","paraphrases":["What are the papers written by Cynthia Breazeal and Kenton Williams together?"],"info":{}}
{"id":"train_487","question":"Which papers did Abhimanyu D. publish in the last 4 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/172/0866> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["List the papers published by Abhimanyu Dubey in the last 4 years."],"info":{}}
{"id":"train_489","question":"What are the venues in which Hongye Su published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/74/513> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Su, H. published."],"info":{}}
{"id":"train_490","question":"Who are the co-authors of Franco Stellari?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/38/4731> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/38/4731> ) }","paraphrases":["With which other authors has the author Stellari, Franco written papers?"],"info":{}}
{"id":"train_491","question":"List the papers published by Steve Benford in the last seven years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/SteveBenford> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -7 ) }","paraphrases":["Which papers did Steve Benford publish in the last 7 years?"],"info":{}}
{"id":"train_492","question":"List the papers published by Xiaowen Cao in the last 4 years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/154/5940> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -4 ) }","paraphrases":["Which papers did Cao, Xiaowen publish in the last four years?"],"info":{}}
{"id":"train_494","question":"Mention the venues in which Jacopo Castellini published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/193/8841> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has J. Castellini published papers?"],"info":{}}
{"id":"train_495","question":"In which conferences or journals has Ping Zhou published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/43/909> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which P. Zhou published?"],"info":{}}
{"id":"train_496","question":"Who are the co-authors of Kevin J. Barker?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/23/6533> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/23/6533> ) }","paraphrases":["Mention the co-authors of Kevin J. Barker."],"info":{}}
{"id":"train_497","question":"Who are the co-authors of Shir G.?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/211/7229> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/211/7229> ) }","paraphrases":["With which other authors has the author Shir G. written papers?"],"info":{}}
{"id":"train_498","question":"What are the papers written by Dirk Farin and With, Peter H. N. de together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/00/2295> . ?answer dblp:authoredBy <https://dblp.org/pid/w/PeterHNdeWith> }","paraphrases":["Which papers did Farin, Dirk and Peter H. N. de With write together?"],"info":{}}
{"id":"train_499","question":"In which conferences or journals has Dietlind Helene Cymek published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/145/5543> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Dietlind Helene Cymek published?"],"info":{}}
{"id":"train_501","question":"What are the papers written by Mark van den Brand and Ramon R. H. Schiffelers together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/v/MarkvandenBrand> . ?answer dblp:authoredBy <https://dblp.org/pid/42/2894> }","paraphrases":["Which papers did Mark van den Brand and Schiffelers, Ramon R. H. write together?"],"info":{}}
{"id":"train_503","question":"In which conferences or journals has Mostafa Blidia published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/01/4922> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which Blidia, Mostafa published?"],"info":{}}
{"id":"train_504","question":"In which conferences or journals has Sharad Malik published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/79/6934> . ?x dblp:publishedIn ?answer }","paraphrases":["What are the venues in which S. Malik published?"],"info":{}}
{"id":"train_505","question":"What are the venues in which G. Neil Haven published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/15/2493> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which G. Neil Haven published."],"info":{}}
{"id":"train_506","question":"Which papers did Mattia F. and Giuseppe Nunnari write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/19/1859> . ?answer dblp:authoredBy <https://dblp.org/pid/93/2552> }","paraphrases":["What are the papers written by Mattia F. and Giuseppe Nunnari together?"],"info":{}}
{"id":"train_507","question":"Mention the venues in which Badri, Mourad published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/17/4566> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Mourad Badri published papers?"],"info":{}}
{"id":"train_508","question":"In which conferences or journals has J. Ma published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/37/9293> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which J. Ma published."],"info":{}}
{"id":"train_509","question":"Mention the venues in which Zwolinski, Mark published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/99/2370> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Mark Zwolinski published papers?"],"info":{}}
{"id":"train_511","question":"Which papers did Joe V. and A. Bogdanov write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/212/7827> . ?answer dblp:authoredBy <https://dblp.org/pid/212/8582> }","paraphrases":["What are the papers written by Joe V. and Alina Bogdanov together?"],"info":{}}
{"id":"train_512","question":"What research papers did Adrian-Horia D. publish with the author affiliated to SuperData?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/4469> . ?answer dblp:authoredBy ?y . ?y dblp:primaryAffiliation 'SuperData, Bucharest, Romania' }","paraphrases":["Which publications did Adrian-Horia D. write with the author from SuperData?"],"info":{}}
{"id":"train_513","question":"In which conferences or journals has C. Boldyreff published papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/68/1268> . ?x dblp:publishedIn ?answer }","paraphrases":["Mention the venues in which Cornelia Boldyreff published."],"info":{}}
{"id":"train_514","question":"Mention the venues in which Bouguelia, Mohamed-Rafik published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/23/10872> . ?x dblp:publishedIn ?answer }","paraphrases":["In which conferences or journals has Bouguelia, Mohamed-Rafik published papers?"],"info":{}}
{"id":"train_515","question":"List the papers published by Fukumizu, Kenji in the last nine years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/96/464> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -9 ) }","paraphrases":["Which papers did Fukumizu, Kenji publish in the last nine years?"],"info":{}}
{"id":"train_516","question":"Which papers did Angel Plastino and Roseli S. Wedemann write together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/5606> . ?answer dblp:authoredBy <https://dblp.org/pid/51/6398> }","paraphrases":["What are the papers written by Angel Plastino and Wedemann, R. S. together?"],"info":{}}
{"id":"train_518","question":"List the papers published by Mohammad Ali Abam in the last two years.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/a/MohammadAliAbam> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -2 ) }","paraphrases":["Which papers did Mohammad Ali Abam publish in the last two years?"],"info":{}}
{"id":"train_519","question":"Which papers did Weifeng Liu publish in the last 3 years?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/147/1465> . ?answer dblp:yearOfPublication ?y FILTER ( ?y > YEAR ( NOW () ) -3 ) }","paraphrases":["List the papers published by Weifeng Liu in the last 3 years."],"info":{}}
{"id":"train_520","question":"Mention the co-authors of A. Bonivento.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/68/4164> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/68/4164> ) }","paraphrases":["Who are the co-authors of A. Bonivento?"],"info":{}}
