{"id":"train_3119","question":"Count the number of co-authors that A. J. Bowers has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/178/8961> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/178/8961> ) }","paraphrases":["How many co-authors does Alex J. Bowers have?"],"info":{}}
{"id":"train_3120","question":"Report the average number of co-authors for publications published by Mrigank Sharad.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/98/10663> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Sharad, Mrigank?"],"info":{}}
{"id":"train_3121","question":"Count the number of papers that Dong-Hong Ji has published in EMNLP-CoNLL.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/42> . ?answer dblp:publishedIn 'EMNLP-CoNLL' }","paraphrases":["In EMNLP-CoNLL, how many papers has Dong-Hong Ji published?"],"info":{}}
{"id":"train_3122","question":"Count the number of co-authors that J. Marecek has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/02/4822> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/02/4822> ) }","paraphrases":["How many co-authors does J. Marecek have?"],"info":{}}
{"id":"train_3123","question":"How many co-authors does S. Garg have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/143/9429> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/143/9429> ) }","paraphrases":["Count the number of co-authors that Shashwat Garg has."],"info":{}}
{"id":"train_3125","question":"Count the number of co-authors that Yin C. has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/94/7894> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/94/7894> ) }","paraphrases":["How many co-authors does Yin Cao have?"],"info":{}}
{"id":"train_3126","question":"Report the count of papers that Marc Ditzhaus has published in J. Multivar. Anal..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/240/4380> . ?answer dblp:publishedIn 'J. Multivar. Anal.' }","paraphrases":["How many papers has Marc D. published in J. Multivar. Anal.?"],"info":{}}
{"id":"train_3127","question":"Report the average number of co-authors for publications published by Cyril S..","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/162/4119> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for research papers published by Cyril S.?"],"info":{}}
{"id":"train_3128","question":"What is the average number of papers published by Marcela G. G\\u00F3mez Zerme\\u00F1o per year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/182/3615> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["Report the average number of publications by Marcela G. G\\u00F3mez Zerme\\u00F1o per year."],"info":{}}
{"id":"train_3130","question":"How many research papers has Mudjihartono, Paulus published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/292/1190> }","paraphrases":["How many papers has Mudjihartono, Paulus published?"],"info":{}}
{"id":"train_3131","question":"How many papers has Bao Wang published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/40/10304> }","paraphrases":["How many research papers has Bao Wang published?"],"info":{}}
{"id":"train_3133","question":"How many research papers has Gede Putra Kusuma Negara published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/14/545> }","paraphrases":["Mention the number of papers that Gede Putra Kusuma Negara has published."],"info":{}}
{"id":"train_3135","question":"How many research papers has Alexander U. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/85/6788> }","paraphrases":["Mention the number of papers that Alexander Ulanov has published."],"info":{}}
{"id":"train_3136","question":"How many papers has Cerquitelli, T. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/20/5348> }","paraphrases":["How many research papers has Cerquitelli, T. published?"],"info":{}}
{"id":"train_3137","question":"How many co-authors does Liying Liu have?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/73/4986> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/73/4986> ) }","paraphrases":["Count the number of co-authors that L. Liu has."],"info":{}}
{"id":"train_3138","question":"Mention the number of papers that Rabia B. has published.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/154/2196> }","paraphrases":["How many papers has Rabia Boumaraf published?"],"info":{}}
{"id":"train_3139","question":"Report the count of papers that Bongsik S. has published in PACIS.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/74/1245> . ?answer dblp:publishedIn 'PACIS' }","paraphrases":["How many papers has Bongsik Shin published in PACIS?"],"info":{}}
{"id":"train_3142","question":"Report the average number of co-authors for publications published by Wulan, Gaowa.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/213/2754> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }","paraphrases":["What is the average number of co-authors for papers published by Gaowa Wulan?"],"info":{}}
{"id":"train_3143","question":"Count the number of papers that McFarland, M. C. has published in ICCD.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/52/1293> . ?answer dblp:publishedIn 'ICCD' }","paraphrases":["How many papers has McFarland, M. C. published in ICCD?"],"info":{}}
{"id":"train_3144","question":"Count the number of co-authors that Ogiela, Lidia has.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/14/1024> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/14/1024> ) }","paraphrases":["How many co-authors does Ogiela, Lidia have?"],"info":{}}
{"id":"train_3146","question":"In First Monday, how many papers has Pettigrew, K. E. published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/27/3395> . ?answer dblp:publishedIn 'First Monday' }","paraphrases":["How many papers has Pettigrew, K. E. published in First Monday?"],"info":{}}
{"id":"train_3147","question":"Report the average number of publications by Omori, Toshiaki per year.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( AVG ( ?count ) AS ?answer ) { SELECT ( COUNT ( ?y ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/71/4332> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }","paraphrases":["What is the average number of papers published by Omori, Toshiaki per year?"],"info":{}}
{"id":"train_3149","question":"How many research papers has Arthur H. M. van Roermund published?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( COUNT ( DISTINCT ?answer ) AS ?count ) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/66/2420> }","paraphrases":["How many papers has Arthur H. M. van Roermund published?"],"info":{}}
{"id":"train_3150","question":"Who is the most frequent co-author of Cioppa, A. Della and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/60/2630> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/60/2630> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Antonio Della Cioppa has the most papers and how many?"],"info":{}}
{"id":"train_3151","question":"Mention the year in which Nestor R. Polanco published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/202/3643> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Nestor R. Polanco publish the most research papers?"],"info":{}}
{"id":"train_3152","question":"When was the first paper by Tom Tollenaere published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/44/6536> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Tom Tollenaere published?"],"info":{}}
{"id":"train_3153","question":"Find the year in which A. Arranz Carre\\u00F1o published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/53/9747> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by A. Arranz Carre\\u00F1o published?"],"info":{}}
{"id":"train_3154","question":"When was the last paper by Dikovskii, A. Ja. published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/44/5658> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Dikovskii, A. Ja. published?"],"info":{}}
{"id":"train_3156","question":"Find the year in which Rosaci, D. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/91/2341> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Domenico Rosaci published?"],"info":{}}
{"id":"train_3157","question":"Least number of papers were published by Younis Al Rozz in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/209/8796> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Younis A. Rozz published the least papers."],"info":{}}
{"id":"train_3158","question":"In which year was the last paper by Kun Huang published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/10/4151-3> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Kun Huang published?"],"info":{}}
{"id":"train_3159","question":"Mention the year in which Truls F. published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/39/5703> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Truls Flatberg publish the most research papers?"],"info":{}}
{"id":"train_3160","question":"Find the year in which Hossein Mobahi published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/94/1490> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Mobahi, Hossein published?"],"info":{}}
{"id":"train_3161","question":"Report the year in which Ulf Leser published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/l/UlfLeser> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did U. Leser publish the least papers and how many?"],"info":{}}
{"id":"train_3162","question":"In which year was the last paper by Robert Mitchell published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/70/9676> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Report the year in which Mitchell, Robert published their last paper."],"info":{}}
{"id":"train_3163","question":"Who is the most frequent co-author of Alfredo Colosimo and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/77/1632> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/77/1632> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Alfredo Colosimo and how many papers do they have together?"],"info":{}}
{"id":"train_3164","question":"Mention the year in which Inhyuk Kim published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/06/7539> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Inhyuk Kim publish the most papers?"],"info":{}}
{"id":"train_3165","question":"Report the most frequent co-author of Yongcheng Wang and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/06/4175> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/06/4175> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Yongcheng Wang and how many publications do they have together?"],"info":{}}
{"id":"train_3166","question":"Mention the year in which Kiara G. published the most papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/274/1096> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Kiara Grouwstra publish the most research papers?"],"info":{}}
{"id":"train_3167","question":"In which year did the author Q. Wu publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/215/6855> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Mention the year in which Qianteng Wu published the most papers."],"info":{}}
{"id":"train_3168","question":"Report the most frequent co-author of Oscar De Feo and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/5987> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/19/5987> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Oscar De Feo has the most papers and how many?"],"info":{}}
{"id":"train_3169","question":"When was the first paper by Zhang, Q. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/44/8547> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Zhang, Q. published?"],"info":{}}
{"id":"train_3170","question":"Who is the most frequent co-author of Ron Daniel and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/11065> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/67/11065> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of R. Daniel and how many papers do they have together?"],"info":{}}
{"id":"train_3171","question":"Report the year in which Junji Shikata published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/65/4968> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Junji Shikata published?"],"info":{}}
{"id":"train_3172","question":"When was the last paper by R. Denning published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/54/42> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Rebecca Denning published?"],"info":{}}
{"id":"train_3173","question":"Report the most frequent co-author of Yang Xin and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/72/2718> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/72/2718> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Yang Xin has the most papers and how many?"],"info":{}}
{"id":"train_3174","question":"Find the year in which Akilesh T. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/283/6462> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Akilesh T. published?"],"info":{}}
{"id":"train_3175","question":"In which year did the author Li, Wei publish the most research papers?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/64/6025-56> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["In which year did Wei Li publish the most papers?"],"info":{}}
{"id":"train_3176","question":"Report the most frequent co-author of Yinglong Bian and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/249/5845> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/249/5845> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Yinglong Bian has the most papers and how many?"],"info":{}}
{"id":"train_3177","question":"Who is the most frequent co-author of Belkouch, S. and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/51/10119> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/51/10119> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Belkouch, S. has the most papers and how many?"],"info":{}}
{"id":"train_3178","question":"Report the year in which Clive R. published their last paper.","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/10/710> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the last paper by Clive R. published?"],"info":{}}
{"id":"train_3179","question":"In which year was the first paper by Sara A. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/212/7397> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Sara A. published their first paper."],"info":{}}
{"id":"train_3180","question":"Least number of papers were published by Y. Xue in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/204/1800> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Report the year in which Yaxu Xue published the least papers."],"info":{}}
{"id":"train_3181","question":"In which year did Jun Wu publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/20/3894-1> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Jun Wu in which year?"],"info":{}}
{"id":"train_3182","question":"When was the last paper by Laurent Topart published?","sparql":"SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/277/0217> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the last paper by Laurent Topart published?"],"info":{}}
{"id":"train_3183","question":"Report the most frequent co-author of Steven G. and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/92/3749> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/92/3749> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Steven Gillijns and how many publications do they have together?"],"info":{}}
{"id":"train_3184","question":"In which year was the first paper by I. R. Cohen published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/71/3693> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which I. R. Cohen published their first paper."],"info":{}}
{"id":"train_3185","question":"In which year was the first paper by Shannon L. Mathis published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/202/0059> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Shannon L. Mathis published?"],"info":{}}
{"id":"train_3186","question":"Who is the most frequent co-author of Johanne Morin and how many publications do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/22/6306> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/22/6306> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Report the most frequent co-author of Johanne Morin and how many papers do they have together?"],"info":{}}
{"id":"train_3187","question":"Report the year in which David L. Neuhoff published the least papers.","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/17/4018> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by David L. Neuhoff in which year?"],"info":{}}
{"id":"train_3188","question":"With which author does Philippe Kruchten has the most papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/k/PhilippeKruchten> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/k/PhilippeKruchten> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["Who is the most frequent co-author of Kruchten, Philippe and how many publications do they have together?"],"info":{}}
{"id":"train_3189","question":"In which year did the author Alexa T. McCray publish the least publications?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/50/4639> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["Least number of papers were published by Alexa T. McCray in which year?"],"info":{}}
{"id":"train_3190","question":"Least number of papers were published by Q. Ye in which year?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/44/7694> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did Qiaolin Ye publish the least papers and how many?"],"info":{}}
{"id":"train_3191","question":"Find the year in which Stephen P. Glasby published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/38/2782> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["In which year was the first paper by Stephen P. Glasby published?"],"info":{}}
{"id":"train_3192","question":"When was the first paper by Lee-Sub Lee published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/08/2628> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["Find the year in which Lee-Sub Lee published their first paper."],"info":{}}
{"id":"train_3193","question":"In which year was the first paper by Ju, W. published?","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/04/4068> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Wendy Ju published?"],"info":{}}
{"id":"train_3194","question":"Report the most frequent co-author of Estelle Ah-Ki and how many papers do they have together?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/84/6434> . ?x dblp:authoredBy ?answer FILTER ( ?answer != <https://dblp.org/pid/84/6434> ) } GROUP BY ?answer } ORDER BY DESC ( ?count ) LIMIT 1","paraphrases":["With which author does Estelle Ah-Ki has the most papers and how many?"],"info":{}}
{"id":"train_3196","question":"In which year did See-May Phoong publish the least papers and how many?","sparql":"PREFIX dblp: <https://dblp.org/rdf/schema#> SELECT ( GROUP_CONCAT ( ?answer ; separator = ', ' ) AS ?answer ) ?count WHERE { SELECT DISTINCT ?answer ( COUNT ( ?answer ) AS ?count ) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/72/2749> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC ( ?count ) LIMIT 1","paraphrases":["In which year did the author Phoong, See-May publish the least publications?"],"info":{}}
{"id":"train_3197","question":"Find the year in which Horn, J. A. published their first paper.","sparql":"SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x <https://dblp.org/rdf/schema#authoredBy> <https://dblp.org/pid/24/8906> . ?x <https://dblp.org/rdf/schema#yearOfPublication> ?answer }","paraphrases":["When was the first paper by Jay A. Horn published?"],"info":{}}
