{"id":"train_882","question":"What research problem is addressed in the paper titled \"6th Open Challenge on Question Answering over Linked Data (QALD-6)\"?\n","sparql":"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX orkgp: <http://orkg.org/orkg/predicate/> SELECT DISTINCT ?concept ?rlabel WHERE { orkgr:R6386 orkgp:P31 ?x . ?x orkgp:P32 ?concept . ?concept rdfs:label ?rlabel . } LIMIT 1","paraphrases":["What reseach problem is the paper \"paper title\" trying to address?","What is the aim of the research paper \"paper title\"?","What is the aim of \"paper title\"?"],"info":{}}
{"id":"train_986","question":"Does \"ZoomRDF\" uses filters?","sparql":"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX orkgp: <http://orkg.org/orkg/predicate/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> SELECT ?uses_filter WHERE { ?paper orkgp:P5025 ?filter ; rdfs:label ?title . FILTER ( REGEX ( ?title , \"ZoomRDF\" ) ) BIND ( IF ( ?filter = \"T\" ^^ xsd:string , \"Yes\" , \"No\" ) AS ?uses_filter ) }","paraphrases":["Does the paper \"paper title\" uses filters?"],"info":{}}
{"id":"train_1402","question":"What is major reactant for \"Microwave-Assisted Cobinamide Synthesis\"?","sparql":"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX orkgp: <http://orkg.org/orkg/predicate/> SELECT ?reactant WHERE { ?papers rdfs:label ?titles . FILTER ( REGEX ( ?titles , \"Microwave-Assisted Cobinamide Synthesis\" ) ) ?papers orkgp:P31 ?cont . ?cont orkgp:P37557 ?reactant . }","paraphrases":["What is the major reactant of paper \"paper title\"?"],"info":{}}
{"id":"train_1607","question":"What is the base URL of \"The Document Components Ontology\"?","sparql":"PREFIX orkgp: <http://orkg.org/orkg/predicate/> SELECT ?iri WHERE { orkgr:R8342 orkgp:compareContribution ?cont . ?cont orkgp:P7034 ?ont . ?ont orkgp:P7042 ?iri ; orkgp:P7035 ?full_name . FILTER ( REGEX ( STR ( ?full_name ) , \"Document Components Ontology\" , \"i\" ) ) }","paraphrases":["What is the IRI of \"resource\"?"],"info":{}}
